[
  {
    "username": "merichards",
    "rating": 1.0,
    "comment": "Rather dull and predictable play.",
    "timestamp": 1488668400
  },
  {
    "username": "The Barefoot Killer",
    "rating": 2.0,
    "comment": "Wow. This is s truly boring game. Go Fish is its obvious influence, and that ain't great pedigree. A very disappointing early Knizia title. I'm surprised it received new editions.",
    "timestamp": 1531951200
  },
  {
    "username": "kps1ny",
    "rating": 3.0,
    "comment": "Sold on BGG 9/7/23.",
    "timestamp": 1706050800
  },
  {
    "username": "rkleopold",
    "rating": 4.0,
    "comment": "Keep",
    "timestamp": 1748556000
  },
  {
    "username": "grasa_total",
    "rating": 5.0,
    "comment": "2015: \"Definitely not worth it with 5p (each player picks one suit and the game is won or lost on very boring marginal advantages). Constrained communication is always interesting, probably enough to try this again with 4p if given the chance.\n\nWhich I guess would make it my least-despised Knizia game.\"\n\n2024: Now I'm a Knizia fan but haven't played this again yet.",
    "timestamp": 1723068000
  },
  {
    "username": "sh4mike",
    "rating": 5.0,
    "comment": "Appreciate the negotiation aspect, but there isn't enough weight behind the decisions, just basic set collection. Bohnanza makes this game irrelevant,",
    "timestamp": 1720994400
  },
  {
    "username": "qwertymartin",
    "rating": 6.0,
    "comment": "Played with the original Hexagames edition which has charmingly old-school artwork and a few rules differences to later editions, which I'm not sure are important. I don't think we made the most advantage of the communication possibilities in the trade offers (I certainly didn't) but it was quite enjoyable.",
    "timestamp": 1756591200
  },
  {
    "username": "tphon",
    "rating": 6.0,
    "comment": "Sleeved - Premium UltraPro",
    "timestamp": 1730674800
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "I like the idea. But the points system doesn’t quite work right, in my opinion.\n\nPurge candidate/NK",
    "timestamp": 1756936800
  },
  {
    "username": "pkufahl",
    "rating": 8.0,
    "comment": "This game, a find in a used bookstore, proved to be far more entertaining than what I anticipated. Maybe it just works really well with my family.\n\nHere's what's special about it: you don't just trade cards in the game, you also trade information about what you're trying to do. In Bohnanza, players cycle through their cards too quickly and build their bean-fields in the open, making the information about their hands very cheap. In Res Publica, sets take a lot longer to acquire while hidden from view, and players have much more control over what they reveal. I'm not aware of any other game where trading and hidden information are balanced quite like this.\n\nQueen Games made a couple of strange changes to the deck and rules: there are only 5 cards of monks and books (instead of Knizia's design for 6 of each), and only 2 monk/book cards are need to make a set for the special bonuses (instead of 3). This obviously leaves the odd 5th card as useless and unbalances the game toward players lucky enough to draw 2 monk cards). I'm adopting the suggested houserule to require 3 cards for these sets, and shuffle a card from a completed monk/book set into the deck. See this thread: On the 2011 Queen Version",
    "timestamp": 1695938400
  },
  {
    "username": "dougadamsau",
    "rating": 9.0,
    "comment": "A remarkably clever trading game where you may only make one offer/counter-offer for every deal on the table. Deals are made over sets of cards, sets are traded in for settlements, which give you more cards and eventually cities. A game where you must listen carefully, and carefully consider your limited chances to trade. A delight to play a trade/negotiation game where you don't have to shout to get anywhere!",
    "timestamp": 1527199200
  },
  {
    "username": "AnalogGamer",
    "rating": 10.0,
    "comment": "\"Civilization\" Express. Don't have 12 hours? Break this out.",
    "timestamp": 1286661600
  }
]