[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Tried it once for a few turns, and it was a disaster. The person playing Britain refused to ally with me even though it was the only obvious move, I couldn't tell if he was playing solitaire or roleplaying. Meanwhile the others were obviously planning an attack together. Then Britain changed his mind when he saw things were going badly, but the game fell apart and stopped then.\n\nIt seems like the kind of game I woulda loved if things had gone differently, but it's so damn lengthy that maybe it doesn't matter. Oh well!",
    "timestamp": 1731884400
  },
  {
    "username": "parpari",
    "rating": 1.0,
    "comment": "I freaking hate this game. Endless means, backstabbing and ganging of on least favourite player of this game sets a side Hours and Hours wheeling and dealing to make little bite move forward. Then, everything goes back to the first house is too frustrating. This game can legitimately never end.",
    "timestamp": 1731711600
  },
  {
    "username": "Rene_407",
    "rating": 1.1,
    "comment": "I actually hate this game with unbridled terrifying passion. I have removed it from my life, so I actually do not own it any more. It stands here to remind me to never, ever play this game again. Is it good? Yes! Do I rather cut down a three and chop the wood into bits and eat them with vinegar? Also Yes. BGG, why is there no option \"Voluntarily destroyed\" to describe the accurate status of my game? People should be allowed to burn this game. There are some redeeming qualities. Like you could put valuables in this box because nobody will ever think anything valuable is in it. I hate it so much. If I ever had a billion euros I would buy all copies and put them a mile underground. Although it would probably be reprinted then. Streisand effect. So a better idea is to pay off the creator to never republish. And bribe Google, Reddit and Youtube to remove any and all mention of this game. And pay BGG a motherload of money to reduce the Diplomacy BGG rating with several 10000 positions and give random 404 errors on the Diplomacy game page. This game is poison on your social life. This game makes you hate your backstabbing friends. This game makes you backstab your friends and end friendships. This game is like Monopoly, a game designed to prove a point (War with friends is bad hmkay) and people mistake it for being good. I loathe this game. It should be named \"Ultimate Dissapointment\" or \"Fun Debilitating Time Wastement\". Rip this game to shreds when you see it. Stamp on it with your feet. Burn the remains. Nuke it from orbit. If you even need kindling to start a BBQ, go get this game and throw it in there. Mail it to your ex-wife. Use it's components to fill a cardbox to protect other sold worthy boardgames from damage while being transported. This is the 100% opposite of KLASK, which is the boardgame that could save humanity. Diplomacy is the boardgame that could start Nuclear War and end humanity. It's the Middle East of boardgaming.",
    "timestamp": 1728597600
  },
  {
    "username": "Joey_A",
    "rating": 1.0,
    "comment": "Just why? A game called diplomacy...with no rules governing diplomacy and no reason to be diplomatic in the literal sense. More of a social experiment than a game, and I hate socializing. Gimme Dune any day!",
    "timestamp": 1724104800
  },
  {
    "username": "SithCats",
    "rating": 1.0,
    "comment": "This is the least fun game I have ever played.",
    "timestamp": 1713304800
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Diplomacy can destroy friendships. It seems to promote bullying, lying, ganging up on the player at the bottom of the social pecking order and backstabbing. This is really my Nemesis game: pure negotiation, long play length, betraying your friends, player elimination (yuck!) and juicy king making. Awful. Would never play again. I'd rather have dental surgery.",
    "timestamp": 1696802400
  },
  {
    "username": "John Rogers",
    "rating": 1.0,
    "comment": "Diplomacy is pretty much the embodient of everything I hate in games: long, lies, backstabbing, king making. After hours of this deceit-filled craziness, somebody must finally give up, ally with another, and end the sordid affair. I played it once (ended in the fifth hour once I decided to back someone just to end the damn thing) so I can say I did but won't ever do it again.",
    "timestamp": 1680386400
  },
  {
    "username": "kesulin",
    "rating": 1.0,
    "comment": "partidas via E-Mail.\nEn persona seguro que pierde mucho.",
    "timestamp": 1675292400
  },
  {
    "username": "Live and let dice",
    "rating": 1.0,
    "comment": "Ugh. Yuck. Not for me. No thanks. Never more. Brrrr...",
    "timestamp": 1660860000
  },
  {
    "username": "BlackHammer66",
    "rating": 1.0,
    "comment": "A simple, accessible game that hides a brutal, unfair experience. In most games, especially when playing with experienced players, a few people will be eliminated very early on, often with little they can do about it. Usually I don’t mind player elimination too much, but in a game that’s six hours long… It can make people never want to play games again. Stay well clear of this one unless you’re playing online (the you can just leave if you start losing irrecoverably)",
    "timestamp": 1632348000
  },
  {
    "username": "rws2029",
    "rating": 1.0,
    "comment": "There are no words to adequately describe how much I detest this thing. It is so mean-spirited by design that it can actually destroy friendships and drive you away from board gaming as a hobby. The dictionary defines diplomacy as, \"the art of dealing with people in a sensitive and effective way\". If you believe that means lying, selfish exploitation of others, and backstabbing, then this vile thing is for you.",
    "timestamp": 1628200800
  },
  {
    "username": "Sioraf",
    "rating": 1.0,
    "comment": "There's so little detail in the military aspect of the game that really it could have been anything else without anything being lost; rather than armies and fleets taking over supply centres to make more armies and fleets it could have been investors putting money in businesses to make more money. There's no morale, no terrain (so for example defending in Italy isn't any easier than attacking in Russia), no quality (so for example a Russian army will fight as well as a German one even though the actual warfare of the time shows very much otherwise), no supplies (so an army half the continent away will fight as well as if it was in its country's capital). Clearly the board was designed to make numbers and therefore alliances the key to winning even though in real life leadership, training and better weapons make the difference. When the board could as easily have been anything else there isn't much point to there being physical locations at all; it could have just been a series of counters and tracks and instead of moving pieces around you just negotiate for this and that which is really all the game is anyway.\nDon't get me started on the online community of the boardgame...",
    "timestamp": 1610924400
  },
  {
    "username": "Joseandres02gr",
    "rating": 1.0,
    "comment": "There are a lot of games that do the same in a much efficient and funnier way. No one should be playing this game anymore.\n\nI will describe this game with the following quote: \"ain't nobody got time for that\"",
    "timestamp": 1588456800
  },
  {
    "username": "hockeyking9",
    "rating": 1.0,
    "comment": "This is barely a game, it's just gang up on the person we don't like. HATE this",
    "timestamp": 1580166000
  },
  {
    "username": "thebearthatwasnt",
    "rating": 1.0,
    "comment": "good game mechanics, don't like it at all, only way to win is by being an ***.. no enjoyment in that for me",
    "timestamp": 1576882800
  },
  {
    "username": "tankbard",
    "rating": 1.0,
    "comment": "Pointless if played quickly, tedious if played properly. It has a combat engine, but really it's a bluffing game, only you're expected to be tactful and polite (diplomatic, even!) instead of merely deceptive -- at least, if you want people to work with you. Give me fighting with a little more flash, or let's just play Go instead.\n\nIn terms of raw game quality Diplomacy probably deserves a better ranking than this. But at this end of the scale the real criterion is \"Which game is a less colossal waste of my time\", and Diplomacy is a very long game.",
    "timestamp": 1576018800
  },
  {
    "username": "airjudden",
    "rating": 1.0,
    "comment": "The single worst game ever made.\n\nIt is an epic fail as a \"war game,\" and no matter what crusty grogs say, it is a war game with a negotiating aspect.\n\nYou have an early 20th century European power. On a given turn, you make plans on what to do this turn with other players. Then you write down your orders and simultaneously reveal them. Because you are not obligated to do what you promised to do, there is a certain amount of back-stabbing that may or may not go on.\n\nEach area can only contain 1 cube. These cubes represent armies. You win combat by attacking an adjacent area while another one \"supports\" your attack. Without the numerical advantage, you cannot win.\n\nPretty simple concept, right? So why does it suck? Historically, it fails. Anyone can form an alliance with anybody else. France & Germany are not going going to ally and stick it to Austria-Hungary, who is not going to ally with Russia.\n\nThe next fail is that all sides are basically equal in power and all armies are the same. Because Russia starts out with an extra piece, they are actually more powerful than Germany -- in 1900. In what universe?\n\nAnd then there's the combat system. That is a system so lame-brained, it screams \"Eurogame!\"\n\nYou could assuage some of the flaws of the game by making a generic map and taking away the ahistorical flaws, but you are still left with a boring game that takes way too long to play with too little payoff.\n\nAnd if you play with the wrong group, you might lose some friends when it's all said and done, but if that's the case, you shouldn't be playing with them because the ties of friendship should be stronger than board games.\n\nLet me tell you how bad this game is: I don't do fractional ratings because 10 increments are more than enough. However, I wanted to be really clear that this game is the worst, so I rated the next batch of losers \"1.1\" just to make it abundantly clear that this is the worst.\n\nNeedless to say this is the most regrettable purchase I ever made, as I had planned on buying Hell's Highway: Operation Market Garden for months, and when I finally got the chance, I got this instead. I quickly traded it and was happy to dump it off, though I felt guilty, as though I had given them the videotape from the movie \"The Ring.\"\n\nWords simply cannot accurately describe just how much I loathe this game. I hope my feeble attempts were enough to scare you away from making the mistake of adding it to your collection.",
    "timestamp": 1552863600
  },
  {
    "username": "arisep",
    "rating": 1.0,
    "comment": "As a game it is not horrible obviously, but I don't like games that heavy on aggression element and even less so about games that are heavy on backstabbing element. As Diplomacy is very heavy on latter and also a very long game, I have hard time imagining a game that I'd like to play less.\n\nIf I ever come up with one, I'll re-rate Diplomacy as a two-star game.",
    "timestamp": 1533074400
  },
  {
    "username": "dierenh",
    "rating": 1.0,
    "comment": "Nederlandse regels in tekst opmaak met foto's (zw/w)",
    "timestamp": 1525903200
  },
  {
    "username": "GoddessInTriptych",
    "rating": 1.0,
    "comment": "Argue for six hours over who should win the game: The Board Game.",
    "timestamp": 1523224800
  },
  {
    "username": "ILoseAtLife",
    "rating": 1.0,
    "comment": "Legitimately my least favorite game of all time. Absolutely agonizing. Game can literally take days to finish and it is incredibly tedious the entire time. Also, people inevitably get pissed off at each other. Awful.",
    "timestamp": 1498255200
  },
  {
    "username": "Kaizen Zanshin",
    "rating": 1.0,
    "comment": "A mean spirited game, that practically forces you to back stab the alliances you have made - If I wanted to break a friendship up this would be the game I use to do it. However, I don't play with people I don't like. This game has not aged well either. This is one I would be happy to never play again.",
    "timestamp": 1486249200
  },
  {
    "username": "robertino",
    "rating": 1.0,
    "comment": "Will never play this again... Ever.",
    "timestamp": 1482706800
  },
  {
    "username": "wesleyb3",
    "rating": 1.0,
    "comment": "I didn't mind playing it the first time, but its way too long, and too much back stabbing and lying to make it interesting. Left a bitter taste in my mouth and I will never play this game ever again.",
    "timestamp": 1425510000
  },
  {
    "username": "B_Moores",
    "rating": 1.0,
    "comment": "Nasty, unpleasant, drags on, player elimination; little strategy and not enough objectives.",
    "timestamp": 1395615600
  },
  {
    "username": "dancingdanslc",
    "rating": 1.0,
    "comment": "I did not like this game at all.",
    "timestamp": 1391382000
  },
  {
    "username": "Treganter",
    "rating": 1.0,
    "comment": "Reading the comments around this one will give you a fair idea as to why I hate this game: massive length, brain-deadening tedium and more bitter betrayal than a George R R Martin novel. What everyone has failed to consider though are the trees who gave their lives for this monstrosity. They could've been made into fine literature, a house or even another board game. But no. Condemned to Diplomacy. It'd be like being made into Spam.",
    "timestamp": 1388790000
  },
  {
    "username": "AdmiralGT",
    "rating": 1.0,
    "comment": "My first 1 I think. Essentially a portion of the group decides who they're going to kill. Repeat until end-game. If you enjoy school-yard bullying then this is the game for you.",
    "timestamp": 1372802400
  },
  {
    "username": "PaulECoyote",
    "rating": 1.0,
    "comment": "Or how to loose friends and alienate people.",
    "timestamp": 1365976800
  },
  {
    "username": "robdnose",
    "rating": 1.0,
    "comment": "Play this with people you already hate. Then you won't be making new enemies.",
    "timestamp": 1363906800
  },
  {
    "username": "davedanger",
    "rating": 1.0,
    "comment": "Read other comments not related to backstabbing. Easily broken by players. Too long. Crappy mechanics. Burn.\nNot a game. The WORST example of gaming. Run, RUN, RUN!",
    "timestamp": 1341180000
  },
  {
    "username": "TheSil",
    "rating": 1.0,
    "comment": "The \"game\" of stabbing your friends in the back and being mean to each other.\nNever want to see this again, no fun only frustration.\nAlso I did never see one game of this finished (not that I would like to...)",
    "timestamp": 1330902000
  },
  {
    "username": "mistermarino",
    "rating": 1.0,
    "comment": "Should be called \"International Politics for Boring Assholes\". Move generic units. Make unenforceable treaty. Break treaty. Attack former friend who was former enemy who was former friend. Get attacked by former friend who was former enemy who was blah blah blah blah. It might appeal to certain people who find the United Nations general assembly fascinating, but I do not want, even for one minute, to hang out with people like that. I'd like to state the following for the record: If you lost (or could lose) a friend because of this game, you are a blithering idiot. What kind of wanker would break a friendship over any game, let alone one this excruciatingly dull? With its moronic all-units-are-identical setup, the endless negotiations and a so-dumb-I-can't-believe-it's-not-a-joke combat system, a session of Diplomacy rivals C-Span for tediousness and dental surgery for unpleasantness. Scheming and wanking, scheming and wanking. I'd rather be stretched thin, twisted into a meat pretzel and shoved up a donkey's bunghole.",
    "timestamp": 1314136800
  },
  {
    "username": "Biiirdmaaan",
    "rating": 1.0,
    "comment": "Never play this game with people you want to be friends with afterwards. I've actually seen first hand a couple break up while playing due to this game.\n\nThis is probably the only game I never wish to see again.",
    "timestamp": 1299193200
  },
  {
    "username": "fslocalking",
    "rating": 1.0,
    "comment": "每一轮开始阶段,玩家之间进行口头讨论和做一个商讨,可以许下承诺,然后各自秘密在白纸上写上自己调动军队的详细过程,然后一起摊开白纸,按照白纸上所写的进行调动军队,估计说明书有大部分是教玩家的书写规则的,晕倒!",
    "timestamp": 1291935600
  },
  {
    "username": "torak",
    "rating": 1.0,
    "comment": "French version: My advice: Beuarrrk!",
    "timestamp": 1290034800
  },
  {
    "username": "My Lego",
    "rating": 1.0,
    "comment": "I find it to be broken and not really a game. hmm",
    "timestamp": 1283464800
  },
  {
    "username": "bearn",
    "rating": 1.0,
    "comment": "Wow i played this once and it is exactly the mean spirited game that it is portrayed as. DO NOT play this game with people who do not have a thick skin.",
    "timestamp": 1283464800
  },
  {
    "username": "flyboy16",
    "rating": 1.0,
    "comment": "I've been lied too, tricked, and worse - off ignored and ostracized. Sound more like a blues song than a game.",
    "timestamp": 1276120800
  },
  {
    "username": "alfredo lorente",
    "rating": 1.0,
    "comment": "Diplomacy is a love-it-or-hate-it \"game.\" Those who enjoy it don't mind its length, its intensity, and the fact that the whole games revolves around completely nailing your opponent, so the their last twelve hours of play produce no payout. I'd rather bang my head against a wall.",
    "timestamp": 1266706800
  },
  {
    "username": "middleclassjoe",
    "rating": 1.0,
    "comment": "ugh! I would rather eat finely ground up glass and die from internal hemorrhaging than play this crap ever again.",
    "timestamp": 1258671600
  },
  {
    "username": "petershergalis",
    "rating": 1.0,
    "comment": "Played wth friends and it was too easy for the cheaters to manipulte rules i their favor. I hate when the rules change each time you play and always change to the favor of the other guy. Republic of Rome blows this out of the water for real diplomatic game play and the rules stay consistant.",
    "timestamp": 1240437600
  },
  {
    "username": "Bodo",
    "rating": 1.0,
    "comment": "A vile exercise in all modes of conduct that should be discouraged in humans, and banned in gamers.\nTo win this game, you lie to your friends for the momentary benefit of winning a game.\nWith this line of reasoning, whats wrong with the next step........ a little cheating.\nI last played this back in the 1970s when I was young and immature, with others who were young and immature, and saw it ruin friendships.\nIt is a relationship breaker.\nSome fun !",
    "timestamp": 1221602400
  },
  {
    "username": "metelo",
    "rating": 1.0,
    "comment": "Most games end in a tie after a lot of backstabbing.\n\nI had the itch to play it now and then, but since I found senji. no need to even mention it in our gaming group.",
    "timestamp": 1221516000
  },
  {
    "username": "The Doctor",
    "rating": 1.1,
    "comment": "Not a game for THE CHILDren. Elimination results in boredom and a profound desire to eat the game pieces. Objects may be thrown.",
    "timestamp": 1219874400
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 1.0,
    "comment": "The poster child for lying, and stabbing your sworn partners in the back. This game convinced me I HATE diplomacy games.",
    "timestamp": 1217541600
  },
  {
    "username": "audpopdeb",
    "rating": 1.0,
    "comment": "UUUGH!",
    "timestamp": 1203980400
  },
  {
    "username": "Kester",
    "rating": 1.0,
    "comment": "This is more popularity contest than game. It's like a long, drawn-out party game where instead of having fun you're horrible to each other. I cannot fathom the appeal at all.",
    "timestamp": 1201042800
  },
  {
    "username": "Simon Mueller",
    "rating": 1.0,
    "comment": "Austrian politics were actually more fun than portayed in this game.",
    "timestamp": 1197241200
  },
  {
    "username": "Senso",
    "rating": 1.0,
    "comment": "Want to lose friends? Play this.",
    "timestamp": 1160604000
  },
  {
    "username": "iamspamus",
    "rating": 1.0,
    "comment": "OHMIGOD, this game sucked. It's worse than the dentist. I know that there are people out there who love it. Enjoy and play it all you want. Just don't ask me to play it.",
    "timestamp": 1142982000
  },
  {
    "username": "tyoda",
    "rating": 1.0,
    "comment": "I played this in college and hated, hated, hated it. A great game if you want to start a fight with your friends.",
    "timestamp": 1142722800
  },
  {
    "username": "aramis",
    "rating": 1.0,
    "comment": "I hate this game. It's always been an excuse for people to gang up on each other and backstab mercilessly.",
    "timestamp": 1116280800
  },
  {
    "username": "Bathory",
    "rating": 1.0,
    "comment": "Play three time with germany... Never again. I'm not sure that is really a game !",
    "timestamp": 1106953200
  },
  {
    "username": "victorywt",
    "rating": 1.0,
    "comment": "down time too long.",
    "timestamp": 1090706400
  },
  {
    "username": "potterama",
    "rating": 1.0,
    "comment": "To my mind, the most spite-inducing bit of treachery which ever had the misfortune to plague the hobby. Should be banned by the Geneva Convention. Add to this landscape an unplayably complex unit-movement mechanic, and a bizarre requirement for number of players (changed in other editions, I'm informed) and you have less a boardgame and more spite-in-a-box.",
    "timestamp": 1085349600
  },
  {
    "username": "hinj",
    "rating": 1.0,
    "comment": "Thad gave me a quick and dirty diplomacy lesson for dummies. Agreed, the mechanics of the game are quite simple. But all that negotiation…I’m pretty sure this one isn’t for me. I very much dislike negotiation games. It was interesting, though, and\nsomeday I’d like to see it played, but I’m pretty sure I don’t want to participate.",
    "timestamp": 1078268400
  },
  {
    "username": "Greblord",
    "rating": 1.0,
    "comment": "Loathe. Detest.",
    "timestamp": 1067209200
  },
  {
    "username": "Gregsacto",
    "rating": 1.0,
    "comment": "Is this even a game? Hated it, my other half hated it, every gamer we know hates it. Why would anyone spend time doing this?",
    "timestamp": 1052517600
  },
  {
    "username": "MingFu",
    "rating": 1.0,
    "comment": "Worst game ever, long and disappointng, a 1 out of respect for other people. Ambiguous rules, ambiguous geography, and ridiculous length in a 7 player game lead to this game's suck factor. The other 6 players, all of whom are decent gamers and willing to play a variety of games, refuse to play this again.\nI was going to keep complaining, but I realize if you choose to play this game you deserve what you get.",
    "timestamp": 1044140400
  },
  {
    "username": "tbrofromspace",
    "rating": 2.0,
    "comment": "I've won my only game of this. Seems to be a bad faith exercise, and I am very alarmed by the AI training the society of world dominators or whatever the pro league for diplomacy is called is doing.",
    "timestamp": 1743804000
  },
  {
    "username": "Mack1993",
    "rating": 2.0,
    "comment": "Cool concept but tedious.",
    "timestamp": 1727388000
  },
  {
    "username": "SocialJusticePaladin",
    "rating": 2.0,
    "comment": "Immensely long, immensely tedious, deeply unrealistic and frustrating. Christ alone knows why people still play this crap. Strong candidate for one of the worst games ever made.",
    "timestamp": 1722981600
  },
  {
    "username": "TryAndHoldMeBack",
    "rating": 2.0,
    "comment": "Unbalanced starting positions/ Options.\nNo Fun and complete time waste.\nThis game invented down time.",
    "timestamp": 1686866400
  },
  {
    "username": "PaperDesigner",
    "rating": 2.0,
    "comment": "I once played part of a single game. That was enough. Why do I want to play a game that takes six hours and you can get stabbed in the back multiple times? It's a well-designed game that was clearly designed to ruin friendships. Pass.",
    "timestamp": 1642028400
  },
  {
    "username": "eecpickle",
    "rating": 1.5,
    "comment": "It is pretty bad, I hate long negotiation games. But I could see why people like it.",
    "timestamp": 1641942000
  },
  {
    "username": "PScipio",
    "rating": 2.0,
    "comment": "I own three copies of this game I no longer like and will no longer play - after scores of FtF, snail mail, and e-mail games. (Most before BGG was created, so not noted here.) Kissinger, who like myself is a former diplomat and learned in diplomatic history, reportedly is a big fan of this game. Probably our differences IRL and on this game stem from the fact that he is ok with a diplomacy that is far more devious and ultimately unsuccessful than that which I support.",
    "timestamp": 1640386800
  },
  {
    "username": "Jolnarfanatic",
    "rating": 2.0,
    "comment": "Just so long and very player dependent",
    "timestamp": 1621375200
  },
  {
    "username": "chaddyboy_2000",
    "rating": 2.0,
    "comment": "A pure negotiation game isn't for me. I can't even remember who I've made what deals with, and don't enjoy the effort that goes into doing so. I found it more fun simply irritating others' plans until I was eliminated.",
    "timestamp": 1610492400
  },
  {
    "username": "Spikiii",
    "rating": 1.5,
    "comment": "I feel very bad backstabbing people, this game is absolutely not for me",
    "timestamp": 1608159600
  },
  {
    "username": "dkuznick",
    "rating": 2.0,
    "comment": "Played back in high school. This is so not my cup of tea. Certainly a game I would refuse to play.",
    "timestamp": 1605654000
  },
  {
    "username": "tyrone_jones",
    "rating": 2.0,
    "comment": "Nope never going to play this one, but I got it at a garage sale!",
    "timestamp": 1603666800
  },
  {
    "username": "DinahSanders",
    "rating": 2.0,
    "comment": "How to Lose Friends box set.",
    "timestamp": 1597528800
  },
  {
    "username": "RicPain",
    "rating": 2.0,
    "comment": "Ugh. This game is horrible. Hours worth of playtime is frequently undermined by players who want to quick turnaround by breaking an alliance. This game is the opposite of fun.",
    "timestamp": 1588543200
  },
  {
    "username": "danieltanner",
    "rating": 2.0,
    "comment": "I hate diplomacy.",
    "timestamp": 1579820400
  },
  {
    "username": "ratbulogg",
    "rating": 2.0,
    "comment": "Unbalanced and unrealistic. The only thing this game does well is destroy friendships.",
    "timestamp": 1525212000
  },
  {
    "username": "PetSven",
    "rating": 2.0,
    "comment": "A several hour long kingmaker scenario.",
    "timestamp": 1508623200
  },
  {
    "username": "petegrey",
    "rating": 2.0,
    "comment": "One play was enough for me. No thanks.\n\nThe game isn't broken. Its just super long and annoying.\n\nIf I want to betray and piss people off in a game, I'll play Intrigue.\n\nIf I want something similar with a longer duration, I'll just go to work.",
    "timestamp": 1499378400
  },
  {
    "username": "Toxic Meeple",
    "rating": 2.0,
    "comment": "I feel I ought to justify a low rating, but *sound of air blown across lower lip*",
    "timestamp": 1499119200
  },
  {
    "username": "gossamerica",
    "rating": 2.0,
    "comment": "This game is clearly not for me. After wasting 5-6 hours, the 5 of us playing decided we were done and called it a draw. Clearly not my kind of game.",
    "timestamp": 1486940400
  },
  {
    "username": "johnpnewman",
    "rating": 2.0,
    "comment": "The game that ruins weekends and destroys friendships. If you don't mind a brutal backstabbing game that takes 6 - 8 hours to play, this is for you!",
    "timestamp": 1486422000
  },
  {
    "username": "themaster408",
    "rating": 2.0,
    "comment": "BGG rating system I rate it at 2. In the \"is this a well made game, is it balanced\" I give it a 9. I loved this game when I started it, but the game is way too long and I've never seen people get as angry playing this as they have with any other game. You can be essentially eliminated early on, but have to still play. People become pawns for other players similar to playing Risk with a couple who never attack each other.\nThe game itself is not bad, but I can't play this again.",
    "timestamp": 1469570400
  },
  {
    "username": "sancmat",
    "rating": 2.0,
    "comment": "Game: Name on cover",
    "timestamp": 1464732000
  },
  {
    "username": "NoxMortem",
    "rating": 2.0,
    "comment": "I really think this game IS amazing, but i can not give it a higher ranking because this game really only depends on whom you can ally with. I KNOW this is all this game is designed to do but it can be very unsatisifiyng when on a game evening after one of seven hours one ore more players are defeated and can go home. This is player elimination extreme.\n\nUpdate 2016: Reduced down to 2. I just play Subterfuge on Android if I want that experience and it makes so much more fun. Diplomacy died for me.",
    "timestamp": 1460066400
  },
  {
    "username": "sirlivealot",
    "rating": 2.0,
    "comment": "Owned by someone else. Currently in my collection.",
    "timestamp": 1458342000
  },
  {
    "username": "alfonzo54",
    "rating": 2.0,
    "comment": "I find this very interesting in theory but I'm pretty sure I dislike dedicated negotiation phases in area control games which is all Diplomacy is. Combine it with the rulebook full of clarifying diagrams of confusing situations, the playtime, the necessary player count, and all the various imbalances and you get something I'll avoid.",
    "timestamp": 1451775600
  },
  {
    "username": "firstfletch",
    "rating": 2.0,
    "comment": "Long game that feels like a grueling day at work. No fun for me at all.",
    "timestamp": 1438812000
  },
  {
    "username": "AmadanNaBriona",
    "rating": 2.0,
    "comment": "I am terrible at lying and I hate backstabbing. I can recognize the brilliance of the design and its appeal to a certain sort of ruthless player, but it is not for me.",
    "timestamp": 1436479200
  },
  {
    "username": "Shleprock",
    "rating": 2.0,
    "comment": "About thirty years ago this would have been a five. Not fun at all unless you're looking to talk about nothing interesting. This game just might be fun with the right gaming group' but it would be difficult to find that group.",
    "timestamp": 1434405600
  },
  {
    "username": "stefant",
    "rating": 2.0,
    "comment": "Play this if you need to get rid of some friends and make more enemies.",
    "timestamp": 1426287600
  },
  {
    "username": "mierla",
    "rating": 2.0,
    "comment": "To be clear, I think it's an excellent game. It's just not my cup of tea.",
    "timestamp": 1425423600
  },
  {
    "username": "NewTroll",
    "rating": 2.0,
    "comment": "Way too long for an elimination game! Even worst though is getting only 'mostly' taken out and then having to actually sit through hours of \"gameplay\" you can't actually contribute to. To me, Diplomacy is NOT a game. Bought game on hype, played several times trying to find the enjoyment, donated to Goodwill. The end.",
    "timestamp": 1421362800
  },
  {
    "username": "Maximuss",
    "rating": 2.0,
    "comment": "Sometimes I find the rating system on BGG a little wonky. Giving Diplomacy a 2 seems harsh. However, based on what a 2 in BGGs rating system means, it's the closest to how I feel about the game.\n\nDiplomacy is a war/negotiation game set in the years leading up to WWI. The 7 major European countries are represented on the board, which is in fact a map of Europe. To win, a player has to control 18 specially marked provinces on the board. Every country starts with three of these provinces, except Russia, which starts with four. In order for anyone to do well at all they are going to have to form alliances with other players. However, these alliances are fragile at best as players never know how much to trust each other, and are always looking for an opportunity to turn on their allies when it's most advantageous.\n\nDiplomacy is an incredibly well thought out game. All countries have more-or-less even strength to start, and are immediately threatened by at least two other neighbouring countries. I really appreciate and applaud the game for its design.\n\nI hate long games. I just don't want to invest hours upon hours of time to one game. Despite this I really wanted to try Diplomacy, which has a reputation of going long. Now I've played it, and my desire to play has been quenched - forever. This is why I rate Diplomacy a 2. It's because a 2 indicates that I never want to play the game again. For one thing, the game had gone seven hours before the first (and as it turned out only) player was eliminated. A big reason for the length is that you can only go so far before getting bogged down in stand-offs with other countries' military units. These impasses are frequent, and slow progress down considerably. Second, you have to lie to other players and stab them in the back. This is known about the game, and my group even discussed it before we started. We reminded ourselves that it's only a game, so don't get too upset when someone turns on you. However, when I stabbed my friend in the back, who thought we had a rock-solid alliance, he was angry. I didn't like making him feel that way. I also didn't like betraying his trust in me, even though it was only within the game. I've realized that if a game causes negative emotions I'm just not into it. I sold my copy of Intrigue after one play for this same reason.\n\nSo, I doubt I'll ever play Diplomacy again. For the reasons mentioned I can't recommend the game either.",
    "timestamp": 1413064800
  },
  {
    "username": "asahetter",
    "rating": 2.0,
    "comment": "Only play this with folks you wish to never talk to again. I've seen people cry during this.",
    "timestamp": 1405980000
  },
  {
    "username": "LL6869",
    "rating": 2.0,
    "comment": "Good lord, can't be played.",
    "timestamp": 1400968800
  },
  {
    "username": "Abhoth_",
    "rating": 2.0,
    "comment": "A fascinating game, but the backstabbing and deceit does not result in a nice evening. I have yet to play it without at least one person getting really angry.",
    "timestamp": 1399845600
  },
  {
    "username": "Scavinger",
    "rating": 2.0,
    "comment": "Only play with people you want to lose as friends.",
    "timestamp": 1387753200
  },
  {
    "username": "Panzerknacker",
    "rating": 2.0,
    "comment": "I may have to try this game online, but as a board game, it has one inbuilt flaw that totally breaks it for me - and that's NOT the backstabbing aspect. It's player elimination combined with an extremely long play time. There is no better way to spoil a good evening with friends. Or, even worse - plays where a player is only almost eliminated, but still forced to watch the game without having much to contribute. That is not only insuling to friends and/or guests to someone's house, it is also the opposite of what a board game should do.\n\nThere are other, much better games with similar elements, like Junta (because it offers different ways of escaping from a dreadful position, while it's also very humrous and has more exciting moments), Game of Thrones (because it's more thamtic, more random and has limited play time), or simply Risk (because it's short with missions).",
    "timestamp": 1386457200
  },
  {
    "username": "martybjsg",
    "rating": 2.0,
    "comment": "A 'classic' - pass. Play Civilization, it is much better for the time taken. Waaaayyy too long for the fun return provided. There are much better games nowadays. First played in the 1970s, and thankfully not played since the '80s. I do not understand the 'love' for this one.",
    "timestamp": 1384124400
  },
  {
    "username": "TaijiJohn",
    "rating": 2.0,
    "comment": "All negotiation. Not my type of game at all.\n\nSold at Pacificon 2012.",
    "timestamp": 1377468000
  },
  {
    "username": "saccenti",
    "rating": 2.0,
    "comment": "You would really have to find the right group of seven players for this to work well, and I am perhaps not a good candidate.",
    "timestamp": 1374530400
  },
  {
    "username": "biohazard930",
    "rating": 2.0,
    "comment": "I'm not a big fan of the \"lie-to-the-face\" style of direct conflict. I guess I'm not a good diplomat.",
    "timestamp": 1370469600
  },
  {
    "username": "Smoo",
    "rating": 2.0,
    "comment": "Very pure game, but I need to be in a very specific mood to play it. Better played online.",
    "timestamp": 1369864800
  },
  {
    "username": "Bolger",
    "rating": 2.0,
    "comment": "I realize that this games has some good qualities, but it simply is not for me. I don't like negotiation games, and this one is one is just too long as well. I could enjoy this one hour, but not five.",
    "timestamp": 1350252000
  },
  {
    "username": "davestephens",
    "rating": 2.0,
    "comment": "DIPLOMACY\nNot fun in any way.",
    "timestamp": 1340143200
  },
  {
    "username": "bpovis",
    "rating": 2.0,
    "comment": "I can understand why some folks like this game, but for me it is the very definition of agony.",
    "timestamp": 1338847200
  },
  {
    "username": "Zoibil",
    "rating": 2.0,
    "comment": "You have to lie to win. That's a huge problem for me.\nPeople who love this game try to compare it to chess and say there is no luck. This is a load of garbage.\nPeople who love this game repeatedly claim people are in some way defective if they don't like this game. That is also a load of garbage.",
    "timestamp": 1331852400
  },
  {
    "username": "Jude",
    "rating": 2.0,
    "comment": "I detest this game. Lying and backstabbing leave me feeling filthy, and I also hate being lied to. Give me a straight-forward wargame where there is no doubt that we are trying to kill each other outright.",
    "timestamp": 1330988400
  },
  {
    "username": "Hugin",
    "rating": 2.0,
    "comment": "\"This is the game that never ends... it just goes on and on my friends...\"",
    "timestamp": 1328655600
  },
  {
    "username": "Kweevnidny",
    "rating": 2.0,
    "comment": "Gunboat diplomacy gets a big 8 from me, but in its base form I really do not like the game. I think its the lying and cheating aspect that I detest the most, not to mention the loss of a day of my life with which I could get more enjoyment from by cutting the front lawn with nail scissors.",
    "timestamp": 1327964400
  },
  {
    "username": "kowalskie",
    "rating": 2.0,
    "comment": "1x7\n\n---\n\nOnly played once but would not be interested in trying again.\n\nSimply found it dull - the actual game is almost non-existent & walking around trying to convince people to 'help' you in a completely artificial environment held no interest for me...\n\nYou could get the same effect byjust sitting with 6 other people and arguing untill you decide who the 'winner' should be.",
    "timestamp": 1321830000
  },
  {
    "username": "milesn",
    "rating": 2.0,
    "comment": "The game itself is not bad, but I will not play it again, ever. It causes too many conflicts between players which unfortunately can spill over into real life. No game is worth that.",
    "timestamp": 1305496800
  },
  {
    "username": "tmf2115",
    "rating": 2.0,
    "comment": "Definitely a great facebook game, or phone app but a horrible board game that takes AGES to finish and still gets you no-where.",
    "timestamp": 1293145200
  },
  {
    "username": "Eryth",
    "rating": 2.0,
    "comment": "Brand new, recent printing, still in the original shrinkwrap.",
    "timestamp": 1291244400
  },
  {
    "username": "Mindmaster21",
    "rating": 2.0,
    "comment": "Pas mon type de jeu: trop long, pas ou peu d'ambiance.Le système de jeu est aride, je lui préfère un Trône de Fer.\n\nNot my type of game: too long, little or no atmosphere. The game system is dry, I prefer A Game of Throne",
    "timestamp": 1289775600
  },
  {
    "username": "ryancarroll88",
    "rating": 1.7,
    "comment": "I probably couldn't count the number of miserable times I have had with this Diplomacy. The game itself has virtually no mechanics, so gameplay relies entirely on user interaction - before every turn players discuss with each other their plans for expansion and work deals out based on that. The way we played, everyone met each other one to one in private and exchanged their \"strategies.\" What this boils down to is making empty promises, getting frustrated that other people break theirs, and way more time wasting than should be ever reasonable for a board game. Even worse, I have found that as time goes on people take the game more and more seriously and pretty much everyone gets angry and bitter towards one another. Not at all my idea of a fun board game night.",
    "timestamp": 1282514400
  },
  {
    "username": "Fulminata",
    "rating": 2.0,
    "comment": "I have played this game once upon a time back in my youth, but I don't think I would ever do so again. Certainly not with people I consider friends. A certain level of player conflict and even backstabbing is one thing, but the level that is required to play this game is too high. It's a game that seems purposely designed to bring out the worst in me as a gamer, therefore I simply won't play.",
    "timestamp": 1271628000
  },
  {
    "username": "yoda31419",
    "rating": 2.0,
    "comment": "It drags.\nSo few interesting choices.\nIt's so long.\nJust... no.",
    "timestamp": 1269126000
  },
  {
    "username": "Great_Mazinga",
    "rating": 2.0,
    "comment": "Avalon Hill version has very nice metal ships and cannons. Great game for destroying relationships.",
    "timestamp": 1268780400
  },
  {
    "username": "shopt",
    "rating": 2.0,
    "comment": "I just don't like this game. It's no fun being the person who gets killed early, and there is too much kingmakering.",
    "timestamp": 1258412400
  },
  {
    "username": "camidon",
    "rating": 3.0,
    "comment": "Not my kind of game. So cutthroat and so much deceptive. Not fun for me in this day and age. Appreciate what the game wants to do, but would rather do so many other things. If I wanted to discuss treaties with people I'd be a diplomat.\n\nTRADED",
    "timestamp": 1758664800
  },
  {
    "username": "Mikael Halonen",
    "rating": 3.0,
    "comment": "Writing orders is fun and negotiation is fun but this game can make me very angry.",
    "timestamp": 1758319200
  },
  {
    "username": "M St",
    "rating": 3.0,
    "comment": "Surprisingly unpleasant and far too long for what it does. A product of its time, given the competition in the 50s and 60s. Have not played it in 35+ years and do not intend to go there again.",
    "timestamp": 1749333600
  },
  {
    "username": "SultanSevy",
    "rating": 3.0,
    "comment": "There are many other things I enjoy doing a whole heckuva lot more than pissing off my friends for 6 hours. Blech!!",
    "timestamp": 1747173600
  },
  {
    "username": "Nickeddy01",
    "rating": 3.0,
    "comment": "Best game ever to play with people that you want to have a falling out with. Enormous playing time, but you end up hating on your friends. And if you are having a bad run, you will end up sacrificing hours and hours to losing a game that you are hating playing. I have actually lost friends from playing this game. All that said, it is still an awesome experience",
    "timestamp": 1732748400
  },
  {
    "username": "tmoiynmwg",
    "rating": 3.0,
    "comment": "A classic that takes literally forever to play and is nothing but feel-bads.",
    "timestamp": 1731884400
  },
  {
    "username": "etothejtheta",
    "rating": 3.0,
    "comment": "I hate this game.",
    "timestamp": 1730674800
  },
  {
    "username": "JacobiteCat",
    "rating": 3.0,
    "comment": "Lead to a few fistfights among the group I gamed with long ago so sold it and haven't looked back.",
    "timestamp": 1726437600
  },
  {
    "username": "m2f2",
    "rating": 3.0,
    "comment": "World War 1\n\nx",
    "timestamp": 1712613600
  },
  {
    "username": "Simonsmrt",
    "rating": 3.0,
    "comment": "I wanted to give this a higher rating but it just never really worked for me. Just endless arguments",
    "timestamp": 1711234800
  },
  {
    "username": "Nanorider426",
    "rating": 3.0,
    "comment": "Do you want to lose some friends? Play this game!",
    "timestamp": 1704668400
  },
  {
    "username": "BoSSman232",
    "rating": 3.0,
    "comment": "What a god awful game. You can be knocked out of contention (of this very long game) within the first 3 turns due to no fault of your own. Then you must sit there the rest of the game and none of the other players will help you back into advantageous positions (why would they). Having private conversations with any of the other players to plan is kind of interesting, but it also really drags out the game as people keep having meetings while others just want to progress to the next turn.",
    "timestamp": 1697493600
  },
  {
    "username": "giorgiopaco",
    "rating": 3.0,
    "comment": "The idea would be very nice, but the contemporaneity of the execution of the actions makes, for my taste, the game very difficult to play.",
    "timestamp": 1680818400
  },
  {
    "username": "jdberry",
    "rating": 3.0,
    "comment": "Way too long and unsatisfying. Hours of \"dude, help me attack X and move away from Y\"--no thanks.\n\nThree neighboring countries. All three make deals. All legitimate deals from a strategic standpoint. All mutually exclusive. One country, therefore, must get screwed. I've been on both sides--the winning end was not really that satisfying, the losing end especially so.\n\nI don't like the feeling of implicit collusion that pervades. I don't think meta-distrust is part of the game. Or IS it... bwahahaha. Ahem. Just too many other fun things to play out there, without spending 24 hours on a 3-way win.",
    "timestamp": 1679094000
  },
  {
    "username": "adrian754",
    "rating": 3.0,
    "comment": "Not really sure if it's a board game with a playing time of 360 minutes, it's more like a tool for a workshop about planning, strategy and negotiation. The rules are complex.",
    "timestamp": 1677193200
  },
  {
    "username": "curtc",
    "rating": 3.0,
    "comment": "I used to really like this back when I had unlimited time, and friends with the same. But now I can't imagine playing this instead of A Game of Thrones or Wallenstein or Battle For Rokugan, which scratch a similar \"plan and reveal\" itch, but much better. And in a fraction of the time.",
    "timestamp": 1675465200
  },
  {
    "username": "andy61",
    "rating": 2.5,
    "comment": "Simple but ground-breaking negotiation game, but I was just rubbish at it. Mind you, my closest friend was national Diplomacy champion 1982 (or was it 83?)...\nBut it's all about back-stabbing, so I have no desire to play it again.",
    "timestamp": 1639004400
  },
  {
    "username": "emilxf",
    "rating": 3.0,
    "comment": "Well, it’s a classic and I like the thing with writing down orders and discussing in different rooms. But the butthurt factor is just too great.",
    "timestamp": 1628719200
  },
  {
    "username": "Korwin",
    "rating": 3.0,
    "comment": "Never liked it, but unlike risk, at least I know why other people like it",
    "timestamp": 1601244000
  },
  {
    "username": "naehlen",
    "rating": 3.0,
    "comment": "gespendet an bodo",
    "timestamp": 1599429600
  },
  {
    "username": "Born-of-Ashes",
    "rating": 3.0,
    "comment": "If only world leaders would play this game instead of using real lives they would only kill each other. I do not enjoy the feel of deception from either side, but especially when I have a mechanically ensured victory that relies on my ally not losing their nerve to an opponent’s cajoling machinations.",
    "timestamp": 1595282400
  },
  {
    "username": "dollamanna",
    "rating": 3.0,
    "comment": "Cared little for the mechanics of this one. Alliances forged mean nothing so opponents could help or oppose you at the drop of a hat. I managed to come third out of five by never forming an alliance, showing you that being on the wrong side of a betrayal early on will mess up the rest of the game for you.",
    "timestamp": 1586815200
  },
  {
    "username": "_The_Inquiry_",
    "rating": 3.0,
    "comment": "Prior to 2020: 2 plays",
    "timestamp": 1580857200
  },
  {
    "username": "kevinwho",
    "rating": 3.0,
    "comment": "I loved and hated this game as a teen. I loved the simultaneous action selection, but hated that 75% of the gametime was spent on wheeling and dealing, more specifically my friends/opponents trying to talk me into taking actions that clearly were to their own benefit and not mine.",
    "timestamp": 1579215600
  },
  {
    "username": "viranga",
    "rating": 3.0,
    "comment": "Nearly always the first one eliminated. I do like several aesthetic and strategic/tactical aspects of the game. I would rate it higher if not for the high back-stab potential. I don't mind deceiving (e.g. Die Kutschfahrt zur Teufelsburg), lying (e.g. The Resistance), and back-stabbing as a result of deceiving (e.g. Dune). ...but back-stabbing as a result of going back on my explicitly given word (even in a game)... There are strange things I learn about myself in this hobby",
    "timestamp": 1576537200
  },
  {
    "username": "HiTracey",
    "rating": 3.0,
    "comment": "A classic game in many ways, but dry as dust. It has led me to bear grudges at others' perfidy for over four decades, which can't be a good thing.\n\nComplexity 1/10 (rules); ?/10 (strategy)",
    "timestamp": 1574722800
  },
  {
    "username": "mOCHU035",
    "rating": 3.0,
    "comment": "I see no reason as to why this game would ever work in person. Online with friends is just as annoying. Online with strangers is just slightly more tolerable. And there is so much talking and so little doing. Far better in concept than in execution.",
    "timestamp": 1564264800
  },
  {
    "username": "Commissar_Piotr",
    "rating": 3.0,
    "comment": "This is a really awesome game, not to my taste but I appreciate the game mechanic and have no problem with admitting that the game is a lot better than I will ever be as a gamer. Do not play with anyone you want to keep as a friend.",
    "timestamp": 1559512800
  },
  {
    "username": "philip.dutre",
    "rating": 3.0,
    "comment": "I used to LOVE this game (would have given it a 10), back in the days when we had TIME (read: student days). Been there. done it, now I don't bother anymore.\n\nI would still recommend everyone who hasn't tried it yet to try it, since it's a classic and would be a shame not to have played this at least once in your life.\n\nDiplomacy-type games are not really my cup-of-tea anymore. Players approach it too differently, which can really turn it into a frustrating experience.",
    "timestamp": 1552258800
  },
  {
    "username": "JediPearce",
    "rating": 3.0,
    "comment": "Opened, Never Played.",
    "timestamp": 1537048800
  },
  {
    "username": "Jhimbob",
    "rating": 3.0,
    "comment": "Bit of an unpleasant slog, this takes all the interesting points of discussion and puts them into an awkward war game full of player elimination and feeling bad about literally everything you do. The Game of Thrones Board Game is this game with a modern design.",
    "timestamp": 1534197600
  },
  {
    "username": "dragonster",
    "rating": 3.0,
    "comment": "Long game if played with full 7 (though best overall imo).\nBad game if played with 2.\nRules for 4 or 6 seem quite good though.",
    "timestamp": 1526335200
  },
  {
    "username": "WilcoxDave",
    "rating": 3.0,
    "comment": "I am not a fan of collusion and back stabbing games. Though this might be realistic it feels like a player elimination type of game and it takes too long to keep my interest. I know it is a classic but I never enjoyed the play.\n\nA similar game without all the secret discussions that I enjoyed a little more was Borderlands.",
    "timestamp": 1522274400
  },
  {
    "username": "InventoryAccount",
    "rating": 3.0,
    "comment": "Some of my most fond gaming memories are based around Diplomacy. I can remember playing games of it at college, where we would all submit turns twice a day and discuss moves during classes. I can remember multiple other games where we would show up at someone's house and play until the wee hours of the morning, getting angry at each other for betrayals and then immediately offering to ally again as soon as the moment was right.\n\nI can also remember that I've literally never finished a game. I've also had people who got mad enough to not talk to me for days afterwards, and while I'm sure the majority of that blame is on me, I can't help but feel that the game brings it out of people as well.\n\nIt's an experience that I think everyone should have at least once, but I honestly don't think it's a very good game. Mechanically it's nothing incredible, and other games can fill a similar niche in far less time.\n\nIn short, I look back on Diplomacy fondly, but I would not recommend it as a good game, and would also be unlikely to play it again.",
    "timestamp": 1511910000
  },
  {
    "username": "1 Family Meeple",
    "rating": 3.0,
    "comment": "MIKE'S",
    "timestamp": 1508882400
  },
  {
    "username": "mangozine",
    "rating": 3.0,
    "comment": "I have never been a fan of this — much as I enjoy a certain 'have that' element in many games, this takes it to all the extremes I really don't enjoy... It's a good game, for sure, but it's also one that I really don't like, thus the poor rating.",
    "timestamp": 1507845600
  },
  {
    "username": "bcnevan",
    "rating": 3.0,
    "comment": "You're hungry, but all that you have is a dried up, shriveled prune that is well past its expiration date. If you eat it, you'll be occupied with discomfort for the next 4+ hours and you'll have learned at least one lesson after recovering. You'll now know to leave such ugly and mildly poisonous things alone.",
    "timestamp": 1507586400
  },
  {
    "username": "edoved",
    "rating": 3.0,
    "comment": "The emphasis on negotiation is very interesting, but it's not a pleasant gaming experience. Lasts too long. It's similar to Risk without chance.",
    "timestamp": 1505685600
  },
  {
    "username": "DanD030",
    "rating": 3.0,
    "comment": "Okay, okay. This game is not deserving of a \"3\". However, even my the heyday of my youth when I had way too much time, we never came close to finishing a game of Diplomacy. Always seemed like the game was straining friendships as much as it was straining game alliances.",
    "timestamp": 1489705200
  },
  {
    "username": "The_Crimson_King",
    "rating": 3.0,
    "comment": "Once you understood the game you knew which alliances would work and which wouldn't. From then on it's boring.",
    "timestamp": 1485039600
  },
  {
    "username": "coxy_fc",
    "rating": 3.0,
    "comment": "Hated this game, it's great for finding out just how annoying and pushy people can be (you know, sweaty guys in black t-shirts acting like they rule the world...wait a second?!), but my last play was 30 yrs ago so maybe I should give it another go.",
    "timestamp": 1484175600
  },
  {
    "username": "mightycreeper",
    "rating": 3.0,
    "comment": "Does not work with non-hardcore gamers or too few players.",
    "timestamp": 1477868400
  },
  {
    "username": "Boltana",
    "rating": 3.0,
    "comment": "Far too many games do the same thing with better mechanics.",
    "timestamp": 1474149600
  },
  {
    "username": "MackDaMerc",
    "rating": 3.0,
    "comment": "If you enjoy this game, look for a modern substitute:\n- A Game of Thrones: The Board Game (2nd Ed)\n- Age of Conan: The Strategy Board Game",
    "timestamp": 1470002400
  },
  {
    "username": "DylanAM",
    "rating": 2.5,
    "comment": "Eerily, (and I can't really explain how this came about) when push came to shove, and my friends and I pulled out the knives, we were all either emotionally bothered by the impact it had on us, or on other players at the table. Something happened. Despite the fact that we knew going in NOT to take anything personal, it stopped feeling like a game, and started feeling like what would happen if people were really acting this way.\n\nWe didn't like causing each other to feel that way seriously, even though it was just because of things going on in the game. I've realized something about games from playing Diplomacy, that \"it's just a game\" only carries so far. Even though I really, really appreciate the uniqueness and structure of this game, I'll be surprised if I can really bring myself to play it again. I used to be the person who said \"If your friendship takes a hit over a game, what kind of friendship was it really?\" It's just, in a way, it stopped feeling like a game. And it just wasn't the kind of game I ever wanted to play again.",
    "timestamp": 1463436000
  },
  {
    "username": "StuffyMcGee",
    "rating": 3.3,
    "comment": "Interesting concept with the secret negotiation and backstabbing, but it takes forever and wasn't that fun.",
    "timestamp": 1458514800
  },
  {
    "username": "MichaelDSwitzer",
    "rating": 3.0,
    "comment": "Too long, too slow. So many better games out there now.",
    "timestamp": 1457391600
  },
  {
    "username": "Lancelot42",
    "rating": 2.5,
    "comment": "I *want* to like this game; but sadly I have to admit that it has a lot of flaws. Too long; too difficult to play (secret negotiations). Player elimination.\n\nPlayed a lot of this in high school & college.",
    "timestamp": 1434664800
  },
  {
    "username": "Carlos Palomino",
    "rating": 3.0,
    "comment": "Conveys little sense of the diplomatic battle for Europe; can be boring if you're out of it; this might be a classic, but it does not hold up to newer offerings (like Tammany Hall))",
    "timestamp": 1431295200
  },
  {
    "username": "heikman",
    "rating": 3.0,
    "comment": "It is not necessarily bad.. i see what it has to offer.. it's just that i do not enjoy backstabbing per se.. and backstabbing you have to do a lot, if you wanna win.\n\nFurthermore it takes ages...! My playgroup started really pumped up about it.. but after 4 hours where everyone betrayed almost everyone the faces were getting long.\nAt that point you ask yourself what am I doing here..? Is anyone enjoying this right now..?\n\nNot me, but it certainly has a following.",
    "timestamp": 1427666400
  },
  {
    "username": "cratex",
    "rating": 3.0,
    "comment": "Played it once many years ago because I was talked into it. Ugh. Yes, I'm sure it is a great game for those that enjoy that sort of thing. Me, I'd rather do something else.",
    "timestamp": 1426978800
  },
  {
    "username": "Sorp222",
    "rating": 3.0,
    "comment": "Late 70's early 80s this was my fave game. Same tingle and excitement i now get from xxxxx. I doubt i will ever play it again -but what fond memories.\n\nQuite amazing to think that this game was designed in 1959.",
    "timestamp": 1426719600
  },
  {
    "username": "t_s_sullivan",
    "rating": 3.0,
    "comment": "You either love it or you hate it. I hate it.",
    "timestamp": 1423177200
  },
  {
    "username": "JordanLewis1",
    "rating": 3.0,
    "comment": "- Extremely long\n- Slow pacing\n- Backstabbing\n- Runaway leader",
    "timestamp": 1421017200
  },
  {
    "username": "thorgn",
    "rating": 3.0,
    "comment": "Bad first experience. I was Italy against a combined Russia/Turkey front. Probably would be good with the right crowd, but I think this game has a great capacity to ruin a nice friendly game night.",
    "timestamp": 1419548400
  },
  {
    "username": "Eselbeus",
    "rating": 3.0,
    "comment": "Yikes! This isn't a game. This is diplomacy.",
    "timestamp": 1417647600
  },
  {
    "username": "heavydisking",
    "rating": 3.0,
    "comment": "5.5 => 3 I really just can't imagine ever playing this again. Fascinating artifact and game design though.",
    "timestamp": 1414882800
  },
  {
    "username": "NoNamium",
    "rating": 3.0,
    "comment": "This game is THE game of diplomacy (should be apparent by the name). The rules are simple and ensure that diplomacy is the only winning strategy. I like to play this game, but its hard to scrape 7 players together which how many you should really be before you can play",
    "timestamp": 1413928800
  },
  {
    "username": "Epsilon_Balls",
    "rating": 3.0,
    "comment": "\"Let's take a *very* basic abstract game, but add NEGOTIATION to it!\"\n\nI've played three times now, and it's an unsatisfying frustrating game to play. Nobody 'wins', everyone leaves pissed off at someone, and overly tired because of the 6 hour commitment. The table discussions go on too long, while people pretend that there is not some obvious move.\n\nThis is stupid peoples' chess, for six people.",
    "timestamp": 1413064800
  },
  {
    "username": "garysax",
    "rating": 3.0,
    "comment": "I think this game has been eclipsed by others that use its diplomacy, non-dice rolling mechanic. Even though I like the principles of the game in general you need too many players to play it and the game is so darned stressful that I don't find myself wanting to play often.\n\nI find that the game plays much better by e-mail and actually plays the best online with people you don't know--having plenty of time for negotiations (days) means that calculations are less chaotic and stabs are better planned and less emotional--the game takes on a little bit more logic.\n\nSomething like Game of Thrones completely fires Diplomacy for me.\n\nFinally, I don't know what else to say other than that there are some poor design problems like the common stalemate positions in the game. I suppose you could argue that all the players usually know about them so it's not a problem but I still think it is a problem. Add in the unbalanced starts which I am normally fully in support of. Some players in a vastly better position than others and game design has to come into question.",
    "timestamp": 1411250400
  },
  {
    "username": "steverenothom",
    "rating": 4.0,
    "comment": "Friendship killer.",
    "timestamp": 1755900000
  },
  {
    "username": "echelon",
    "rating": 4.0,
    "comment": "Definitely not my kind of game. A lot of people consider it a gem however",
    "timestamp": 1755122400
  },
  {
    "username": "fsnam",
    "rating": 4.0,
    "comment": "Unpleasant game",
    "timestamp": 1753999200
  },
  {
    "username": "SirGrenadealot",
    "rating": 4.0,
    "comment": "Played once, not my type of game at all. But I can see that there is a group of people who appreciates this.",
    "timestamp": 1752789600
  },
  {
    "username": "msfleck",
    "rating": 4.0,
    "comment": "BREAKDOWN OF SCORE:\n\nCleverness and game mechanics of the game: 9\nLength of game, combined with the horrible sickness-to-stomach feeling that I feel throughout EVERY moment of EVERY time i've played this: 1\n\nAverage: 5\n\nI'm just don't have the fortitude to endure this game, although the diceless and cooperative-while-simultaneously-backstabbing element of the game is very unique and clever. Also another complaint: the cooperative win condition of the game enabled me to win my first game (played during my junior year of high school, on the only day of classes i ever skipped) when I, playing as England, realized that between myself and Russia (whom I'd never interacted with or cooperated with for the whole game) could win the game simply by declaring an alliance, because between us we had enough regions to win. A very lackluster finish. (but of course, I couldn't avoid the opportunity to win it as soon as possible, given how sick I felt at backstabbing by best friend as Germany).\n\nA final note: I've seen so many people get so upset at people lying to them, that the bad feeling has persisted beyond the game. I know that lying/deception is a part of many games that I really enjoy (e.g. poker), but I guess the directness and the extent to which you must lie and betray an ally in this game for the ploy to be successful makes the consequences a little more severe. This is the one game I think would be much better to play with strangers than with friends. (although, on second thought, Poker too might often be better played with strangers)...\nFor this final issue, another point is deducted from that 5.",
    "timestamp": 1751839200
  },
  {
    "username": "Bal_505",
    "rating": 4.0,
    "comment": "played once online. Barebones rules, but the movement (which is essentially the only game action) is weirdly fiddly. The combination of player elimination and long playtime is fine for an online asynchronous game but I imagine intolerable in-person.",
    "timestamp": 1744840800
  },
  {
    "username": "arry1",
    "rating": 4.0,
    "comment": "Sadly, never got a chance to play it live, though I've been a big fan ever since I've heard of it. (Got two email games, though it's not as good.)",
    "timestamp": 1743202800
  },
  {
    "username": "bggmatje",
    "rating": 4.0,
    "comment": "[December 2017]\nExtremely long and annoying war game where you make alliances with other players to attack opponents, but you know you will betray and be betrayed from time to time. Players will team up against the player in the lead and so it is self-balancing and thus can take ages to play.",
    "timestamp": 1736290800
  },
  {
    "username": "SYGF",
    "rating": 4.0,
    "comment": "Ultimately, if I'm getting a bunch of people together for a game that's going to take many hours, we're going to play something more in-depth, like oath of fief.\n\nThis is the premier game for long-term online play because of the simultaneous turns.",
    "timestamp": 1726783200
  },
  {
    "username": "kyhre",
    "rating": 4.0,
    "comment": "Fascinating design that I played a few sessions of two decades ago. A real achievement pf game design. I can’t say I’d be keen to revisit it.",
    "timestamp": 1718402400
  },
  {
    "username": "rah100",
    "rating": 4.0,
    "comment": "Interesting idea but half the players realize early that they will slowly lose for the next 2 hours until they give up",
    "timestamp": 1699311600
  },
  {
    "username": "wmshub",
    "rating": 4.0,
    "comment": "Played once, long ago. From what I can tell you discuss and backstab people for hours on end. Maybe days, weeks, or months on end. Finally everybody gets tired of bashing the leader and just lets somebody win.\n\nWas not a fan.",
    "timestamp": 1689026400
  },
  {
    "username": "rynelf",
    "rating": 4.0,
    "comment": "--Jan2005-- Enjoy it a more when not playing with friends. Hmm...",
    "timestamp": 1680559200
  },
  {
    "username": "silvergoose",
    "rating": 4.0,
    "comment": "I will never, ever play this game again. I do not like the mechanism of convincing other people to do things that help you, and that is the entirety of the game. I think it's extremely well made, just not for me.",
    "timestamp": 1676242800
  },
  {
    "username": "Irondell",
    "rating": 4.0,
    "comment": "Up from 1. I've watched a few real-time gameplay vids from a very good YT channel and I can see what is interesting about the game. I still think you've got to be a bit of a psycho to be any good at it though. The real problem is finding 7 people who can spend the several hours it takes to play. I think in any case that Diplomacy is more suited to online play with anonymous strangers. Unfortunately that lends itself to the same problem you get when playing MMORPG like D2 i.e. Griefers: people who think that the point of the game is to ruin it for others. You just can't win *sigh*.",
    "timestamp": 1654725600
  },
  {
    "username": "Gaius",
    "rating": 4.0,
    "comment": "Do not play this game with friends or with loved ones. You have been warned.",
    "timestamp": 1651874400
  },
  {
    "username": "RedwoodCroft",
    "rating": 4.0,
    "comment": "An old classic, but group dependant and even then takes an age to play.",
    "timestamp": 1644447600
  },
  {
    "username": "RossBoss629",
    "rating": 4.0,
    "comment": "Fun game with dedicated crowd, very time-consuming and can be boring watching if you lose early. Niche game for the right time and place.",
    "timestamp": 1641078000
  },
  {
    "username": "Wiesl",
    "rating": 4.0,
    "comment": "Way too long for a boardgame, works well as browsergame/Mailgame though.",
    "timestamp": 1629324000
  },
  {
    "username": "Takhyon",
    "rating": 4.0,
    "comment": "Despite the low rating I actually think Diplomacy is a good, maybe even a great game. It's beautifully simple but has enormous depth, an extremely pure and savage negotiation game that's more about playing the people around the table than it is about any mechanics or rules in the actual game. I played it online several times with my friends asynchronously over a couple of weeks, which was super intense and almost life-consuming. A very memorable time and a great thing to have experienced - just not a one I'm that interested to try again, as the game is extremely brutal, takes an eternity to play, is very stressful, and it truly does have the potential to destroy friendships.",
    "timestamp": 1625263200
  },
  {
    "username": "Pandorzecza",
    "rating": 4.0,
    "comment": "Not for me",
    "timestamp": 1623448800
  },
  {
    "username": "CincinnatiKid",
    "rating": 4.0,
    "comment": "Dislike the backstabbing",
    "timestamp": 1606863600
  },
  {
    "username": "funtaps",
    "rating": 4.0,
    "comment": "Не смогли сыграть полную партию даже один раз.",
    "timestamp": 1581375600
  },
  {
    "username": "autumnweave",
    "rating": 4.0,
    "comment": "2019/12/26: Good game, but just not my style. I have a hard time with games where backstabbing is a key ingredient. Also the game does not last long enough for the backstabber to have to face the consequences of their actions.",
    "timestamp": 1577401200
  },
  {
    "username": "girlboydog",
    "rating": 4.0,
    "comment": "Christmas 2018\n\nWe played this with a group of friends virtually over a few weeks. It was easily one of the most stressful times of my life and I still don't totally trust some of those friends (Sam).",
    "timestamp": 1574290800
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "prolonged playtime \n\nAbsolutely Stabulous\n\nGoverning Dynamics\n\nHow to Win Games and Manipulate People",
    "timestamp": 1572303600
  },
  {
    "username": "jcarsoniii",
    "rating": 4.0,
    "comment": "Charlie's",
    "timestamp": 1564264800
  },
  {
    "username": "thebaysix",
    "rating": 4.0,
    "comment": "I feel like this game needs two different ratings. Diplomacy the concept is brilliant and a fascinating exercise in strategy, negotiation, and Machiavellian machinations. Diplomacy the actual game to enjoy with others is... well... let me put it this way: would you play the Iterated Prisoner's Dilemma with your buddies?\n\nLove, love, love the theme! World leaders negotiating World War I, so cool! At least I think it is. Mechanics are complex but also great once you get the hang of them. There are many rules for movement, and since it is simultaneous you can wind up with weird corner cases. That doesn't bother me though. In fact, it is actually a plus since it adds to the tactics of the game and makes you feel like a scheming war-strategist managing to pull of an unlikely maneuver.\n\nUnfortunately it is way too backstabby to play with friends, which kind of ruins it for me. It's also player elimination, which sucks. The saving grace is that it is playable online if you don't mind making enemies over the internet - even that has downsides though as most online games take weeks, if not months.",
    "timestamp": 1539986400
  },
  {
    "username": "tbar4848",
    "rating": 4.0,
    "comment": "Hard to get to the table, and ultimately we'd rather play Game of Thrones.",
    "timestamp": 1539208800
  },
  {
    "username": "Shades911",
    "rating": 4.0,
    "comment": "Long and suspenseful, and there are other games that do it better. But, it's not awful.",
    "timestamp": 1535925600
  },
  {
    "username": "Duereloi",
    "rating": 4.0,
    "comment": "A game that really depend too much on the kind of people you are playing with",
    "timestamp": 1528408800
  },
  {
    "username": "barry_015",
    "rating": 4.0,
    "comment": "Gave away in shrinkwrap",
    "timestamp": 1525644000
  },
  {
    "username": "Joshua_Sams",
    "rating": 4.0,
    "comment": "Have friends? Don't play this game if you want to keep them. Also overly long and boring.",
    "timestamp": 1524088800
  },
  {
    "username": "Shampoo4you",
    "rating": 4.0,
    "comment": "Too long for what it is.",
    "timestamp": 1523916000
  },
  {
    "username": "RingelTree",
    "rating": 4.0,
    "comment": "I usually like player interaction, but this is just too much for me. I get stuck in a \"what-if\" rabbit hole.",
    "timestamp": 1522533600
  },
  {
    "username": "Majestic One",
    "rating": 4.0,
    "comment": "This is a difficult game to like. You really need the right group of people to play. Its heavy and not very forgiving. I enjoy this game but I have a hard time getting others to play or even learn. If there is a lighter version that gives the same difficult choices and careful strategy, let me know.",
    "timestamp": 1519167600
  },
  {
    "username": "Unclefeg",
    "rating": 4.0,
    "comment": "A game in which two or three big fish come to terms to split the pond and everyone else gets screwed over. So true to life that it absolutely fails to be fun in any fashion. And I say this after 26 years as a professional diplomat.",
    "timestamp": 1516748400
  },
  {
    "username": "darkkirby111",
    "rating": 4.0,
    "comment": "Only played once, very long game and small mistakes can cost you big time way down the line.",
    "timestamp": 1512428400
  },
  {
    "username": "Isgrimnur5",
    "rating": 4.0,
    "comment": "Nice game that I played a lot. It shows its age and it is way too long, needing the full complement of 7 players. I will keep in my collection, but will play it only with one group of friends occasionally only because I can't convince them to play newer games.",
    "timestamp": 1511046000
  },
  {
    "username": "BoozySquid",
    "rating": 4.0,
    "comment": "Do you have 8 hours? You will need it... unless you're knocked out in the second year. Then you're done in 45 minutes.",
    "timestamp": 1507240800
  },
  {
    "username": "amitche1",
    "rating": 4.0,
    "comment": "There's no reason to play this game in the 21st century. The mechanic has been improved upon by Game of Thrones and others. I guess if you absolutely hate the theme of other games this would be an option.",
    "timestamp": 1504476000
  },
  {
    "username": "ekaun",
    "rating": 4.0,
    "comment": "A strange game - more of a dysfunctional party game for sociopaths than anything else. This is one game that the absence of luck hurts, rather than helps.",
    "timestamp": 1495836000
  },
  {
    "username": "maumastoks",
    "rating": 4.0,
    "comment": "A highly imbalanced game in regards to player count. The game itself is long (actually recommended to play it online) but no matter what you do, there inevitably will be one or several players that will get kicked out of the game early on. So gameplay would be: 7 people meeting to play this game for whole day but in 1 hour 1-3 players get eliminated and have nothing else to do - maybe play some other game or just go home. Your game is over. If you want a modern version of this game with far more balance in regards of this player loss issue, then play Game of Thrones - it is obviously based on diplomacy but greatly modified to cover all the issues, amount of diplomacy itself slightly reduced (but still necessary) and game time itself shortened 1.5-2 times. This is a very old game and it probably was very good back in the days. Not recommended.",
    "timestamp": 1492120800
  },
  {
    "username": "Ldayjones",
    "rating": 4.0,
    "comment": "This game is long and this version is not my favourite, but love the game generally.",
    "timestamp": 1491084000
  },
  {
    "username": "farsidehobbes",
    "rating": 4.0,
    "comment": "Diplomacy is not for me. I'm not good at negotiation games, and a few of the factions could only win if the planets aligned.",
    "timestamp": 1485126000
  },
  {
    "username": "barry_015",
    "rating": 4.0,
    "comment": "gave to a friend...Still in shrinkwrap",
    "timestamp": 1485039600
  },
  {
    "username": "dadd0",
    "rating": 4.0,
    "comment": "There is a lot of obsession around this game. It's a great deal of fun and one of the first board games I remember playing outside Monopoly and all of it's various spin offs. However it's best played with complete strangers online. Finding 6 other friends who don't already have their meta strategies and preferences in alliances isn't realistic.",
    "timestamp": 1484694000
  },
  {
    "username": "thatach",
    "rating": 4.0,
    "comment": "Not my type of game too long etc.",
    "timestamp": 1482879600
  },
  {
    "username": "rogeracox",
    "rating": 4.0,
    "comment": "Without a doubt the most overrated game I have ever played. Could be I just had some bad experiences at a convention devoted solely to Diplomacy. Or maybe it's those Dippers who insist you can't play a \"tournament level\" game with 6 at a table (you can, but it requires something most don't possess: ingenuity).",
    "timestamp": 1482447600
  },
  {
    "username": "AWildEep",
    "rating": 4.0,
    "comment": "Got a free weekend? Maybe you can borrough my copy, I most likely won't have to time to play.",
    "timestamp": 1481324400
  },
  {
    "username": "Lego Pirate",
    "rating": 4.0,
    "comment": "Can be good with the right players but it is just too long",
    "timestamp": 1480719600
  },
  {
    "username": "teg2",
    "rating": 4.0,
    "comment": "Not played\nFor Trade",
    "timestamp": 1476914400
  },
  {
    "username": "poguelife",
    "rating": 4.0,
    "comment": "Not my cup of tea. Way too long with way too much downtime.",
    "timestamp": 1475877600
  },
  {
    "username": "Galghamon",
    "rating": 4.0,
    "comment": "I have never played this. I am not sure I ever will. A game that takes this long and has player elimination as one of its mechanics is a bit broken in my opinion.",
    "timestamp": 1475445600
  },
  {
    "username": "TomVasel",
    "rating": 4.0,
    "comment": "It's a sport rather than a game, and it's really not that much fun. When you leave a game session wiped out, angry at others, and generally downright tired from the game experience - how can that be fun? I give it a \"3\" instead of a \"2\" because it is an excellent teaching tool. A tool, not a game.",
    "timestamp": 1469224800
  },
  {
    "username": "dara108",
    "rating": 4.0,
    "comment": "The great grandparent of many games I like today.\nOffers depth never seen prior to it's existence, which at this point is very limited.\nSimple gameplay, tedious ordering routine.\nAn all day kind of game, if playing online, it's hard to keep people interested once their orders don't work a couple of times.",
    "timestamp": 1462485600
  },
  {
    "username": "sunshiny",
    "rating": 4.0,
    "comment": "Sealed",
    "timestamp": 1461708000
  },
  {
    "username": "mafman6",
    "rating": 3.5,
    "comment": "This game has a lot of my respect but I avoid playing it. The mechanic of lying at the right times just is not my style.\nBut considering this is basically how survivor works I can see how its liked by many.\n\nI think the only way to have a good experience playing is to play over time something like a turn a week",
    "timestamp": 1460930400
  },
  {
    "username": "Abiezer Coppe",
    "rating": 4.0,
    "comment": "Heresy I know, but I've never enjoyed Diplomacy as much as I feel I should. Other games scratch the backstabbing itch far better.",
    "timestamp": 1457478000
  },
  {
    "username": "rgdebarros",
    "rating": 4.0,
    "comment": "It emulates World War I in a luckless game of simultaneous movement through written (secret) orders to armies and fleets. Has good strategic depth, but victory cannot be achieved without skills on diplomacy and deceit. The game also needs seven players to work well and, therefore, its sessions can take a lot of time. A classic that will appeal only to gamers that can handle well the mandatory \"backstab-to-win\", player elimination and, above all else, the exhaustive amount of time that it takes to be played.",
    "timestamp": 1455318000
  },
  {
    "username": "Galatolol",
    "rating": 5.0,
    "comment": "I like the beginning and the moment of \"first contact\", reminds me of Tresham's Civilization. The first times when you decide whom to attack, whom to support, are superb, but then inevitably some players fell off and from that point it's much less fun to me and the more we play the more tedious it gets.\n\nThe objective of half + 1 supply centers is way too high IMO.",
    "timestamp": 1759615200
  },
  {
    "username": "shannyn_north",
    "rating": 5.0,
    "comment": "Sean N. 4.5\nA giant in its own right, perhaps. But that doesn't excuse the tedium or the poor board design (especially in context to starting locations). A Game of Thrones: the Board Game did everything Diplomacy was good at without the bother.",
    "timestamp": 1754172000
  },
  {
    "username": "TheKilljoy",
    "rating": 5.0,
    "comment": "I don't like it. In all fairness it might not be for me, but it shows its age in the absence of more modern implementations.",
    "timestamp": 1738537200
  },
  {
    "username": "stude",
    "rating": 5.0,
    "comment": "Could be fun with a big group which I don't usually have. Especially not one that would have time to learn and play for hours... moves are easy to do, sorting out the results not.",
    "timestamp": 1738364400
  },
  {
    "username": "BoardGamingCouple",
    "rating": 5.0,
    "comment": "5/5\n\nClassic game with no luck that thrives on strategy and negotiation. it can take a bit long with certain groups, but just set a 5min time limit for negotiation & a 5min time limit for writing orders. Games usually take 4hours. 50+ plays.\n\nHouse rules: Italy starts with a Fleet in Rome instead of an Army.\nPlay with shared victory. 1 player with the most stars, 1 player with the second most stars = shorter playtime.",
    "timestamp": 1738018800
  },
  {
    "username": "Zapata",
    "rating": 5.0,
    "comment": "Last time I played it was 25 years ago. Wouldn't play it anymore. But a great concept, for sure.",
    "timestamp": 1733785200
  },
  {
    "username": "Hehaho15",
    "rating": 5.0,
    "comment": "Better than risk, but takes 3 times as long (and that's an assumption, as I've never completed a game of it)",
    "timestamp": 1728597600
  },
  {
    "username": "eheitzman",
    "rating": 5.0,
    "comment": "Arguably the best territory-acquisition game of all time. I love it to death, but it suffers from some major limitations: (1) takes forever to play (2) plays best with 6 or 7 players (3) it's an elimination game, so you can get knocked out early and be uninvolved for the rest of the party. It's probably best played in an office or online in a \"one turn per week\" format. If you liked this, check out Game of Thrones.",
    "timestamp": 1722636000
  },
  {
    "username": "Eisenkreuz",
    "rating": 5.0,
    "comment": "Probably been replaced by GoT the boardgame now.",
    "timestamp": 1714773600
  },
  {
    "username": "fjordi",
    "rating": 5.0,
    "comment": "Interesting mechanics but the combat system is too simple and the game has some things I don't fully understand. Elimination of players is a down.",
    "timestamp": 1701817200
  },
  {
    "username": "WatchmanX2000",
    "rating": 5.0,
    "comment": "Both a good and a bad game. It involves a lot of manipulation of your opponents, so if you're doing it with friends you better be used to double dealing each other in games. But it is a great teacher of the negotiation skills necessary to advance your position. Not being good at this title is not a bad thing, but more an indication you dislike manipulating others (or being manipulated).",
    "timestamp": 1690322400
  },
  {
    "username": "guestid1250",
    "rating": 5.0,
    "comment": "Have only played once. Just really didn't get into it. Classic game, I know, but not really for me. Seems like there are so many better-designed games that came later. This one probably inspired some of them.",
    "timestamp": 1678489200
  },
  {
    "username": "davegw78",
    "rating": 5.0,
    "comment": "Rule book says 1971 edition. Appears complete but need to inventory wooden pieces.",
    "timestamp": 1670194800
  },
  {
    "username": "The_Android",
    "rating": 5.0,
    "comment": "Actually, I own the 1914 brazilian bootleg version. The rules included are inaccurate; I had to download the original Diplomacy rules to make sense of this game.",
    "timestamp": 1668466800
  },
  {
    "username": "CmdrOverbite",
    "rating": 5.0,
    "comment": "On reflection, I admire the hell out of this game but if I'm spending 8 hours gaming with people I can think of a number of other ways to spend that time. I don't hate it by any stretch, but a) I'm a bad liar b) it's ridiculously difficult to get seven people together for a day-long game c) player elimination is a mechanic that has (I think rightly) been deprecated since this one was invented.",
    "timestamp": 1667775600
  },
  {
    "username": "Nicolas Weiss",
    "rating": 5.0,
    "comment": "I've clinged to my Asmodée edition of Diplomacy from the longest of time, as its austere map, paper notes, wooden discs and metallic sculpts gave off the aura of a gentleman's strategy game. But the requirements to get the full experience are so steep that I don't know I'll ever play it again: 7 players, 7+ hours. And these players must have an understanding of the 20+ subrules of the resolution phase of simultaneous movement in order to plan accordingly. And these players must be willing to roam the rooms of a flat, holding a whole bunch of private conversations/negotiations for often 15 minutes before deciding on their moves for the turn. And these players must be understanding of and in agreement with the idea that they might get eliminated early on while the remainder of the game goes on for hours; and that the reason for it is that everything they've spent hours of energy and emotion building has been casually swiped away by the betrayal of a promise from someone they otherwise hold dear. Assembling such a crowd is a tough ask.\n\nI could entertain myself in the illusion that one day, when the stars align, I'll dust off my old box and it will have been so worth it. But my discovery of the online digital world of Diplomacy has made me realise that we're really talking about a game that was made for asynchronous play-by-mail and which, played properly, results in an awful amount of stalemate joint ties; which I'm not that interested in.",
    "timestamp": 1665439200
  },
  {
    "username": "myalya",
    "rating": 5.0,
    "comment": "The negotiation aspect of the game is very interesting, unfortunately we never finish the games before some players inevitability lose interest. It's also very difficult to find 7 players.\n\nThis isn't my type of game, but my husband loves this and I think we'll hold onto it forever for the hope of maybe someday playing a full game",
    "timestamp": 1665352800
  },
  {
    "username": "Donniedarko01",
    "rating": 4.5,
    "comment": "Still a good game for people who want to lose their friends. Two main issues: Duration and pseudo player elimination.",
    "timestamp": 1664143200
  },
  {
    "username": "baseplate23",
    "rating": 5.0,
    "comment": "Only played once and it took two game days to finish the damned thing. Was a lot of fun the folks I played with, since we all got into a character of sorts for each nation, but I know that this won't do it for a lot of folks. Movement was the trickiest thing, but it did make for a tense moment to see if your politicking and backstabbing payed off or not. This was usually tempered, however, by frequently checking the rules to see if our moves were valid.",
    "timestamp": 1661810400
  },
  {
    "username": "glennhoek",
    "rating": 5.0,
    "comment": "Another classic, and a lot of fun. There are, however, better games that are just as much fun, are playable with fewer players, take a fraction of the time to play, and don't have player elimination.",
    "timestamp": 1655762400
  },
  {
    "username": "ol_sloppy",
    "rating": 5.0,
    "comment": "Avalon Hill 50th Anniversary Edition",
    "timestamp": 1649109600
  },
  {
    "username": "DoxChristian",
    "rating": 5.0,
    "comment": "Very much enjoy playing with seven people, but happened too rarely to keep. Game is not really worth playing with less than 7 IMHO. With 7, game is a 10 with less than 10, about a 2.",
    "timestamp": 1647039600
  },
  {
    "username": "herrkaiser",
    "rating": 5.0,
    "comment": "The game is good. It just takes too frickin long.\nSpending hours on potentially pointless discussions and ultimately being eliminated on a fellow player's 50-50 decision... maybe I got too old for that.\nI love the system, but for strategy I rather play games like Ikusa, and for negotiation it'll be New Angeles.",
    "timestamp": 1644102000
  },
  {
    "username": "Leviat",
    "rating": 5.0,
    "comment": "A beautiful game that I never want to play again.",
    "timestamp": 1642201200
  },
  {
    "username": "Ghost_Palm_Technique",
    "rating": 5.0,
    "comment": "I would rate gunboat diplomacy a 7. Diplomacy with actual talking/social manipulation is terrible.",
    "timestamp": 1641596400
  },
  {
    "username": "lindre3000",
    "rating": 5.0,
    "comment": "Fun, but there are better games that can be played in much less time",
    "timestamp": 1635285600
  },
  {
    "username": "AndysBloodbath",
    "rating": 5.0,
    "comment": "Chess mixed with Risk that has all the dice thrown away. Such a great game if you have a weekend to spare and don't really need to sleep.\n\nWrite down you orders, watch the others write down theirs, hoping that your diplomatic agreeements remain intact then reveal... The inevitable back stab that leaves your nation in tatters and you spend the next 13 hours as a vassal nation until you can eventually stab him back.\n\nAn awesome game that takes so long that it can't often hit the table and many refuse to play due to the emotional involvment, I now play an online version with strangers, this method works really well as you can't can't see who is chatting to who.",
    "timestamp": 1630274400
  },
  {
    "username": "Filcha",
    "rating": 5.0,
    "comment": "Glen has my copy",
    "timestamp": 1626040800
  },
  {
    "username": "Micastiz",
    "rating": 5.0,
    "comment": "Hard to rate this game. Fascinating game interaction that depends almost entirely on negotiation. I have a soft spot for it as we played it frequently when I was in high school many years ago. The problem with it, and why I am rating it low, is that you really must lie in the most convincing devious way possible. It can become personal as players swear their allegiance only to blindside another player. After the fun wears off after several plays, we found you start risking friendships if you really want to win. Of course, you don't have to go that deep into a game, but we were a bunch of super competitive gamers who all wanted to win.",
    "timestamp": 1623103200
  },
  {
    "username": "kreznykov",
    "rating": 5.0,
    "comment": "played once.",
    "timestamp": 1622844000
  },
  {
    "username": "spencyrrh",
    "rating": 5.0,
    "comment": "Look, I love this (especially the non-binding, closed negotiation), but not eight hours of it, and not with player elimination.",
    "timestamp": 1621288800
  },
  {
    "username": "Biobuster1",
    "rating": 5.0,
    "comment": "Great Game, but it takes a LONG time to play. always love the experience but I do wish it were shorter",
    "timestamp": 1615158000
  },
  {
    "username": "djberg96",
    "rating": 5.0,
    "comment": "Classic game. Simple, elegant diceless movement and combat system. The problem is getting 7 players together.\n\nI ultimately traded my copy because I so rarely play it any more, at least in person. This game has been relegated to PBEM/Computer versions for me.\n\nUpdate: I've updated my rating to reflect my current feelings on the game. Really, this was a 10 in high school, and it's great with a group of friends you can trash talk with as you play into the wee hours of the morning. But as I reflect back I think it was always more about the social dynamic and, like so many multiplayer wargames, the game was just a facilitator while its mechanics were somewhat irrelevant.\n\nI've tried playing this in a more \"neutral\" setting where I know few, if any, of the players in the game. While still somewhat interesting tactically and strategically, I found the game loses a lot of its charm in such settings, as I try to negotiate with people I don't even know (or possibly even like), and in the end I don't care as much whether I succeed or fail. It's kind of like watching a mediocre movie sequel - you like the characters and the theme, but overall the movie is just meh. Plus, the thing just takes too damned long.\n\nThese days I would always pick a game like Imperial over this, which is a lot shorter, and has the added dimension of a majority shareholder that can take your military powerhouse away from you, or Here I Stand if I want a game that still involves some private negotiation, but isn't centered on it.\n\nAnyway, thanks for the memories.",
    "timestamp": 1612479600
  },
  {
    "username": "ccmonter",
    "rating": 5.0,
    "comment": "I used to play weekly in high school, but we never finished a game. Backstabbing fun. Backstabbing EVIL. Not for the thin skinned.",
    "timestamp": 1610492400
  },
  {
    "username": "Samuraiman",
    "rating": 5.0,
    "comment": "Only every played online over a long period of time. Rating could be changed if an in person playing ever occurred, but I suspect it will be too drawn out.",
    "timestamp": 1609282800
  },
  {
    "username": "morteigan",
    "rating": 5.0,
    "comment": "This game is a friendship breaker, a couple destroyer and a pretty good diplomacy game. The problèm is that the only way to finish the game is to backstab your friend in the worst way possible. Nice game, but be prepared to never trust your best friends again.",
    "timestamp": 1608332400
  },
  {
    "username": "sabbath_12",
    "rating": 5.0,
    "comment": "LONGGGGGG",
    "timestamp": 1598911200
  },
  {
    "username": "Meadbeard",
    "rating": 4.9,
    "comment": "Good for its time: now far too long, dry, tiresome, and stale. It's a classic: a hardcore game of the past. There are too many twenty-first-century competitors to make Diplomacy worthwhile today. If you have this many people and this much time, you're playing Game of Thrones or Twilight Imperium.\n\nLack of enough limiting factors in the end-conditions is a serious drawback.",
    "timestamp": 1596492000
  },
  {
    "username": "sykano",
    "rating": 5.0,
    "comment": "old negotiation game classic\na bit overrated\nneeds 7 engaged players (!)\ntakes way too long (6+ hours) for what it is (!)\n\ndated game\nodd mechanics (only 1 army per region)\n\nI'm not a big fan of the WW1 theme/context. Why are there no other maps included? Could use some maps that are not based on real history.\n\nEverybody has to play as aggressive salesman and do backstabbing.\n\nreplayability limited (at least with same players), standard moves for each nation ...",
    "timestamp": 1595196000
  },
  {
    "username": "ChameleonBG",
    "rating": 5.0,
    "comment": "way too long. GoT better version.",
    "timestamp": 1591567200
  },
  {
    "username": "Khexhu",
    "rating": 5.0,
    "comment": "The 1982 Avalon Hill Edition was pretty ugly all around to me. I actually don't recall if I ever played my copy as a kid.\nI did play a bunch with the newer version with miniatures that came out and probably 50 times on the Paradox PC Game version decades back.\n\nThis may well be the only game from the 1950's that I would still play today. But I don't need to own it any longer.",
    "timestamp": 1587679200
  },
  {
    "username": "pozz70",
    "rating": 5.0,
    "comment": "Good condition.",
    "timestamp": 1584486000
  },
  {
    "username": "KlaztheBoardgamer",
    "rating": 5.0,
    "comment": "Only good if you have 6 or 7 players, but with the right friends it makes this game awesome.\n\nIn my group we only have 15min planning instead of 30 (makes more round and quicker gameplay)",
    "timestamp": 1578006000
  },
  {
    "username": "sushidog",
    "rating": 5.0,
    "comment": "I like it in theory. I have not enjoyed playing it. Maybe I'm not that into multi player games where you have to rely on alliances and backstabbing.",
    "timestamp": 1572390000
  },
  {
    "username": "sunszu",
    "rating": 5.0,
    "comment": "got it cheap. Cant stand the lack of random effects or combat resoults...trust me he says.. my fanny I will",
    "timestamp": 1568325600
  },
  {
    "username": "kingmerrygold",
    "rating": 5.0,
    "comment": "Can be fun with the right people, but I guess it just makes me wish I were playing a LARP instead.",
    "timestamp": 1559167200
  },
  {
    "username": "Slobodon Ginfizz",
    "rating": 5.0,
    "comment": "An elegant, enduring game design that I just don't find to be all that much fun.",
    "timestamp": 1552690800
  },
  {
    "username": "Texagony",
    "rating": 5.0,
    "comment": "Used",
    "timestamp": 1550358000
  },
  {
    "username": "Coehawk",
    "rating": 5.0,
    "comment": "Haven’t played yet",
    "timestamp": 1545606000
  },
  {
    "username": "MananTheMoon",
    "rating": 5.0,
    "comment": "{O: Greg}",
    "timestamp": 1541372400
  },
  {
    "username": "stephen_the_geek",
    "rating": 4.5,
    "comment": "No luck but I really don't like the mechanics of this game. So much effort is required to plan everything properly with the other players that it really isn't worth playing.\n\nAnd to win you basically have to backstab everyone else in the game at just the right time. Imbalanced starting locations add to the frustrations.",
    "timestamp": 1528840800
  },
  {
    "username": "yauyyb",
    "rating": 5.0,
    "comment": "superceded completely by Rex: final days of an empire",
    "timestamp": 1518303600
  },
  {
    "username": "christiannaesseth",
    "rating": 5.0,
    "comment": "Played it a couple of times, not my kind of game.",
    "timestamp": 1514415600
  },
  {
    "username": "jcarvin",
    "rating": 5.1,
    "comment": "For what it's worth, these style of games are just not for me. I can certainly see why people either love or hate it.",
    "timestamp": 1512946800
  },
  {
    "username": "MegaWestWolf",
    "rating": 5.0,
    "comment": "Wanted this game, but there are so many other games like this now...and a lot of them do it better.",
    "timestamp": 1512514800
  },
  {
    "username": "yangtze2000",
    "rating": 5.0,
    "comment": "If you're a good player, and the other players know it, you're toast. Or at least you should be. Between a set of equally good players, the toasting is arbitrary and there's nothing you can do about it. How is that a game? Interminably long.",
    "timestamp": 1510614000
  },
  {
    "username": "Dynastico",
    "rating": 5.0,
    "comment": "It's good if you like the drawn-out intrigue. Otherwise you're probably better off playing a different military game.",
    "timestamp": 1510527600
  },
  {
    "username": "kimrich",
    "rating": 5.0,
    "comment": "Eventually played this one Christmas after watching a very funny youtube video of someone explaining the rules. I think we managed about 3 moves in about 4 hours!",
    "timestamp": 1509228000
  },
  {
    "username": "The White Wizzard",
    "rating": 5.0,
    "comment": "I mean... it's a great concept, but how many times have you come out of a day long game of diplomacy feeling good? In my opinion, never! It's a great idea. Great design. There are moments of excitement, but my god is it stressful, emotionally wrenching, and aggravating. Even when I win I feel like &%*$.",
    "timestamp": 1504562400
  },
  {
    "username": "grantsg",
    "rating": 5.0,
    "comment": "7 Player",
    "timestamp": 1504130400
  },
  {
    "username": "shortwave",
    "rating": 4.5,
    "comment": "Classic negotiation war game",
    "timestamp": 1501797600
  },
  {
    "username": "Buddy2337",
    "rating": 5.0,
    "comment": "While a classic game, requires too many people to play in my opinion. If you can get 7 people, this game would be fantastic but I've had problems getting that many. Only low score since hard to get so many friends to play",
    "timestamp": 1498687200
  },
  {
    "username": "BossGameworks",
    "rating": 5.0,
    "comment": "I like the idea of a 'war game' without no dice whatsoever. However, this game is basically 90% lying to your friends. Like bold-faced, \"I swear to god I'm not lying\" type of lying. And it goes on for hours. I can see how feuds are started over this game.\nBest played with strangers. Under no circumstances should you play with your spouse!",
    "timestamp": 1496613600
  },
  {
    "username": "aro246",
    "rating": 5.0,
    "comment": "A little too much diplomacy required. Just doesn't work in my group.",
    "timestamp": 1495922400
  },
  {
    "username": "batmatt72",
    "rating": 5.0,
    "comment": "I like my friends\nI want to stay friends\ntherefore I don't play with them\nI only play with family, they have to love me",
    "timestamp": 1490911200
  },
  {
    "username": "Csigs",
    "rating": 5.0,
    "comment": "Abrasive tedium with the wrong people.",
    "timestamp": 1489359600
  },
  {
    "username": "peteyandycreek",
    "rating": 5.0,
    "comment": "2 Plays - Great concept, but a bit outdated now.",
    "timestamp": 1487977200
  },
  {
    "username": "RHelms",
    "rating": 5.0,
    "comment": "Very surprised by this! I love the backstabbing :-)\n\nEDIT: A few plays later I'm kind of ambivalent on this one. A few times now, the game has run on for +10 hours WITHOUT having a winner. I love the concept of the game... the execution not so much.",
    "timestamp": 1486508400
  },
  {
    "username": "il_mago",
    "rating": 5.0,
    "comment": "Risiko al contrario, dove contano le alleanze invece delle guerre. Interminabile.",
    "timestamp": 1480114800
  },
  {
    "username": "SeanC",
    "rating": 5.0,
    "comment": "A game the rating for which depends entirely on who you play with. For me, it could be a '1' or a '7'. I gave it a '5' per my typical experience.",
    "timestamp": 1479769200
  },
  {
    "username": "Tanakor",
    "rating": 5.0,
    "comment": "An interestig game. Only played it three or four times many years ago. One thing I don´t understand are the claims, that you shouldn´t play this with your friends. Even if you are a sore loser (I can be!): Why sould you hold a grudge over a game??? I mean, if you can´t take a backstabbing in Diplomacy why should you take an attack in any other game less personal?",
    "timestamp": 1477605600
  },
  {
    "username": "boufalaxx",
    "rating": 5.0,
    "comment": "I just started a game of this online with the guys at work. It's VERY Fun.\n\nBut... It ages you fast. Not a heap of longevity there.",
    "timestamp": 1477519200
  },
  {
    "username": "DoctorDuckButter",
    "rating": 5.0,
    "comment": "Love the game, would give it a higher rating, but I cannot get anyone to play it. They say it takes too long. I hear it is an excellent computer based game though.",
    "timestamp": 1476309600
  },
  {
    "username": "sakoguru",
    "rating": 5.0,
    "comment": "Back stab all your friends, cause that makes them like you more.",
    "timestamp": 1473372000
  },
  {
    "username": "chuft",
    "rating": 5.0,
    "comment": "Everyone should try it for the experience, especially non-gamers. Not everyone will want to keep playing it, and that's OK. I would never play it again under any circumstances I can really think of.\n\nKnew one guy who loved to play it two-player. Guess he never was exposed to any other games, or thought of it as one of the three games in the world, along with chess and checkers.",
    "timestamp": 1470952800
  },
  {
    "username": "Dice Driven Gamer",
    "rating": 5.0,
    "comment": "I have enjoyed Diplomacy in the past, especially online (one move per couple of days) but I don't think it's a good game. It's extremely long, it has player elimination and it does not scale well. And imagine nobody wants to negotiate with you, everyone is making plans for half and hour and you stay there waiting.",
    "timestamp": 1469052000
  },
  {
    "username": "MagisterLudo",
    "rating": 5.0,
    "comment": "Played this version at school in the late 70's. Not sure we ever got the rules totally correct.",
    "timestamp": 1463349600
  },
  {
    "username": "Shadowski",
    "rating": 5.0,
    "comment": "This was a very fun playthrough with a full 7 player match. Italy got screwed, as is normal from what I understand, but my France held its own, keeping Austria, Germany AND maybe Turkey.... at bay.\n\nIt was a great time of diplomacy, broken promises, alliances that held to the very end, and bitter defeat for some (Italy had a single territory left when we called the match at the 10th turn due to time)\n\nA true classic!",
    "timestamp": 1458687600
  },
  {
    "username": "Ephastion",
    "rating": 5.0,
    "comment": "Keeping this around so someday the children will have yet another reason to fight.",
    "timestamp": 1457823600
  },
  {
    "username": "Airstone",
    "rating": 5.0,
    "comment": "Interesting but yea people can get really invested and then not want to talk to each other afterwards.",
    "timestamp": 1456786800
  },
  {
    "username": "slaadibardfast",
    "rating": 4.5,
    "comment": "Can be entertaining with right group of players. Victory condition makes game perpetual with competent players who just won't let someone win.",
    "timestamp": 1456268400
  },
  {
    "username": "way2slo",
    "rating": 5.0,
    "comment": "Got stabbed twice in my first game. The wounds may never fully heal.",
    "timestamp": 1454108400
  },
  {
    "username": "Npapa",
    "rating": 5.0,
    "comment": "Not a game for everyone. I can handle the backstabbing but the play time is a killer (6+ hours). I would like to find a similar game that plays in about a third of the time or less.",
    "timestamp": 1452207600
  },
  {
    "username": "Bonham R",
    "rating": 5.0,
    "comment": "This is a great, classic game. So why the average rating? Two main reasons...\n\nFirstly, this game suffers immensely from Analysis Paralysis... i.e. players that take F-O-R-E-V-E-R on their turns. This is the reason I will not play this game.\n\nSecondly, too many people get angry over the eventual, and pretty much required, betrayal they will face by the end of the game. Alliances (i.e. Diplomacy) are often what help you win the game... but if you want to win the game as a single player, that means you WILL betray. This isn't a problem for my group, but it is for many.",
    "timestamp": 1450652400
  },
  {
    "username": "Tricky_Warlord",
    "rating": 5.0,
    "comment": "A game that inspires fear and loathing. In some ways it is a 10, but because I am trying to reach out and build actual lasting friendships in this hobby, it's more like a 2. A rating of 5 is a compromise.",
    "timestamp": 1450220400
  },
  {
    "username": "swiftlex",
    "rating": 5.0,
    "comment": "I cannot remember the last time I played this and I would need persuading even if someone bothered to suggest it.",
    "timestamp": 1434232800
  },
  {
    "username": "janrogalo",
    "rating": 5.0,
    "comment": "Not my piece of cake. Probably played it with a wrong group in a wrong place...",
    "timestamp": 1430690400
  },
  {
    "username": "wjones",
    "rating": 5.0,
    "comment": "I really think this is a masterpiece but I don't think I will ever play it again that is why I don't give this a perfect 10. People just get too mad at each other. I am able to put my emotions to the side when I play this but no one else can. People just get too mad so I will not play this again. *correction - I am pretty good at putting my emotions to the side, but being repeatedly betrayed by all players does test that as I recently found out.\n\nPlayed again recently, and I am downgrading this game to an 8 (from 9.5) (may drop lower if I think about this more). Elegant design. Just no fun for most the players involved. Try getting backstabbed, then backstabbed, then backstabbed, then backstabbed.\n\nThat first turn is one of the best experiences in games, in general. But the next 7 turns are not fun if you didn't make any inroads.\n\nOnly a couple of the countries are any fun to play.\n\nThis is probably the first time I have dropped a rating after losing (I don't know if I have ever really dropped a rating). Normally that doesn't bother me - losing that is. But losing in this game is not fun; especially since hope seems to be there each turn. So you are brought up and then taken down, then up, then down. That last game I played was wicked. And I have completely lost my love for this game. I won't play this again. All I know is I played my last game honourably.\n\nNow I am just plain exhausted. All my previous feelings are gone, and I just am plan done with the game. Can 100% say I am done with the game. this game takes too long (played it online over several days) - don't want to play a board game for a long time now. (game is now a 5) Elegant design does not equal fun anymore.",
    "timestamp": 1428962400
  },
  {
    "username": "paulrrahn",
    "rating": 5.0,
    "comment": "Often generates hurt feelings among the players, given the potential for backstabbing. I am uncomfortable with being deceptive and manipulative, which diminishes my enjoyment of the game. Games can be quite lengthy, and are often not played to completion.",
    "timestamp": 1427583600
  },
  {
    "username": "Poetic_Justice",
    "rating": 5.0,
    "comment": "Soooo long. My group has never been able to complete a game of diplomacy.",
    "timestamp": 1425942000
  },
  {
    "username": "BCush",
    "rating": 4.5,
    "comment": "This is a great game if you want to lose friends.",
    "timestamp": 1422658800
  },
  {
    "username": "stefanmiker",
    "rating": 5.0,
    "comment": "The classic & epic AH's all time classic game about WW1 era....Diplomacy vs War vs Conquer!!!!!Many players,many ours!!!",
    "timestamp": 1421794800
  },
  {
    "username": "Chops",
    "rating": 5.0,
    "comment": "At least 4 copies, three AH, condition good to unplayed (1 blocks, 1 stars & anchors), the other in a large flat red box, condition fair.",
    "timestamp": 1416006000
  },
  {
    "username": "Magritte",
    "rating": 5.0,
    "comment": "Interesting negotiation game but it just takes to long to finish. And the gameplay is actually quite simple, so that makes negotiation rounds quite repetitive and shallow. Off course this is very dependent on who your opponents are and how strategic they (and you) can think.\n\nCan anyone build a lighter version of this, that plays in 2 hours, please?\n\nMinus: 1 - 3 - 5 - 9 - [-1]",
    "timestamp": 1412719200
  },
  {
    "username": "NegativeNine",
    "rating": 5.0,
    "comment": "Lots of rules. Orders are written down on crowded pads. These get cluttered and make it hard to decipher. Not particularly worried about cheating from that aspect, but when you have a large army, it's hard to remember what you were moving where.\n\nNeed to come back to this with dark, multi-colored pens, better understanding of rules, and knowledge of European geography.",
    "timestamp": 1399240800
  },
  {
    "username": "Gunness",
    "rating": 5.0,
    "comment": "A game that's easier to admire than to enjoy. It's simply too dry for my taste.",
    "timestamp": 1394060400
  },
  {
    "username": "Greywolf2001ca",
    "rating": 5.0,
    "comment": "Too boring, long... although the hidden orders are a good idea.",
    "timestamp": 1391295600
  },
  {
    "username": "redlink",
    "rating": 5.0,
    "comment": "impossivel de conseguir player.",
    "timestamp": 1389308400
  },
  {
    "username": "marbot",
    "rating": 5.0,
    "comment": "No dice..write your orders. Played quite a lot. Need a good group though.",
    "timestamp": 1387580400
  },
  {
    "username": "SybotCB",
    "rating": 5.0,
    "comment": "I like diplomacy but you need a whole day, and some really good friends that know it's just a game in order to have a lot of fun with it.",
    "timestamp": 1386025200
  },
  {
    "username": "mike t",
    "rating": 5.0,
    "comment": "Have the AH and the ORIGINAL Gibson Games Editions.",
    "timestamp": 1378764000
  },
  {
    "username": "ASpeirs21",
    "rating": 5.0,
    "comment": "1976 Avalon Hill Version with the wood pieces.",
    "timestamp": 1373234400
  },
  {
    "username": "doctorb",
    "rating": 5.0,
    "comment": "I cannot imagine playing this game only by table top. No matter how good of friends you are and how long you have known each other, some one always leaves the table with hurt feelings. I only play by email ... where you can make others suffer impersonally.",
    "timestamp": 1369692000
  },
  {
    "username": "greekramos",
    "rating": 5.0,
    "comment": "The most hateful gaming experience I've ever had. Battlestar Galactica is a close second.",
    "timestamp": 1366063200
  },
  {
    "username": "Sillion",
    "rating": 5.0,
    "comment": "Now I like Game of Thrones and Imperial so much better",
    "timestamp": 1361055600
  },
  {
    "username": "johnwong882",
    "rating": 5.0,
    "comment": "good",
    "timestamp": 1359500400
  },
  {
    "username": "licinius",
    "rating": 5.0,
    "comment": "Given Away",
    "timestamp": 1356217200
  },
  {
    "username": "Dobbin2",
    "rating": 5.0,
    "comment": "Mostly played postally (there was no email!). It always seemed like a good idea, but never quite \"did it\" for me...",
    "timestamp": 1354316400
  },
  {
    "username": "per42",
    "rating": 4.5,
    "comment": "The idea is great but you need to play it with either complete strangers (which possible is the best) or a very homogenous group of really good friends. Two best friends ruins the game for everyone else.",
    "timestamp": 1354143600
  },
  {
    "username": "Vince Londini",
    "rating": 5.0,
    "comment": "The luckless combat system and mutually beneficial co-operation combined with the art of the backstab make this game entertaining. But, it's long. Got through a couple of PBEM games years ago...used it as a Junior High History schoolteacher for the lessons on WWI and secret agreements. And once, as a party stunt. But it mostly gathers dust.",
    "timestamp": 1341871200
  },
  {
    "username": "allenj82",
    "rating": 5.0,
    "comment": "Complete and in good condition.",
    "timestamp": 1338415200
  },
  {
    "username": "Gryfon",
    "rating": 5.0,
    "comment": "good game, but how often can you get 7 people that are all bloodthirsty?",
    "timestamp": 1333749600
  },
  {
    "username": "stoneart69",
    "rating": 5.0,
    "comment": "hour after hour of deal making and backstabbing.",
    "timestamp": 1333317600
  },
  {
    "username": "Jeff Schulte",
    "rating": 5.0,
    "comment": "A classic game, but I prefer more meat to my game mechanics when manuevering armies and fleets across Europe.",
    "timestamp": 1326841200
  },
  {
    "username": "shammois",
    "rating": 5.0,
    "comment": "Unfortunately my back-stabbing tactics were not well-received! Not in a rush to alienate anyone again.",
    "timestamp": 1326754800
  },
  {
    "username": "sfox",
    "rating": 5.0,
    "comment": "a game of politics more than anything else, just takes far too long",
    "timestamp": 1326582000
  },
  {
    "username": "steef",
    "rating": 5.0,
    "comment": "give 4 of your friends baseball bats and throw them in a closet. It's cheaper & you'll lose less friends that way.",
    "timestamp": 1325977200
  },
  {
    "username": "smkctk",
    "rating": 5.0,
    "comment": "Friendships have been broken on this game. I played it once, and remember pretty much losing in turn 2. Takes way too long. Backstabbing is fun though.",
    "timestamp": 1323298800
  },
  {
    "username": "phil_standen",
    "rating": 5.0,
    "comment": "Still fed up with this fiddly game, despite winning as Austria",
    "timestamp": 1321225200
  },
  {
    "username": "Jomazael",
    "rating": 5.0,
    "comment": "This is one of those games highly dependent on the players. I have never got down and dirty with why some people rate this the be all and end all of games. Average at best as a game imo, its all down to who is sitting around the table. Or at the end of an email. Cross this with axis and allies, then maybe we can talk !",
    "timestamp": 1320188400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "A giant in its own right, perhaps. But that doesn't excuse the tedium or the poor board design (especially in context to starting locations). A Game of Thrones: the Board Game did everything Diplomacy was good at without the bother.",
    "timestamp": 1759269600
  },
  {
    "username": "Maximaler",
    "rating": 6.0,
    "comment": "Als Kind oft gespielt ich fand Risiko aber besser.",
    "timestamp": 1756936800
  },
  {
    "username": "Nodens",
    "rating": 6.0,
    "comment": "Undeserved bad rep. Nobody likes liars, the winner is usually the most reliable partner.",
    "timestamp": 1756418400
  },
  {
    "username": "Gernial",
    "rating": 6.3,
    "comment": "winning by arguing. Mac: \"I make the worst propaganda\"",
    "timestamp": 1754690400
  },
  {
    "username": "Whizkid",
    "rating": 6.0,
    "comment": "Sticker sheet is unused. Set is complete. Box shows shelf wear. Some maps have small notes in ink, alas. There are more copies of the map in the box.",
    "timestamp": 1754344800
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Milestone in gaming history\n\n- Way too long\n- Requires exactly 7p",
    "timestamp": 1753826400
  },
  {
    "username": "GrimThunderbrew",
    "rating": 6.0,
    "comment": "Too long? Cannibalized for parts. Metal pieces look great in Imperial 2030.",
    "timestamp": 1752876000
  },
  {
    "username": "boardgamegirlpaints",
    "rating": 6.0,
    "comment": "Great game at it's core, not right for my group.",
    "timestamp": 1752098400
  },
  {
    "username": "ReignsEternal",
    "rating": 6.0,
    "comment": "missing a couple of pieces.",
    "timestamp": 1750284000
  },
  {
    "username": "MonteesMeeples",
    "rating": 6.0,
    "comment": "Had a lot of fun (and frustration) back in the days of play by mail (and email). The nature of the game is making temporary allies, but being ready to backstab them when the time is right.",
    "timestamp": 1749852000
  },
  {
    "username": "abdekker",
    "rating": 6.0,
    "comment": "Critical to the game is the process of talking to enemies and allies. Secondary are the actual mechanics of moving armies and fleets (mastered quickly). Those with a keen understanding of human nature and able to think and talk fast are rewarded rather than those with clever strategy. The game closely mirrors life with its undeserved failures and unexpected successes. Diplomacy is a great game.\n\nHaving said all that, the game does encourage \"negative\" behaviour - you *will* be forced on occasion to lie, use coercion or threats, be forced to trust an opponent known to be lying, etc. These aspects are all part of the rough and tumble of the game (which some love and others loathe).\n\nAlso, finding 6 players to play for 3+ hours is near impossible, so I rather recommend the excellent 2-player variant Intimate Diplomacy. ID removes the lying, back-stabbing and other negative aspects of 7-player Dip, but retains the rich game play. Its also takes less than half the time to play!\n\nDiplomacy: 5\nIntimate Diplomacy: 9",
    "timestamp": 1747864800
  },
  {
    "username": "NoDicePlease",
    "rating": 6.0,
    "comment": "It had its moment in the sun when we had the time to play it. Likely will never be played again.",
    "timestamp": 1746482400
  },
  {
    "username": "djadmoros",
    "rating": 6.0,
    "comment": "Had a German edition from Parker in my youth. Played it mostly solitaire. For then, a good game, there were no complex monsters around those times.",
    "timestamp": 1745964000
  },
  {
    "username": "xoflram",
    "rating": 6.0,
    "comment": "Sold GenCon 2024. Played A LOT in high school, but not really for our group now. Can be a real friendship killer.",
    "timestamp": 1744927200
  },
  {
    "username": "BrazenLudorum",
    "rating": 6.0,
    "comment": "Best 7",
    "timestamp": 1739833200
  },
  {
    "username": "svic64",
    "rating": 6.0,
    "comment": "Very fun game for a group of players.",
    "timestamp": 1739487600
  },
  {
    "username": "Eric Brosius",
    "rating": 6.0,
    "comment": "This is an interesting and instructive game, but although I've played it many times (most of them via mail or e-mail) and admire the design, I don't enjoy it enough to keep investing the time to play it.\n\nI rate it '6' with the Gunboat rules, but only a '4' when it's played the right way.",
    "timestamp": 1738450800
  },
  {
    "username": "FamilyGamer20",
    "rating": 6.0,
    "comment": "Purchased as a teenager for sub $20. Game takes a long time and requires dedicated players and time. Shelved with Axis and Allies for sentimental value. Specific variant contains tons of cardboard.",
    "timestamp": 1738105200
  },
  {
    "username": "odinsgrandson",
    "rating": 6.0,
    "comment": "Intriguing concept and mechanics. It is fun for a bit, but you don't ever really finish a game.",
    "timestamp": 1737586800
  },
  {
    "username": "zachmane",
    "rating": 6.0,
    "comment": "Could be fun... With the right group. Many other games which scratch the same itch, but are shorter, less of a hassle to play.",
    "timestamp": 1737500400
  },
  {
    "username": "ahrnge",
    "rating": 6.0,
    "comment": "I've played many games of correspondence diplomacy. It is an absolute masterpiece. I hope I never play it again.",
    "timestamp": 1736895600
  },
  {
    "username": "Subaru77",
    "rating": 5.5,
    "comment": "A játék amiről tudom, hogy imádni fogom, mert annyira átélhető, annyira hozza a történelem ízét! És akkora nagy csalódás lett! A játék kötelező(!) eleme a másik szándékos, legaljasabb módon történő átverése, kihasználása, megvezetése. Hazudozás pironkodás nélkül. És bár tudja mindenki, hogy ez egy játék, de akkor is fáj mind megtenni, mind átélni. Gáz. Ha meg nem így játssza a csapat, akkor meg a legrosszabb Rizikó \"élményt\" kapják a résztvevők.",
    "timestamp": 1732834800
  },
  {
    "username": "FeiJai24",
    "rating": 6.0,
    "comment": "I owned this game as a tennager in the late '80s early '90s. I really liked it but found it difficult to get to the table. It took so long to play and finding someone to play with was difficult, given the game length.",
    "timestamp": 1730847600
  },
  {
    "username": "invervegas",
    "rating": 6.0,
    "comment": "Complexity √",
    "timestamp": 1724968800
  },
  {
    "username": "Zronos3008",
    "rating": 6.0,
    "comment": "Torto",
    "timestamp": 1720821600
  },
  {
    "username": "easterncalculus",
    "rating": 6.0,
    "comment": "Interesting, but way too gradual and drawn out, and features (centrally) player elimination",
    "timestamp": 1719871200
  },
  {
    "username": "FizmosFolly",
    "rating": 6.0,
    "comment": "I adore this game. The teach is nightmarish and the game truly takes all day and then some. Outside of college I've only really gotten to play online. I doubt it'll ever see the table but I can't bring myself to get rid of it",
    "timestamp": 1717279200
  },
  {
    "username": "DarkJjay",
    "rating": 6.0,
    "comment": "This game was just never going to get played. We'll play Dune instead",
    "timestamp": 1716415200
  },
  {
    "username": "DSmitty",
    "rating": 6.0,
    "comment": "This game could be amazing in the right situation. You gotta have everyone playing to win and understanding that backstabbing is just part of the game though. I've always thought that when a player is defeated, they should choose whether to join the person that conquered them (and become assimilated into that society) or to join the resistance (another team) and try to defeat the person that defeated them. That way no player is totally eliminated and can be part of the game all the way through. One thing I don't like about the game is trying to resolve all the actions. I'm always afraid we're getting something wrong when there are so many sets of orders that are simultaneous and often conflicting.",
    "timestamp": 1710802800
  },
  {
    "username": "chipsmith",
    "rating": 6.0,
    "comment": "Mixed feelings on this. Played when I was young. Definitely a well designed game, and what an immersive experience playing face to face.\n\nIdk though, I’ve seen some permanently damaged friendships come out of this, and I personally was not very good at the manipulation required to win. So, I still own it, and did enjoy the experience of playing it, but I can’t see myself playing it again.",
    "timestamp": 1710111600
  },
  {
    "username": "Lironcareto",
    "rating": 6.0,
    "comment": "This is always a game hard to play, due to its nature. Having private negotiation and betrayal while seating at a table is always complicated. Even if you keep it private, others will see you doing shenanigans and will feel untrusty. However it's a perfect game for a group of people spending a weekend in a retreat, extending the gameplay during the entire stay.",
    "timestamp": 1708729200
  },
  {
    "username": "Lord_Loren_Soth",
    "rating": 6.0,
    "comment": "2-7",
    "timestamp": 1708038000
  },
  {
    "username": "Vorpa",
    "rating": 6.0,
    "comment": "One of the only few games from this era that I feel is still justified in my primary game-cabinet. This is no glorified dice rolling as so many games of that era are.\nHard to get to the table though and other than intrigue and backstabbing it's pretty thin and can become very frustrating if played with the wrong people.",
    "timestamp": 1705100400
  },
  {
    "username": "heyitshenry",
    "rating": 6.0,
    "comment": "I find this game much more fun online than in person",
    "timestamp": 1703977200
  },
  {
    "username": "kareds",
    "rating": 6.0,
    "comment": "Tough one to give a rating. I've managed to play 3 games with the same group, and it can be pretty fun if people get into it without allowing their feelings to be hurt. Giving it a rating is like rating a conversation, though. It depends 95% on who you're playing with.",
    "timestamp": 1702076400
  },
  {
    "username": "adamshum",
    "rating": 6.0,
    "comment": "Played my first (half) game of this last week. Fairly simple to explain. Takes lots of social energy which I don't quite have, given the length of the game. Feels a bit stressful to play. At the same time, can see why it is very loved by some close friends.",
    "timestamp": 1700521200
  },
  {
    "username": "Ravensburg24",
    "rating": 6.0,
    "comment": "You need 7 players who are simultaneously ruthless and congenial, are willing to sacrifice half a day and are okay with practically guaranteed player elimination. But, when the stars align, this game is truly a remarkable and unique experience for the five players that survive the first ten rounds. It also works well as a correspondence game, though betrayal is a lot nastier when the implications last months rather than a few hours.\n\nI recommend playdiplomacy.com for anyone looking for a digital version, and it's free! Though of course buying a physical copy is highly recommended for moral and economic reasons.",
    "timestamp": 1699830000
  },
  {
    "username": "slimy_asparagus",
    "rating": 6.0,
    "comment": "You can't get this to the table nowadays. I have fond memories of playing it FTF back in the day. My only logged play was online and really was not as much fun. I myself was a substitute and every seat had resigned at least once.",
    "timestamp": 1690840800
  },
  {
    "username": "mkittlitz",
    "rating": 6.0,
    "comment": "you gotta really like arguing and writing stuff down",
    "timestamp": 1690581600
  },
  {
    "username": "Ellogeyen",
    "rating": 6.0,
    "comment": "2-4 plays (2016)",
    "timestamp": 1689631200
  },
  {
    "username": "Harae",
    "rating": 6.0,
    "comment": "Okay: Strategic - Euro - Easy\n\nGood in th days but not nowadays.\n\nMultiplayer only (need at least 4). Interesting mechanics and very subtle game system. Maybe a bit too simple (boring) and still lacking flavor.\nNeed at least 4 players and a good group to be enjoyable. If you have the right players, the rating can go up to 8. Nowadays there are so many better multi player games around that I hardly play this one.",
    "timestamp": 1689544800
  },
  {
    "username": "B4lalaika90",
    "rating": 6.0,
    "comment": "The game of diplomacy, a vintage piece.",
    "timestamp": 1688940000
  },
  {
    "username": "Eric the Red",
    "rating": 6.0,
    "comment": "Played this endlessly in high school. My introduction to Avalon Hill and wargaming in general.\n\n*EDIT* This is a game that needs the right crowd. A backstab can cost a friendship in this game.",
    "timestamp": 1688076000
  },
  {
    "username": "fgpina",
    "rating": 6.0,
    "comment": "Superb game but with 2 major problems: finding 5 hours to play it and finding people willing to play the 5 hours in a hard pressure atmosphere! Chances of playing it in the next coming years is therefore quite reduced...",
    "timestamp": 1686088800
  },
  {
    "username": "SteveMcG",
    "rating": 6.2,
    "comment": "Area wargame",
    "timestamp": 1682892000
  },
  {
    "username": "Pura_Vida",
    "rating": 6.0,
    "comment": "Those were long long nights of negotiating and backstabbing back then, with the Habsburg monarchy always losing in the end. Which is historically correct of course.",
    "timestamp": 1680300000
  },
  {
    "username": "Lenny474",
    "rating": 6.0,
    "comment": "7 Players\n6-7 Players",
    "timestamp": 1679868000
  },
  {
    "username": "Illibossk",
    "rating": 5.5,
    "comment": "I've only played this once. It's very long (7+ hours) and there is a lot of negotiation, alliances, and stabbing people in the back. I'd like to try again at some point, but the time commitment is just something I'm not super interested in.",
    "timestamp": 1677798000
  },
  {
    "username": "verandi",
    "rating": 6.0,
    "comment": "Really requires the right people at the table to live up to its potential. In person or by e-mail are wholly different experiences",
    "timestamp": 1677538800
  },
  {
    "username": "OpieGoHard95",
    "rating": 6.0,
    "comment": "It's definitely a classic, but certainly requires the right people to play with",
    "timestamp": 1677366000
  },
  {
    "username": "boseguy22",
    "rating": 6.0,
    "comment": "2-7 Players, 6 Hrs+\nBest Played over a matter of weeks",
    "timestamp": 1675119600
  },
  {
    "username": "antiussentiment",
    "rating": 6.0,
    "comment": "The more players the better.\ndon't play with the wrong people :-)\ngood sportsmanship is required by the stabee.",
    "timestamp": 1673305200
  },
  {
    "username": "jayouzts",
    "rating": 6.0,
    "comment": "Not perfect, and the quality of the game depends on how involved your opponents are. Still a solid game after all these years. Best played PBEM.",
    "timestamp": 1670713200
  },
  {
    "username": "byronator",
    "rating": 6.0,
    "comment": "This is the game I grew up on. It is a classic that is so simple yet so complex. I have found having a good time with this is more about the players you're playing with/against than anything else. If you can find that mix of players who are willing to talk, negotiate, lie, betray, get mad but still understand this is just a game, then this is great. Unfortunately it takes forever to play, so it's pretty rare that this gets to the table, but I'm always excited when it does.",
    "timestamp": 1667080800
  },
  {
    "username": "jonpaget",
    "rating": 5.5,
    "comment": "A strategic, area control game that relies of making pacts and breaking them. Not my sort of game but I respect how easy it is to understand.",
    "timestamp": 1666648800
  },
  {
    "username": "destro",
    "rating": 6.0,
    "comment": "s",
    "timestamp": 1666044000
  },
  {
    "username": "Tesestae",
    "rating": 6.0,
    "comment": "With the simplest rule-set possible, this game is the mother of mind-games amongst players.\nYou will form alliances and live in constant fear of betrayal, all while plotting your own way to victory.\n\nNothing for the faint of heart.\n\nAlso, always keep in mind that you are only manipulating each other ingame; don't take anything of that personally.",
    "timestamp": 1663106400
  },
  {
    "username": "Alter_Zausel",
    "rating": 6.0,
    "comment": "Would easily be a 7 with some quality of components.",
    "timestamp": 1661983200
  },
  {
    "username": "Albertinum",
    "rating": 6.0,
    "comment": "Take a whole day. Talk, eat, drink, laugh, think, care, hate.\nLove it! But never again! Or..?",
    "timestamp": 1655244000
  },
  {
    "username": "adamphipps11",
    "rating": 6.0,
    "comment": "2-7 Players\nBest: 7",
    "timestamp": 1655244000
  },
  {
    "username": "countcrow",
    "rating": 6.0,
    "comment": "Bloody brutal game that if unchecked could take days to play. Definitely look up house rules to stream line the experience.\n\nThis game cost me two friends. It WILL upset people beyond the table if not done properly. I was similarly warned and ignored it.",
    "timestamp": 1654293600
  },
  {
    "username": "Scawt",
    "rating": 6.0,
    "comment": "I have many fond memories of college, one of which is Diplomacy and the many games of it played. Some finished, many not, Diplomacy holds a high ranking based largely on respect. The pure, simple mechanisms make for a very engaging game. Like many of my top ranked games, it's a game that demands a lot of its players to be successful. Intense negotiation, social engineering, and constant paranoia are the tenants of Diplomacy, and 50+ years later it's still something that stands on its own.",
    "timestamp": 1653602400
  },
  {
    "username": "cicerunner",
    "rating": 6.0,
    "comment": "The game is mechanically better than my rating reflects. I appreciate it as a design but no longer have the enthusiasm or resilience to play such a potentially devastating game over so many hours.\n\n(Estimated 15 unlogged plays pre 2020, in the preceding 40+ years ... )",
    "timestamp": 1653170400
  },
  {
    "username": "sethanator117",
    "rating": 6.0,
    "comment": "Played",
    "timestamp": 1652565600
  },
  {
    "username": "getdafunkout",
    "rating": 6.0,
    "comment": "I have a lot of respect for this game's design and its contribution to the hobby.\n\nMy biggest issues are that it can drag on too long and that it can reach situations that are simply not very fun or interesting for some players who nonetheless are expected to keep going through the motions to avoid being a poor sport. I prefer games where all players find their experience interesting and/or enjoyable. So, I guess if 7 people who are all REALLY into Diplomacy are playing, this game shines.",
    "timestamp": 1650837600
  },
  {
    "username": "GaryCollins68",
    "rating": 6.0,
    "comment": "On one hand, I remember games very well that I played in HIGH SCHOOL (1960's). Although I remember them fondly, they're also the reason that I'll probably not play again. Even in the 1980's it was getting a little too tense for adults (not to mention the 8+ hour commitment)...think overturned tables...Still, Diplomacy is a unique gaming experience. Many should try it at least once.",
    "timestamp": 1650664800
  },
  {
    "username": "littlemute",
    "rating": 6.0,
    "comment": "Makes me titter with delight because I'm such a bad liar in real life. Need seven. That's a problem.",
    "timestamp": 1650146400
  },
  {
    "username": "redemptioncousin",
    "rating": 6.0,
    "comment": "New, in box.",
    "timestamp": 1650060000
  },
  {
    "username": "brennanr",
    "rating": 6.0,
    "comment": "Not a great fit for my personality type. Classic game.",
    "timestamp": 1640818800
  },
  {
    "username": "williamhillis",
    "rating": 6.0,
    "comment": "One of the great games, notorious for splitting up friendships. Only Supremacy is worse in that regard. Still, can be fun if you can find six friends who secretly hate each other this much.",
    "timestamp": 1640646000
  },
  {
    "username": "BobbyReichle",
    "rating": 6.0,
    "comment": "This is one instance where I don't think the Board Game Geek rating system is very helpful, because I am not usually willing to play Diplomacy. But I'm very happy I've been able to play it. Luckily I have an excellent game group with cool heads and we've been able to enjoy playing. Keep everything in the game, and understand that it's just a game, and you'll have an enjoyable experience.",
    "timestamp": 1638745200
  },
  {
    "username": "MRSalem",
    "rating": 6.0,
    "comment": "Mint.\n\nThis is the classic, \"I pretend to like you, but deep down, I hate your F'n guts\" game. It's great for playing with the in-laws. Try it, trust me...\n\nThis is a box chocked full of loathing, hate, and betrayal amongst your so-called and/or soon-to-be ex-friends.\n\nIt's been known to break up a marriage or two, end decades long friendships, and cause all kinds of trust issues.\n\nOverall, the gameplay is pretty basic, with lots of negotiation, broken promises, and heartache.\n\nA real keeper for those with a sense of humor, a touch of psychosis, or a very thick skin.",
    "timestamp": 1637535600
  },
  {
    "username": "HowitzerBug",
    "rating": 6.0,
    "comment": "An excellent game with simple mechanics but a great depth of strategy. Wonderful way to get people together and talking for a whole afternoon (if not a day!). Be careful to play with people who don't take things to personally, backstabbing is encouraged!",
    "timestamp": 1637190000
  },
  {
    "username": "andytaylor",
    "rating": 6.0,
    "comment": "How to alienate friends and lose them. I actually enjoyed playing this but couldn’t get anyone else to play it.\nSold.",
    "timestamp": 1634162400
  },
  {
    "username": "AKHawkster",
    "rating": 6.0,
    "comment": "The original All-Weekender for me, hard to get going, but it's a lot of fun and the friendship destruction potential is real",
    "timestamp": 1633903200
  },
  {
    "username": "zaubererer",
    "rating": 6.0,
    "comment": "Very simplistic and outdated but ok for the time period it was created. Also one game takes too long and it is only playable with many players.",
    "timestamp": 1631656800
  },
  {
    "username": "lordgro",
    "rating": 6.0,
    "comment": "Known as a \"classic\". Lauded for its simultaneous movement, and its emphasis on player negotiations over game mechanics. Unfortunately long to complete. Some are disappointed about its requiring a player to ultimately betray his ally/allies to win the game; but many have enjoyed this aspect the most. Legend has it that President Kennedy played it with his staff--a chilling thought.",
    "timestamp": 1630792800
  },
  {
    "username": "dalembertian",
    "rating": 6.0,
    "comment": "Keeping just for sentimental value, original box from my childhood.",
    "timestamp": 1629756000
  },
  {
    "username": "marknau",
    "rating": 6.0,
    "comment": "A classic. Requires exactly 7 people to play properly. Wears thin fast with the same crowd, because it is all about negotiation, with some tactical problems along the way. The time commitment is daunting, and it's an elimination game.",
    "timestamp": 1626472800
  },
  {
    "username": "RHReiss",
    "rating": 6.0,
    "comment": "A classic that I played frequently in college but rarely since then. Requires the right group to people to be a good game for repeat play.",
    "timestamp": 1623448800
  },
  {
    "username": "Mighty Jim",
    "rating": 6.0,
    "comment": "Brilliant, of course, but who has the time?\n\nOld review:\n\"Diplomacy\" creates the most complex, subtle, and deliciously-cruel player interaction. Its simple rules make it the perfect game to introduce people to gaming -- although they'll probably never speak to you again. Only its length and slight lack of replayability reduce this game from a 10.",
    "timestamp": 1619560800
  },
  {
    "username": "GeryFlash",
    "rating": 6.0,
    "comment": "Good game but there is too few mechanics, almost nothing just different game situations - moving rules. It is a chess game with negotiation.",
    "timestamp": 1618092000
  },
  {
    "username": "Sjerv1e",
    "rating": 6.0,
    "comment": "The simplicity of this game's design is amazing to me, and I love the concept of the game, but if I'm going to play an all-day game with some friends I will always prefer to play Twilight Imperium over this. And since all-day gaming sessions are getting less common, I don't think this will ever hit the table again.\n\nProbably better to play this online.",
    "timestamp": 1615158000
  },
  {
    "username": "basadani",
    "rating": 6.0,
    "comment": "played it online twice",
    "timestamp": 1614294000
  },
  {
    "username": "chrisjwmartin",
    "rating": 6.0,
    "comment": "Dip - a good game, and one that I'll be happy to play any time I have six other people who like the game, aren't playing anything else and have several hours to kill.",
    "timestamp": 1612566000
  },
  {
    "username": "Mixo",
    "rating": 6.0,
    "comment": "Not really good in Face-to-Face pla, but excellent if played over a couple of weeks/months, with players interacting while not actually at the board. I used to run a game at university - whenever the players met for a beer or so, the topic of diplomacy came up at one point - excellent.",
    "timestamp": 1612479600
  },
  {
    "username": "eladnl",
    "rating": 6.0,
    "comment": "The game is clearly the founding father of many other area control as well as bluffing games. It is fun with the right group, sophisticated, but a bit too long for me. Simple rules with high level of complexity. It needs exactly 7 players, which is often difficult to get.",
    "timestamp": 1611356400
  },
  {
    "username": "mazzyfred",
    "rating": 6.0,
    "comment": "Was probably one of the first game i played after the \"classic games\" of my childhood. We spent weekends with my friends playing this and I still have great memories of it. Would never play it again today, though.",
    "timestamp": 1607986800
  },
  {
    "username": "manassas9570",
    "rating": 6.0,
    "comment": "Fun to play but it's a long slog and the effort to rally a crowd to play all the sides is extensive.",
    "timestamp": 1607727600
  },
  {
    "username": "B41939",
    "rating": 6.0,
    "comment": "Needs time, seven people, and familiarity with the conflict situations (or a program to handle order resolutions); once all's in place, fun as h**l. I once coaxed seven hesitant folks to give it a try (I was GM); in two turns I had seven maniacs on my hands. Sales of the game also tripled in that (small) city.",
    "timestamp": 1605308400
  },
  {
    "username": "lordvoldemort",
    "rating": 6.0,
    "comment": "&$ A classic Avalon Hill game. I have played it mostly over the judge online. It is a tremendous amount of fun; however, it is not a good game for folks who are easily angered by lying or treachery. Treachery is the key to the game and you have to revel in being the victim as well as the stabber. Also you need 7 for this game and it takes at least 4 hours and as many as 8 hours to play. Ideally, with a face to face game, you need to include an 8th as a gamemaster to keep this moving and reconcile moves.\n\nI love the game, but almost never get to play.",
    "timestamp": 1604098800
  },
  {
    "username": "master_tactician",
    "rating": 6.0,
    "comment": "Fun to play now and then, just make sure it's with the right crowd. Learning each country's unique strategic options and openings is really interesting. The lack of luck in this is also compelling, but can be replaced with something that can be equally frustrating: people playing too emotionally or unpredictably. Rather than a delicate diplomatic and prediction game, if a player or group decides you're dead, whether rational for their position or not, no amount of politicking will save you. Elimination this way can really sour a play.",
    "timestamp": 1602626400
  },
  {
    "username": "Zetsar",
    "rating": 6.0,
    "comment": "Ruins trust like no other. This game is quite entertaining with friends, but sometimes is a bit too vicious.",
    "timestamp": 1601935200
  },
  {
    "username": "kimerupooru",
    "rating": 6.0,
    "comment": "A landmark negotiation game, but limited by an unbalanced map and the need for seven players. It is further limited by the 4+ hours needed to complete a game. As I have gone from being a competitive player to a social one, my patience for \"traitor\" games has completely disappeared. This is why I haven't played a game of Diplomacy in years. When I played it last, I prefered the 1900 variant map.",
    "timestamp": 1599516000
  },
  {
    "username": "mobius1974",
    "rating": 6.0,
    "comment": "I was introduced to this game as an alternative to the luck-driven game \"Risk.\" by a USMC friend who had an older version with painted wooden armies and navies. The \"no dice involved\" aspect fascinated me, as it became evident that the outcome of the game was a direct result of the actions (and inactions, and diplomatic maneuverings) of the players rather than sheer luck. The premise to the game, as I see it, is: convince all the other players that you should be the game's winner through military force, coerscion, subterfuge, or, as many nations have done through the years, deceit and surprise.\n\nThough I own this newer version of the game, I'd love to own the more \"classic\" version(s) of it. Failing that, I'll attempt to replace the cardboard counters of my more current version with painted figurines to represent the armies (artillery pieces), navies (battleships of the era), and supply centers (factories).",
    "timestamp": 1598738400
  },
  {
    "username": "Tiamat",
    "rating": 6.0,
    "comment": "Very influential for me. It was my main point of reference for a long time. But these days I'm not as interested in popularity contests or needing to gauge whether another player is lying to you.",
    "timestamp": 1597960800
  },
  {
    "username": "KingofLions",
    "rating": 6.0,
    "comment": "This is a game that ended some friendships in High School. We tried it once later in life, and it had a few plays in it and I'm old enough not to hate someone who betrays me. Still....",
    "timestamp": 1596146400
  },
  {
    "username": "Proqs",
    "rating": 6.0,
    "comment": "The first few times you play it you think it's amazing. After a while you get bored by or tired of the backstabbing. Then it also becomes a more boring game.\nAlso the best way of playing it is with 7 people, which can be hard to find",
    "timestamp": 1595714400
  },
  {
    "username": "jamesmckinley",
    "rating": 6.0,
    "comment": "you have to have the right group of people, willing to play and willing to really get into it...one uninterested person can ruin the game",
    "timestamp": 1593122400
  },
  {
    "username": "Reverend Pete",
    "rating": 6.0,
    "comment": "Ooooh...the tension!",
    "timestamp": 1592776800
  },
  {
    "username": "Sadderley",
    "rating": 6.0,
    "comment": "If you can get it cheap then do so. It is the epitome of a minimalist board game which is totally dependent upon strategy. However if you want the same game with better (any) components then get Game of Thrones: The Board Game",
    "timestamp": 1592344800
  },
  {
    "username": "Red Eye",
    "rating": 6.0,
    "comment": "Oh this one would go on for hours! And then the brutal and inevitable betrayal.",
    "timestamp": 1589752800
  },
  {
    "username": "Khexhu",
    "rating": 6.0,
    "comment": "The 1999 Avalon Hill (Hasbro) Big Box Edition was the best looking version I ever owned. This may well be the only game from the 1950's that I would still play today. But I don't need to own it any longer.",
    "timestamp": 1587679200
  },
  {
    "username": "Malkryst",
    "rating": 6.0,
    "comment": "I have almost lost friends over this game, which is probably why it doesn't get played anymore, but still a classic if you can get the right group size together to play it (7, really - so for me it just won't get played anymore).",
    "timestamp": 1584399600
  },
  {
    "username": "RABartlett",
    "rating": 5.8,
    "comment": "Needs the right group to play and co-operate",
    "timestamp": 1583967600
  },
  {
    "username": "ninjahumstart",
    "rating": 6.0,
    "comment": "All Components in very good condition. Only a few sheets from the pad have been used. Has only been played once. Box has some wear from storage",
    "timestamp": 1582585200
  },
  {
    "username": "mtgchamp",
    "rating": 6.0,
    "comment": "Only played one time. I made the mistake of trusting someone who I thought was the most trustworthy person I knew (Rick Lewis) during the first time. Boy was I wrong, and the rest of the game sucked for me.",
    "timestamp": 1581894000
  },
  {
    "username": "Rob Beekman",
    "rating": 6.0,
    "comment": "Owned by Henry",
    "timestamp": 1580943600
  },
  {
    "username": "singhalex",
    "rating": 6.0,
    "comment": "Great fun, but needs a full group.",
    "timestamp": 1580252400
  },
  {
    "username": "abss",
    "rating": 6.0,
    "comment": "Played only online games",
    "timestamp": 1578524400
  },
  {
    "username": "Dragoons_Kane",
    "rating": 6.0,
    "comment": "A very good strategy game (maybe the best). Rarely played. The problem is the playtime and players not accepting their mistakes and wants do-overs... there are no do-overs in Diplomacy  Also, destroys friendships...",
    "timestamp": 1578438000
  },
  {
    "username": "Pierce",
    "rating": 6.0,
    "comment": "I like playing this from time to time. It's best with the full player count. Some games are very dynamic and exciting, others can be frustrating if players form early alliances and won't budge on them. I think it's best when all players are total strangers.",
    "timestamp": 1578092400
  },
  {
    "username": "grecorivera",
    "rating": 6.0,
    "comment": "Brand new, opened but never played.",
    "timestamp": 1577746800
  },
  {
    "username": "kitrok",
    "rating": 6.0,
    "comment": "I've only ever played a few turns.\n\nI think the game is intriguing I want to try this again as an adult.",
    "timestamp": 1575759600
  },
  {
    "username": "skinny_luke",
    "rating": 6.0,
    "comment": "Tactical treachery. 2-7p (best 4+) 4h",
    "timestamp": 1575500400
  },
  {
    "username": "Fone Bone10",
    "rating": 6.0,
    "comment": "Not much to say about this game. I’m fond of it because it was first introduction to board gaming, but it has its flaws. I’ve never been able to finish a whole game, once someone gets eliminated they are out for potentially 12 hours of gaming.",
    "timestamp": 1575327600
  },
  {
    "username": "datefruit",
    "rating": 6.0,
    "comment": "simultaneous",
    "timestamp": 1568498400
  },
  {
    "username": "junglepat",
    "rating": 6.0,
    "comment": "The interaction and strategy are out of this world. Too bad that it is so hard to find people to play with.",
    "timestamp": 1568066400
  },
  {
    "username": "callust",
    "rating": 6.0,
    "comment": "Favored Types: Killer, Socializer\nDisfavored Type: Achiever",
    "timestamp": 1567893600
  },
  {
    "username": "cuento",
    "rating": 5.5,
    "comment": "Used to love this type of games. Unluckily very few people can play this and not get angry at the end. Additionaly - it's very long. Haven't played this one for YEARS and don't know if ever will play again, still like it though. Nowadays leading towards more approachable games.",
    "timestamp": 1566770400
  },
  {
    "username": "DomD",
    "rating": 7.0,
    "comment": "Not yet played",
    "timestamp": 1759269600
  },
  {
    "username": "Fevin",
    "rating": 7.2,
    "comment": "Extremement complexe à organiser. Mais ultra spectaculaire. A faire assez rarement.\n\nQuand même un poil bancal et vielli (modification après m'être fait ramasser avec l'Autriche  )",
    "timestamp": 1757714400
  },
  {
    "username": "Fungato",
    "rating": 7.0,
    "comment": "Too long to play",
    "timestamp": 1755640800
  },
  {
    "username": "Bozok",
    "rating": 7.0,
    "comment": "Love it conceptually, though it's very long and not sure it's always worth it. Have to play it with the right group, and a large group at that (6-7 players).",
    "timestamp": 1754949600
  },
  {
    "username": "Zagreus9",
    "rating": 7.0,
    "comment": "Second to monopoly, it's the fastest way to lose friends!\n\nBut with the right group of players, it's superb. Tightly evil, manipulative and joyous",
    "timestamp": 1754690400
  },
  {
    "username": "Botulf",
    "rating": 7.0,
    "comment": "2-7\n\nF",
    "timestamp": 1744840800
  },
  {
    "username": "Inkwan",
    "rating": 7.0,
    "comment": "Is this an 8 or a 2? I am never quite sure but it is quite an experience. GoT with expansion is a better designed game with it's catch up mechanics that prevent a runaway leader AND plays in less than 3 hours",
    "timestamp": 1744322400
  },
  {
    "username": "Someski",
    "rating": 7.0,
    "comment": "This is a long old game but fun in a larger group. Would like to play this more often.",
    "timestamp": 1741647600
  },
  {
    "username": "josephfeller",
    "rating": 7.0,
    "comment": "Games I played age 11-20",
    "timestamp": 1740006000
  },
  {
    "username": "sculley",
    "rating": 7.0,
    "comment": "9 - Excellent game\n6 - Will play sporadically if in the right mood",
    "timestamp": 1739919600
  },
  {
    "username": "Alfagar",
    "rating": 7.0,
    "comment": "If you don't like your friends, this is a great game.",
    "timestamp": 1739660400
  },
  {
    "username": "DaddyDosDeuce",
    "rating": 6.5,
    "comment": "BGG HoF: Another classic game I grew up playing as a kid. Didn't play this as often as Civilization but do remember all the times we had to disperse across the house to meet in groups to plot. Not sure how easy this would be to get to the table nowadays though.\n\nHave the 50th anniversary version, which is all cardboard counters. May have to either upgrade to the version with metal pieces (1999), or 3D print.",
    "timestamp": 1737500400
  },
  {
    "username": "KRon0508",
    "rating": 7.0,
    "comment": "I have an extra copy, new in shrink.",
    "timestamp": 1735513200
  },
  {
    "username": "KDLadage",
    "rating": 7.0,
    "comment": "Reviewed: MM",
    "timestamp": 1733094000
  },
  {
    "username": "FranklinTV",
    "rating": 7.0,
    "comment": "So, It's a classic of the genre which I purchased a few years ago, and yet have not remotely even come close to playing it, nor do I see it happening in the future. I have faith that maybe one day, but till then, It's an archive game. as I live in hope to one day to have the time to play it properly a few times. (13/9/11). UPDATE: Thanks to the site www.backstabbr.com, I have got to experience this game, and for something of It's age, it is an amazing design. It is almost frightening how this game can get inside your head, and the fear of being backstabbed is ever present and so painful when it occurs. A true classic, but it is also a game I think I would need to step away from having played a number of games, as it offers a very deep rabbit hole to fall down. That said, would be curious to play it in person at least once (Rating 9.028, Nov 2021). UPDATE: The Great Xmas 2024 Cull. I think it is still a true gaming classic, but one I would never play physically and only on backstabber, so for that point, a reduction in rating (Rating 7.028, Nov 2024)",
    "timestamp": 1732662000
  },
  {
    "username": "abssalom",
    "rating": 7.0,
    "comment": "Actualizado: Como juego, es bueno, te diviertes, haces alianzas, pegas puñaladas, y pierdes amigos en el proceso.\nComo juego de mesa, no funciona bien, necesitas un tiempo tan alto que no compensa la experiencia.",
    "timestamp": 1731538800
  },
  {
    "username": "Rygel",
    "rating": 7.0,
    "comment": "This game can take 2 hours or 2 days. Depends on how you play and who you play with. Very good game with the right group.\n\nGot in 2007",
    "timestamp": 1731279600
  },
  {
    "username": "davybiltoni",
    "rating": 7.0,
    "comment": "Pros :\nFun with a small group of friends\nNice retro board\n\nCons :\nTedious at times\nThere's a board but very few components so not really getting much for your money\nTerrible box quality\n\nComplexity : 3/10",
    "timestamp": 1729634400
  },
  {
    "username": "OldYronsides",
    "rating": 7.0,
    "comment": "2-7p (best 7)\n360m",
    "timestamp": 1729288800
  },
  {
    "username": "aleksandar",
    "rating": 7.0,
    "comment": "7 Players (6)\n360 min\n3.35",
    "timestamp": 1728684000
  },
  {
    "username": "dylanv2",
    "rating": 7.4,
    "comment": "The one thing that makes drops this game's score is the length. Other than that, it is intense and is engaging. You will see who in your group is charismatic and who is not.\n\nComponents: 6\nArt: 7\nTheme: 8\nMechanism: 7.5\nEnjoyment: 8.5",
    "timestamp": 1728338400
  },
  {
    "username": "DannyDoo",
    "rating": 7.0,
    "comment": "1 Sell\nMost people defer to one friend who loudly dislikes the game, therefore none opt to play this one.",
    "timestamp": 1726264800
  },
  {
    "username": "James DeBenedetti",
    "rating": 7.0,
    "comment": "The only problem is the length of play time.",
    "timestamp": 1724450400
  },
  {
    "username": "extrala",
    "rating": 7.0,
    "comment": "\"Childhood Classics\". One of the few games that passed the test of time.",
    "timestamp": 1722895200
  },
  {
    "username": "LordEris",
    "rating": 7.0,
    "comment": "Brilliant classic, but I felt that it's more of an educational game at this time and age.\nNot so fun now, but still a playble game.",
    "timestamp": 1721599200
  },
  {
    "username": "firemage85",
    "rating": 7.0,
    "comment": "Although nearly impossible to get 7 people to agree to play this game, it remains one of my favorites after all these years.",
    "timestamp": 1720994400
  },
  {
    "username": "bobjohnson",
    "rating": 6.6,
    "comment": "+ Interactive and emotional. Clever movement system. Can win without ever lying.\n- Ruins friendships -- people tend to take the betrayals personally.",
    "timestamp": 1718488800
  },
  {
    "username": "jimok",
    "rating": 7.0,
    "comment": "Great game. We have a fairly large face-to-face group in the Chicago area, with one to three games being held per month. If you're interested, email me or check out our website, windycityweasels.org!\n---\nUpdate, July 2019: Hi, my name is Jim, and I've been Diplomacy-free for four months! Too many other games that I want to play to devote any more time to this one.\n---\nUpdate, May 2024: My resolve is as stiff as ever -- I will never play Diplomacy again.",
    "timestamp": 1716501600
  },
  {
    "username": "genoboard",
    "rating": 7.0,
    "comment": "Came out the year I was born. Couldn't resist. Needs at least three players to work. Risk with backstabbing.",
    "timestamp": 1716242400
  },
  {
    "username": "goonzo",
    "rating": 7.0,
    "comment": "Web(playdiplomacy.com): 1 play",
    "timestamp": 1713909600
  },
  {
    "username": "RVW0711",
    "rating": 6.8,
    "comment": "Speaking of Diplomacy (See Cutthroat Caverns), this game is the grandaddy of friendship killers. I still enjoy an occasional game for the sheer strategy that must be employed to win. However, because of its nasty and unpredictable nature, I tend to stay away from this one.",
    "timestamp": 1711321200
  },
  {
    "username": "warder57",
    "rating": 7.0,
    "comment": "The classic game of deals and betrayal. If you're up for a long game involving a lot of social and strategic elements, this is for you. But you need a lot of time and people who can handle a game where you have to lie to each other. And I mean hours of work down the drain because your friend just stabbed you in the back kind of lies.",
    "timestamp": 1709766000
  },
  {
    "username": "Reedy8",
    "rating": 7.0,
    "comment": "Brilliant game of cut throat empire building. Favourite of my early teenage games. Brutal at times.",
    "timestamp": 1709506800
  },
  {
    "username": "Samuelw3",
    "rating": 7.0,
    "comment": "2024",
    "timestamp": 1707001200
  },
  {
    "username": "infinitepeaks",
    "rating": 7.0,
    "comment": "With the right group, and the right mindset, it's great.",
    "timestamp": 1706569200
  },
  {
    "username": "lonewolf",
    "rating": 7.0,
    "comment": "Got this game as a kid, have always loved it. Lot of strategy and backstabbing. The one drawback is that it is very, very long.",
    "timestamp": 1706223600
  },
  {
    "username": "nabos",
    "rating": 6.5,
    "comment": "Players: 2-7 (7)",
    "timestamp": 1705791600
  },
  {
    "username": "szadiamond",
    "rating": 7.0,
    "comment": "6 - 7 (best 7) players, 360min",
    "timestamp": 1700780400
  },
  {
    "username": "unrealbe",
    "rating": 7.0,
    "comment": "Played a few times with a big group. Got stabbed in the back so many times but it created some very memorable experiences. Takes too long though.",
    "timestamp": 1700521200
  },
  {
    "username": "Loddonist",
    "rating": 6.5,
    "comment": "Great game but it takes sooooooo long f-t-f. I always found p.b.m. brought out the best in the game (and reflects the communications of the era in which it is set).",
    "timestamp": 1700434800
  },
  {
    "username": "whimsicaltyrant",
    "rating": 7.0,
    "comment": "Own - Storage",
    "timestamp": 1700434800
  },
  {
    "username": "Teutonicknight17",
    "rating": 7.0,
    "comment": "Best when you LARP as the different countries",
    "timestamp": 1696802400
  },
  {
    "username": "Madhatterdk",
    "rating": 7.0,
    "comment": "missing a piece",
    "timestamp": 1694037600
  },
  {
    "username": "colorado_gamer",
    "rating": 7.0,
    "comment": "Do Gooder Library",
    "timestamp": 1691618400
  },
  {
    "username": "nuverian",
    "rating": 7.0,
    "comment": "Missing 1 yellow and 1 white fleet.\nBox corner is torn.",
    "timestamp": 1691359200
  },
  {
    "username": "stenole",
    "rating": 7.0,
    "comment": "(7P) Simultaneous turn non-RNG area of control game. 90% of game time is a combination of coordinating attacks, brokering deals and alliances and lying to each other. No deals are binding. The game tends to last long for some and not for others.",
    "timestamp": 1690063200
  },
  {
    "username": "Bryon",
    "rating": 7.0,
    "comment": "7",
    "timestamp": 1689804000
  },
  {
    "username": "Firearchitect",
    "rating": 7.0,
    "comment": "Played online",
    "timestamp": 1687903200
  },
  {
    "username": "Dgotrek",
    "rating": 7.0,
    "comment": "Diplomacy... It's all in the name. A delightfully acrimonious scrum over old Europe. We played it a lot in junior high in the 80s. Be forwarned that it takes a long time and can cause lasting damage to interpersonal relationships. It's been a long time since I could get the desired number of 5-7 players together.",
    "timestamp": 1687298400
  },
  {
    "username": "drydoc",
    "rating": 6.8,
    "comment": "Diplomacy is one of the greats, but please understand, it's not for everyone. This abstract tactical game is honestly more similar to Chess than it is Risk. Despite its simple game mechanics and rules, its strategy is surprisingly complex being a mixture of logic, intuition, and teamwork.\n\nDuring gameplay, your time will be divided between making tactical calculations and maintaining and breaking alliances. Given every party is competent, you can't find yourself a victory without some type of compromise with your opponents. This really is part of the brilliance behind this game.\n\nDiplomacy is one of my all time favorite games, but it's a heavy one and I have to be in a particular mood to enjoy it. Gameplay can last hours, sometimes 7+.. Despite this, I would go as far as to say one could make the argument that Diplomacy is the best 7 player board game in existence. This is something I certainly subscribe to. Play at your own \"Risk.\" (10-15 plays)",
    "timestamp": 1686780000
  },
  {
    "username": "iverof",
    "rating": 7.0,
    "comment": "The Human game!",
    "timestamp": 1686348000
  },
  {
    "username": "Tufturk",
    "rating": 7.0,
    "comment": "Used to play this on the judges (email), and switched to the 1900 variant after a while. The king of negotiation games, and still quite a bit of scope for actual move-by-move analysis. But it just takes so much time... Online games with full press will last months and require huge commitment, which feels less and less tempting.",
    "timestamp": 1680732000
  },
  {
    "username": "Urutsini",
    "rating": 7.0,
    "comment": "While this game hasn't aged well, especially with the game length, I have had many fun games",
    "timestamp": 1680559200
  },
  {
    "username": "sherwinpr",
    "rating": 7.0,
    "comment": "In California.",
    "timestamp": 1678662000
  },
  {
    "username": "tscox87",
    "rating": 6.5,
    "comment": "I think I like the idea of it more than actually playing it.",
    "timestamp": 1677452400
  },
  {
    "username": "MWF1",
    "rating": 7.0,
    "comment": "go",
    "timestamp": 1675206000
  },
  {
    "username": "mykalberta",
    "rating": 7.0,
    "comment": "Classic Game",
    "timestamp": 1674082800
  },
  {
    "username": "oldgoat3769967",
    "rating": 7.0,
    "comment": "Too many people are sensitive about the inherent mechanisms of player shifting their alliances and opposition moves. I rated this game low because of player reaction to real world politic that comes out in the play through of the game. Be careful of who yo play with. Stick to players that are cold and calculating.",
    "timestamp": 1673996400
  },
  {
    "username": "Johnny Awesome",
    "rating": 6.5,
    "comment": "Gave away in the 90s. Too dry.",
    "timestamp": 1671750000
  },
  {
    "username": "alexanderpasch",
    "rating": 6.5,
    "comment": "If everyone worth playing is willing to put in the time and effort into this game, it can be very fun and thought provoking. You'll constantly be wondering about your moves and whether you should ally or betray your neighbors. But, despite the rules not being too complex, it takes quite a long time to complete, with quite a lot of negotiation.",
    "timestamp": 1670540400
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 8.0,
    "comment": "The premier & cruelest negotiating game, that will surely test nerves, tempers, and friendships. Totally reliant on negotiation, lying, & backstabbing, which can stir up the fury in players, so one must go into this remembering that it's JUST A GAME. I still keep a copy of Diplomacy around just in case there is a request, but I don’t honestly expect to play it again soon, sadly. But it was grand back in the college days. At it's best, you'll never experience anything more trying than this gaming experience.\n*It looks quite nice when the 2008 edition board combines with the 1999 miniatures:\nhttps://boardgamegeek.com/image/4374594/diplomacy\n*Rating reflects willingness to table it, but as a landmark, classic influential game, it is a '9'.",
    "timestamp": 1760738400
  },
  {
    "username": "Lendengold",
    "rating": 8.0,
    "comment": "Gereon\n(?)",
    "timestamp": 1759442400
  },
  {
    "username": "sucrates",
    "rating": 8.0,
    "comment": "Would be a 9 but for the playing time. NEVER actually have finished a game of this one. But if you do end up in situation that you're stuck with 6 gaming buddies at a place where you won't be disturbed the whole weekend, there's definitely no better game than Diplomacy.\n\nBring some other games for the early quitters/dropouts though. \n\n[2023] Ended up selling this one away to someone that might have enough time to actually play this game. No matter how good it is, a game that doesn't get playtime should move to a room where it is played.",
    "timestamp": 1757628000
  },
  {
    "username": "steffomaster",
    "rating": 8.0,
    "comment": "Tobias",
    "timestamp": 1756159200
  },
  {
    "username": "Congue38",
    "rating": 8.0,
    "comment": "Not my fav but one of the best games ever",
    "timestamp": 1753912800
  },
  {
    "username": "QuI4ViC",
    "rating": 8.0,
    "comment": "Excellent game if you want to stop talking to your friends, it requires a lot of patience, hard to understand, and where tradition is key to winning.",
    "timestamp": 1753048800
  },
  {
    "username": "VibroChimp",
    "rating": 8.0,
    "comment": "So far ahead of its time. I remember playing this as a teenager (probably the only time in my life when I could get a large group of friends together for a game of this length) and being impressed at how immersive the experience was with such a minimal rule set. Unfortunately, very hard to get to the table nowadays but I still have a lot of admiration for it.",
    "timestamp": 1748210400
  },
  {
    "username": "Flow25",
    "rating": 8.1,
    "comment": "THE classic game, that can easily destroy a whole day and friendships as well.",
    "timestamp": 1748037600
  },
  {
    "username": "Spada_",
    "rating": 8.0,
    "comment": "12+. Strategy + War. 2-7 players - Best: 7",
    "timestamp": 1747605600
  },
  {
    "username": "gamesbook",
    "rating": 8.0,
    "comment": "Nostalgia rating for all those years played during high school!",
    "timestamp": 1746828000
  },
  {
    "username": "macUladh",
    "rating": 8.0,
    "comment": "An engaging strategy and negotiation game with an unfortunate reputation that keeps it from the table. I'd love to play more, but with so many other engaging options these days I don't think I will ever persuade a group to join me.",
    "timestamp": 1745359200
  },
  {
    "username": "realityfoible",
    "rating": 8.0,
    "comment": "With the right group of people this transcends board gaming entirely, becoming a twisted form of LARPing.\n\nThe elephant in the room is that in execution Diplomacy can take roughly forever to play through, and you absolutely must have a full player count. Preferably players who won't mind potentially playing a losing seat for hours without giving up.\n\nMy recommendation is to set up a Diplomacy day with lunch and dinner pre-set for delivery, and allow no one to leave.\nWill it be a board game night, or the setup for a murder mystery? Why not both?",
    "timestamp": 1744840800
  },
  {
    "username": "Ravensburg24",
    "rating": 8.0,
    "comment": "Best with 7 players.\n\nAn amazing game for the 5 players who aren't basically eliminated in the first three rounds, I hope you have a fun activity for the other two  But seriously, the rules are straightforward and the game is all about roleplay, it's literally freeform planning and discussion punctuated by simultaneous updates of the game state. However, because no one can act alone (initially at least), your fate is in the hands of your fellow players and this bothers some people. Choose your group wisely.",
    "timestamp": 1743202800
  },
  {
    "username": "Sitnam",
    "rating": 8.0,
    "comment": "A good game that taught me bitter life lessons. Seems a shame to take that out on the game though.",
    "timestamp": 1739401200
  },
  {
    "username": "lordbwallace",
    "rating": 8.0,
    "comment": "If you have 6 friends willing to play, then buy this game, if not, find a Diplomacy discord server and save yourself some cash",
    "timestamp": 1738364400
  },
  {
    "username": "Fipton4564",
    "rating": 8.0,
    "comment": "Tactical real time negotiation, incredible theme and philosophy. It's mechanics are connected to the real world. Requires a lot of thinking, deduction. Unfortunately many players with free time are needed.",
    "timestamp": 1737759600
  },
  {
    "username": "Gwydion19",
    "rating": 8.0,
    "comment": "A timeless classic. The only problem with this game is finding the right mix of people to bring it to the table. There are internet options but they don't really match the tabletop experience.",
    "timestamp": 1737414000
  },
  {
    "username": "Joel_L",
    "rating": 8.0,
    "comment": "The tension this game creates with such a simple rule-set is astonishing. Excellent game. I don't know how often I'll be able to play this as it does demand a large player-count (7) and a large time commitment. It's also quite stressful. But as a once-a-year epic experience I can see myself looking forward to it.",
    "timestamp": 1736377200
  },
  {
    "username": "Chris Busse",
    "rating": 7.5,
    "comment": "Classic game, IF you can get anyone to play.",
    "timestamp": 1735686000
  },
  {
    "username": "EllenCaroline",
    "rating": 8.0,
    "comment": "Avalon Hill bookshelf version. Played only twice - had to feed the gamers both lunch and dinner. But an excellent game if you have the time and can find 7 players.\n\n3.4 game weight",
    "timestamp": 1735599600
  },
  {
    "username": "ajie426",
    "rating": 8.0,
    "comment": "超主观点评（7人局）：\n1、不愧是从1959年传承至今的经典，虽然画风、配件和玩法都比较简单，但是背景和游戏结合得很好，玩起来也很流畅，当说服（忽悠）别人按照自己的意图行动时非常有成就感。\n2、支援和护送都可以寻求别的国家帮助，这就让变数更多了，随时被背刺，也经常因为指令配合不好变成废指令，真是太真实了。\n3、同时行动很好，但是写指令有点累，感觉像权力的游戏那样用指令token控制会更方便。\n小心得：\n1、我们觉得控制的兵力多的时候写指令有点累，就村成了控制8个补给中心游戏结束，结果发现8个太快了，第二年就结束了，有点人都还没反应过来，感觉还是10-12个补给中心比较合适。\n2、土耳其、俄罗斯、英格兰早期蛮强的，因为没有后顾之忧。我用的土耳其，感觉在黑海这个地方挺微妙的。\n3、船能下海还是尽量下海，进可攻退可守，不仅方便投运兵力，支援的地方也比较多，而且要消灭或者驱逐船还是比较难的。\n玩法：\n大家随意交流战术之后，秘密对自己的每个部队书写指令，指令有4种，一是坚守、二是移动、三是支援、四是护送。所有兵种的战力都为1，想击败别人就要数量比别人多。冬季根据部队所在位置，确认占领的补给中心，然后根据补给中心数量解散（任意地方）或征召（在自己的本土）部队。",
    "timestamp": 1733094000
  },
  {
    "username": "Denniz_D",
    "rating": 7.5,
    "comment": "There is nothing quite like playing this game PBEM. It takes awhile and feels a bit like musical chairs when it comes to the initial alliances, but I'm always up for a game.",
    "timestamp": 1731366000
  },
  {
    "username": "SimonHepple",
    "rating": 8.0,
    "comment": "great game but hard to replay with live players because of the backstabbing. Fun game that simulates European Realpolitik",
    "timestamp": 1731106800
  },
  {
    "username": "Nicodemus42",
    "rating": 7.5,
    "comment": "-2-3-4-5-6-7",
    "timestamp": 1730674800
  },
  {
    "username": "Geoboffin",
    "rating": 8.0,
    "comment": "Well, no-one has time for this now, but it was great back in the day when we had no cares in the world.",
    "timestamp": 1729720800
  },
  {
    "username": "crito13",
    "rating": 8.3,
    "comment": "Still one of my favorite games of all time, even though I don't play it much (tough to find 6 other people who like it and have the time to play). Have started playing it online. The benefit of online is you can act without having to worry about getting friends mad. The problem is you can't \"read\" your opponents. Love the no luck aspect.",
    "timestamp": 1727474400
  },
  {
    "username": "DrakeStorm",
    "rating": 7.5,
    "comment": "A great game if you have 7 players and all day to waste. The mechanics are brillantly simple and the secret negotitating can be really exciting (I think more fun with friends than strangers). You can play with 6 if you have to, but anything less is just plain dumb. The biggest problem is once you get back stabbed and put into a weak, losing position, you are still in the game with your few pieces and then have the choice of wasting more of your time doing basically nothing, or quitting the game leaving your troops in civil disorder which has some impact on the game which is bound to piss someone off. Haven't played in years, but wouldn't mind with the right people.",
    "timestamp": 1726869600
  },
  {
    "username": "Sizzy",
    "rating": 8.4,
    "comment": "极为精炼的规则\n将人与人的动态平衡用到极致，外交游戏的顶峰",
    "timestamp": 1726696800
  },
  {
    "username": "dash.jp",
    "rating": 8.0,
    "comment": "• Well used.",
    "timestamp": 1725314400
  },
  {
    "username": "chrisgledhill",
    "rating": 8.0,
    "comment": "Not sure why this has its own BGG entry.\n\nI give the classic game 10. This version is very good, with excellent rules, but loses a couple of points for\n\n1) lifeless, generic art,\n\n2) odd shape of armies (still better than the plastic ones that came with Avalon Hill)",
    "timestamp": 1723068000
  },
  {
    "username": "cholmcc",
    "rating": 8.0,
    "comment": "A classic - half-coop, half-adversarial",
    "timestamp": 1721340000
  },
  {
    "username": "sutrebuh",
    "rating": 8.0,
    "comment": "Online via email or equivalent is the only good way to play it.",
    "timestamp": 1721253600
  },
  {
    "username": "gamesbook",
    "rating": 8.0,
    "comment": "The classic game of bluff and un-making friends.\nBelongs to: VIVIAN",
    "timestamp": 1720994400
  },
  {
    "username": "kastel",
    "rating": 8.0,
    "comment": "Dc4d",
    "timestamp": 1717797600
  },
  {
    "username": "zeotter",
    "rating": 8.0,
    "comment": "I love this game. I got to play a bunch times with my game group in the '90's but can't find anyone who wants to play it now.",
    "timestamp": 1716760800
  },
  {
    "username": "Citan7",
    "rating": 8.0,
    "comment": "I've played this several times now and I can safely say this is a fantastic game, but only for specific players. Need to find people that are 100% on board for actually talking to other players and definitely are on board to get over being salty if betrayed.",
    "timestamp": 1711407600
  },
  {
    "username": "Shimpy",
    "rating": 8.0,
    "comment": "With the right group of people, this can be a lot of fun.",
    "timestamp": 1708297200
  },
  {
    "username": "Pollux1969",
    "rating": 8.0,
    "comment": "Mean, meaner, Diplomacy! Cool system, but too long and definitely not for everyone...",
    "timestamp": 1703372400
  },
  {
    "username": "ashrockk",
    "rating": 7.8,
    "comment": "An all time classic. Only thing bringing it down from a 9 is that it takes all day and is rarely finished. Amazing, unique.",
    "timestamp": 1702594800
  },
  {
    "username": "riivan",
    "rating": 8.0,
    "comment": "I found I had the most enjoyment playing with 2-3 people per country with each controlling a different facet: government/diplomacy, navy, and army.",
    "timestamp": 1701730800
  },
  {
    "username": "OgieOgilthorpe2",
    "rating": 8.0,
    "comment": "X",
    "timestamp": 1701212400
  },
  {
    "username": "giampi",
    "rating": 8.0,
    "comment": "Mondadori Giochi version",
    "timestamp": 1697493600
  },
  {
    "username": "Guthwulfe",
    "rating": 8.0,
    "comment": "When you want to get 6 people together that you don't want to be friends with anymore!",
    "timestamp": 1694383200
  },
  {
    "username": "MurrayTO",
    "rating": 8.0,
    "comment": "Original edition (pre-Avalon Hill), with wooden fleets & armies in large long box, dark with gold lettering. Game is in Acceptable to Good condition. It has been played several times, many years ago. No damage to board or components. Box is well-worn (Acceptable?) and can use some taping up. Games is complete and includes wooden fleet and army blocks, and 17 conference maps. Sweetener: International Diplomacy Association's Diplomacy Handbooks from 1973, 1974 and 1975.",
    "timestamp": 1693778400
  },
  {
    "username": "Druivenclub",
    "rating": 8.0,
    "comment": "Hans",
    "timestamp": 1693778400
  },
  {
    "username": "theclay",
    "rating": 8.0,
    "comment": "A deep game that requires you to betray people at some point.",
    "timestamp": 1692568800
  },
  {
    "username": "colorado_gamer",
    "rating": 8.0,
    "comment": "Do Gooder Library",
    "timestamp": 1691618400
  },
  {
    "username": "JRLade",
    "rating": 8.0,
    "comment": "How could so many friendships be ruined by such a simple game? I wish I could play this more, but no one will play with me anymore. It was worth every friend lost, a classic.",
    "timestamp": 1689112800
  },
  {
    "username": "brettellmd",
    "rating": 8.0,
    "comment": "1959??? Is it really that old? Wow. Haven't played that whole deal-making, backstabbing game with my friends. Played a 2-player with my daughter, and even as a purely tactical battle game it stands quite well. Amazing for such an old design.\n\nI need to get a better version than this one though - too cluttered on map.\n\nSold in Sydney Noship Auction 2023 for $7",
    "timestamp": 1682028000
  },
  {
    "username": "Thasaidon",
    "rating": 8.0,
    "comment": "3-7p 180'+ - Great game, but you need to play it with Diplomacy-minded players who are willing to spend A LOT of time. I never quite finished a game...",
    "timestamp": 1680732000
  },
  {
    "username": "Musculus IV",
    "rating": 8.0,
    "comment": "A brutal game and a classic",
    "timestamp": 1680645600
  },
  {
    "username": "Mythagic",
    "rating": 8.0,
    "comment": "2-7",
    "timestamp": 1679526000
  },
  {
    "username": "CardiffElectric",
    "rating": 8.0,
    "comment": "G",
    "timestamp": 1676934000
  },
  {
    "username": "Riotgirl",
    "rating": 7.5,
    "comment": "I will never play Diplomacy face-to-face again (actually, I *would*), but I absolutely love playing via PEBM [backstabbr app]. Diplomacy shines when played via PEBM, due to the zero luck element, simultaneous order writing and resolution, without the 7-8 hours required to play in person.\n\nAn excellent and elegant game that perfectly captures and distills the often ruthless nature of geopolitics.",
    "timestamp": 1676761200
  },
  {
    "username": "4characters",
    "rating": 8.0,
    "comment": "If only it didn't take so long to play...",
    "timestamp": 1675897200
  },
  {
    "username": "Joekneebgoode",
    "rating": 8.0,
    "comment": "If you can get the right group of people together to play this, it can be an absolutely superb inter-personal gaming experience. Tense and strategic in the extreme, plus you get to know the map of Europe intimately.\n\nFirst played this as a 14 year old using a copy of the game owned by my School, and in conjunction with learning early 20th Century European history. Thoroughly enjoyable and memorable experience.\n\nBut be prepared for friendships and trust to be put through the wringer.",
    "timestamp": 1675897200
  },
  {
    "username": "HighChronicler",
    "rating": 8.0,
    "comment": "8/10, would stab bestie in the back again.",
    "timestamp": 1675810800
  },
  {
    "username": "okram",
    "rating": 8.0,
    "comment": "It's great and you can't convince me otherwise. Sure, it takes ages to play, has that dreaded player elimination in it, and getting violently stabbed in the back by a friend really hurts. But the negotiations, oh boy, the negotiations. It's a social experiment of the highest caliber. You try to the best of your abilities to detect the microexpressions of other players and you try to read between the lines when someone suggests you to do some drastic moves because it \"benefits you both\". Does it, does it really?!",
    "timestamp": 1673996400
  },
  {
    "username": "Londonside",
    "rating": 8.0,
    "comment": "This is not a well-balanced or comprehensive game. But for anyone's first board game battling other players over a map, and you allow time for diplomacy it is incredibly enjoyable. The tension of waiting for what countries around you are going to do brings back a lot of nostalgia.\n\nAs many have pointed out, the aggressive salesman usually wins, but additional house rules to keep people in the game can make it very fun.",
    "timestamp": 1673391600
  },
  {
    "username": "axsk",
    "rating": 7.5,
    "comment": "Perfect for what it does, IF you have the right people for it.",
    "timestamp": 1673305200
  },
  {
    "username": "curtnic",
    "rating": 8.5,
    "comment": "Great game! Played twice online. Soloed as France first time out!!!",
    "timestamp": 1757196000
  },
  {
    "username": "Jclancy15",
    "rating": 9.0,
    "comment": "I can't enjoy all this game has to offer, because the social process of playing well is a little too taxing for me to do regularly. However, it's obvious from even the gunboat variant how deep the texture of the map is. This foundation offers the richest opportunity for sophisticated negotiation that I am aware of in any game.",
    "timestamp": 1753826400
  },
  {
    "username": "JoeSteadman",
    "rating": 9.0,
    "comment": "My favorite game, its about pitting people against each other, cooperation and influence....a simple yet deep game.",
    "timestamp": 1752530400
  },
  {
    "username": "julian turner",
    "rating": 9.0,
    "comment": "The grand-daddy of strategy games and a personal all-time favourite, though it exists rather more in the memory now than with a serious prospect of being played. Ideally wants a whole weekend... those were the days!",
    "timestamp": 1752271200
  },
  {
    "username": "MAKOKI",
    "rating": 9.0,
    "comment": "There is a kind of magic on being backstabbed by a friend",
    "timestamp": 1749592800
  },
  {
    "username": "wagu_fann",
    "rating": 9.0,
    "comment": "Great game to play with friends if we have time, especially with a good friend group.",
    "timestamp": 1749420000
  },
  {
    "username": "svenbart",
    "rating": 9.0,
    "comment": "Best way to lose friends",
    "timestamp": 1748556000
  },
  {
    "username": "thespaniardsteve",
    "rating": 9.0,
    "comment": "2-7, 7",
    "timestamp": 1745445600
  },
  {
    "username": "Drelorean",
    "rating": 9.0,
    "comment": "A gem among classic board games, Diplomacy generates a maximum yield from simple gameplay elements. the map is brilliantly designed, the tactical choices require cunning, and the required strategic planning stands above all.\nThe 7 Powers all play completely differently, representing a near endless supply of replay value.\nThe big problem is finding the right group to play with, as your personal enjoyment will depend largely on it: people who say \"Monopoly and Risk ruin friendships\" have clearly never played Diplomacy ;-)",
    "timestamp": 1744840800
  },
  {
    "username": "ncc1701jv",
    "rating": 9.0,
    "comment": "The best worst game! The stories that have spawned from this will last forever. Would not recommend the same play group playing this without a significant time gap in between. Betrayals never quite go away - do they Michael?!",
    "timestamp": 1738450800
  },
  {
    "username": "scurvybuffdog",
    "rating": 8.5,
    "comment": "Diplomacy itself is an outstanding game. In my top 5 favorite of all time. Nothing else really compares to it. Player interaction is HIGH.\nHowever, do not buy the latest version featuring the box art in the picture given. The components in the newest versions are absolute JUNK. The manufacturer couldn't have done a poorer job choosing cheap cardboard components that are difficult to distinguish from one another. The only thing worth using in the game are the rules which are well done. I took the time to make a huge 8' by 6' map and use pieces made from a large wooden dowel. The result is worth it.\nDiplomacy itself is outstanding, this version of the game is NOT and is not reflected in my rating.",
    "timestamp": 1737414000
  },
  {
    "username": "Mr_Quacks",
    "rating": 9.0,
    "comment": "Diplomacy is a game I would easily give a 10, but it’s a tough one to get to the table. The ideal player count is 7, and it’s not always easy to round up that many people who want to play this kind of game. However, when the stars align, the strategic moments this game offers are some of the best I’ve ever experienced. With minimal mechanics but incredibly deep strategy, it’s a game that rewards negotiation, alliances, and betrayal in equal measure.\n\nTo keep the game moving and add an extra layer of chaos, I use a few house rules:\n\n5-minute Diplomacy phases and 1-minute writing orders phases: This keeps the game fast-paced and intense, forcing players to make quick decisions and preventing it from dragging on.\nFlashcards for writing orders: These add a fun roleplay element and help immerse players in the game's tense atmosphere. The physical act of writing orders on flashcards feels fitting and keeps everyone engaged.\n\nDespite its challenges in setting up, Diplomacy is a masterpiece of strategic gameplay, and the low mechanics but high stakes make it an unforgettable experience when it does hit the table.",
    "timestamp": 1736722800
  },
  {
    "username": "JohnDClair",
    "rating": 9.0,
    "comment": "Some of my most fun strategic experiences in my early adult gaming life were with this game.",
    "timestamp": 1736722800
  },
  {
    "username": "Mucholulli",
    "rating": 9.0,
    "comment": "The best game ever as far as I´m concerned... However... impossible to get to the table. Therefore no perfect score, but a decent 9...",
    "timestamp": 1735858800
  },
  {
    "username": "stinderdaad",
    "rating": 9.0,
    "comment": "Got backstabbed on the first turn, love it.\n\nThough I believe the fun is VERY dependent on who you play with.",
    "timestamp": 1726524000
  },
  {
    "username": "purplewurple",
    "rating": 9.0,
    "comment": "Oh if only it were easier to get 7 people together for hours and hours of gaming. And it really needs the right crowd; some people will get upset by the backstabbing, others are too passive and insecure... But, if you do get the right people together, there is no experience like diplomacy. This is the one game I wish I could play more often.",
    "timestamp": 1723932000
  },
  {
    "username": "skanking tea",
    "rating": 9.0,
    "comment": "Avalon Hill edition",
    "timestamp": 1718748000
  },
  {
    "username": "gamerdoge",
    "rating": 9.0,
    "comment": "considering its history, this game deserves a medal.",
    "timestamp": 1716328800
  },
  {
    "username": "espin",
    "rating": 9.0,
    "comment": "The elegance of the rules and total absence of chance are very appealing conceptually and, combined with the social engagement, make the game satisfying to play.\n\nThe difficulties are:\n- Finding enough players who are happy* to spend the time needed to play a 5-to-10-hour game and who are okay with deceiving and/or being deceived within the context of the game and its rules. Even if you find a full seven players who can agree to the above at a specific time, what if one of them drops out? Do you invite an extra player just in case? What do they do if everyone shows? The game is long enough to be an event, but sensitive to the precise player count.\n- Player eliminations. The game is too long to have someone sit and watch after being eliminated. I have some thoughts on a modified form of the game that could help with this, but meanwhile, see MrSmith's suggestions, below.\n- Typically, underwhelming and unrealistic consequences to not keeping your word. Maybe a mob or career theme would be more appropriate to the core strategy of backstabbing.\n- Kingmaking\n\n*I say 'happy' because one should never play a game with someone who wants to not play the game, and one should not attempt to play a long game with someone who is only content to play.\n\nFor myself and perhaps others to try, I repeat here a suggestion from 'MrSmith' on how to play with non-hardcore players:\n\"\nIMPERATIVE HOME RULES FOR FRIENDLY PLAY UNDER 3 HOURS:\n1. NO BACK TALKING (reduces 30% length): No one leaves the table (except for emergencies :-) ). Communication is open or made through written secret short notes.\n2. NO ELIMINATION (reduces 30% length): When one or more powers reach 0 or 1 supply centers, the game ends immediately. Player with most supply centers wins.\n3. NO BACKSTABBING: [this would drastically alter the tone of the game] Before attacking, supporting an attack or entering a nation's home territory, a declaration of war (DoW) must be issued at the beginning of the orders writing phase. In order to benefit from another power's unit support, an alliance declaration must also be issued by both powers.\n\"",
    "timestamp": 1715983200
  },
  {
    "username": "svengineer99",
    "rating": 8.5,
    "comment": "Rating is for the '2 player variant' posted to the Forums 20-Apr-2024",
    "timestamp": 1713650400
  },
  {
    "username": "MeneerPuffy",
    "rating": 9.2,
    "comment": "Both a game as well as a academic exercise in Neo-realist international relations theory, this game is in many ways the grandfather of all modern strategy games - both board and digital.\n\nTake any strategy boardgame that has been released in the past decade and then strip away all of its 'chrome'; the many rules, point-tracks, tokens and pieces of cardboard that serve to make the game more complicated without adding any meaningful complexity. Once removed, the game that remains is Diplomacy - the grandfather of modern strategy games.\n\nWhat constitutes complexity in a strategy game? In my view its the players evaluating positions- both their own and those of their opponents. Weighing the strengths and potential weaknesses of each other, trying to figure out whose is ahead and who to gang up on. To do so cooperation is required but trust is a scarce resource. The weak must appear strong to avoid being carved up. The strong must appear weak to prevent alliances against them. Thus everything depends not just on the board state; but the impression the players have of it.\n\nAs a consequence, gameplay no longer revolves around some wooden piece on a point track but around the human person sitting opposite of you. Can you trust them? Do they trust you? When they look at the board, do they see the same threats and opportunities as you do? Do your interests align, and if so, when will they start to diverge?\n\nNow, the limited set of rules, uncomplicated by themselves, have created a game that is infinitely complex as they are applied through the social interactions of a table full of people continuously evaluating, judging, scheming, lying and arguing.\n\nToo often boardgames 'kill the table'. With players staring in silence at boards filled tokens and trackers whilst everyone else waits for their turn.\n\nDiplomacy, despite its length, is a fast-paced game. All turns are taken simultaneously with no 'down time' in between. Players do not wait on each other and the table will never be silent. All gameplay is centered on the boardstate and the players. There are no 'secondary player boards', instead you get raw, undistilled strategy - continuous negotiations interrupted by those glorious moments of shock, betrayal, elation, and panic as the board state is updated at the end of each turn.\n\nSimple to learn, with rules that can be explained in a few minutes, yet impossible to master. This timeless classic hasn't aged a bit.",
    "timestamp": 1710630000
  },
  {
    "username": "svenbart",
    "rating": 9.0,
    "comment": "Friendship-Killer :-)",
    "timestamp": 1709938800
  },
  {
    "username": "Alvareze",
    "rating": 9.0,
    "comment": "Simple, but very strategic. Chess, but at seven! And with négociations!",
    "timestamp": 1706914800
  },
  {
    "username": "jager_fury",
    "rating": 9.0,
    "comment": "A shining example of elegant, excellent game design.",
    "timestamp": 1706742000
  },
  {
    "username": "RonCarlson01",
    "rating": 8.5,
    "comment": "S010",
    "timestamp": 1705791600
  },
  {
    "username": "Farne",
    "rating": 9.0,
    "comment": "Played my dad's copy of this game a few times in my late teens and no game experience has quite compared for the level of immersion and engagement. I remember sneaking around trying to spy on other negotiations going on round the house. The simplicity of the mechanics are pretty much perfect - no chance, no stacks of cards, just negotiating with (and betraying) your fellow players.\n\nThat said, it's long (not sure I ever actually finished the game), needs all seven players, and I think really requires the players to enthusiastically want to get into the spirit of the game. I also can imagine that played with the wrong people it could be quite bullying, but in the games I remember players who were too untrustworthy and duplicitous tended to lose out when other players realised they couldn't be trusted.\n\nWas perfect with a bunch of my late teenage friends, maybe a bit harder to imagine it working out so well now I'm 30. But if you think you have a good group and are keen to try this game, I'd definitely recommend!",
    "timestamp": 1705100400
  },
  {
    "username": "neiderhauser77",
    "rating": 9.0,
    "comment": "An absolute, presidential classic. This game teaches GUMPTION, RESOLVE, COMMUNICATION, & the art of DIPLOMACY.",
    "timestamp": 1704841200
  },
  {
    "username": "flinnbarker",
    "rating": 9.2,
    "comment": "If I ever convince someone to play this with me, I bet I'll love it.",
    "timestamp": 1702767600
  },
  {
    "username": "redlich",
    "rating": 9.0,
    "comment": "1976 Avalon Hill version",
    "timestamp": 1699398000
  },
  {
    "username": "kijoe",
    "rating": 9.0,
    "comment": "A classic! Game mechanics boiled down to bare minimum, giving a lot of room for intrigue, backstabbing and alliances",
    "timestamp": 1699052400
  },
  {
    "username": "Elusive2",
    "rating": 8.8,
    "comment": "The ancient classic. The most tense and dread-inducing strategy-game created.\n\nNot for the people who can't separate their feelings from a game. Beware.",
    "timestamp": 1699052400
  },
  {
    "username": "eerodek",
    "rating": 9.0,
    "comment": "Well played game from HS\npoor condition\nwooden pieces",
    "timestamp": 1697234400
  },
  {
    "username": "bonillarau",
    "rating": 9.0,
    "comment": "Esta versión original de un gran juego sigue siendo la mejor de todas. Un juego de gran sencillez y tremenda profundidad y emoción. Es complicado jugarlo en mesa porque hace falta juntar 7 personas durante bastantes horas. Yo he tenido más éxito creando partidas por e.mail, y hay varias páginas que ofrecen la posibilidad de jugarlo online. Se me da mejor montar partidas de Diplomacy que jugarlo. De hecho, lo juego fatal XD",
    "timestamp": 1694642400
  },
  {
    "username": "RichardIngram",
    "rating": 9.0,
    "comment": "The 1962 Intellectual Diversions edition.",
    "timestamp": 1693087200
  },
  {
    "username": "colorado_gamer",
    "rating": 9.0,
    "comment": "Do Gooder Library",
    "timestamp": 1691618400
  },
  {
    "username": "SuspiciousIndividual",
    "rating": 8.5,
    "comment": "Very fun game filled to the brim with backstabbing, but has 2 major problems.\n- Very difficult to get at least seven people at the same place at once\n- The game tends to last too long and diplomatic negotiations taper off towards the end\n\nGenerally, the game is very good!",
    "timestamp": 1689976800
  },
  {
    "username": "JimHackerMP",
    "rating": 9.0,
    "comment": "Has 1971 Games Research Ed. rules with it, so not sure if that was put in as substitute and it's really the 1961 ed. or what; but the box indicates it really is the '61 ed (old-style American address in corner). Love the wooden pieces; just wish there were more of each color so you do not run out as you get closer to victory! Very nice large map which folds in half! Another downside: no supply center ownership markers, as the 1999 Hasbro ed. has. Like the AH 1985 ed., there are only 8 army blocks and 8 fleet blocks per player so you might run out as you get closer to victory. Unfortunately this has never been a problem for me in Diplomacy",
    "timestamp": 1687989600
  },
  {
    "username": "Timbunn",
    "rating": 9.0,
    "comment": "Exactly what it says on the box. A true negotiation game.",
    "timestamp": 1687384800
  },
  {
    "username": "DeskJet86",
    "rating": 9.0,
    "comment": "Oh how I wish I could find enough people near me to play this FTF...",
    "timestamp": 1685397600
  },
  {
    "username": "ultimoratio",
    "rating": 9.0,
    "comment": "The OG remains the best of these Diplomacy-style games. Its imitators often make this serious flaw where they put so much crap on the design (looking at you, Game of Thrones: the Board Game) that is actually intervenes or hinders the player interaction of Diplomacy.\n\nVariants: highly prefer having shorter time on diplomacy which forces players on thinking intuitively and manages prioritises. The short time can also be used to pressure and bully players when negotiating.",
    "timestamp": 1683237600
  },
  {
    "username": "Ranior",
    "rating": 9.0,
    "comment": "I got to play this a lot during High School with my friends. We played so many games, including some online. Therefore it still has a warm spot in my heart, and I do still love it. But I've come to realize that the player elimination aspect coupled with long play time makes it incredibly difficult to get to the table, especially with the 7 player requirement. And even when I do get it to the table, something is missing when playing with newer/inexperienced players who don't know the nuances of the gameplay that can also really impact my enjoyment of playing this one. Still, I will almost always play this if there is a chance to--simply because it is so difficult to get a chance to play.\n\nThis is a wonderful game to enjoy and play online async though, in many ways it almost is better there. You can really dive deep in the negotiations and planning that can be difficult to do in a live game. There used to be a rich postal scene for the game, so in some ways it feels like Diplomacy was far ahead of its time and was waiting for the internet to come along and let it really shine. Online the player elimination parts along with requiring exactly 7 players are much easier hurdles to overcome, plus you can't see who is talking to whom which can sometimes kind of spoil the in person experience. Having a computer adjudicate complicated sets of orders is also handy.\n\nUpdate (May 2023): Upping this to a rightful 9 where it belongs. I still play a few times per year, mostly async, although I do play in person here and there, and have some growing hopes to do so slightly more regularly. Regardless, it still absolutely is an event type game, that is tricky to plan and organize as an adult in the modern game scene, oh to go back to those days of youth where we dove in to this on so many weekends and even some daring weeknights with fast rounds!\n\nRegardless, there is nothing still quite like this. It's so visceral in what it does, it's simply negotiation, but a hell of a lot of it. You plan and plot and try to make allies, then the intense reveal of orders, and you simply do that again and again as a grand epic plays out in front of the players. No randomness, no confusion. The fact you have failed is directly due to the other players take your stuff, and reneging on our plans. That brutal truth can crack friendships as the game infamously is known to do, but that's part of the point here....no other game makes one feel quite so much, and while it can suck to feel that pain, there can be a sort of joy in it? Most games you can care less what happens, and perhaps that is better, but if you want a jolt of emotion with your game, Diplomacy can bring it out far more than anything else.\n\nIs that good? Eh, it's not always something one wants. But given nothing else provides it, I think it's a great design and worth play here and there. You get more intensity and more negotiation out of a good game of Diplomacy than you can in whatever else has come out since.\n\nI often liken this to the TV reality show Survivor--both games are actually social games, where winning requires you to advance your own cause at the expanse of others, and winning often comes with some backstabbing and turning on promises with people you've repeatedly build up alliances and trust with. Winning is therefore quite hard, as you have to manage this path well enough that people want to help you win, even when they know what has happened to get you there. Much like Survivor, players who get eliminated hopefully have the right mindset and understand that it is a game, and one they signed up for, but you still sometimes see those who are enraged and pissed about what has happened, and one time friends can be broken. Diplomacy is known to do that too, although again is it the game's issue, or a player? It perhaps is a bit of both, but the game doesn't hide what is going to happen, and someone teaching it shouldn't hide it either.\n\nIn the end, to experience exquisite highs of plans all coming together and masterful manipulations, one has to be prepared for the largest lows you'll get in a game, the unrelenting reality that your ally and friend screwed you over and you're going to lose because of it as everything you worked for and planned has crumbled in the face of the lies, treachery and betrayal.\n\nAgain, it may well not be the experience for many, but for anyone who is excited by trying such a thing, nothing will deliver the jolt that Diplomacy so consistently has and does.",
    "timestamp": 1682892000
  },
  {
    "username": "ExcellentRaven",
    "rating": 9.0,
    "comment": "The classic. Often replicated, never improved. Like the in person 6 hour version over the 6-month 1/wk email version.",
    "timestamp": 1681682400
  },
  {
    "username": "kzinti",
    "rating": 9.0,
    "comment": "Best strategy game out there. No dice. Just trying to outwit your opponents. It definitely feels like a WWI push-slog. Not for the faint of heart though. You cannot win this unless you make alliances, and later on break them.",
    "timestamp": 1676847600
  },
  {
    "username": "tangomargarine",
    "rating": 8.8,
    "comment": "Have played in-person 3 (?) times. In-person vs online games are very different beasts.\n\nOnline, I've got over a dozen games under my belt. 24-hour turns leave plenty of time for diplomatic haggling and alliance-making (and -breaking) that you lack in face-to-face game. Much more opportunity for intrigue and betrayal, and players are less likely to get tired of the game and want to call it a draw early.\n\n...not that most games of Diplomacy don't end in a draw online, though. If somebody manages a solo victory, it usually means they significantly outclassed the competition, or the other players majorly screwed the pooch at some point and failed to unite against the leader for some reason.\n\nNo other game quite like it. I'm not a social person by any means, but those first two years when you're trying to convince your neighbors to ally against somebody else nearby really get the blood pumping.\n\nPlay it online",
    "timestamp": 1672959600
  },
  {
    "username": "jcameron",
    "rating": 9.0,
    "comment": "There is no game in the world like the first 4 turns of Diplomacy",
    "timestamp": 1669849200
  },
  {
    "username": "mobiusband96",
    "rating": 9.0,
    "comment": "My favourite game. Rarely get it to the table because it needs 7 people who are willing to dedicate a day to it. It has plenty of flaws but I just haven’t found another game that creates as emotional responses to a turn.",
    "timestamp": 1669676400
  },
  {
    "username": "marcx",
    "rating": 9.0,
    "comment": "Als de mensen elkaar liggen en een en ander van elkaar verdragen is dit een mooi spel. Maar je moet tegen je verlies kunnen en de tijd hebben. Ook online regelmatig gespeeld maar dan is het onderhandelen niet zo leuk.",
    "timestamp": 1668812400
  },
  {
    "username": "szurla",
    "rating": 9.0,
    "comment": "B4",
    "timestamp": 1665957600
  },
  {
    "username": "rumble_tusk",
    "rating": 9.0,
    "comment": "Great game but don't ever play with work colleagues and think hard before playing with friends / family.",
    "timestamp": 1665180000
  },
  {
    "username": "MarechalGrouchy",
    "rating": 8.8,
    "comment": "-WAR-\n\n7p\n\n22x24 map",
    "timestamp": 1662933600
  },
  {
    "username": "geordienp",
    "rating": 9.0,
    "comment": "Board Games' coming of age, a revelation back in the seventies. Flawed but brilliant.\nSeveral earlier plays",
    "timestamp": 1662415200
  },
  {
    "username": "KillerWithaG",
    "rating": 9.0,
    "comment": "A brilliant simple game, but best with 7 players so not played so often. When played with 7 it is one of the best games for simplicity and excitement but people can get knocked out early.",
    "timestamp": 1651960800
  },
  {
    "username": "Robert Osvalds",
    "rating": 9.0,
    "comment": "Its not really a game about seven world powers. Its about pitting people against each other, cooperation and influence. The many critics out there who see it as a shallow game of backstabbing and lying just don't get it. Some of my favorite DIPLOMACY experiences have been in games that I didn't win.",
    "timestamp": 1651528800
  },
  {
    "username": "MormonVoodoo",
    "rating": 8.9,
    "comment": "Absolutely love this game. I can play it with friends, and with strangers, but usually not with a mix. The chief reason for this being: I love the balance of this game. The large push to escape the \"random chance\" element that is always so prevalent in board and card games. Instead, there is a heavy reliance on your own social skills, strategic wisdom, and even your overall willpower. However, when there is a combination of strangers and close friends in a single game, I feel like it unbalances the diplomatic element. Some people know others well already, and so there are all ready unbalanced relations set up in advance. But maybe that mirrors real-life diplomacy. I'm probably just bitter from always being betrayed my closest friends in this game haha. Definitely a favorite though. It would be a 10, if it weren't for the replay value. After 10 or so games with the same people, they start to replicate past games. Needs a changing crowd. But love it nonetheless.\n\nUpdate. Playing this game with the right group is essential for a good experience.",
    "timestamp": 1646262000
  },
  {
    "username": "Quartzgamer",
    "rating": 9.4,
    "comment": "Played many times postally and ftf, I realise it is not everybody's cup of tea, but when time allows, this played by 7 people who enjoy the game is fantastic.\n10/06/84 (p): playing like this is a lot harder than you expect!\n15?/07/84 First experience of Manorcon, 2 played and reasonable results against the experts.\n10/08/84: (P) Mesklin & Trantor:\n29/10/84: (P) + Gramayre:\n12/12/84: Need to try playing the wicked Witches.\n01/04/16 (P):\n04/04/16 Yes another game - really enjoyed it.\n03/05/16 (P): The game gets better and better.\n14/05/16 (P): Heading to a climax.\n02/06/16 (P)(FoN) This could break the enemies defence line.\n14/06/16 (P)(Ode) Last ditch defence here, can I hold the line?\n02/08/16 (P): Why do I have bad feelings about this game, I suspect I am about to be stabbed!\n09/08/16 (P):Gunboat variant: Am on my way out of this one as E against a F/G combination. have weakened F but not long to survive here methinks. Although suspect G may now cruise through F.\n09/08/16: (P): Much better here but stalemated in North. hoping southern allies get the breakthrough which will give a chance for a push.\n18/08/16 (P): Gunboat - Different game to above- but one that is definitely going better, so far!\n19/09/16: (P): Dis is going quite well, lets hope it stays that way.\n11/10/16P): Krukhut: Hmm interesting, having to watch I & R & T as Austria is not easy but there is hope as long as supposed ally does not turn on me!\n17/10/16: (P): Danaerys: Seems to be going well but there seems no logic to the way that certain over players are playing.\n23/10/16: (P): Dis: Very stalemated at the moment but hopeful that things will improve:\n24/10/16: (P): Krukhut: Still struggling to play Austria but it is getting easier. Fingers crossed:\n05/11/16P): Dis - There could be a break through coming!\n20/11/16P): Danaerys: Opening up but could go either way! Interesting to see next turn!\n01/12/16: (P): Dis - Still no break through but fingers crossed.\n09/12/2016: (P); Krukhut: OK have they stabbed me?\n22/01/17: (P): Danaerys: So far so good - trying to reorganise position:\n27/01/17: (P): Krukhut: They haven't as yet so still hope!\n06/02/17: (P): Krukhut: Trying to push a new alliance & Danaerys: Trying to stave off an attack!\n09/02/17: (P): Looks like possible game end as a draw, not a lot I can do about it.\n09/03/17: Played intimate Diplomacy ( 2 player version) - excellent 2 player game.\n07/04/17: (P): Krukhut. Hmm - well the stab has hit - can I hold the line - only time will tell.\n01/05/17; (P): Danaerys: Now the battle commences.\n12/05/17: (P) Krukhut: Time to form Le Grand Alliance:\n13/06/17: (P): Danaerys: Hmnn going out here, Turkey has got A/F/I/R all under control. Grrrrr\n26/06/17: (P): Kruhkut: Oh well, no one is listening, so we will all go under one by one!\n16/07/17: (P): Danaerys: Looks like I am going down - all of them under Turkeys thumb. Won't give up tho!\n23/07/17: (P): still unsure which way this one is gpoing.\n11/08/17: (P): Danaerys: 6 way draw - better than expected.\n11/08/17P) Kruhkut: Stuck in a hole!!!\n01/10/17P) Very frustrating, having to defend against a leader , whilst other country gets undeserved 2nd, and two others fight each other and ignore the rest of the board! Grrrrr.\n05/11/17: (P) Krukhut. See previous comments - Frustrating:\n23/11/17: (P) Kruhkut. Not my happiest game.\n29/01/18: (P) Kruhkut. Still in but not for much longer,\nsigh.\n11/02/18: Q99:\n08/04/18: Q101:\n25/05/18: Q102:\n08/06/18: Dimitrea?\n27/06/18: Q103:\n28/08/18: Q104:\n14/10/18: Dimitra.\n24/10/18: Q105:\n27/10/18: Dimitra.\n14/01/19: Dimitra. Sigh, although still in there for the moment.\n25/01/19: Redbeard:\n14/02/19: Dimitra:\n25/03/19: I do enjoy a game of Diplomacy.\n07/04/19: Russia - going ok til A & T ganged up. Grrr\n11/05/19: Russia again - my weakest country methinks.\n16/06/19: Think that confirms Russia as my weakest country - sigh - sooo frustrating:\n30/09/19: Keep trying to play Russia but don't get any better, sigh.\n10/11/19: Still not getting the hang of Russia.\n21/01/20: TLGC -\n28/01/20: TLGC - Went well:\n03/02/20: Alex Obs:\n04/02/20: TLGC -\n11/02/20: TLGC.\n18/02/20: TLGC Yet another excellent game:\n19/06/20: Interesting - 1st ever successful R - G alliance that worked.\n10/11/20: At last a 3 way draw. Not quite a win but!\n15/11/20: Definitely feeling stronger.\n04/01/21: 5 player Mercator:\n12/02/21: Mercator again but Russia is a pain to play\n10/03/21: WW1 - Forgotten how good this 2 player is!\n13/03/21: Mercator 5 up: Short straw? Lol",
    "timestamp": 1644015600
  },
  {
    "username": "Kotro",
    "rating": 9.0,
    "comment": "Personal rating: 5/5\n\nNow here's a dilemma... One of my favourite board games ever... which I would never play in physical format. This game was made for the age of internet and online play, where you can agree to take as much time as you want, scheme away and mail people your plans, and then watch it unfold. As a person to person experience, I wouldn't bother, there are better, shorter options in the market.",
    "timestamp": 1642460400
  },
  {
    "username": "Luam",
    "rating": 9.0,
    "comment": "Only ever played online. I love it. Every aspect of it.",
    "timestamp": 1638658800
  },
  {
    "username": "b0laroid",
    "rating": 9.0,
    "comment": "most exciting excuse to stare at a map for hours",
    "timestamp": 1635980400
  },
  {
    "username": "HankMcCoy78",
    "rating": 9.0,
    "comment": "Back-shelf.",
    "timestamp": 1635285600
  },
  {
    "username": "OGBNdahouse",
    "rating": 9.0,
    "comment": "Possibly the best game ever. I wish people didn't take the backstabbing personally!",
    "timestamp": 1625263200
  },
  {
    "username": "alexintour",
    "rating": 10.0,
    "comment": "First of all – it’s just a game. Remember this.\nNo dices at all, so if you’re unlucky with dices, this is the game for you.\n\nDiplomacy is just about your negotiation skills with other people and your ability to see when your ally is telling you a lie and your enemy tells you the truth.\n\nThere are 7 players in a game, so normally 1 winner and 6 losers. Just get used to it. Your odds on winning are not that great. You have to try hard.\n\nIf you can’t separate game and real life this game will hurt you a lot.\nIf you can, it will get you fun, friends and new experiences*\n\n(* - only if you remember the first line of this comment)",
    "timestamp": 1760565600
  },
  {
    "username": "EshR",
    "rating": 10.0,
    "comment": "10/10 love bullying my friends then immediately getting my a** kicked cause they all hate me now",
    "timestamp": 1758232800
  },
  {
    "username": "kwhite1",
    "rating": 10.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "jaypol36",
    "rating": 10.0,
    "comment": "the OG",
    "timestamp": 1753221600
  },
  {
    "username": "sorcretic",
    "rating": 9.5,
    "comment": "Feb. 2025 #50: Diplomacy might be my only high school/college game to still make this list. I've only played twice in person, but played much more on various online judge sites. I'd read opening strategy and do tactical puzzles on the Diplomatic Pouch. Though I haven't played in years, Diplomacy still fascinates me. At the time I played a lot of dice-chuckers like Risk and Axis & Allies, and Diplomacy's elegant simultaneous deterministic combat system was very appealing to me. I'd spend evenings working out the chess-like permutations of different order sets. Of course, tactics are secondary to negotiation, and I much preferred composing the perfect e-mail to stilted IRL discussions, which felt rushed (even though the IRL game is very long).\n\nJan. 2024 #36: I rarely play this these days and would only play async, ideally with people I don't know that well. Diplomacy is one of the few games I've read strategy articles about, and the only game from my younger years that remains on this list.",
    "timestamp": 1750802400
  },
  {
    "username": "Hugo_de_Nose",
    "rating": 10.0,
    "comment": "Brilliant, at least 4 players required",
    "timestamp": 1749420000
  },
  {
    "username": "ColinONeill",
    "rating": 10.0,
    "comment": "One of my all time favorite games. Probably best played via email. With people you may never see again. Or with friends with you don't mind losing.",
    "timestamp": 1743976800
  },
  {
    "username": "GomJabbar",
    "rating": 10.0,
    "comment": "My Rank: 1\n\nGreat having another vintage copy of my favourite game of all time.",
    "timestamp": 1743631200
  },
  {
    "username": "Paddy_002",
    "rating": 10.0,
    "comment": "Obwohl es nur 1 Partie war, diese wurde auch nicht beendet, so hat Diplomacy mich doch überzeugt. Kein Spiel hat mich und meine Mitspieler das gleiche Fühlen lassen wie bei Diplomacy, es ist ein völlig anderes Spielgefühl und ich liebe es.",
    "timestamp": 1743289200
  },
  {
    "username": "anton",
    "rating": 10.0,
    "comment": "What can I say? Gamers of every stripe need a copy of this one in their collection.\nMy copy is the 1959 original with the maroon box lid, the modified Denoyer-Geppert mapboard and the wooden game pieces.",
    "timestamp": 1740697200
  },
  {
    "username": "jackadven",
    "rating": 10.0,
    "comment": "I purchased this to get the new wooden pieces.",
    "timestamp": 1740524400
  },
  {
    "username": "britchey",
    "rating": 10.0,
    "comment": "Wooden pieces\nonline\n7sb, 6sc, 5s, 4s",
    "timestamp": 1740092400
  },
  {
    "username": "Yokhen",
    "rating": 10.0,
    "comment": "Best Wargame Ever.",
    "timestamp": 1724104800
  },
  {
    "username": "Istvanffy",
    "rating": 10.0,
    "comment": "Great multiplayer game of international politics - certainly the best introduction to politics (and its intrigues) I know. Diplomacy is a great way to study human behaviour, thinking skills, strategy, and negotiations. Fantastic re-play-ability.\n\nI have organized a Diplomacy game (face-to-face) or a Diplomacy Tournament almost every year since the late 1970s; mostly in Calgary, Alberta, Canada. Other locations include: Beaconsfield, Quebec and Baton Rouge, Louisiana and Vancouver, British Columbia. It has been a lot of work but I think this game teaches so many lessons that it deserves special effort to get people together to play this exceptionally great game.\n\nWARNING #1:\nDiplomacy can be hard on relationships. Because forming alliances (leaving the possibility of backstabs) is central to the strategy of most games it can be hard for players who find it difficult to be betrayed. Diplomacy can be emotionally challenging when the political realities of self-interest, dishonesty, bad-faith and greed are revealed during games.\n\nOn the more positive side; mature adults benefit from the trials associated with the experiences gained from playing Diplomacy. I highly recommend the game for all those who want to understand politics, history or human nature.\n\nWARNING #2\nGames require a lot of time to play well. I usually find 6 hours is best. A game can be played in 4 or 5 hours but will not likely lead to a decisive conclusion - even if played for 7 or more hours. Thus it takes a lot of effort to organize a game.\n\nOn the positive side; it can be a great game to play over extended periods of time such as once a week. Some of my favourite games when going to University were when we played 2 or 3 moves per week.\n\nDiplomacy is a fantastic game. Highly recommended.",
    "timestamp": 1721167200
  },
  {
    "username": "chiefsachem",
    "rating": 10.0,
    "comment": "Excellent condition. Only a few sheets used. Not everything is punched out.",
    "timestamp": 1714341600
  },
  {
    "username": "Galedion",
    "rating": 10.0,
    "comment": "Arbeitszimmer",
    "timestamp": 1712872800
  },
  {
    "username": "JR66",
    "rating": 10.0,
    "comment": "A classic and great game if have lots of time",
    "timestamp": 1709938800
  },
  {
    "username": "GlorifiedGutsyGaming",
    "rating": 10.0,
    "comment": "I can see why people would have some disdain from the stabbing, but it's a game. It's a great one at that. Simple and not too clunky, but thinky.\n\nI'd say that as far as improvements go the colors of nations can be challenging. I prefer the color scheme of one of the digital implementations. The meeples for units are hard to tell apart so I prefer the unit tokens instead and I think that could be improved at a much larger cost I'd assume. The balancing of the game is also tough to say. I think without having unique player powers they almost have them just by geography. Like some countries are very water heavy or rely more on diplomacy than might.\n\nI'd love to see expansion maps be released physically.",
    "timestamp": 1709679600
  },
  {
    "username": "leshazlewood",
    "rating": 10.0,
    "comment": "A lovely game, but can rarely find enough friends with time on their hands to play face-to-face.",
    "timestamp": 1707174000
  },
  {
    "username": "chrisgledhill",
    "rating": 10.0,
    "comment": "+ Chess for seven clever liars.\n+ Beautifully streamlined mechanics.\n\n- Once betrayed and beaten badly, it is hard to come back to the table.\n\nJeu épuré, magnifique : ça fait mal quand on perd, mais on y revient.\n\nĜenro : Tiu ĉi ludo kreis sian propran ĝenron: Diplomatio-ludo! Ege reludinda.",
    "timestamp": 1707087600
  },
  {
    "username": "Bobit",
    "rating": 10.0,
    "comment": "VDiplomacy! To date the best async. Hundreds of maps, I have some specific tastes now and would be bored of classic. So interesting in that it is entirely positional. Very heavy on the unique 3-way-draw mechanic, which can be controversial. Surprisingly slow and confusing to in-person games.",
    "timestamp": 1702335600
  },
  {
    "username": "Bitsinthesky",
    "rating": 10.0,
    "comment": "Really needs 7 players. This is gaming at its purist. After a game I feel ive just walked out of an exam. Haven't lost any friendships over it yet, but there have been some close calls.",
    "timestamp": 1701644400
  },
  {
    "username": "XenonRadon",
    "rating": 10.0,
    "comment": "It's the best game ever in my mind.\nBrief rules.\nNo dices or cards.\nFull of strategy and fun.\n\n-Commented after playing 500+ games (of many variants), ranking top 20th on vdiplomacy.",
    "timestamp": 1696716000
  },
  {
    "username": "a910230",
    "rating": 10.0,
    "comment": "It is not a game but an art.",
    "timestamp": 1696629600
  },
  {
    "username": "pmyip",
    "rating": 10.0,
    "comment": "C4CB",
    "timestamp": 1693864800
  },
  {
    "username": "colorado_gamer",
    "rating": 10.0,
    "comment": "Do Gooder Library",
    "timestamp": 1691618400
  },
  {
    "username": "CooCoo333",
    "rating": 10.0,
    "comment": "absolutely brutal game. I love it.",
    "timestamp": 1689544800
  },
  {
    "username": "Conrad1978",
    "rating": 10.0,
    "comment": "I have started to love playing this online. I would love to do this one face to face. Update I have played face to face. I cannot begin to describe how amazing this experience was.",
    "timestamp": 1686520800
  },
  {
    "username": "bcarlisi",
    "rating": 10.0,
    "comment": "3D printed fleets & armies (ships/tanks)",
    "timestamp": 1686520800
  },
  {
    "username": "deldamiano",
    "rating": 10.0,
    "comment": "Amazing game of diplomacy and conquest, the luck has no relation with the way to victory,and 1 big pleasure and tension writting your orders !",
    "timestamp": 1685052000
  },
  {
    "username": "fmuehlboeck",
    "rating": 10.0,
    "comment": "CBR",
    "timestamp": 1682632800
  },
  {
    "username": "rlowke",
    "rating": 10.0,
    "comment": "Simply a great game. Created in 1954, and arguably the grandaddy of historical war games. I think it's the earliest board game of the genre still actively played (ignoring things like chess and checkers). Unique, original, and one of the best. You need at least 5 players though. And yeah, it tends to cause arguments and break-ups between friends.",
    "timestamp": 1679526000
  },
  {
    "username": "MotherMary",
    "rating": 10.0,
    "comment": "Should be ranked with chess. However it is multiplayer so it is different and more parallel. Both are still equal as best, most pure multiplayer games ever made. You can write their rules on a napkin, the game is the people. Anyone who doesnt get this game is similar to someone who can't think a turn ahead in chess, or thinks a pawn move is a simple pawn move. Stick to no confrontation, no politics, no luck euros please. Some people dont like their games in more than pure one dimension and that is okay, but I find those games so lacking what these games have and would rather play this once a year than a typical euro once a week.",
    "timestamp": 1679526000
  },
  {
    "username": "Spartan519",
    "rating": 10.0,
    "comment": "This is a classic in every sense. Cut my teeth on this back in the 80's and even played at GenCon with the big boys a few times. Love it!",
    "timestamp": 1679439600
  },
  {
    "username": "michaos12345",
    "rating": 10.0,
    "comment": "This is the ONLY game I’ve rated as 10/10, and that is a serious rating. This game deserves it. Why? The mechanics are simple, there aren’t a lot of pieces, the board isn’t overly complex. To the naked eye, this is a relatively simple game. Why 10/10? Because the beauty of this game is the players playing it. There’s no luck, no dice rolls, no cards, just you and the other players negotiating, promising, betraying, and fighting for European supremacy. You need to form alliances and know when the time is right to break those alliances. The best way I can describe this game is it’s all about the human experience. Any real strategy board gamer needs to play this game at some point in their life. There are 2 downsides to the game: if you can’t find 7 players to play a full game the experience is diminished. There are ways to still play the game with less than 7, but the more players involved the better the game. Diplomacy tends to take a large amount of time, so finding 7 players that are committed to spending a day playing this game can be challenging. That being said, you will not beat the experienced of a 7 player game of diplomacy.",
    "timestamp": 1679007600
  },
  {
    "username": "Ozzie",
    "rating": 10.0,
    "comment": "James is borrowing it",
    "timestamp": 1672527600
  },
  {
    "username": "cnedrow",
    "rating": 10.0,
    "comment": "Unforgiving & brutal but always memorable. Pure strategy, manipulation, & deception at it's finest!",
    "timestamp": 1672441200
  },
  {
    "username": "RogerDHyman",
    "rating": 10.0,
    "comment": "I own this edition, as well as three (3) newer editions, and Colonial Diplomacy. The classic negotiation game. Have always enjoyed playing.",
    "timestamp": 1671836400
  },
  {
    "username": "Sir Pent",
    "rating": 10.0,
    "comment": "I really love playing this game. But it takes FOREVER, and is only fun with 7 players who HAVE to be REALLY GOOD at separating what happens INSIDE the game from REAL LIFE! Therefore, this almost never gets to be played.",
    "timestamp": 1671058800
  },
  {
    "username": "Chrismas22",
    "rating": 10.0,
    "comment": "Le Roi des Jeux de Société",
    "timestamp": 1669417200
  },
  {
    "username": "drontnet",
    "rating": 9.5,
    "comment": "My favorite diplomacy game.",
    "timestamp": 1663711200
  },
  {
    "username": "tomppa",
    "rating": 10.0,
    "comment": "variant",
    "timestamp": 1663624800
  },
  {
    "username": "Culkasi",
    "rating": 9.5,
    "comment": "Wow, what a game. I can see problems if people come in with preconceived ideas of who they will play with/against, but in a good group where no one is biased, this game plays really well. The only negative - the time it takes to play it",
    "timestamp": 1663624800
  },
  {
    "username": "Phredd3",
    "rating": 10.0,
    "comment": "This is the most intense and immersive game I've ever played, period. FTF, this occupies six-plus hours of time fully and completely, with no time or or even inclination to do anything else. Even a called bathroom break is a time for intense negotiation. As PBEM, you can spend as much time crafting the exact right language to your neighbor in the game as you spend drafting the exact right language to send to your client...and it's debatable which one you subjectively feel is more important! Simply a brilliantly crafted game. It isn't for everyone, but for those who can laugh at the end and recognize that it really was just a game, it may well be the best gaming experience ever.",
    "timestamp": 1659477600
  },
  {
    "username": "Sebyphume",
    "rating": 9.7,
    "comment": "The best game of negotiation.\n\nNo random and simultaneous choice is the key of its success.\n\nA good mix of strategy, bluff, seduction and psychology makes it one of the richest games.\n\nCan be played only with 7 players for a balanced game.",
    "timestamp": 1655330400
  },
  {
    "username": "ProudNitro",
    "rating": 10.0,
    "comment": "Fantastic game that will permanently break the trust your friends have placed in you, if you can get 7 interested friends together to play it.",
    "timestamp": 1653516000
  },
  {
    "username": "AmoralGamer",
    "rating": 10.0,
    "comment": "Literally my favorite game. Always trying to get people to play, but you have to be bold to tackle this gem!",
    "timestamp": 1648162800
  },
  {
    "username": "GamesRGames",
    "rating": 10.0,
    "comment": "This is one of my favorite games of all time. It's not for everybody, but it pulls out aspects of human nature that other games ignore completely. It is a long, interactive game with very simple choices in a simultaneous action resolution system. What makes the game is talking to other people. I've had games that I won where I felt terrible for backstabbing my closest friends, and games where my friends stuck by me when the whole table was against me. I've had games where I wasn't certain whether I was helping somebody or manipulating them. This is a game that is always intense and interesting, and I love it.\n\nI haven't played this often, but every time I play it is a genuine event and never fails to be interesting.",
    "timestamp": 1643238000
  },
  {
    "username": "Arecius88",
    "rating": 10.0,
    "comment": "Love this game! Want to play more!",
    "timestamp": 1640300400
  },
  {
    "username": "Tietie007",
    "rating": 10.0,
    "comment": "Génial !",
    "timestamp": 1636585200
  },
  {
    "username": "LordHaas",
    "rating": 10.0,
    "comment": "You will lose all your friends but it will be worth it.",
    "timestamp": 1635807600
  },
  {
    "username": "Cuchulainn1795",
    "rating": 10.0,
    "comment": "A fine, all skill game requiring a cool, strategic mind, a command of the art of diplomacy, and a ruthless streak a mile long.\n\nA genuinely fantastic game, but it must be played by the right group of people. I've seen friendships come to bitter ends because of this game, and indeed I would never again play this with any of my pals.\n\nBUT... if you can find the right people, and if they know how to play, the game can be nothing short of a work of art.",
    "timestamp": 1634767200
  },
  {
    "username": "Zamba Bone",
    "rating": 10.0,
    "comment": "Hell of a game. Hard work. Its nature is quite incomparable. A genre of its own.\n\nProbably never going to play it again.",
    "timestamp": 1634421600
  },
  {
    "username": "Azor Ahai VII",
    "rating": 10.0,
    "comment": "One of the best experiences I have had board gaming. So much so, that I wrote and showcased a whole presentation about my experience with the game for a college class. Not many games could be showcased in such a way and draw admiring \"Oooh\"s and \"ahhh!\"s from students as I recount the many bloody betrayals and highstakes interaction between players. If there is one complaint I have, it would be the sticky situation of hurt feelings after an especially cruel backstab between close friends. For that, I highly recommend anonymous online services.",
    "timestamp": 1630879200
  },
  {
    "username": "Postius",
    "rating": 10.0,
    "comment": "This is how games should be",
    "timestamp": 1627423200
  },
  {
    "username": "TrapperGus",
    "rating": 10.0,
    "comment": "Intense game where the outcome are driven by players dealing with each other.",
    "timestamp": 1626472800
  },
  {
    "username": "PhiloEpisteme",
    "rating": 10.0,
    "comment": "Easily one of my favorite games. The cliche, \"diplomacy can ruin friendships\" can be true. To avoid this pitfall it is best that players set table rules for conduct, language, etc. When playing in person it is also best to plan on fun activities for eliminated players.",
    "timestamp": 1626386400
  },
  {
    "username": "hyperhopper",
    "rating": 10.0,
    "comment": "A brilliantly simple game that focuses purely on negotiation; the barebones war mechanics serve only as a vehicle to drive player negotiation, alliances and backstabs.",
    "timestamp": 1623621600
  },
  {
    "username": "DanFred",
    "rating": 10.0,
    "comment": "I've only played one game of Diplomacy, but it was one of the most enjoyable gaming experiences I've had. I love the epic feel and treachery. One of the best games I've played. It's great fun to learn how to be a master manipulator and to know how to get people to trust you and when to betray them. Diplomacy is a great way to learn about the prisoners' dilemma. I can't wait to play again.",
    "timestamp": 1621548000
  },
  {
    "username": "Mossflower_Wanderer",
    "rating": 10.0,
    "comment": "An all-time classic!",
    "timestamp": 1618696800
  }
]