[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I like the concept, but in practice it’s mostly studying these payout split charts to see where the majority of the benefit lies. After several games I still can’t remember where the change is waiting. And the first round is spent in auctions valuing these shops so you better get used to it quickly. It’s weird that in practice it’s so mathematical compared to any Knizia auction game, though its clunky and stiff and slow at it. Why not just allow players to negotiate these values themselves?\n\nA lesser weakness is that there’s 5 other games called Marrakesh. It could just be small and annoying, but maybe it’s a bigger sign of how the name is too generic here.\n\nedit: I still find this game disgusting. Calculate these numbers to figure out the ROI on your shops! Consult these tables to find out who’s getting the most money from a move! It’s so stiff and creaky, taking away creativity, because players don’t need talk to each other but stare at the game for answers. I guess it’s more freeform than a lot of modern euros, but that lifeless core which doesn’t trust its players is so familiar, I see that more than ever now in euros. There were a lot of negotiation games from the 90s and earlier, why is this so special for taking OUT the negotiation?",
    "timestamp": 1745445600
  },
  {
    "username": "TobiasG",
    "rating": 2.0,
    "comment": "An incredibly boring exercise in maximizing ROI. It’s beyond me why I should spend my spare time on this.",
    "timestamp": 1709593200
  },
  {
    "username": "nerdymove",
    "rating": 3.0,
    "comment": "3+",
    "timestamp": 1384988400
  },
  {
    "username": "calandale",
    "rating": 4.0,
    "comment": "The thinking in this one is really unpleasant.\nIt's also one of those games where you can leave points lying about to scoop up,\nand hope the opponents just don't see what you're likely going to score.",
    "timestamp": 1490223600
  },
  {
    "username": "getareaction",
    "rating": 5.0,
    "comment": "Rating based on two plays.",
    "timestamp": 1750197600
  },
  {
    "username": "hiyou",
    "rating": 5.0,
    "comment": "空き家の競りを始めるか、客を移動させて店に入れるかの2択で行われるシンプルかつドーラらしい人が遊ぶ意味がある経済ゲーム。競りを始めたり、客を斡旋すると手数料がもらえるのが特徴的だけど、多くの場合手数料と比べようもないくらい儲けさせすぎてしまう印象。\n下家が競りをコントロールできすぎるのはかなり問題で、要らないんだけどわざと釣り上げねばならないという事態が頻繁に発生する。",
    "timestamp": 1549753200
  },
  {
    "username": "Ephorus",
    "rating": 6.0,
    "comment": "What I like:\n- You’re not just bidding for stuff, you’re moving around the board, trying to position yourself well and grab the right shops at the right time.",
    "timestamp": 1759528800
  },
  {
    "username": "Lemem",
    "rating": 6.0,
    "comment": "In my few plays I've found the shared incentives of MarraCash to be fairly underwhelming. Movements are either so profitable that they are obvious or so minuscule that they aren't worth your action. I don't particularly love the auctions and as a whole I do find the game to to be more mathy than I'd like; it's fine.",
    "timestamp": 1754258400
  },
  {
    "username": "Slimeyselim",
    "rating": 7.0,
    "comment": "wait for playte reprint",
    "timestamp": 1755813600
  },
  {
    "username": "Jordan_Varbev",
    "rating": 8.0,
    "comment": "#3*, #4**",
    "timestamp": 1760911200
  },
  {
    "username": "AlPacino11",
    "rating": 8.5,
    "comment": "Excellent old school simple bidding game!\nOnly a few rules create a unique game!",
    "timestamp": 1760479200
  },
  {
    "username": "mawilson4",
    "rating": 9.5,
    "comment": "Auctions, spatial movement puzzle, emergent opportunities for light negotiations/collusion, and more shared incentives than any game I've played...maybe ever. Which requires careful manipulation to get the most out of both your and opponents' turns.\n\nAll in just two possible action types: move a group of tourists or put up a shop for auction. A masterclass in design.\n\nMy copy is entirely homebrew, since the original was long out of print when I was looking to purchase it. There's rumors of a new edition, which would be lovely. Not so much for me at this point, but to introduce others to this excellent game.",
    "timestamp": 1759788000
  }
]