[
  {
    "username": "Toxic Meeple",
    "rating": 1.0,
    "comment": "Kick seven bells out the player in last place to do better. Definitely broken.",
    "timestamp": 1506722400
  },
  {
    "username": "wkover",
    "rating": 1.0,
    "comment": "Broken like the dreams of a roadflattened armadillo.\n\nDepending on the prevailing warmongering attitudes, a player can get eliminated on the FIRST TURN. Our one and only game was eleven minutes long because we immediately turned on each other until only one ship remained. That person won.\n\nHoo boy. Glad I didn't pay for that one.",
    "timestamp": 1331852400
  },
  {
    "username": "alexst",
    "rating": 2.0,
    "comment": "A game where combat is based purely on luck by rolling a 6-sided dice. Otherwise it is a very light German type game. Played it once but don't want to play it again.",
    "timestamp": 1546556400
  },
  {
    "username": "Tsaar",
    "rating": 2.0,
    "comment": "Elfenroads meets Risk.\nOne play, 3 hours, 6 rounds. Five rounds of shipping around cubes, strange take-it-or-leave-it commerce, last round killing frenzy where victory was stolen from the veteran player and the richest player won. Risk-influenced logistical game, and lasting way too long. In essence this might be a ok game, but needs redesign and 2 hours should suffice.\n\nAnother remark: the boats look like supertankers and tend to fall over or loose cargo.",
    "timestamp": 1430690400
  },
  {
    "username": "Leonardo",
    "rating": 3.0,
    "comment": "Some clever ideas but I didn't like the ending and how points are won",
    "timestamp": 1729029600
  },
  {
    "username": "Jarikv9",
    "rating": 3.0,
    "comment": "jack",
    "timestamp": 1620079200
  },
  {
    "username": "cheappoison",
    "rating": 4.0,
    "comment": "This game just felt way too long and the pacing is completely off. First 3 turns you are trading and then everything starts to be locked up and once that happens people start looking for fights, which means the hard trades are just not going to happen and you'll just be spending the money you made early to keep up a warfleet. Then it really is just a messy wack-a-mole back and forth that can really just come down to player order, something that is set from the beginning and you can't really do much about.\n\nFalls into this weird nothing space where it isn't a good tight modern euro, or an interesting conflict simulation either. It is an interesting idea and you could make something interesting out of this. If you want to keep up yours points you should be able to maintain trade, if there is no trade going on for 6 turns those cities should no longer gif max vp. Everyone should be poor, but once a city is rich it will always be rich, even if there are 5 or 6 fights that all make it change hands. The combat is also extremely unsatisfying.\n\nIt's cool that this is one of the first euro wargames, but I feel it really shows it's age.",
    "timestamp": 1750456800
  },
  {
    "username": "Yokiboy",
    "rating": 4.0,
    "comment": "This is a very fun, competitive trading and raiding game. It's a bit on the long side though, and many games have surpassed it.",
    "timestamp": 1579647600
  },
  {
    "username": "OGNOG",
    "rating": 5.2,
    "comment": "Probably OG. (Rating non-indicative of game quality.)",
    "timestamp": 1649109600
  },
  {
    "username": "chaddyboy_2000",
    "rating": 5.0,
    "comment": "Tons of decisions to make every turn with a lot of tense moments. Opportunities for deal-making, negotiating, and of course my favorite, backstabbing (a.k.a. screwage)! My only complaint is the 2 hours that it takes. Otherwise, a fun game!\n\nI thought this one was great with three players, but kind of sucked with four.",
    "timestamp": 1645570800
  },
  {
    "username": "Pandorzecza",
    "rating": 5.0,
    "comment": "The second edition looks better",
    "timestamp": 1632780000
  },
  {
    "username": "jens_hoppe",
    "rating": 5.0,
    "comment": "Trading and conquest in the Mediterranean. It's been a while, but I remember it as pretty fun. Nothing like making those five-sailor boats near the end of the game, and insist they're only for defense. :-)",
    "timestamp": 1551049200
  },
  {
    "username": "tphon",
    "rating": 6.0,
    "comment": "No cards",
    "timestamp": 1728856800
  },
  {
    "username": "RogerDHyman",
    "rating": 6.0,
    "comment": "Moderately fun game; nice components. Sold when replaced by 2nd ed.",
    "timestamp": 1720303200
  },
  {
    "username": "Michelsan",
    "rating": 6.0,
    "comment": "Seems at start like a peacefull euro commercial game, but the winning strategy is to go on piracy in the mid game.",
    "timestamp": 1707260400
  },
  {
    "username": "jimok",
    "rating": 6.0,
    "comment": "My game group rotates the choice of games for the evening. Next time my choice comes up, I'm picking this one.\n--\nUpdate, January 2024: I sold this one due to lack of play. Kind of sorry to see it go, but I was never going to play it. Hope it found a good home.",
    "timestamp": 1705100400
  },
  {
    "username": "ripley3",
    "rating": 7.0,
    "comment": "Partite : 3",
    "timestamp": 1747864800
  },
  {
    "username": "hughthehand",
    "rating": 7.0,
    "comment": "Another one I wish people played more. Great game. Hate the damn flags though. I like commodity games and for some reason anything that has spice in it. Probably because I like the Dune movie and book so much. I think what does it for me on this game is that there is battle, but the outcome of them are ususally not good for either side. So while there are fights, it generally doesn't happen until end game, and there are only a few major ones that might or might not determine the outcome.",
    "timestamp": 1741042800
  },
  {
    "username": "Kash000",
    "rating": 8.0,
    "comment": "Played this with Yann back at EAI Tech in France in 1997-1999",
    "timestamp": 1739401200
  },
  {
    "username": "kastel",
    "rating": 8.0,
    "comment": "Rd3",
    "timestamp": 1733439600
  },
  {
    "username": "Pugnogia",
    "rating": 9.0,
    "comment": "2 confezioni. Una ancora chiusa\n2 boxes, one still sealed",
    "timestamp": 1700089200
  },
  {
    "username": "Eagles",
    "rating": 9.0,
    "comment": "1 play copy, and another (maybe 2?) still in shrink...somewhere.",
    "timestamp": 1661724000
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "During the buy phase, you can buy as much as you can afford without bandwidth. Therefore it's not a euro!\n\nI liked the 2nd edition, but this is much more wild. Less euro, fewer weird phases of getting income. And all those rules I forgot from 2nd edition, like churches, were just to score extra VP. Everything was just a VP engine. Here, they're simple motivations for how players negotiate with each other. Like your capital is worth nothing if you don't fill it up, so that's obviously on everyone's checklist. The end result is I feel a lot more tension, wondering if I'm going to cooperate or conflict with another player, and nothing in the game is restricting us. So we have to talk it out, and hopefully not drag both of us below another neutral player.\n\nNow remembering a ton of wargames that are way more scripted and euro than this, with special event decks. But also scripted euro games that never allow for conflict. At least in this game, there's an arc of players peacefully trading, and then later competing and declaring war when they've maxed out the local region. It felt more educational than both genres, haha.\n\nOne thing that baffles me in 2nd edition is that clock that never changes. I guess it was to avoid bidding for turn order, but the end result is that everyone wanted consecutive spaces to move everything at once, so it didn't achieve anything. So that's my impression, how they added in more clunky rules to make it less freeform.",
    "timestamp": 1760306400
  },
  {
    "username": "tominascz",
    "rating": 10.0,
    "comment": "I actually like this game a lot, is definitely one of my favorites. It's nice and pretty challenging. Requires a lot of strategic thinking. It's also quite a lot about interaction between the players. Can get really long (3-4 hours for us).",
    "timestamp": 1604790000
  }
]