[
  {
    "username": "zerbia88",
    "rating": 1.0,
    "comment": "Playing this game is like watching paint dry. Except when you watch paint dry at least you're getting something done.",
    "timestamp": 1687298400
  },
  {
    "username": "Boardgamer80",
    "rating": 1.0,
    "comment": "You have no influence on your game. You are totally dependent on what others do. You can't plan ahead. Major luck factor",
    "timestamp": 1655416800
  },
  {
    "username": "BillNC",
    "rating": 1.0,
    "comment": "In very poor taste.",
    "timestamp": 1643238000
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Fun theme where you're chopping the heads of the members of the Ancien Regime. But the game often plays itself, which is a shame.",
    "timestamp": 1639954800
  },
  {
    "username": "Ninergamer",
    "rating": 1.0,
    "comment": "This is a theme that should never be used in a game. The French Revolution was horrific and demonic.",
    "timestamp": 1609542000
  },
  {
    "username": "SirHandsome",
    "rating": 1.0,
    "comment": "Played once with 5 players, felt pretty pointless... one action per turn (no card combos?) and 4 players going in between you meant there was absolutely no room to plan in this type of game. Seems like some of the issues would be alleviated with 3 or 2 players,, but...\n\nDon't really like playing games that feel pointless or like they're made to just brainlessly \"pass time\"... for that I'd lounge on the beach. When I play a game I want to be stimulated and engaged, even with a filler!\n\n(1 Design + 0 Enjoyment)",
    "timestamp": 1541804400
  },
  {
    "username": "joebelanger",
    "rating": 1.0,
    "comment": "Loathe this theme, but it's much more playable than Family Business.",
    "timestamp": 1475445600
  },
  {
    "username": "Seal Bludgeoner",
    "rating": 1.0,
    "comment": "The worst game I have ever played. Crazy 8's has more strategy and fun than this. The concept seems fun, but it's stupid. Save yourself the pain and buy a deck of cards. I would rather shut mousetraps on my private parts than play this game.",
    "timestamp": 1411941600
  },
  {
    "username": "hoenir",
    "rating": 1.0,
    "comment": "Didn't really like the the art and game play.",
    "timestamp": 1408226400
  },
  {
    "username": "vanrydergames",
    "rating": 1.0,
    "comment": "i'd rather be put in a real Guillotine",
    "timestamp": 1402437600
  },
  {
    "username": "LosSchabossDragon",
    "rating": 1.0,
    "comment": "Oh my gosh !",
    "timestamp": 1341180000
  },
  {
    "username": "no_where_dense",
    "rating": 1.0,
    "comment": "There are no real decision making in the game. I lowered the rating from 3 to 1. This is just a total crap.",
    "timestamp": 1315260000
  },
  {
    "username": "Cynical",
    "rating": 1.0,
    "comment": "Draw cards, hope for the best?",
    "timestamp": 1306447200
  },
  {
    "username": "redhuntingcap",
    "rating": 1.0,
    "comment": "Easily one of the worst and most pointless games I have ever played. At it's heart is a card drafting mechanism so uninspired, and lacking in any real possibility for decision making, it makes Ticket to Ride look like East Front II. Either you play a card that will give you a better choice than the card that is currently up, or you take what's there because it's good, or because you can't do anything to make it better. Sometimes you just have to take whatever crap is there and do something pointless like knock a random card out of somebody's hand. The only redeeming quality this game has is it's theme, and it is completely wasted here.",
    "timestamp": 1211752800
  },
  {
    "username": "jellyfishjoe",
    "rating": 2.0,
    "comment": "Too random for me, and having to move the entire line toward the guillotine is fiddly",
    "timestamp": 1755640800
  },
  {
    "username": "esteves91",
    "rating": 2.0,
    "comment": "SOLD",
    "timestamp": 1725314400
  },
  {
    "username": "hiimjosh",
    "rating": 2.0,
    "comment": "Too random, too boring, too long, bleh",
    "timestamp": 1703718000
  },
  {
    "username": "kameronsnewphone",
    "rating": 2.0,
    "comment": "RNG that's functionally equal to rolling a dice to see who wins. Opportunities to make clever plays that come maybe only once in every 20 games. Don't understand how anyone considers this game worth their time, but I think it tends to show up in more collections than it deserves by charming new hobbyists with more indirect take-that mechanics than they may have experienced before, and by putting up the facade of a game that promotes long-term planning.",
    "timestamp": 1684360800
  },
  {
    "username": "Chuggas",
    "rating": 2.0,
    "comment": "A good game, I'm just not a fan of the theme.",
    "timestamp": 1671318000
  },
  {
    "username": "ChimBlade",
    "rating": 2.0,
    "comment": "Might be a 3 or 4 if I didn't love Parade.",
    "timestamp": 1641250800
  },
  {
    "username": "Levilas",
    "rating": 2.0,
    "comment": "I played this game a couple of times and somehow I can't make myself into liking it. Also, I dislike the artwork on the cards.",
    "timestamp": 1638486000
  },
  {
    "username": "Fragasnap",
    "rating": 2.0,
    "comment": "A simple take-that deck-of-many-things game that will almost invariably result in king-making, especially with its open scoring.\nIf that's what you want, then you've got a million options: Knock yourself out.",
    "timestamp": 1633730400
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Quite dull",
    "timestamp": 1627423200
  },
  {
    "username": "Gia187",
    "rating": 2.0,
    "comment": "Veel geluk, je kan elkaar te veel boycotten.\nJe moet het doen voor het gezelschap.",
    "timestamp": 1586383200
  },
  {
    "username": "ljhms",
    "rating": 2.0,
    "comment": "Can't remember much of the game except dreading every minute of it.",
    "timestamp": 1577574000
  },
  {
    "username": "joeldugard",
    "rating": 2.0,
    "comment": "Too many cards doing too many crazy things to allow for any actual strategy to take place",
    "timestamp": 1571436000
  },
  {
    "username": "John Rogers",
    "rating": 2.0,
    "comment": "Did you draw good card?\n\nWIFE RATING - 6\n\nLet someone borrow it and they misplaced it.",
    "timestamp": 1567116000
  },
  {
    "username": "GustiC",
    "rating": 2.0,
    "comment": "Way too easy and it isnt challenging at all.",
    "timestamp": 1501452000
  },
  {
    "username": "aristanton",
    "rating": 3.0,
    "comment": "I mostly picked it up because it was suggested as a party game for many players years ago that was fun and fast. I don't think its very interesting for many players. Maybe it's interesting for less players to play. Not many opportunities to steal a win from someone else or smash their plans etc. I think it needs more rules/cards wise to be interesting.",
    "timestamp": 1755468000
  },
  {
    "username": "Idiot_for_Life",
    "rating": 3.0,
    "comment": "Best at 3-5\nVery short length\nTake that shared tableau management game.",
    "timestamp": 1752184800
  },
  {
    "username": "CMagex",
    "rating": 3.0,
    "comment": "1, where is this?\n\nRemove-simple small game that I can bring anywhere if needed, but will remove if someone wanted\n\nEverdeck for this",
    "timestamp": 1742338800
  },
  {
    "username": "bneffer",
    "rating": 3.0,
    "comment": "Goofy and light, especially for when you go about executing people as the core action.",
    "timestamp": 1701471600
  },
  {
    "username": "duodora",
    "rating": 3.0,
    "comment": "It's good for a laugh, but I'd have to be talked into playing. There are a lot of games that are \"good, silly fun,\" that are a little bit more strategic and satisfying for me.",
    "timestamp": 1692136800
  },
  {
    "username": "verandi",
    "rating": 3.0,
    "comment": "Hilarious concept and art, but the game play itself fell flat for me, lacking any tension whatsoever. These casual mindless activity games really irk me.",
    "timestamp": 1677625200
  },
  {
    "username": "peakhope",
    "rating": 3.0,
    "comment": "Really just not fun. Too many special abilities, and too many that are too wild. Obviously it's highly random, but I expect more from a filler.",
    "timestamp": 1652565600
  },
  {
    "username": "Wrecktangled",
    "rating": 3.0,
    "comment": "Not much to say about this one. You just play cards from your hand trying to change a line of cards to score you more points. You dont really have much agency in the game, but I can see how some people might enjoy it as a background activity.",
    "timestamp": 1652133600
  },
  {
    "username": "socialsnacker",
    "rating": 3.0,
    "comment": "Like a lot of older games of this type I just find that it goes on too long. Something that can be funny when the game takes 5-10 minutes is less funny when the football is continually yoinked away from you over the course of a longer game.",
    "timestamp": 1641250800
  },
  {
    "username": "Oezz",
    "rating": 3.0,
    "comment": "Things happen. Maybe you win, maybe you lose. At least it's over relatively quickly.",
    "timestamp": 1639695600
  },
  {
    "username": "Withjrock",
    "rating": 3.0,
    "comment": "This is RNG and WAY too simple mechanics. It's really comparable to Red Dragon inn... but without the \"gambling, I'm in\"... you have very little control, and it's always just one move at a time. Probably great for a six year old, but not for a gamer.",
    "timestamp": 1611874800
  },
  {
    "username": "zxcvbn2",
    "rating": 3.0,
    "comment": "Yeah take-that with nothing else isn't really my thing.",
    "timestamp": 1543532400
  },
  {
    "username": "SkunkToe",
    "rating": 3.0,
    "comment": "X",
    "timestamp": 1532469600
  },
  {
    "username": "copcopps",
    "rating": 3.0,
    "comment": "My sisters like it I however find it too random and repetitive.",
    "timestamp": 1528668000
  },
  {
    "username": "Sitbear",
    "rating": 4.0,
    "comment": "With the caveat that I only played this game once and at 6 players, more than recommended... I think I've seen enough to know that it's just a bad game.\nLots of take that, lots of luck, virtually no strategy. Usually the best play you can make is either completely obvious or completely up to the gods. But for a game which plays itself, it's not particularly smooth: The board state changes so drastically that you pretty much have to wait your turn and then re-read your cards before every move. It does not flow quickly the way Uno does, and the significance of the various cards you pull is not immediately obvious. Rather than suspense, it's like reading your own fate in the newspaper.\n\nSo for a game that is not mechanically interesting, not fluid in play, is there anything that saves it? Well, even the most basic games can be saved by the right amount of charm, humor, or wit. Unfortunately, Guillotine merely gestures at these instead of performing it.\nRevolutionary France, though it is in some ways absurd, is a deeply political theme. Yet the game does not do anything with the theme other than hint at the humor of decapitation. It sends no moral message. Its artwork is cartoony in a trashy way. There is no real transgression, and the violent theme is abstracted away until all that's left is beige.",
    "timestamp": 1755295200
  },
  {
    "username": "Joyful_Gamer",
    "rating": 4.0,
    "comment": "I do not remember too much about this game. It was the person who brought it first time playing the game as well, so we might have been playing wrong. Assuming we were playing correctly, the game was fine and not too challenging. I do vividly remember zoning out during the game, so def found it boring. Would be open to playing again if it ever appeared, but would not recommend buying or buy it myself.",
    "timestamp": 1752184800
  },
  {
    "username": "CotB",
    "rating": 4.0,
    "comment": "Verdict - Mediocre\nWeight - Light\nPlaytime - 20 Minutes\nOptimal Player Count - 3\n\nKey Mechanisms\n-Take That\n\nRankings\n105th Best Game 2018",
    "timestamp": 1750975200
  },
  {
    "username": "couchlife",
    "rating": 4.0,
    "comment": "Light filler that floats on by. Sometimes you can pull a clever play but it doesn't give me any satisfaction.\n\n06/01/25",
    "timestamp": 1749160800
  },
  {
    "username": "Sunnyfield",
    "rating": 4.0,
    "comment": "★★☆☆☆\nGuillotine behead of its time?\n\nGuillotine is an oldie in board game terms. BGG says anno 1998. Yet it is still in print, so there must be something to this game, right! Right?\n\nIn guillotine up to 5 players are playing for the heads of nobles during the French revolution. It is played over three \"days\" (rounds) with every day consisting of 12 scheduled decapitations. In your turn you may optionally play an action card that most of the times allows you to rearrange the order of the nobles on death row. Followed by the beheading of the noble in front of the line. You keep the head for victory points. Some heads are worth more than others. The aim is to get ahead in the game by having the most victory points after the third day. You end your turn by drawing an action card. Play continues with the next player.\n\nIt is a very simple game to teach (or learn). Everybody can play it within minutes and enjoy messing with other players' turns through action cards. And it is a good laugh the first time, but even then after the third day (round) the game already starts to feel a bit repetitive. The action cards are random and lack really interesting variety. The randomness can be hilarious, but also a bit annoying. There's some agency, but it is quite limited. In the end the players are the kingmakers (pun intended!) and the game relies on all players knowing who the king of the hill is at any given time.\n\nAt the other hand there is also the opportunity for revenge. And what is more fun than getting back at someone! So yeah, there's some giggles in that! To remain fun, this game does not only need a guillotine but also a shot... or two... or more! I think guillotine is a party game. As with any party game: YMMV!\n\nGuillotine is a classic. It's strength is in its accessibility and instant hilarity with the right crowd in the right place and time. Which means that I would usually shy away from it. The game becomes more appealing after a few drinks for me.",
    "timestamp": 1743289200
  },
  {
    "username": "tayl0496",
    "rating": 4.0,
    "comment": "It can be fun with family, but a bit too chaotic.",
    "timestamp": 1739660400
  },
  {
    "username": "MatroidX",
    "rating": 4.0,
    "comment": "Way too simplistic. Pretty obvious what your best move is at every point, so just determined by sequence of nobles and cards you have.",
    "timestamp": 1730242800
  },
  {
    "username": "Joel_L",
    "rating": 4.0,
    "comment": "It suffer from the usual problem with card games like this. Too much text and too many cards means it's hard to fully grasp the game-state. Even if you could, the points-swing from random card draws makes it too chaotic for me to enjoy. Also the theme is gross.",
    "timestamp": 1724709600
  },
  {
    "username": "Stas",
    "rating": 4.0,
    "comment": "Last played: Aug 2005",
    "timestamp": 1710630000
  },
  {
    "username": "Kodeir",
    "rating": 4.0,
    "comment": "Guillotine is a perfect example of dark humour: if not for this one, I'd say that's impossible that a game that's about beheading people could be humorous. Personally, I find it funny, but I can see why makes some people feel uneasy.\n\nThe gameplay is so simple that can be easily explained in a minute. Indeed, I'll explain you how it works: the game consists of three days. Every day, 12 nobles are put in a row. Each turn, a player might play a card, \"collect\" the first noble of the line and draw a card; then the turn proceeds clockwise. When all the nobles are collected, a new day begins and 12 other nobles are prepared. At the end of the third day, the player with the most points it's the winner. That's all.\n\nThe simplicity of the game joined with a bit of \"take that\" mechanisms and a fixed ending makes this one a very good filler, which leads us to it's main drawback: the strategies are almost nonexistent, and the tactical decisions are just moving a noble or two through the line.\n\nIf you want a simple filler and the theme doesn't scare you, it's possible that you find it funny and enjoyable. The game is cheap and the components not only have good illustrations, but also are very functional, so you aren't throwing your money away.\n\nRating: \nNumber of players:\n3\n5\n\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "thebaysix",
    "rating": 4.0,
    "comment": "One of the better games that fall into the \"not-too-skill-based card game\" category. Had some fun with it, and that's about it.",
    "timestamp": 1700780400
  },
  {
    "username": "pertwee",
    "rating": 4.0,
    "comment": "Played this a half dozen times and it did not work for me and my partner. No rub on the game or those that like it, I just really didn't.",
    "timestamp": 1688594400
  },
  {
    "username": "rynelf",
    "rating": 4.0,
    "comment": "--Dec2003-- Chaotic and relatively unappealing (for me, at least) game. Nice theme, and fun with the right crowd (of course - that crowd could play anything and be happy), but not something I'd ever choose.",
    "timestamp": 1680559200
  },
  {
    "username": "pietereblom",
    "rating": 4.0,
    "comment": "Although the esthetics and the setting of the game are definitely two of its strong points, the game offers no strategic depth and allows tactically only superficial decisions. Certain cards in the game seem very flawed/overpowered.",
    "timestamp": 1679698800
  },
  {
    "username": "DexGeek",
    "rating": 5.4,
    "comment": "Owner: Dex",
    "timestamp": 1744754400
  },
  {
    "username": "Ritz1974",
    "rating": 5.0,
    "comment": "Line manipulation game. Lots of luck and randomness.",
    "timestamp": 1744408800
  },
  {
    "username": "Blix",
    "rating": 5.0,
    "comment": "Social & Silly\nRespect, Not Love",
    "timestamp": 1744322400
  },
  {
    "username": "cubntin",
    "rating": 5.0,
    "comment": "2-5 players",
    "timestamp": 1743289200
  },
  {
    "username": "RikHavok",
    "rating": 5.0,
    "comment": "2/25 Complete. The guillotine is dented.\nNot going to sleeve.",
    "timestamp": 1740265200
  },
  {
    "username": "JPSFOX",
    "rating": 5.0,
    "comment": "I enjoyed this game a lot more in the early 00's. My gaming tastes and collection have grown since then and I never pull this out when I want to play a game.",
    "timestamp": 1737759600
  },
  {
    "username": "ShiannLin",
    "rating": 5.0,
    "comment": "2003 Fairplay À la carte Runner-up\n1998 Origins Awards Best Traditional Card Game Winner",
    "timestamp": 1734390000
  },
  {
    "username": "Y_OChan",
    "rating": 5.0,
    "comment": "AO",
    "timestamp": 1728856800
  },
  {
    "username": "krit1789",
    "rating": 5.2,
    "comment": "Take-that type card game. There should be a hand limit for the action cards.",
    "timestamp": 1728770400
  },
  {
    "username": "snunemaker",
    "rating": 5.0,
    "comment": "Nice light game. Great artwork!",
    "timestamp": 1723672800
  },
  {
    "username": "Sortrose",
    "rating": 5.0,
    "comment": "Decent game if not taken too seriously. Would like it to be more swingy for added fun factor.",
    "timestamp": 1718488800
  },
  {
    "username": "Lemem",
    "rating": 5.0,
    "comment": "It is true, Guillotine is a filler, but there are a ton of better options that aren't nearly as random or lackluster.",
    "timestamp": 1715205600
  },
  {
    "username": "spencyrrh",
    "rating": 5.0,
    "comment": "2024-03-28 (1 play with 4): Just being cruel, unusual, unfair and full of take-that isn't enough to earn my ire. This game has a fun gimmick component, lots of mean, rule-breaking actions, and a card which says 'Piss Boy' on it, so it's not all bad.\n\nHowever, one player was able to suspend every other player's agency for about a third of the playing time. That was quite boring. The cards are pretty ugly, and not colourblind-friendly, which was a problem for our group. And there are so many action cards that you can end up with a poor draw and have nothing to do.",
    "timestamp": 1711580400
  },
  {
    "username": "PepaSed",
    "rating": 5.0,
    "comment": "I think the game would be more interesting if players were allowed to play any number of cards at any time, while still drawing only one at the end of their turn. I think it would generate greater interaction between players and provide more options for strategizing.",
    "timestamp": 1711062000
  },
  {
    "username": "tigerted2k3",
    "rating": 5.0,
    "comment": "1.27",
    "timestamp": 1710543600
  },
  {
    "username": "Jittery Jester",
    "rating": 5.0,
    "comment": "Quick little card game with a funny theme.",
    "timestamp": 1708383600
  },
  {
    "username": "bdmiller",
    "rating": 5.0,
    "comment": "For Sale",
    "timestamp": 1707606000
  },
  {
    "username": "Bobit",
    "rating": 5.0,
    "comment": "Sort of like a complex Exploding Kittens where you keep more tiles in hand. It's alright.",
    "timestamp": 1702335600
  },
  {
    "username": "Urbanwatts",
    "rating": 5.0,
    "comment": "The gameplay is fine but the theme salvages it. Outside of chopping heads, there isn't much that is interesting.",
    "timestamp": 1702249200
  },
  {
    "username": "Yemic",
    "rating": 5.0,
    "comment": "Not in original tuckbox",
    "timestamp": 1701298800
  },
  {
    "username": "Luds",
    "rating": 5.0,
    "comment": "(Christmas gift from Eloïse, 2013-12-26)\n\nNice litte card game with funny art and quick game play. The game is short and fun. Better than similar games like Walk the Plank.\n\n(Sold to user Dhunam 2019-04-10)",
    "timestamp": 1696024800
  },
  {
    "username": "madvogel",
    "rating": 5.0,
    "comment": "Cute and fun but hardly strategic at all.",
    "timestamp": 1694556000
  },
  {
    "username": "Hisspamyola",
    "rating": 5.0,
    "comment": "Easy to understand, easy to teach, and quick to play. Definitely a go-to filler for me.",
    "timestamp": 1694037600
  },
  {
    "username": "spareman",
    "rating": 5.0,
    "comment": "Decent filler game. I actually like playing it with just 2 people. Great artwork and funny theme.\n\nAlmost zero strategy though. The game is 99% tactical. Which means that playing with more than 3 can be a chore since there is too much downtime and not enough to do when it's not your turn.",
    "timestamp": 1689026400
  },
  {
    "username": "Shimpy",
    "rating": 5.0,
    "comment": "It’s an ok filler that fits in my purse",
    "timestamp": 1688076000
  },
  {
    "username": "Robert Osvalds",
    "rating": 5.0,
    "comment": "This is a fun \"filler\" game while you wait for others to show up. Comedy keeps it light, but would easily grow stale after a few times playing. Still, I like the originality and the artwork. Worth the 10 dollars.",
    "timestamp": 1681423200
  },
  {
    "username": "jondodd82",
    "rating": 5.0,
    "comment": "First impression",
    "timestamp": 1680300000
  },
  {
    "username": "Entropology",
    "rating": 5.0,
    "comment": "I like this game, but spouse made me get rid of it due to theme with the kids. It is actually pretty morbid that is covered up by the cartoony art.",
    "timestamp": 1679180400
  },
  {
    "username": "moonerie",
    "rating": 5.5,
    "comment": "2-5 players (2-5 rec; best 4)\n6.5 rating\n1.27 complexity\n30 mins\n\nNotes: Used to rate it higher until playing again recently. Light game but kind of meh if you don't play with people that want to actively screw each other over (haha)",
    "timestamp": 1760306400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Quick, easy to teach, and cheap fun. Some hand management skill to make it not brainless, and some killer screwing can go on.",
    "timestamp": 1759356000
  },
  {
    "username": "KoolerAidMan",
    "rating": 6.0,
    "comment": "2 - 5 players.\n\nCard game. Tiny game.\n\nDo not sleeve. Sleeves wil not fit in box.",
    "timestamp": 1756504800
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 8717371240394\ncd rek 8",
    "timestamp": 1756418400
  },
  {
    "username": "lele589",
    "rating": 5.5,
    "comment": "Print&Play",
    "timestamp": 1754863200
  },
  {
    "username": "GeminiWeb",
    "rating": 6.0,
    "comment": "Reasonable filler game. Light paced.",
    "timestamp": 1754863200
  },
  {
    "username": "d3struct10n",
    "rating": 6.0,
    "comment": "Dark humour of the game is attractive, but the gameplay itself quickly becomes a bit repetitive and monotonous with reading quite a bit of text, so I'm not sure I'd recommend this game beyond trying it for a couple of plays.",
    "timestamp": 1754690400
  },
  {
    "username": "shannyn_north",
    "rating": 6.0,
    "comment": "Chris Wray 4.0\nThe game is a little silly, but it is fun, and there can be a fair amount of strategy. I think this will attract a crowd similar to \"Flux,\" but I'd much rather play Guillotine than Flux.\n\nSean N. 6.0\nQuick, easy to teach, and cheap fun. Some hand management skill to make it not brainless, and some killer screwing can go on.",
    "timestamp": 1754258400
  },
  {
    "username": "RalfMalf",
    "rating": 6.0,
    "comment": "Fine as long as people play quickly. Nice theme.",
    "timestamp": 1753394400
  },
  {
    "username": "Hkbauer511",
    "rating": 6.0,
    "comment": "A quick card game where you try to score the best heads as they get CHOPPED . Fun theme with quirky action cards to switch up the game play.",
    "timestamp": 1752703200
  },
  {
    "username": "mrkade",
    "rating": 6.0,
    "comment": "A good fun short game.",
    "timestamp": 1750197600
  },
  {
    "username": "Jbroots",
    "rating": 6.0,
    "comment": "Box torn. Game complete. well loved",
    "timestamp": 1748296800
  },
  {
    "username": "Tbirdmg",
    "rating": 6.0,
    "comment": "One of the few party games i really enjoy. Good, light hearted fun, entertaining illustrations, simple rules that can be learned in 5 minutes. Plays poorly at 2p. You really need 3-4 to make the game worthwhile.",
    "timestamp": 1747000800
  },
  {
    "username": "mib45",
    "rating": 6.0,
    "comment": "-",
    "timestamp": 1745100000
  },
  {
    "username": "SteamMan66",
    "rating": 6.0,
    "comment": "A simple but fun card manipulation game",
    "timestamp": 1741302000
  },
  {
    "username": "Eitetsukb",
    "rating": 6.0,
    "comment": "Played",
    "timestamp": 1740956400
  },
  {
    "username": "Kiyote",
    "rating": 6.0,
    "comment": "Imperiums to Order 1998",
    "timestamp": 1739919600
  },
  {
    "username": "Stoicgame",
    "rating": 5.5,
    "comment": "The main selling point of this is how easy it is to get to the table and teach.",
    "timestamp": 1739142000
  },
  {
    "username": "Paxete",
    "rating": 6.0,
    "comment": "Partidas a partir del 2021",
    "timestamp": 1739142000
  },
  {
    "username": "jaluth",
    "rating": 6.0,
    "comment": "Fun if you've got a bunch of people over. Two player-experience is a bit \"meh\", sadly.",
    "timestamp": 1738796400
  },
  {
    "username": "Sonny_Crockett",
    "rating": 6.0,
    "comment": "Nostalgia prevents me from culling. So many quick games laughing at the Bad Nun. Not a great game, but a comfort food. It's the Doritos and Mountain Dew of my collection. Not very good, but sometimes irresistible and enjoyed to excess in my youth.",
    "timestamp": 1737932400
  },
  {
    "username": "Tolkienfan3324",
    "rating": 6.0,
    "comment": "Card Game",
    "timestamp": 1737673200
  },
  {
    "username": "KingMePlease",
    "rating": 6.0,
    "comment": "Unique card game but not one for our family.",
    "timestamp": 1736204400
  },
  {
    "username": "fromeea",
    "rating": 6.0,
    "comment": "In Box #0067\nNot Sleeved because of Box\n\nRosalie Phillips: 6\nAmy Peschong: 7",
    "timestamp": 1736118000
  },
  {
    "username": "YlumsGuardian",
    "rating": 6.0,
    "comment": "Old review: Got this one for free at the local swap shop, which is the only reason I own it.\n\nIt's a very random game with a heavy dose of take that, not to mention a LOT of luck.\n\nFine for what it is, but so many odd choices (which, to be fair, add to its charm). The actual guillotine in the game makes the box twice as big as it should be--it should just have been another card at the end of the row.\n\nThe rules could have been a lot clearer in some parts, but it's easy enough to figure out or house rule it. Believe me, it really doesn't matter.\n\nThen, of course, there's the theme. It doesn't bother me, but it seems this is a game begging for a re-theme. Maybe Martian colonies attracting better citizens? Dodgeball teams trying to get the most athletic teammates? I would think almost anything would be more appealing to a mass audience.\n\nAnd yet... the game's quirks, odd choices of packaging, and theme all make it unique and stand out, which I think is a plus in a market of too many bland \"it's OK\" games.\n\nUpdate: Sold",
    "timestamp": 1735945200
  },
  {
    "username": "graui",
    "rating": 6.0,
    "comment": "Nice ideas but somehow boring.",
    "timestamp": 1735599600
  },
  {
    "username": "Javajoesworld",
    "rating": 6.0,
    "comment": "Funny classic filler. Off with their head!",
    "timestamp": 1735340400
  },
  {
    "username": "honeybeast25",
    "rating": 6.0,
    "comment": "Good filler card game.",
    "timestamp": 1735167600
  },
  {
    "username": "MoMahili",
    "rating": 7.0,
    "comment": "Sale",
    "timestamp": 1759874400
  },
  {
    "username": "Johnny Opie",
    "rating": 7.0,
    "comment": "Not reflected in BGG, but played this a bunch back in the day. Simple, fun. Can feel a bit mean.",
    "timestamp": 1758837600
  },
  {
    "username": "kwalzl",
    "rating": 7.0,
    "comment": "6A",
    "timestamp": 1758492000
  },
  {
    "username": "Muppetus Galacticus",
    "rating": 7.0,
    "comment": "Archived",
    "timestamp": 1755900000
  },
  {
    "username": "espoon82",
    "rating": 6.9,
    "comment": "Just a little fun and dumb with a theme that is in my academic field. :-)",
    "timestamp": 1755813600
  },
  {
    "username": "bonster20",
    "rating": 6.5,
    "comment": "[two copies, one NIS]\nA very silly game. Makes a good filler. Best played while speaking with French accents. I have one friend who ad-libs a little biography or narration for each play he makes, which definitely adds to the fun.",
    "timestamp": 1755727200
  },
  {
    "username": "GravityRabbit",
    "rating": 6.5,
    "comment": "Fun, light filler game.",
    "timestamp": 1755208800
  },
  {
    "username": "vilanova72",
    "rating": 7.0,
    "comment": "Local-(273)",
    "timestamp": 1754604000
  },
  {
    "username": "Spatzy",
    "rating": 7.0,
    "comment": "4",
    "timestamp": 1754517600
  },
  {
    "username": "Vormwald1",
    "rating": 7.0,
    "comment": "Very fun game. Go to filler for my gaming group.",
    "timestamp": 1753567200
  },
  {
    "username": "Yagyuu",
    "rating": 7.0,
    "comment": "- Stable part of collection\n\nOne of the few take-that games I can tolerate and even like because of the unique, dark and crazy theme.\n\nWill always pick it over any \"funny\" take-that games like Flux, Munckin, exploding-whatever-unicorn games or unholy Uno clones.",
    "timestamp": 1753221600
  },
  {
    "username": "Samustroid",
    "rating": 7.0,
    "comment": "Let's eat the rich!",
    "timestamp": 1752444000
  },
  {
    "username": "solitaryquest",
    "rating": 7.0,
    "comment": "Fast, light time passer game with a humorous twist. Love bringing this out at family gatherings and watching my older relatives feign offence.",
    "timestamp": 1751839200
  },
  {
    "username": "gidorah",
    "rating": 7.0,
    "comment": "06.2025\n\nIn Guillotine, only one thing is (mostly) certain: you’ll have to take the card at the front of the line at the end of your turn. Which sounds unremarkable until you understand that not all cards are created equal. Some give you a few points and some give a lot of points. Some score more, the more you get. Some score negative points or have negative effects. Still not much of a game until you get to the action cards, which let you do a lot of tomfoolery: change the direction or order of the line; skip cards ahead or move them back; take certain cards; steal from opponents; skip taking a card; end the round early; and so on. The goal then is to manipulate the line for your benefit while sagging off of bad cards for your opponents to take.\n\nGuillotine is chaotic and take-that but it’s also extremely fluffy and casual, something you can play at a pub for a quick laugh. It helps that I really enjoy both the setting and the presentation of Guillotine. The ghastliness of collecting “heads” of state is perfectly juxtaposed with the goofy art.",
    "timestamp": 1750975200
  },
  {
    "username": "Greytrek",
    "rating": 8.0,
    "comment": "Everyone I introduce to this enjoys it, and it's become one of the most popular time killers in my game group. It's fun, as is the art, and the humor is fittingly morbid without going too dark. It's simple and easy to learn but offers plenty of choices. It's smoother if you don't keep shifting the line down - it's all based on order anyway. As for actual downsides, there's a certain amount of small text, and the pacing slows down slightly at max player count. Ultimately, it's a fun and accessible table-pleaser that deserves more love.",
    "timestamp": 1760479200
  },
  {
    "username": "Smottz",
    "rating": 8.0,
    "comment": "2 3 4 5 ⚔️ ☰\nL ★★★\n\n◈ esoteric",
    "timestamp": 1757368800
  },
  {
    "username": "Gernial",
    "rating": 8.1,
    "comment": "good fungame in a bigger group",
    "timestamp": 1754604000
  },
  {
    "username": "Ramp_",
    "rating": 8.0,
    "comment": "Very good filler game. The theme is cool, the illustrations are entertaining and it can be teached in about 2 minutes. There's a \"take that\" element, thus non gamers that are used in such games will find it funny as well.\n\nUpdated to 7.5 → 8. I've played it a few more times and it is actually a hit most of the times, even with new people to the game. The theme of it is quite unique and always brings a smile to people faces.",
    "timestamp": 1752703200
  },
  {
    "username": "Vinnyvinvinvinvin",
    "rating": 8.0,
    "comment": "Very impressed by this one. The card text was notably a lot clearer than I felt other games are and the theme is wonderful gallows humor. Despite playing with 6 players, I still felt like I had a lot of agency. Super solid party game!",
    "timestamp": 1750629600
  },
  {
    "username": "elputovader",
    "rating": 7.5,
    "comment": "#OPBO Junio25",
    "timestamp": 1749765600
  },
  {
    "username": "icarusmustburn",
    "rating": 7.5,
    "comment": "Harsh little card game.",
    "timestamp": 1748383200
  },
  {
    "username": "Maarten1998",
    "rating": 7.5,
    "comment": "Fun little game where the theme is quite funny in a way. Some cards can be pretty mean and there is a lot of luck.",
    "timestamp": 1747432800
  },
  {
    "username": "Erravan",
    "rating": 8.0,
    "comment": "Fun order manipulation game",
    "timestamp": 1744149600
  },
  {
    "username": "bartenderMS",
    "rating": 8.0,
    "comment": "Kilian",
    "timestamp": 1740956400
  },
  {
    "username": "bishop026",
    "rating": 7.5,
    "comment": "A fast and fun card game in which you mess with other players to win the game. Beautiful design.",
    "timestamp": 1740870000
  },
  {
    "username": "Malbo56",
    "rating": 7.6,
    "comment": "I love the black humor. One of the few very old games that I am happy to play again.",
    "timestamp": 1740610800
  },
  {
    "username": "darquil",
    "rating": 8.0,
    "comment": "Components: Great caricatures of the various nobles, both historic and imagined. The action cards are particularly well-done, given the general mediocrity of action cards: each has a unique, superfluous illustration, and some have easy-to-follow diagrams to help with comprehension.\n\nExperience: The clever part of the game, that of manipulating the order on death row, is enjoyable. The use of action cards to achieve the manipulation isn't particularly creative (though perhaps it was more so at its time of publication), and the game can be rather chaotic, with noone's collection of nobles being safe from tampering. Still, I enjoy it, and it was one of the first card games I ever played that exposed me to the world of non-standardized decks.\n\nWith only two players the chaos is at a minimum and it really shines. There is opportunity for strategy and budgeting my hand of action cards as players mine the line of nobles for the valuable ones first, then eventually find clever ways to foist the gray nobles on each other.\n\nWith more players, the game is too short, and players have too little control over their fates. At the same time, there is less incentive to target other players.\n\nFirst Played: 2001-01-01\nLast Played: 2020-03-31\nPlays (32):\n? players: 15\n2 players: 13\n3 players: 1\n4 players: 2\n5 players: 1",
    "timestamp": 1737673200
  },
  {
    "username": "vorlayn",
    "rating": 7.8,
    "comment": "r",
    "timestamp": 1736550000
  },
  {
    "username": "SoBoardTogether",
    "rating": 9.0,
    "comment": "9/2-Reign of Terror, France",
    "timestamp": 1760220000
  },
  {
    "username": "messinuprules",
    "rating": 9.0,
    "comment": "This game is a blast.",
    "timestamp": 1749679200
  },
  {
    "username": "Jestertrek",
    "rating": 8.5,
    "comment": "Surprisingly subversive little card game for such a major publisher. Line up aristocrats and then use clever card play to make sure they all get beheaded in an order that is to your benefit, while avoiding beheading innocents? And this was published by WOTC? Hee! I love 90s card games. Needless to say, this would never get published today.",
    "timestamp": 1741129200
  },
  {
    "username": "spikedone",
    "rating": 9.0,
    "comment": "This is just silly fun.",
    "timestamp": 1738191600
  },
  {
    "username": "ChyronDave",
    "rating": 9.0,
    "comment": "Bins",
    "timestamp": 1726092000
  },
  {
    "username": "Daminor8",
    "rating": 9.0,
    "comment": "One of my wife's all time favorite games. We have played this many times and is always a fun time. Some good strategy here with the card play and line manipulation, which keeps us coming back again for a quick reliable game.",
    "timestamp": 1724104800
  },
  {
    "username": "PepsiFizz",
    "rating": 9.0,
    "comment": "One of the best short and sweet games around.",
    "timestamp": 1710370800
  },
  {
    "username": "sunnyswamp",
    "rating": 9.0,
    "comment": "Never gets old and very funny concept",
    "timestamp": 1702594800
  },
  {
    "username": "BRENNAN95",
    "rating": 9.0,
    "comment": "Top game, fun and quick to learn.",
    "timestamp": 1701298800
  },
  {
    "username": "Markies123",
    "rating": 9.0,
    "comment": "Neat little card game that is a great filler game.",
    "timestamp": 1700262000
  },
  {
    "username": "philosophus",
    "rating": 9.0,
    "comment": "High rating for what it is, a very simple and quick card game about the use of the guillotine during the Reign of Terror.",
    "timestamp": 1692914400
  },
  {
    "username": "ToDiv3For",
    "rating": 9.0,
    "comment": "way more fun and competitive than you might think",
    "timestamp": 1691532000
  },
  {
    "username": "Guthwine3",
    "rating": 9.0,
    "comment": "Excellent illustrations complement a unique, fun, thematic and very well-designed game. Travels well, exceptionally easy to set up and teach. Doesn't take long to play, either.",
    "timestamp": 1684015200
  },
  {
    "username": "thelastemperor",
    "rating": 9.0,
    "comment": "Quick, fun, and with enough tactical card play to scratch the itch one sometimes has of wanting to have a set course of events where they can reliably play a card to those change events to benefit themselves at the expense of their opponents (or sometimes just to give some “take that” to your opponents).\n\nThe theme could be dark, but this game is black comedy, not social commentary. The artwork is light and cartoonish and given the theme, it actually works, by making it light and fun.\n\nCards representing nobles with various point values and colors are lined up before losing their heads. On their turn, players collect the card (the “head”) of the noble in the front of the line. Simple.\n\nBut, some nobles will have special attributes or effects. Perhaps they might cause the player to collect not only their card, but also the one behind them. Or add more cards to the end of the line. Or perhaps a card is worth more points under certain other conditions, like the Count and Countess, each of which are worth 2 points, but are worth 4 each if you have both. There are also some nobles who have the sympathy of the people worth negative points, so no one wants to be the one to collect their head. This all makes things a slightly interesting.\n\nBut, where an interesting game actually emerges is in the card play. Before collecting the head of the noble who is next in line, players have the option of playing one of the action cards in their hand. These cards can do almost anything from giving bonus points, to increasing the value of cards of certain colors, to stealing cards from other players. But usually they allow the player to somehow manipulate the order of the line, either moving a certain color card up to a certain number of places, or maybe moving any card of their choice a specific number of spaces forward or backward, or what have you.\n\nThere’s great variety in the action cards, so it will be hard to keep track of all of them and remember all possibilities when thinking about what your opponents might be able to do on their turns. There are cards the randomly rearrange the line, completely reverse the line, or even discard and replace all the nobles.\n\nIt’s light and fun, although a veteran player will have the distinct advantage of having a better knowledge of what action cards there are. The cute treatment of the dark theme along with enjoyable card play makes this an easy classic to recommend and a super easy choice to bring to almost any table. You can teach it in about 2 minutes, but players will be enjoying learning and figuring out all the ways in which they can play for hours to come.\n\nPlay time might be a bit long for a game like this if you play a full 3 days (rounds, where 12 nobles are lined up that end when all 12 heads have been lopped off). But you could always choose to just play a single round, just watch out for cards that specifically impact how that might play.",
    "timestamp": 1672441200
  },
  {
    "username": "jgrasela",
    "rating": 10.0,
    "comment": "Fun and quick!",
    "timestamp": 1757973600
  },
  {
    "username": "SquirrelInATree",
    "rating": 10.0,
    "comment": "Fun little game with fun art\n\nMade in USA",
    "timestamp": 1757714400
  },
  {
    "username": "cotomel",
    "rating": 10.0,
    "comment": "Classic",
    "timestamp": 1737673200
  },
  {
    "username": "ricklaporte",
    "rating": 9.5,
    "comment": "Paul Peterson - Wizards of the Coast",
    "timestamp": 1704236400
  },
  {
    "username": "nponcian",
    "rating": 10.0,
    "comment": "Pros\n\n- Easy to learn and teach.\n\n- Fast to setup and play (less than 30 minutes).\n\n- Small table space is enough to play.\n\n- Replayable because of the variety in the order of point cards (nobles) as well as action cards that appear from game to game. Some point cards even have effects does affecting the gameplay. Action cards also changes the game in a way thus making each game unique.\n\n- Not multiplayer solitaire. Since there is an ordered line of cards which will be get by each player on their turn, all players want the best card from the same line of cards, creating a competition on that by playing action cards that could change that line on their turn. Most action cards also affects other players directly in other ways.\n\n- Very fun to play! The effects of the action cards are very fun to plan around and execute. Getting a point card (noble) is exciting as you collect sets of cards that you need to score more.\n\nNeutral\n\n- Especially nowadays in the connected world, and a softer world, where everyone has a negative comment, the theme might be seen as a negative. I don't mind it because during the game, while it is thematic, it doesn't feel like you're \"killing\" someone, it just feels like you're \"collecting\" a card. This is because of the simplicity of the game which makes it feel very light.\n\n- No tiebreaker. On my first game as a 2-player game, we both scored 45 points! I don't mind it, I actually prefer no tiebreaker in games because if both of you scored the same number of points, then no one can actually brag about it as it's the same number of points regardless of what tiebreaker rules are there \n\nCons\n\n- In my collection, including those that I already sold, I had a total of around 67 board game boxes. Want to know what's the most useless one? This Guillotine's box! To emphasize, the art is good, the box itself looks nice, but it's useless. It isn't the usual \"open the lid\" type of box but rather like the cereal boxes. For you to insert the cards, you have to trust gravity to not scatter them upon landing at the bottom of the box. That isn't even the worst part! If you sleeved your cards, then just burn the box because it wouldn't fit any (since there is also the cardboard for the executioner inside the box). I just put my cards separately in a paper bag.\n\n- The additional executioner cardboard could have been just the box itself! If you already saw how Tiny Epic games do it, they maximize the usage of even the boxes themselves. I don't mind additional components if there is enough space in the box, but if the box itself is already trash, then that is where I have a problem. They could have even just designed an insert that also converts to the executioner, instead of a totally separate executioner in a useless thin box.",
    "timestamp": 1703113200
  },
  {
    "username": "Jfitch1",
    "rating": 10.0,
    "comment": "Love it for what it is. Short. Simple. Charming. Fun.",
    "timestamp": 1695765600
  },
  {
    "username": "Tau_Zero_II",
    "rating": 10.0,
    "comment": "https://danielsolisblog.blogspot.com/2015/07/one-thing-to-av...\n\nIn addition to removing the \"Callous Guards\" card, we also play without the \"Robespierre\" and \"Scarlet Pimpernel\" cards. Both of the latter cut the game's 3 \"days\" short.",
    "timestamp": 1692568800
  },
  {
    "username": "Wills2003",
    "rating": 10.0,
    "comment": "4\nBought this based on the reviews - and then let it sit for a year before I tried it. Excavated it this holiday season - played 2-player and we both really really enjoyed it. Easy to learn - and very replayable. I'll be buying this game as gifts next holiday season. Thumbs up!",
    "timestamp": 1682287200
  },
  {
    "username": "Alphr",
    "rating": 10.0,
    "comment": "Fantastic game for people that don't play normally play board/card games, with just enough enough player interaction and planning to keep veterans from getting bored.\n\nWith almost no need for instructions, this is always the first game out with new people, or for a quick icebreaker at the start of game night.",
    "timestamp": 1675378800
  },
  {
    "username": "Gamers Closet",
    "rating": 10.0,
    "comment": "Review published on Aug 11, 2019\n\nhttps://www.youtube.com/watch?v=9y9gjdlAzls",
    "timestamp": 1666476000
  },
  {
    "username": "DragonWolfGamer",
    "rating": 10.0,
    "comment": "Love this game",
    "timestamp": 1664920800
  },
  {
    "username": "Shardifier",
    "rating": 10.0,
    "comment": "Easy for new people to pick up, nice art, very portable - all round a fun game that I love. I've played my copy so much the box is faded on one side and falling apart!",
    "timestamp": 1664488800
  },
  {
    "username": "Tolkana",
    "rating": 10.0,
    "comment": "12\n\nKul filler!",
    "timestamp": 1661637600
  },
  {
    "username": "Kaine0986",
    "rating": 10.0,
    "comment": "Incredibly nostalgic, very easy to introduce",
    "timestamp": 1654120800
  }
]