[
  {
    "username": "Schmusetiger",
    "rating": 1.0,
    "comment": "Just not my type of game.",
    "timestamp": 1406757600
  },
  {
    "username": "dragonchilde21",
    "rating": 2.0,
    "comment": "Maybe the explanation was poor or I just don't like trick taking games, but I hated every moment of playing this. I especially dislike the bidding section.",
    "timestamp": 1651615200
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not for me",
    "timestamp": 1633903200
  },
  {
    "username": "pvtparts",
    "rating": 3.5,
    "comment": "Counter-intuitive and awkward almost all the way through.",
    "timestamp": 1757800800
  },
  {
    "username": "Flamebeard",
    "rating": 5.0,
    "comment": "Played",
    "timestamp": 1753912800
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "A collection of trick-taking games. All the games are OK, but nothing really stands out as great.",
    "timestamp": 1731366000
  },
  {
    "username": "iadena",
    "rating": 6.0,
    "comment": "An interesting trick taker where depending on player count you play in teams of some configuration. When you bid to decide trump, you are revealing cards from hand for the rest of the round. Sometimes what you decide on trump and number can make your worst hand become the best hand or the best hand become worst. There is strategy in choosing your partner. I have not played a trick taker that throws me off like this. Will try again but no need to own.",
    "timestamp": 1753653600
  },
  {
    "username": "Jrb259",
    "rating": 6.0,
    "comment": "Mü is an interesting trick-taking game.\n\nEach round, players auction how many points they will win to become the cheif. Other players can choose to tip their hands if they want to try to form an alliance with the cheif. The cheif then chooses a player with a lower bid to partner with for the round.\n\nThe player who bid the second highest becomes the vice-cheif. The role of the vice chief and everyone else, is to form an alliance that seeks to stop the cheif from hitting their goal.\n\nVice cheif gets to select a trump # or suit first, followed by the cheif, who selects a dominant trump suit or # second. Then the trick taking begins.\n\nIf you are delt a bad hand in this game, it can feel very frustrating. You essentially just trash cards every round while someone else wins the tricks. Conversly, if you have an epic hand AND the dominant trump suit, you can essentially run the table. This was the case in our second round, where my partner and I won every single trick except for one. It was a blood bath!\n\nThis means the fun you will likely have is in direct correlation to the cards you are delt. Some rounds are not fun at all. Others are epic, but at the expense of the fun of other players. I feel like Mü amplifies the pain a bit more than I like, even for a somewhat short game.\n\nCatching up once you are behind in this game is incredibly challenging. For one thing, you need to avoid partnering with someone who is beating you in points. Secondly, to really get big points, you need to be the cheif, which will not happen or make sense unless your cards are strong enough to win at least half of the tricks.\n\nAs the cheif, in a 5 player game, this essentially means two players need to win over three players. That's the fun part with the alliance, but if the cheif chooses the right dancing partner, this happens more often than not.\n\nOverall, this was an interesting experiment. I would be willing to try it again. Our first play was slowed down a bit by not completely comprehending the scoring and some of the rules.",
    "timestamp": 1736722800
  },
  {
    "username": "guimel",
    "rating": 7.0,
    "comment": "Traded on BGG October 2025. Very good condition. Collection of card games in compact box. Suitable for 2 players for one game in this box. Some require 3 players, doesn't get a great deal of play. Great illustration and many games to play with this set. Beautifully illustrated by Doris Matthaus . Compact box with various card games included involving bidding and trick taking. Tradied away due to minimum player requirement for some games in the box. BGG member ranking 7.2 BGG Strategy rank 921. Awards winner and nominations:\n1996 Spiel des Jahres Recommended\n1996 Fairplay À la carte Winner\n1995 Meeples Choice Award Nominee",
    "timestamp": 1760047200
  },
  {
    "username": "JohnGrimes",
    "rating": 8.0,
    "comment": "Viel zu lange nicht gespielt!",
    "timestamp": 1750716000
  },
  {
    "username": "aadepizol",
    "rating": 9.0,
    "comment": "Best card game for five people",
    "timestamp": 1755986400
  },
  {
    "username": "dudi",
    "rating": 10.0,
    "comment": "Great game I play since more than 25 years, regularly since 12 years.\n\nFinally available again in a revised version with new great card design and new beginners rules. If you already know Mü and need new cards, just take the new box and use the cards from there to be able to play classic version of Mü.\n\nAlways use classic rules. Revised rules could help people learn the game, after a few games I recommend trying classic rules and deciding yourself after a few games which rule set you prefer.\n\n\"& more\"-Games are worth a try!",
    "timestamp": 1760738400
  }
]