[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Nothing makes you feel heroic quite like hiding in a corner from bats! Tabletop RPGs became their own unique thing, and Computer/Video RPGs also turned into something else. I guess this is a roguelike, but one trapped in the 70s, players having to read hundreds of pages of documents, while the rest of the genre does this better and faster. I think that's what most shocked me, that there's hardly any interaction between characters, yet you're forced to play at the same time...... huh I guess that's most of the hobby now, nevermind.",
    "timestamp": 1729548000
  },
  {
    "username": "Grumbling Grognard",
    "rating": 1.0,
    "comment": "This was the first game I ever mail ordered or pre-ordered (in 1978). I love AH games and Fantasy games as well; but this game (in its first edition) was enough to put me off preordering anything for DECADES.\n\nI have read fans have fixed the \"rules issues\" from the first edition (now at v3 I think), but that will never get me the lost MONTHS of my (now long gone youth) of attempting (and failing) to make the game work... I remember being stunned that my beloved Avalon Hill would release a game in such an un-playable state.\n\nApparently the \"fans\" remade the game, or there are several errata...",
    "timestamp": 1705273200
  },
  {
    "username": "MartynF",
    "rating": 1.0,
    "comment": "We never even got to meet each other when playing the game with 4 players.",
    "timestamp": 1630188000
  },
  {
    "username": "postkarma",
    "rating": 1.0,
    "comment": "Goodwill find. Sold. Loved the map tiles (from Karim's redesign )... Maybe I'll print up a set and use them for a generic overland dungeon crawler. Yeah. Still, I'd love to find another copy, someday. I'll let you know.",
    "timestamp": 1614380400
  },
  {
    "username": "ChaosCreature",
    "rating": 1.0,
    "comment": "set up alone takes ages. way too many rules and parts for me",
    "timestamp": 1531173600
  },
  {
    "username": "gunnaronthesaw",
    "rating": 1.0,
    "comment": "Unplayable with original rules",
    "timestamp": 1216332000
  },
  {
    "username": "Nick Barker",
    "rating": 1.0,
    "comment": "Oh my god, head for the hills. The decent components cannot save this from being a tedious and unplayable mess. A pity, as it always looked promising, but what a mess. Should never have been released in this state. Not a game so much as an early stage play-test kit.",
    "timestamp": 1101078000
  },
  {
    "username": "DuckSoupProductions",
    "rating": 2.0,
    "comment": "It looked promising! The box hit all my triggers! IT FAILED SO BADLY. A couple of good ideas BURIED under Complexity for its own sake. LOUSY.",
    "timestamp": 1678834800
  },
  {
    "username": "ZDog1",
    "rating": 2.0,
    "comment": "Some gave this to me when I was a kid and I never did figure it out. No wonder!",
    "timestamp": 1548111600
  },
  {
    "username": "lordvoldemort",
    "rating": 2.0,
    "comment": "This game is awful. The only reason I played is one of friends liked it. Conceptually, it was ambitious for 1979, but it shipped with rules that were fundamentally broken. For years, there has been errata created by fans of the game that make the game unbroken. I would not say it is playable. If you are going to play, you need to play with Realmspeak, but it is painfully long, fiddly and really pretty difficult. The game has so many exceptions, magic is incredibly complicated and even with updated rules makes little sense. Having said all this, when you beat a monster after defeating the puzzle, the game has its moments. But it is just not worth it for the amount of time it takes you to learn. Play Mage Knight if you want to play a good game that provides effectively the same experience.",
    "timestamp": 1464904800
  },
  {
    "username": "heikman",
    "rating": 2.0,
    "comment": "You have to see this as what it is.. a piece of game history.\nWould i play it for fun? No, never.\nAm i facinated by it as a predecessor to modern gaming & early computer adventures? Yes, definately!\n\nExcept for the deck-building it shares many similiarities with Mage Knight by Vlaada Chvatil. But they went for a much broader & open sand-box style. That sand-box attempt comes with a rule book of 120 pages and a second highest complexity rating by it's publisher Avalon Hill.\n\nI highly recommend trying it out, in the same way you should play a sierra adventura on the computer to see the base structure behind all dem new & shiny titles.",
    "timestamp": 1455318000
  },
  {
    "username": "1nf1n1ty",
    "rating": 2.0,
    "comment": "I found this virtually unplayable.",
    "timestamp": 1434405600
  },
  {
    "username": "jcarvin",
    "rating": 2.1,
    "comment": "Just waaaaay too complex, long, and tedious. Maybe this was good back in the days when there weren't so many RPG available but I just think that newer games do it so much better and faster than this.",
    "timestamp": 1418770800
  },
  {
    "username": "pbrink",
    "rating": 2.0,
    "comment": "Rating based on 1st edition rules.",
    "timestamp": 1416870000
  },
  {
    "username": "VEqualsIr",
    "rating": 3.0,
    "comment": "Dear lord... what can one say? For its day it might have been innovative and ahead of its time, but now? It is behind the times. The lengths the people who designed this thing went to in order to avoid using dice is way over the top.\n\nI got this game when I was 16, and never found anyone willing to go through the ordeal of learning to play it until I was in my 30s. Once I did the first thing I learned was that there were much better games to play for much less overhead.",
    "timestamp": 1672614000
  },
  {
    "username": "Zombie_Jawa",
    "rating": 3.0,
    "comment": "6.5 hours and still couldn't figure out how to do combat with a bat. No. Games have moved on.",
    "timestamp": 1663538400
  },
  {
    "username": "mistermarino",
    "rating": 3.0,
    "comment": "I bought this because I found it relatively (though not absolutely) cheap on eBay. But I HATE this game--or at least I hated it when I was a kid. So I guess I've got to figure out how to play it and give it another try. I never forgave my then best friend for forcing me to play this in high school. It seriously traumatized me. But I admit it was only one play, and possibly I was in a bad mood or it was just a bad day or I was prejudiced by the fact that my friend generally had lousy taste in games or something equally vapid that I refuse to apologize for. I guess I would play it again if there were some relatively painless way to learn the rules.\n\nI would consider trading it, but it would need to be a really good offer. It's definitely not going out for anything outside of my top 10 most wanted. I would consider selling it for a good offer.\n\nTraded it for Dungeon Degenerates and expansions and counted myself lucky.",
    "timestamp": 1598738400
  },
  {
    "username": "sctreno",
    "rating": 3.0,
    "comment": "another game that needs to be redone ,updated, streamlined, and better rule writing.",
    "timestamp": 1581634800
  },
  {
    "username": "pulla",
    "rating": 3.0,
    "comment": "Stupid, confusing, and unbalanced crap.",
    "timestamp": 1524002400
  },
  {
    "username": "peaks326",
    "rating": 3.0,
    "comment": "Don't believe them. Nobody knows how to play this game.",
    "timestamp": 1496354400
  },
  {
    "username": "Young, rich and sexy",
    "rating": 3.0,
    "comment": "Rulebook monster with much too fiddly rules.",
    "timestamp": 1477173600
  },
  {
    "username": "kameronsnewphone",
    "rating": 4.0,
    "comment": "Spent weeks mastering this ruleset and wanted to love it so much. But at the end of the day, it's just not a well designed game. The forums for the game are full of fans who swear by the 'depth' that comes from learning characters, counting your odds, etc. Honestly don't believe it. I respectfully believe these players are seeing the game theough very rosy nostalgic glasses. There is *not* depth to your decisions in the modern definition of the word. It's a game full of walls that provides no toolkit to climb them. There's no skill set to develop as a player, and no decisions to ponder beyond the chances behind your next die roll. Success in this game is rolling a die to loot treasure as your sole action for 10 or more full turns in a row (in a 30 turn game), and hoping maybe you roll the number that unlocks a path to progress on. Using detailed game knowledge (card distributions, etc.) from repeated plays to slightly increase your winrate is the only thing provided to players to compensate for the complete lack of strategy and tactics, and learning to abuse this game knowledge is the opposite of rewarding. It's depressing.\n\nThe theme and aesthetics are SO FUN and the game systems are fascinating and novel, but the game as a whole is absolutely a failed experiment.",
    "timestamp": 1739660400
  },
  {
    "username": "philip.dutre",
    "rating": 4.0,
    "comment": "Tried to play it many times, but never really got it. I like real rpg's better. I bought it again after so many years, to give it another shot.",
    "timestamp": 1714341600
  },
  {
    "username": "Desiderata",
    "rating": 4.0,
    "comment": "Not terribly as exiting as I hoped. Too much downtime between turns (especially during combat), and the dice rolling was excessive. Roll to hide, roll to fight, roll to search for treasure, roll to gain followers, roll to... I was a white knight with a great sword and armor, and I died fighting bats!\nWe didn't play where you had to plan your move in advance, but I can't see that making the game better, only harder.\nWe didn't even do much in the way of Magic, but just the combat system itself seemed way more complicated than it should be.\nI'm not really interested in playing this one again, although I do respect the game and I understand the value it has for others. I'd be willing to try this again but only solo, and I can even expect it would be fun.\n\nUpdate: Years later and now I'm VERY interested in learning this game and exploring it in depth. I am confident my first play was spoiled by too many new players (me included!). As with most games I enjoy, the first play is far from ideal, and this game seems to reward extensive study and exploration. And I love the aesthetic of the character chits with their unique symbol instead of being represented by a plastic mini.\n\nUpdate 2018: Nope. Just too convoluted, long and random for my taste. Characters are not balanced--some are even clearly weak in solo games. The dice rolling mechanic is off-putting. And the changing landscape just makes my brain hurt.",
    "timestamp": 1706569200
  },
  {
    "username": "Larry Welborn",
    "rating": 4.0,
    "comment": "A game that I really want to like but the rules are so confusing. Sold",
    "timestamp": 1638658800
  },
  {
    "username": "Rob Beekman",
    "rating": 4.0,
    "comment": "Owned by Antal",
    "timestamp": 1590876000
  },
  {
    "username": "snowdog_ix",
    "rating": 4.0,
    "comment": "This game was OK to play when I was a kid, but was a huge amount of work to set up and way too complex for not much added value in a fantasy game. The biggest monster in the box is the rulebook.",
    "timestamp": 1574895600
  },
  {
    "username": "josefsallen",
    "rating": 4.0,
    "comment": "Your choices take a backseat to the unforgivable reliance on dice rolling.",
    "timestamp": 1482793200
  },
  {
    "username": "golden_guy_1999",
    "rating": 5.0,
    "comment": "For trade only.",
    "timestamp": 1739228400
  },
  {
    "username": "RobertBrockway",
    "rating": 5.0,
    "comment": "Overly complicated. Would have been a much better game with simpler rules.",
    "timestamp": 1721340000
  },
  {
    "username": "zautman",
    "rating": 5.0,
    "comment": "I felt like I should have been the perfect target for this game. I enjoy AH games, play complex wargames like Squad Leader, and am an old school roleplayer. I also love dungeon crawls, but wanted something meatier and with more chrome than the typical dice roller. The original game rules (even second edition) are difficult to understand, but the excellent tutorial overcomes all these faults. The game is also very fiddly and has lots of chrome, but I typically do not mind this if it adds more depth and theme to a game.\n\nMy problem with Magic Realm is that it simply was not that much fun or exciting. While there are many different character classes and their special abilities and varying chits drive one to use different tactics, I just could not get very enthused about them nor did I find that I wanted to explore them more after a game. So one guy has more move chits or some T and H chits – yawn. I just could not get excited even if they had a T1 chit. Combat is complex, but it felt more like a puzzle where you tried to figure out what chit to play where and hope the denizen did not move or change tactics rather than the tactical challenge I usually find in wargames. The monsters are humdrum (does anyone really get excited about bats or wolves?) and their only real difference is their size, speed, and damage class, but other than that there was not much difference between a bat and a dragon. While the spells and treasures had some interesting names, the rest of them felt more like raw numbers with little theme. As for the adventures, there wasn’t really any mysterious temples or scary dungeons to explore. You mostly just wondered around until a chit or monster roll caused a monster to appear or you ran into another character. Yes the howls, flutters, and dank chits added a little sensory cues to the game, but not enough to overcome the other blandness.\nI played this game in 2020, not back in the day. My comments are not biased by nostalgia. The game has not aged well at all and nostalgia is the only reason I can see spending $$$ to track down a copy of this. I see no need to remake this unless it undergoes a near complete overhaul. I would spend the money and buy something like Gloomhaven that also gives you a lot of replayability, but so much more.",
    "timestamp": 1608246000
  },
  {
    "username": "HikerHistorian",
    "rating": 5.0,
    "comment": "I repurchased this for a nostalgia fix. I played the first three Encounters and, well, it was painful. Finally had to clear it off the table to make room for the next game. But I will revisit MR down the road, check out the updated rules and later encounters, and maybe give Realmspeak a go. I did manage to do an awesome box repair, so there is that.",
    "timestamp": 1603144800
  },
  {
    "username": "Meadbeard",
    "rating": 5.0,
    "comment": "Artifact of a time when games were sometimes designed to describe literally everything.\n\nInelegant to a level of insanity. Tremendous depth, if you put the time into it. Completely unbalanced; clearly not play tested.\n\nThere are great ideas here, but it's difficult to justify exploration unless you're designing a game, and even then...\n\nAstonishing that this project was funded and published; Needed an editor; nonetheless groundbreaking.\n\nThe Ford Model T was also groundbreaking. You don't drive one. You don't want to drive one. If you owned one, you wouldn't drive it. There's a reason for that.",
    "timestamp": 1596405600
  },
  {
    "username": "max2k",
    "rating": 5.0,
    "comment": "I even don't not know wher is gone to ....",
    "timestamp": 1596060000
  },
  {
    "username": "amusedleg",
    "rating": 5.0,
    "comment": "Had this in the early 80s. I am not sure we ever figured out how it worked. It did have some cool ideas in it.",
    "timestamp": 1585519200
  },
  {
    "username": "kegz",
    "rating": 5.0,
    "comment": "Rules Realm...",
    "timestamp": 1565388000
  },
  {
    "username": "mrgreason",
    "rating": 5.0,
    "comment": "Long setup time. Hard to succeed at. Overly complex.",
    "timestamp": 1560290400
  },
  {
    "username": "GordonH",
    "rating": 5.0,
    "comment": "Sold 2018 at Lebanon A Con $100",
    "timestamp": 1553554800
  },
  {
    "username": "lollythecat",
    "rating": 5.0,
    "comment": "Have owned since new. Successful games feel great, but downsides are that it is quite complex, and does not have a not a great combat system. Set up is time consuming, and death can be (very!) quick and brutal. Having said that, Realmspeak is great - games can still be short, but at least you aren't setting up the board each time!",
    "timestamp": 1545606000
  },
  {
    "username": "ecz67",
    "rating": 5.0,
    "comment": "after countless attempt to learn the combat (and its convolute tactis) including a few games played via internet with the help of a patient gamemaster, after I have read three (3) different versions of the rules with all the game aids available; after I have also tried Realm Speak I can finally say the game sucks.",
    "timestamp": 1508450400
  },
  {
    "username": "Hanno12",
    "rating": 5.0,
    "comment": "Old fashioned and fiddly game play. Combat feels fully random.",
    "timestamp": 1500760800
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 5.0,
    "comment": "First impression. Huh? Very confusing and over-wrought game. But so many friends have high regard for this game, that I have purchased a copy to further explore...",
    "timestamp": 1483052400
  },
  {
    "username": "lhamichelle",
    "rating": 6.3,
    "comment": "I let someone buy this game from me back in 1997 and I am still kicking myself... I only ever got to play it twice, which is why I let it go, but I really thought that game was way ahead of its time and now it's impossible to find an affordable copy. Darn it. UPDATE: I finally found one!",
    "timestamp": 1745532000
  },
  {
    "username": "bobjohnson",
    "rating": 6.2,
    "comment": "+ Immersive, amazing variety with only 20 tiles.\n- Long game, very complicated rule book.",
    "timestamp": 1742079600
  },
  {
    "username": "kastel",
    "rating": 6.0,
    "comment": "Dc0",
    "timestamp": 1717797600
  },
  {
    "username": "Gamil_",
    "rating": 6.0,
    "comment": "WTB... for under $100.",
    "timestamp": 1665784800
  },
  {
    "username": "wamsp",
    "rating": 6.0,
    "comment": "players: 1-16 (best: 3-4)\nweight: 4.5\ntime: 240\n\nApril 2018",
    "timestamp": 1654034400
  },
  {
    "username": "enduran",
    "rating": 6.0,
    "comment": "Turns out that it's not a game about advancement of one's character, but I still like the idea of the random map and various kinds of adventures. The combat probably isn't any great shakes, but I think it's also not all that much about combat.",
    "timestamp": 1652738400
  },
  {
    "username": "Jimmer",
    "rating": 6.0,
    "comment": "I love fantasy adventure-style games, and...if you want to play this one, play it with some folks who have played it before. It has a great game designer backstory, and you can see its influences in so many games afterward. I don't love it, but I'd still play it without too much grief.",
    "timestamp": 1651788000
  },
  {
    "username": "Akumala",
    "rating": 6.0,
    "comment": "This feels less like a board game, but like an rpg on a board, and i feel, that you need to \"play\" this game exactly like that, and with a bunch of other players in the right mood, to enjoy it.\n\nOtherwise, you just get an overwhelming amount of rules, that cover surprisingly little meat and tactical depth...",
    "timestamp": 1624658400
  },
  {
    "username": "Born-of-Ashes",
    "rating": 6.0,
    "comment": "Took an hour to setup and explain and when I died in the first 30 minutes the owner called the game saying he just liked to break it out at least once a year. I can see how it is a good RPG substitute, but then it isn't really for competitive play. Definitely hasn't aged well.",
    "timestamp": 1601589600
  },
  {
    "username": "NerwenGreen",
    "rating": 6.0,
    "comment": "It comes across as something that wants to be fast paced and streamlined. But everything is super fiddly with setting up and keeping track of all the bits. It's also possibly not very well balanced against randomness.",
    "timestamp": 1586124000
  },
  {
    "username": "eluvitar",
    "rating": 6.0,
    "comment": "Sadly, pretty much unplayable. Some great mechanics, but just too fiddily to play F2F and the combat takes forever. Realmspeak is pretty good though. I'd give it a 3, but i'll make it a 4 b/c of realmspeak. Needs to be remade. There's a good game in there somewhere.",
    "timestamp": 1585263600
  },
  {
    "username": "Yekrats",
    "rating": 6.0,
    "comment": "Interesting idea, but too damned long and complicated. Of course, I tried to teach myself.",
    "timestamp": 1580252400
  },
  {
    "username": "James Goldfinch",
    "rating": 6.0,
    "comment": "Role Playing light. Nothing you couldn't do in a much more fun way with a real roleplaying game.",
    "timestamp": 1579906800
  },
  {
    "username": "Bien",
    "rating": 6.0,
    "comment": "Edit: If this is taught and played by all experienced players, it's actually a enjoyable \"sandbox\" game.\n\nTHE WORST. I'd rate it lower, but the sheer force of will by gamers has made this into a \"game\". I pity anyone who played any roleplaying table top games and subjects themselves to this.\n\nYou write down your moves in advance. You make a few D6 rolls. Sometimes you're lucky and you'll get a chance to make more D6 rolls to get loot. The battle system is probably the best part, but is clunky and boring.\n\nOwning this game was a curse and I'm glad I ebayed it.",
    "timestamp": 1576710000
  },
  {
    "username": "rws2029",
    "rating": 7.3,
    "comment": "Magic Realm is an amazing, one of a kind, fantasy classic that could only have been created at its seminal moment in time when the foundations of RPG and fantasy board gaming were being laid. Today’s game designs are focused on lowering the barrier to entry for players, and the current aesthetic calls for simplification to facilitate play. In the era of Magic Realm’s creation the accepted paradigm was, “the more effort you put into a game, the more enjoyment you could take from it.” The extensive rules provided fuel for players’ imagination.\n\nMagic Realm is an artifact from the past, but one that can still provide great pleasure if approached with an awareness of its origins.",
    "timestamp": 1759096800
  },
  {
    "username": "Mark.Watson",
    "rating": 7.0,
    "comment": "So complicated. Every time I play this game I get confused. Still fascinated by it.\n------\nEarly impressions make me think this game is amazing, but time will tell. Seems super cool. Rule book (2nd Ed) is bad but not horrific. Main issue is that it repeats itself again and again and has no index. Game is quite long, but as the game opens up it all makes more sense.",
    "timestamp": 1756332000
  },
  {
    "username": "GeminiWeb",
    "rating": 6.5,
    "comment": "Don't think I've ever played this properly ... and have only played it at all on a few occassions in my distant past ... but I still consider it a classic fantasy adventuring game. I must properly get into it one day and I am sure the rating will rise .Perhaps RealmSpeak is something I should be looking at...",
    "timestamp": 1754863200
  },
  {
    "username": "bucklen_uk",
    "rating": 7.0,
    "comment": "Originally had 1st Edition, and we played through the first 4 encounters and gave up. Later got the 2nd edition, but no-one wanted to try it again \nIf anyone wanted to play I'd relearn all the rules and play!\n\n2nd edition long gone, but now acquired first edition again…\n\nLets see if it gets played",
    "timestamp": 1729893600
  },
  {
    "username": "Larry Chong",
    "rating": 7.0,
    "comment": "Only played this partially for first time to get a taste of it. This seems like a wonderful fantasy campaign game, that is ideal for 2 or 3 players. More players tend to slow the game down a lot.",
    "timestamp": 1715205600
  },
  {
    "username": "wizardless",
    "rating": 7.0,
    "comment": "It's all to much this game for me to figure it out.",
    "timestamp": 1713736800
  },
  {
    "username": "questbird",
    "rating": 7.0,
    "comment": "The print-on demand remake",
    "timestamp": 1713045600
  },
  {
    "username": "whitecatplays",
    "rating": 8.0,
    "comment": "Played on RealmSpeak, had no idea why I died sometimes.",
    "timestamp": 1760738400
  },
  {
    "username": "Eric Brosius",
    "rating": 8.0,
    "comment": "This is a fascinating game, but it's hard to play without someone who already knows the rules. I would like to play more if I have a guide.",
    "timestamp": 1751580000
  },
  {
    "username": "VanVeen",
    "rating": 8.0,
    "comment": "Sold to Steph (punkin312) on 6-13-25. 2 copies sold",
    "timestamp": 1749852000
  },
  {
    "username": "MattG",
    "rating": 8.0,
    "comment": "A one-of-a-kind adventure that's great fun if you take some time to learn it. Upped my rating after the Book of Learning was released. Now the rules are awakened \n\nAdded a star due to RealmSpeak",
    "timestamp": 1748728800
  },
  {
    "username": "abodi",
    "rating": 8.0,
    "comment": "Made Print and Play version",
    "timestamp": 1748728800
  },
  {
    "username": "gamesbook",
    "rating": 7.5,
    "comment": "A classic - very complex in comparison to the modern 'german style' games - but well worth the time invested to learn it. Its going take more time than I have left in this life to get there...",
    "timestamp": 1746828000
  },
  {
    "username": "jiistme",
    "rating": 8.0,
    "comment": "Additonal Info: This is v3.2 of the redesign by Karim Chakroun. It looks to be a professionally printed copy, though I am not certain of that.",
    "timestamp": 1735772400
  },
  {
    "username": "Agglefot",
    "rating": 9.0,
    "comment": "Just got my 1st(?) edition copy. Excruciatingly complex, but accordingly rewarding. Not for the feint of heart.\n\nWhere Mage Knight's world felt painfully stiff/static, Magic Realm feels far more alive. Playing this is a glimpse into a vibrant and archaic time in game design. Delicious.",
    "timestamp": 1750284000
  },
  {
    "username": "TheBoyz",
    "rating": 9.0,
    "comment": "Played with a friend's set a few times. Really fun, incredibly hard, and so intriguing. Wish I had one of my own to play a campaign or two.",
    "timestamp": 1748815200
  },
  {
    "username": "MichaelLavoie",
    "rating": 9.0,
    "comment": "A marvelous game that is different every time it is played. The number of never-before-seen concepts introduced here is staggering; even with well-written and organized rulebooks, it would be intimidating to learn. Unfortunately, both official rulebooks are not very good. Once the game is figured out, it becomes an epic fantasy adventure. Richard Hamblen was a genius.",
    "timestamp": 1741388400
  },
  {
    "username": "omidmash",
    "rating": 9.0,
    "comment": "The definitive 80s fantasy game. One of the greatest games ever made, with a messy and terrible rulebook.",
    "timestamp": 1728856800
  },
  {
    "username": "acooper1004",
    "rating": 9.0,
    "comment": "played a lot as a kid with my late brother and friends, fond memories, would love to play again, got all the parts now, thanks to the magic Realm Parts Shoppe",
    "timestamp": 1727560800
  },
  {
    "username": "Schierke",
    "rating": 9.0,
    "comment": "Holy Grail of Boardgaming!\n\nStefan\n\nOwning:\n\n1st edition unpunched\n2nd edition punched\nKarim's re-design",
    "timestamp": 1724968800
  },
  {
    "username": "juno29",
    "rating": 9.0,
    "comment": "I'm still on the fence.. someday, somewhere, maybe I can get the will to learn this bahamut.\n\nedit: Had the pleasure of playing it two times with 3 fellas. I'm still discovering the game, but I want to play and learn more\n\nedit2: Working on it again, but this time I'm pretty hooked \nThis is an old pc roguelike (Rogue, Angband, Nethack, etc.) in form of a boardgame; losing is fun!\nWay waaay ahead of its time, and way waaay difficult to master... I'm really impressed by this design and I'm playing just the solitaire mode.\n\nMy new Best/favourite/most played 1 player game",
    "timestamp": 1723413600
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "This really is the ultimate fantasy game. The sheer number of options that you have to consider in any given game is dwarfed only by the sheer number of rules and exceptions that need to be learned. However, the combat system is amazing, adding brutal realism but clever tactics to what is often replaced with a single die roll in other fantasy games. The exploration and prowling rolls make for the most exciting map in any exploration game. The die roll system is brutal but productive. The magic system has so many nuances and strategies that it's virtually a different game.\n\nI can say so many things about this game, but really, only playing it can live up to your expectations and curiosity.\n\nAs to what edition to get, I have the Avalon Hill edition. I have examined the Karim redesign very closely. There are advantages to both. The AH design has generally better art and strictly better map tiles. However, weapon chits, monster chits, and denizen chits all leave something to be desired. Also, AH magic cards and treasure cards are functionally fine and terrible material-wise. Karim's redesign fixes many of the problems with the chits, adding a significant amount of information to the chits themselves and, more importantly, adding a consistent visual organization to the graphical design of the chits. I can't understate how nice this is. I'm very tempted to just make parts of the Karim redesign to mix with parts of the AH copy I have.\n\nJay Richardson's tutorial has been overwhelmingly useful. Go download it from the files section if you have not yet done so. 3rd edition rules are also necessary, and can be found in the same place.",
    "timestamp": 1759356000
  },
  {
    "username": "doktor avalanche",
    "rating": 10.0,
    "comment": "PP\nAnd Super realm.\nAmazing depth, great game",
    "timestamp": 1759010400
  },
  {
    "username": "kareds",
    "rating": 10.0,
    "comment": "This game has captured my imagination. I'll probably be editing this entry for years as I slowly untangle the ruleset and eventually, hopefully, the strategy.\n\nI hardly even know how to talk about it. Right now I'm mostly just in awe that this thing even exists. There are ideas here that I haven't seen anywhere else, and despite the ridiculous complexity it all somehow makes sense.\n\nGames are more than entertainment. If you want to see what it looks like when someone pushes the form to its absolute limits, you owe it to yourself to try Magic Realm out. Check out the BGG forums to download Realmspeak and start working through the Book of Learning. If there's anything quite like this, I haven't found it.\n\nEdit: I keep getting deeper and deeper into this. The depth is astounding.",
    "timestamp": 1756936800
  },
  {
    "username": "Bossmitch",
    "rating": 10.0,
    "comment": "My favorite fantasy based game. Has complexity, tons of cards, chits, and a great, small community of fans.",
    "timestamp": 1749160800
  },
  {
    "username": "mlolcu",
    "rating": 10.0,
    "comment": "My favorite game!",
    "timestamp": 1746914400
  },
  {
    "username": "Aniceto",
    "rating": 10.0,
    "comment": "PnP",
    "timestamp": 1744322400
  },
  {
    "username": "Blix",
    "rating": 10.0,
    "comment": "Story-Worthy\nReplayable Chaos\nDark & Tense\nSolo Banger\nGroup Dependent",
    "timestamp": 1743804000
  }
]