[
  {
    "username": "XAos",
    "rating": 1.0,
    "comment": "The best way to win this game is to give opponents no clue about which politburo members you might control.\n\nAnd the best way to do that, is...?\n\nWrite your initial bribes, seal them in an envelope.\nWalk away from the game and play something else for a couple of hours. Once the game is over, your opponents can open your sealed envelope and see if you beat them.\n\nAt a games convention, whatever else you play for those 2-hours will be more fun than kremlin.",
    "timestamp": 1301695200
  },
  {
    "username": "SamwiseGamgeeBan",
    "rating": 1.0,
    "comment": "Over-rated!",
    "timestamp": 1195513200
  },
  {
    "username": "kefyras",
    "rating": 2.0,
    "comment": "If you get party chief and kgb head positions, you're nearly invincible. This was a horrible experience where noone could topple the government the whole game. Thematic - sure, fun - no.\nAlso the rules are very hard to understand and the game is way too long.",
    "timestamp": 1720044000
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "You have to like this kind of games",
    "timestamp": 1629756000
  },
  {
    "username": "asfhgwt",
    "rating": 3.0,
    "comment": "Joyless. Just like Russia.",
    "timestamp": 1649800800
  },
  {
    "username": "pulla",
    "rating": 3.0,
    "comment": "Very clunky. Never again.",
    "timestamp": 1491948000
  },
  {
    "username": "newrev",
    "rating": 4.0,
    "comment": "Through a random kill, my random chosen guys died.",
    "timestamp": 1716242400
  },
  {
    "username": "larryjrice",
    "rating": 4.0,
    "comment": "FIRST IMPRESSION:\n\nIt wasn't a good first impression but at least I learned the rules. Our game lasted 3 rounds only as no one did enough to remove the president from office either turn. However, someone thought it important to remove my two guys and put them in Siberia even though they were lowly members of the Party. Yeah, a bit bitter. I don't know if I want to play again or not. The guess work involved in choosing your 10 guys to influence and not knowing how they might come out is not always ideal. I only had two of my guys come out early and the other two came out in the final round which made no difference whatsoever.",
    "timestamp": 1694383200
  },
  {
    "username": "RaffertyA",
    "rating": 5.0,
    "comment": "An AH multiplayer games that's both fun and it works. Lots of humor and lots of potential for trickery and backstabbing all while taking many calculated risks. Wave to the rabble, Boris.\n\nMost recent play dropped 2 points. Just too slow with very little ‘flow’. Also, those that guessed wrong on Influence may be powerless the entire game with having nothing to do.",
    "timestamp": 1759788000
  },
  {
    "username": "p00q",
    "rating": 5.0,
    "comment": "The lack of control and lack of grist for negotiation makes it feel like less of a game and more of an activity. Cute theming, some clever ideas that tie in nicely with said theming.",
    "timestamp": 1728165600
  },
  {
    "username": "Luds",
    "rating": 5.0,
    "comment": "Great material and great theme, but the gameplay falls a bit flat. I enjoy the pyramid of power and the aging of politicians in the game, but too many things were so random like the intial placement of politicians after having thosing which ones to influence.",
    "timestamp": 1696024800
  },
  {
    "username": "lebryant",
    "rating": 5.0,
    "comment": "Played it once and it left two different kinds of feelings to me. From one side, the game is very dated - way too long for what it is, dice chance doesn't help either with a possibility of being practically eliminated out of the game purely due to a die roll, it does not require any active involvement from players, and in fact promotes no involvement at all for at least the first half of the game. But from the other side, the game is very unique to its own genre and the fact that it came out in the mid-80s, is mind-boggling - genius design compared to the other games of that era.\n\n---\nlebryant's TOP games of all time\n---\n[2022]: 196/294 (top 67%) | Rating - 4 | Overall Plays - 1\n[2021]: 197/288 (top 68%) | Rating - 4 | Overall Plays - 1\n[2019]: 160/256 (top 63%) | Rating - 5 | Overall Plays - 1",
    "timestamp": 1689112800
  },
  {
    "username": "Migmeister",
    "rating": 6.0,
    "comment": "Not a bad concept... But after the first couple of rounmds, you can just end up with no one in play... Not bad for such an old game...",
    "timestamp": 1750284000
  },
  {
    "username": "RalfMalf",
    "rating": 6.0,
    "comment": "Only played this once and enjoyed it. The main downside was that it was over before it really got going. Need a second play.\n\nAfter another couple of plays: needs to be played quickly else it's too long for the randomness (typical 80s game!). Don't take it too seriously and it can be fun if the mood.",
    "timestamp": 1731366000
  },
  {
    "username": "Ursus Corvus Lapis",
    "rating": 6.0,
    "comment": "Played before BGG.",
    "timestamp": 1709161200
  },
  {
    "username": "Lord_Loren_Soth",
    "rating": 6.0,
    "comment": "3-6",
    "timestamp": 1708038000
  },
  {
    "username": "Femmi",
    "rating": 6.5,
    "comment": "More of an experience game than anything else- it is great for having a fun afternoon/ evening - but dont expect the world of tactical decision making and more just sitting , watching and enjoying randomness",
    "timestamp": 1759615200
  },
  {
    "username": "crewston",
    "rating": 7.0,
    "comment": "This game is confusing when first played but there is so much strategy and tactics in the bluffing and placement. A lot of people will walk away after their first game wondering what the hell is going on, but repeated plays really rewards and like chess it reveals its true depth over more plays.",
    "timestamp": 1742770800
  },
  {
    "username": "Riever32",
    "rating": 8.3,
    "comment": "Good game on Soviet politics filled with theme and tension. Always a good experience with its fielded to date.",
    "timestamp": 1756418400
  },
  {
    "username": "Pa_We",
    "rating": 8.0,
    "comment": "Needs a total redesign, but the game is fun and hilarious anyway.",
    "timestamp": 1754258400
  },
  {
    "username": "aristanton",
    "rating": 9.0,
    "comment": "Very good game of intrigue and hidden influence. I much enjoy the mechanic of you having hidden influence while the politicians (npcs) in select positions do the actions that determine the fate of others and only when you have them under your control you determine the decisionmaking. I would highly suggest this game to any collector that wants medium duration, medium complexity games of intrigue in their collection. I also own the revolution expansion which is fun but the game is equally fun without it.",
    "timestamp": 1755468000
  },
  {
    "username": "britchey",
    "rating": 8.5,
    "comment": "6sb, 5sd",
    "timestamp": 1739055600
  },
  {
    "username": "Balkotth",
    "rating": 10.0,
    "comment": "Very good game in large groups, a fun game of intrigue, lying, and deception. One of my favourites.",
    "timestamp": 1674169200
  },
  {
    "username": "hjc2270",
    "rating": 10.0,
    "comment": "USSR fan‘s fury（LoL） The design of using age as action point is so intelligent",
    "timestamp": 1669244400
  }
]