[
  {
    "username": "SJAirshark",
    "rating": 1.0,
    "comment": "Don't know about your copy, but mine had no explanation of how to set the game up.",
    "timestamp": 1554933600
  },
  {
    "username": "DaveTu",
    "rating": 2.0,
    "comment": "Game just does not seem to work very well. I have played several of the block games, and this is the only one that I didn't like.",
    "timestamp": 1238450400
  },
  {
    "username": "patrick stevens",
    "rating": 3.0,
    "comment": "Everything is there for a good game except the good. Perhaps too many charts? Or slow tedious play? Hard to say, but this just does not flow like most of Columbia's other block games. Try Dixie for a great Civil war title by Columbia.",
    "timestamp": 1293836400
  },
  {
    "username": "Zerosum",
    "rating": 4.0,
    "comment": "3rd edition: Didn't like the battle-board mechanic as implemented: melee, outflanking, artillery, column routs in any column, all felt a bit off to me. Leader system also seemed a bit superficial, especially the leader change rolls. New map artwork is a step down from previous editions. The new blocks look great, though.",
    "timestamp": 1581980400
  },
  {
    "username": "Shaynerichards72",
    "rating": 5.0,
    "comment": "Still not sure about this game...it has a lot to like, a few things to dislike but just lacks a certain something to make it spark. Can get annoyingly crowded on the map and some of the rivers etc make it hard to quickly see what crossing rules apply where etc",
    "timestamp": 1640818800
  },
  {
    "username": "PSIM2",
    "rating": 5.0,
    "comment": "3rd edition",
    "timestamp": 1626040800
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 6.0,
    "comment": "I far prefer the similar system seen in Columbia’s Napoleon The Waterloo Campaign- a better implementation and more enjoyable title.",
    "timestamp": 1758578400
  },
  {
    "username": "Gentilhombre",
    "rating": 6.0,
    "comment": "Unfortunately I have been dissapointed by this game (I own 3rd edition). Nearly all of the Columbia block games I have played are better and more fun for me than this one.\n\nThere are interesting ideas, like the leader activation, but overall I find the game a bit fiddly, with crowded fronts and little space for maneuver. The Union numerical superiority invites you to carry out an unimaginative attritional strategy that the Confederacy will find difficult to stop.\n\nIn general I also prefer point-to-point maps -the most common in Columbia Games- rather than hexagons.",
    "timestamp": 1694988000
  },
  {
    "username": "red_herring",
    "rating": 7.0,
    "comment": "Classic Columbia Block Game on the Virginia theater.",
    "timestamp": 1729288800
  },
  {
    "username": "Istvanffy",
    "rating": 8.0,
    "comment": "Interesting system, achieving decisive results difficult - but then perhaps that makes it a good simulation of the historical events! I will endeavor to play all the scenarios - but I am favorably impressed.",
    "timestamp": 1661292000
  },
  {
    "username": "Wiseguy4187",
    "rating": 9.0,
    "comment": "I prefer 2nd edition. They threw out the baby with the bath water in 3rd edition.",
    "timestamp": 1751234400
  },
  {
    "username": "Kukko",
    "rating": 10.0,
    "comment": "My rating applies only to the 3rd edition as I have no experience with the former ones. Not that accurate a simulation, as others have noted, the Rebs just can't do what they actually did without houseruling and will have to resort more to turtling. But given the level of abstraction the big picture of the theater somewhat comes through. As a game it's awesome, both sides will face painstakingly difficult choices every play. The tactical battle resolution familiar from Napoleon, trimmed to near perfection here, is a great addition to the \"EastFront Lite\" command control system. The battle system adds another layer of agonizing decisions and most importantly is FUN. Even the longest scenario usually doesn't play longer than 6 months of EastFront, so in that regard Bobby Lee is a definite go to game for me. The minor gripes I had about balance in the beginning aren't an issue after a few more plays, and were just due to my lack of experience. Close matches every time save a couple quick defeats because of drastic mistakes made.",
    "timestamp": 1629064800
  }
]