[
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "Chaotic, kludgy, unbalanced, no fun, luck-drenched. One of my most loathed games. Yecch! Mistermarino's comments say it all, e.g.:\n\n\"This game is so bad that someday, when time travel is invented, it will turn out that the reason it was invented was so that the first time traveler could go back and prevent the game from ever existing.\"",
    "timestamp": 1682546400
  },
  {
    "username": "joakim589",
    "rating": 1.0,
    "comment": "Played the swedish edition called \"Universums härskare\". Worst game I have ever played.",
    "timestamp": 1474581600
  },
  {
    "username": "NeonElf",
    "rating": 1.0,
    "comment": "this game is so random you might as well play Calvin Ball. Certain cards let you cheat without supervision by moving tokens or stealing cards without revealing the card! In my opinion this is the worst kind of game.",
    "timestamp": 1462053600
  },
  {
    "username": "Gabriel",
    "rating": 1.0,
    "comment": "good condition all the parts in the game,none missing",
    "timestamp": 1413928800
  },
  {
    "username": "mistermarino",
    "rating": 1.0,
    "comment": "Less appealing than a sharp stick in the eye. It's been 20 years, and I'm still traumatized by my idiot friends' bizarre devotion to this monstrosity, and the handful of games I was lured into. Utterly boring and trivial, requiring virtually no skill. Fortunately, you can play while eating, drinking, talking and socializing, without paying any attention to the game itself. The most horrible game I have ever played, possibly the most horrible thing of any kind ever.\n\nI was disappointed* recently to learn that for the \"Hating the Top 100\" GeekList, this 8-year-old comment was not the \"most scathing\" 1 rating for the game. The horror! So I am updating it as follows to make sure that, should another such list be attempted, there is no chance of being overlooked.\n\nThis game is so bad that puppies cry themselves to sleep when it is mentioned. This game is to Dutch parents what the boogeyman is to American parents, except that it will only kill the little Dutchlings if they are impolite or eat all the whale blubber. This game made babies with Satan, but they were too rowdy and ate the expensive furnishings, so they were sent to live with the Kardashians.\n\nThis game is so bad that someday, when time travel is invented, it will turn out that the reason it was invented was so that the first time traveler could go back and prevent the game from ever existing. Except of course that, when he returns from the past, his explanation makes no sense, because now no one has ever heard of the game. So he will have had to go back again and make it exist so that his motivation for extinguishing it will make sense, and then the whole Time Paradox Causality Matrix Effect drives him insane and he overloads the time machine, killing everyone in a 500-mile radius around Modesto, California, a place I have never been but which has an unpleasant sounding name and is, probably, the sort of place where the sort of person who invents time travel would live.\n\n*And by disappointed I mean not affected in any way except to be mildly amused.",
    "timestamp": 1334095200
  },
  {
    "username": "kssonn",
    "rating": 1.0,
    "comment": "It's not really broken. This is just the game I hate the most of those we own.",
    "timestamp": 1216677600
  },
  {
    "username": "juiblexlovesyou",
    "rating": 1.0,
    "comment": "its like yars revenge with even less idea about the purpose of, i dunno, anything? please just get twilight imperium and be done with this complete waste of papyrus. the only people who could possibly like this game probably still play d&d and have all their friends call them by their character's name in public. and they probably own a mac.",
    "timestamp": 1210888800
  },
  {
    "username": "EvilTimmy",
    "rating": 1.0,
    "comment": "Lamest. Game. Ever.",
    "timestamp": 1190325600
  },
  {
    "username": "petershergalis",
    "rating": 1.0,
    "comment": "I tried very hard to like this game, but there seemed too many ambiguous rules to really enjoy it.\n\nI prefer to spend my time enjoying other games then to have to spend hours memorizing the rules for this one in order to enjoy it.\n\nI'll stick to something more my speed like ASL.",
    "timestamp": 1155506400
  },
  {
    "username": "silvergoose",
    "rating": 2.0,
    "comment": "I used to enjoy playing this, and do not now. Not a single part of the game is interesting or enjoyable to me.",
    "timestamp": 1676242800
  },
  {
    "username": "Spiff",
    "rating": 2.0,
    "comment": "Avalon Hill version. Pretty, but I can't get over the unbalanced races.",
    "timestamp": 1623708000
  },
  {
    "username": "Ryuu",
    "rating": 2.0,
    "comment": "Take that, and that, and that, and that....",
    "timestamp": 1621116000
  },
  {
    "username": "Puglord",
    "rating": 2.0,
    "comment": "I sort of see why some people love this... I think... but it is SO not my cup of tea.",
    "timestamp": 1605567600
  },
  {
    "username": "KageSasurai",
    "rating": 1.5,
    "comment": "Munchkin for people who take munchkin seriously. I don't play munchkin with people who take it seriously.",
    "timestamp": 1530914400
  },
  {
    "username": "Florik",
    "rating": 2.0,
    "comment": "Ass edition, ugly and with woefully incompete rules. I have to attack random opponents? I'd rather not.",
    "timestamp": 1473285600
  },
  {
    "username": "rachel_atwork",
    "rating": 2.0,
    "comment": "I only played once but it seemed unbalanced. I know it is an older game and appreciate it for being ahead of its time.",
    "timestamp": 1432504800
  },
  {
    "username": "lsamadi",
    "rating": 2.0,
    "comment": "I had the Avalon Hill edition. I didn't get it. My family didn't get it. There was no way they would ever touch it again, so I traded it. Perhaps the original edition would have fared better. I'm sorry to rate such a classic so low, but that's how it is.\n\nPlayed the most recent edition (now 2015). While I didn't hate it the same way as when I tried it in 2006, I don't think I'll change my rating.",
    "timestamp": 1430431200
  },
  {
    "username": "capracaligo",
    "rating": 2.0,
    "comment": "Even uglier than it looks. Cosmic Horror.",
    "timestamp": 1391295600
  },
  {
    "username": "Stas",
    "rating": 3.0,
    "comment": "Just plain boring.",
    "timestamp": 1710630000
  },
  {
    "username": "yin yang",
    "rating": 3.0,
    "comment": "AH version, seemed too simplistic, forced to attack someone each turn, difficult to build a strategy. Must be the original versions that bring the crowds. Beautiful board though.",
    "timestamp": 1702162800
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not my theme",
    "timestamp": 1628373600
  },
  {
    "username": "Neiln99",
    "rating": 3.0,
    "comment": "the newer versions are much better.",
    "timestamp": 1594418400
  },
  {
    "username": "HiTracey",
    "rating": 3.0,
    "comment": "Light multiplayer; quite fun, but not really my thing.\n\nComplexity - 2/10",
    "timestamp": 1574722800
  },
  {
    "username": "thomasdean007",
    "rating": 3.0,
    "comment": "Hasbro version. Very pretty, but I've got to see what they lost from the other versions. Feels like 2/3 of a game.",
    "timestamp": 1505426400
  },
  {
    "username": "MeepleMaven",
    "rating": 3.0,
    "comment": "Lost first game without getting to make a move.\nNever did click in a few subsequent plays.",
    "timestamp": 1480546800
  },
  {
    "username": "Drewcooter",
    "rating": 3.0,
    "comment": "The massive swings in the points on the cards you can play in combat is just too much. With a better combat system I could see this game getting an 8.",
    "timestamp": 1458687600
  },
  {
    "username": "Delikon",
    "rating": 3.0,
    "comment": "Ugh. Rules breaking just not my style.",
    "timestamp": 1455663600
  },
  {
    "username": "EarlofBronze",
    "rating": 4.0,
    "comment": "Okay game...fun and quick.",
    "timestamp": 1752444000
  },
  {
    "username": "filwi",
    "rating": 3.5,
    "comment": "Very old game, with problems such as infinite games, low player agency, high random factor etc. that modern games do away with.",
    "timestamp": 1578524400
  },
  {
    "username": "PfrBraun",
    "rating": 4.0,
    "comment": "Cosmic Encounter (Bill Eberle u.a.) – oder: Lieber klassisch kegeln… Cosmic Encounter genießt bei Kennern einen legendären Status. Hunderte extraterrestrische Spezies ringen runden- und verhandlungsbasiert um die Vorherrschaft im All. Ein Schicksalsstapel bestimmt das anzugreifende Sonnensystem. Der Rest ist Verhandlungssache: Wer greift mit wem an? Wer verteidigt? Per Hyperraumkegel bewegt man sich dann in diesem Klassiker und richtet seine Truppen aus. Letztlich merkt man den Spezies aber an, dass sie aus Amerika kommen. Viel Zufall, viel Verhandlung, konfliktorientierte Mitspielereliminierung. Es ist eines dieser Spiele, die eigentlich nicht auf dem Brett stattfinden, sondern am Verhandlungstisch. Leider verhandelt jeder in seinem Kopf, ob sich der interstellare Kriegszug überhaupt lohnt. Da bleibt es ziemlich still im All. Das mag zwar physikalisch durchaus seine Berechtigung haben, ist aber spielerisch ein ziemlicher Raumkegelkrepierer. Da man aus ganz unterschiedlichen Gründen auch gar nicht wählen kann, was man tun möchte, verwandelt sich auch die eigenen Kosmische Macht in komische Ohnmacht. Denn was nützt mir eine Spezialfähigkeit, wenn der Schicksalsstapel mich an den übermächtigen Gegner verweist. Oder die Mitspieler mich verwaisen lassen. So mögen die Kombinationen aus Spezies fast ein Googol groß sein, aber dem stehen 4 Handlungsmöglichkeiten gegenüber. Da geh ich lieber Hyperraumkegeln. Da sind „Alle Neune“ drin!",
    "timestamp": 1567720800
  },
  {
    "username": "candoo",
    "rating": 4.0,
    "comment": "Played the latest Avalon Hill edition. Nice components if not somewhat over produced.\n\nThe game itself is meh. Much more dynamic choices have emerged in the past 30 years.",
    "timestamp": 1565128800
  },
  {
    "username": "geenius",
    "rating": 4.0,
    "comment": "Hasbro/Avalon Hill edition",
    "timestamp": 1533420000
  },
  {
    "username": "ptm_junk",
    "rating": 4.0,
    "comment": "Over hyped negotiation game. Play chinatown instead",
    "timestamp": 1478127600
  },
  {
    "username": "Shleprock",
    "rating": 4.0,
    "comment": "Meh",
    "timestamp": 1449442800
  },
  {
    "username": "Riku Riekkinen",
    "rating": 4.0,
    "comment": "Appear weak and whine. Negotiation game at its fullest. Crucial design at its time for asymmetrical sides, but doesn't offer much anymore (at least to me).",
    "timestamp": 1436133600
  },
  {
    "username": "NightRider",
    "rating": 4.0,
    "comment": "Used to really like this years ago, but not so much any more.",
    "timestamp": 1434319200
  },
  {
    "username": "lee elektrik",
    "rating": 5.0,
    "comment": "Unfortunatel plays only four.",
    "timestamp": 1706742000
  },
  {
    "username": "Mattias",
    "rating": 5.0,
    "comment": "This version (Hasbro/AH) does not make the game justice.",
    "timestamp": 1684533600
  },
  {
    "username": "coxy_fc",
    "rating": 5.0,
    "comment": "Hmm.. Tom Vasel's reviews are not to be trusted...Very chaotic, the game's ok I guess, it suits loud, over-confident types, which I'm not, but I'm not so convinced after one play. Would like to try the new edition though.",
    "timestamp": 1668121200
  },
  {
    "username": "ppsacco",
    "rating": 5.0,
    "comment": "Actually this is the one I own...not the 2008 version.",
    "timestamp": 1661810400
  },
  {
    "username": "Sindre",
    "rating": 5.0,
    "comment": "It’s fine, I guess.",
    "timestamp": 1631656800
  },
  {
    "username": "caltino",
    "rating": 5.0,
    "comment": "Eon Edition (1977)",
    "timestamp": 1619820000
  },
  {
    "username": "Marky_marc",
    "rating": 5.0,
    "comment": "To make this game really shine it would need 6 players. Unfortunatly it only accomadates 4.",
    "timestamp": 1611874800
  },
  {
    "username": "joebelanger",
    "rating": 5.0,
    "comment": "Simple negotiation game, great theme!",
    "timestamp": 1610060400
  },
  {
    "username": "Red Eye",
    "rating": 5.0,
    "comment": "Never did it for me although I knew there was a cult following.",
    "timestamp": 1598047200
  },
  {
    "username": "brumcg",
    "rating": 5.0,
    "comment": "Has many of the things I don't like in a game... it's all about conflict and negotiation... and yet I like it.",
    "timestamp": 1558476000
  },
  {
    "username": "Jackal!",
    "rating": 5.0,
    "comment": "GW version for the 80s",
    "timestamp": 1504389600
  },
  {
    "username": "Poserdisposer",
    "rating": 5.0,
    "comment": "Also own a few of the expansions. Loved this edition as an 'art piece', but I have never been a fan of the game.",
    "timestamp": 1488409200
  },
  {
    "username": "dragondecade",
    "rating": 5.0,
    "comment": "Just haven't played for years now. Has to have three or more players, and we mostly only have two.",
    "timestamp": 1487631600
  },
  {
    "username": "Boltana",
    "rating": 4.5,
    "comment": "I like the replay potential of the alien races, but this game falls short for me due to the kingmaking aspect at the endgame.",
    "timestamp": 1474063200
  },
  {
    "username": "xxeyes",
    "rating": 5.0,
    "comment": "Play with Anika.",
    "timestamp": 1459634400
  },
  {
    "username": "Fensedge",
    "rating": 5.0,
    "comment": "Classic to own but do you ever play it??? In my case do I want to???",
    "timestamp": 1459116000
  },
  {
    "username": "gregandjan",
    "rating": 5.0,
    "comment": "Never quite liked this game as much as I hoped.",
    "timestamp": 1450911600
  },
  {
    "username": "pastej",
    "rating": 5.0,
    "comment": "Nice idea with alot of feeling, but gets a bit repeatative after a while.",
    "timestamp": 1422226800
  },
  {
    "username": "Bagherra",
    "rating": 6.0,
    "comment": "A good game with too many editions.\nI prefer the AH one.",
    "timestamp": 1760133600
  },
  {
    "username": "stevenwarburton",
    "rating": 6.0,
    "comment": "Enjoyed this one back in the day.",
    "timestamp": 1752444000
  },
  {
    "username": "KatydidWonders",
    "rating": 6.0,
    "comment": "2-6",
    "timestamp": 1746136800
  },
  {
    "username": "Kiyote",
    "rating": 6.0,
    "comment": "Leisure Ways 1990",
    "timestamp": 1739919600
  },
  {
    "username": "ekloff",
    "rating": 6.0,
    "comment": "Cosmic Encounter has stood the test of time and for good reason. The game is littered with deduction and mind games, and not as negotiation heavy as I had imagined. Additionally, where most game's strive for balance, Cosmic Encounter is proudly the opposite. The various races, and flare card, vary wildly in strength, but this power imbalance fosters early targets. While 'The Void' may well be the most powerful race, you'd best believe everyone else knows that and will target that player until they are on equal footing. Granted this purposeful imbalance can produce some king-making scenarios, it never goes so far as to be self-destructive.",
    "timestamp": 1737414000
  },
  {
    "username": "Innsbruck",
    "rating": 6.0,
    "comment": "Player Count: 2 to 6\n Competitive Game: One player wins alone.\n\nDesigned by Bill Eberle, Jack Kittredge, Bill Norton, and Peter Olotka.",
    "timestamp": 1719266400
  },
  {
    "username": "gregor1863",
    "rating": 6.0,
    "comment": "Prefer the Mayfair edition (since I haven't seen most of the aliens from the various Eon expansions.) Great variety of strategy keeps me interested. One alien may work well against several other aliens, but the next game with the same alien can be an entirely different experience.\n\nBe sure to check out the online version.\n\n{Update, bought the Fantasy Flight edition and it's top notch!}",
    "timestamp": 1703890800
  },
  {
    "username": "SultanSevy",
    "rating": 6.0,
    "comment": "Have the old West End Games version, but has been a long time since I've played. Good, chaotic fun.",
    "timestamp": 1699225200
  },
  {
    "username": "Froggy_Steve",
    "rating": 6.0,
    "comment": "Played late 70's, early 80's. Bought \"prviously loved\" on ebay. around 2015. Re-learnt solo. Not made it to the table with other people.",
    "timestamp": 1682373600
  },
  {
    "username": "wildog",
    "rating": 6.0,
    "comment": "I just don't get it... what's the hype about this game? Seems like a dream come true for rules lawyers.",
    "timestamp": 1677538800
  },
  {
    "username": "glsonn",
    "rating": 6.0,
    "comment": "Traded away for Canal Mania in the Milwaukee no-ship math trade, 2/15/08.\n\nProbably should have kept this classic.",
    "timestamp": 1668466800
  },
  {
    "username": "Virogi",
    "rating": 6.0,
    "comment": "Rencontre cosmique",
    "timestamp": 1652565600
  },
  {
    "username": "weswilson",
    "rating": 6.0,
    "comment": "One of the classics. But just like most classics, it's belabored and obtuse. I'd love to play this with a group who knew how to play and were quick to make decisions, but outside some stripped-down re-release, I'd likely not pick this up with other stuff to play.\n\nAnd yet... it calls to me.",
    "timestamp": 1635112800
  },
  {
    "username": "rAdioActivitA",
    "rating": 6.0,
    "comment": "VH?",
    "timestamp": 1631570400
  },
  {
    "username": "Svilleken",
    "rating": 6.0,
    "comment": "Finally reduced my rating on CE to remove my biased memories of my youth playing this game with friends to all hours of the night.",
    "timestamp": 1610578800
  },
  {
    "username": "JasonSaastad",
    "rating": 6.0,
    "comment": "intrinsic interaction\n\n communal cards\n\nI Prefer games where I have my own deck of cards/strategy, which is why Magic: The Gathering > Cosmic Encounter, but I'm glad CE exists, otherwise Richard Garfield may have never created MTG",
    "timestamp": 1610492400
  },
  {
    "username": "Everend",
    "rating": 6.0,
    "comment": "My childhood was well spent.",
    "timestamp": 1591308000
  },
  {
    "username": "breakmanynecks",
    "rating": 6.0,
    "comment": "HAVE P-N-P VersioN",
    "timestamp": 1579042800
  },
  {
    "username": "Brother Abe",
    "rating": 7.0,
    "comment": "9.48",
    "timestamp": 1752444000
  },
  {
    "username": "mmychal",
    "rating": 7.0,
    "comment": "This isn't a gamer's game. It's not for those high and mighty on strategy but it's an excellent game for those who enjoy playing mind games and meddling in someone else's plans. You have to be a good diplomat to do well at this game and therein lies the appeal. This is one of the most social games I've played. I'd rate it higher but I believe the expansions are necessary for its full enjoyment.",
    "timestamp": 1749592800
  },
  {
    "username": "gmarius",
    "rating": 7.0,
    "comment": "need to play this more, only played once thus rating could change. Different rule breaking races is a great idea.",
    "timestamp": 1717365600
  },
  {
    "username": "oddthought",
    "rating": 7.0,
    "comment": "This could be a 1 as easily as it could be a 10, depending on set and setting of any given match. My average experience is very good, though. This is perhaps my favorite party game, and the only one I would actively recommend.",
    "timestamp": 1717020000
  },
  {
    "username": "stumpf",
    "rating": 7.0,
    "comment": "I wish I had someone to play this with me when I was younger.",
    "timestamp": 1716760800
  },
  {
    "username": "mi_de",
    "rating": 7.0,
    "comment": "Well, it did not set my life on fire. Played well enough, and I can see some of the appeal, but maybe I need to give it another shot under different circumstances.",
    "timestamp": 1715378400
  },
  {
    "username": "ClashCityClarky",
    "rating": 7.0,
    "comment": "4-6",
    "timestamp": 1712527200
  },
  {
    "username": "tmarozas",
    "rating": 6.5,
    "comment": "Many fond memories of playing this one.",
    "timestamp": 1685743200
  },
  {
    "username": "Robert Osvalds",
    "rating": 7.0,
    "comment": "This early version had a few hiccups like the reverse cone. The FF version is best.\n\nFun powers, nonetheless.\n\nGreat game of negotiation and maximizing your resources at hand. The more players the better; very little downtime, because you do things on other players' turns.\n\nThe random choice of player encounters, combined with asymmetric alien powers make for a rewarding experience.",
    "timestamp": 1681423200
  },
  {
    "username": "Cragborn",
    "rating": 8.0,
    "comment": "original ~1983? with all species expansions",
    "timestamp": 1761003780
  },
  {
    "username": "digitalbeachbum",
    "rating": 8.0,
    "comment": "Hundreds of hours we played this game with the expansions.",
    "timestamp": 1735426800
  },
  {
    "username": "leshazlewood",
    "rating": 8.0,
    "comment": "Have had it for a several years and initially played it a lot. Have recently introduced it to our U3A group and the response was OK (but nothing more)!!!",
    "timestamp": 1707174000
  },
  {
    "username": "polyjay",
    "rating": 8.0,
    "comment": "Only game you need.",
    "timestamp": 1694901600
  },
  {
    "username": "SteveMcG",
    "rating": 8.0,
    "comment": "Grid Wargame",
    "timestamp": 1682892000
  },
  {
    "username": "rynelf",
    "rating": 7.5,
    "comment": "--Jan2009-- Fond memories of the Eon edition.",
    "timestamp": 1680559200
  },
  {
    "username": "rlowke",
    "rating": 8.0,
    "comment": "An oldie but a goodie.",
    "timestamp": 1679526000
  },
  {
    "username": "sctreno",
    "rating": 8.0,
    "comment": "just plain fun!",
    "timestamp": 1671145200
  },
  {
    "username": "Staban Tuek",
    "rating": 8.0,
    "comment": "THRIFT",
    "timestamp": 1666476000
  },
  {
    "username": "whitecatplays",
    "rating": 9.0,
    "comment": "Legend.\n\nRE: wanna try all-red powers next time",
    "timestamp": 1760738400
  },
  {
    "username": "kwalzl",
    "rating": 9.1,
    "comment": "5A",
    "timestamp": 1758492000
  },
  {
    "username": "snth",
    "rating": 9.0,
    "comment": "Childhood fave that hasn't aged with my tastes in games. But I enjoy it well enough for a nine. Love the flavor.",
    "timestamp": 1757800800
  },
  {
    "username": "eieiowen",
    "rating": 9.0,
    "comment": "Need 2 yellow, 1 red, 1 orange cone.",
    "timestamp": 1726437600
  },
  {
    "username": "robo37",
    "rating": 8.5,
    "comment": "Bare bones gameplay, but the asymmetrical powers make every game a unique experience. Also has wonderful art!",
    "timestamp": 1724364000
  },
  {
    "username": "faidutti_ludotheque",
    "rating": 9.0,
    "comment": "Bien avant mes Tempête sur l'échiquier et Democrazy, bien avant Magic the Gathering, Cosmic s'attaquait au principe qui est à la base de tous les jeux: la stabilité des règles. L'une des multiples éditions de Cosmic porta en sous titre \"le jeu qui brise ses propres règles\", et il n'est sans doute pas de meilleure définition.\n\nLes règles \"de base\" sont simplissimes, quelque part entre le Risk et la bataille. Mais à Cosmic, il y a plus d'esxceptions que de règles, et ces exceptions ne sont pas les même pour tous. Chacun dispose en effet d'un ou de plusieurs pouvoirs modifiant les règles en sa faveur. Des pouvoirs qui n'ont rien d'anecdotique: l'esprit regarde les cartes de l'adversaire, les pions du zombie ne meurent pas, le perdant peut décider que qui perd gagne, le schizoide peut changer le but du jeu, le chronos peut tout recommencer lorsqu'il perd un combat, la force modifie les règles du jeu... en faveur des autres joueurs, et le hurtz peut louer les pouvoirs qui ne sont pas en jeu. Et il y en a des centaines comme cela. Ajoutez à cela des cartes événements - les édits - puis bientôt, en option, des événements plus ou moins contrôlables par les joueurs - les lunes - et des cartes dont les effets se combinent avec les pouvoirs - les flares. Inutile de chercher à s'y retrouver, c'est le chaos - d'autant plus que toutes les alliances sont permises.\n\nCosmic, de par sa structure simple et modulable, est un jeu ouvert. À Chaque partie, les joueurs décident des règles et des éléments qu'ils vont utiliser. En outre, Cosmic est un jeu qui encourage l'innovation et l'imagination: rien n'est plus facile que de créer de nouveaux pouvoirs, de nouvelles cartes, de nouvelles règles, et certains sites webs proposent ainsi plusieurs centaines de pouvoirs inédits. Vous pouvez commencer votre exploration du monde cosmic sur le web par le site du Warp, ou par lexcellent blog Blogmic Encounter\n\nLe plus étonnant, un peu comme avec Tempête sur l'échiquier, c'est que ça marche, et que ça marche même diablement bien. Bien sûr, le jeu avec toutes les options des neuf extensions de l'édition originale - de toute façon introuvables - est réservé aux initiés. Mais en commençant doucement, sans lunes ni flares, avec un ou deux pouvoirs par joueur, on découvre peu à peu les mécanismes et les possibilités d'un jeu culte à nul autre pareil. Si vous aimez les règles claires et les jeux bien carrés, allez plutôt voir du côté des créations allemandes. Mais si vous êtes prêt à vous risquer dans le grand tourbillon du chaos...\n\nReste le principal problème: quel jeu? quelle édition? quelles extensions? L'édition Eon, complète avec les neuf extensions, reste la meilleure et la plus conforme à l'exprit Cosmic, mais elle est introuvable et/ou très chère. Les éditions Games Workshop et West End Games, également épuisées, sont très incomplètes. L'édition Mayfair apportait au jeu des modifications qui n'ont pas fait l'unanimité. L'édition Avalon Hill, au matériel superbe et conforme aux règles d'origine, est malheureusement très incomplète. L'édition FFG, parue fin 2008, est abordable, pratique et relativement complète. C'est donc elle qu'il faut choisir, malgré ses quelques petits défauts.\n\nMon opinion sur l'édition FFG.\nC'est un vieux fan de Cosmic, Kevin Wilson, qui s'est chargé du déveloippement de l'édition 2008 de Cosmic Encounter, la plus complète depuis longtemps. Si le succès est au rendez-vous, une ou plusieurs extensions devraient même suivre.\nL'innovation majeure de cette édition est sans doute la disparition des hexagones qui constituaient le plateau de jeu, remplacés par cinq planètes aux couleurs des joueurs. C'est une idée géniale, qui devrait en effet permettre d'imaginer de nouveaux pouvoirs, de nouveaux édits, de nouveaux effets en tous genres exploitant la possibilité de déplacer des planètes d'un système à un autre, ou de retourner les planètes dont recto et verso sont différents. Ces possibilités ne sont pas encore vraiment exploitées dans la boite de base, mais je n'ai guère de doute qu'elles le seront dans l'extension.\nCette édition est en outre très complète, avec 50 pouvoirs différents, dont une douzaine de nouveaux, leurs flares, des cartes de combat et des édits assez variées. Elle introduit aussi une nouvelle règle optionnelle, la technologie, semnble-t-il destinée à remplacer les lunes (dommage, j'aimais beaucoup les lunes). En outre, il y a déjà deux extensions présentées dans de petites boites, mais fort bien fournies, qui font de ce Cosmic nouvelle vague et coloré la version la plus riche parue depuis bien longtemps.\n----\nLong before my own Knightmare Chess and Democrazy, long before Magic the Gathering, Cosmic perverted the basic principle of all games: rules, and rules constancy. One of the numerous editions of Cosmic has the subtitle \"the game that breaks its own rules\". There can be no better description.\n\nThe \"basic\" rules are very basic, something between Risk and Beggar my Neighbour. But then comes the twists, and in Cosmic Encounter there are more twists and exceptions than there are rules. Each player, for example, has one or more \"alien power\" that changes the rules in his favour. And this powers are not weak ones: the Mind can look at other players' cards, the Zombie's pawns never die, the Loser can decide that the winner loses and the loser wins, the Schizoid can change the goal of the game, the Chronos can replay a challenge, the Force can change minor rules... in aid of other players, the Hurtz can rent aliens not used in this game... and there are hundreds others. Add to this classical event cards - the edicts -, and soon other strange events more or less uncontrollable - the moons - and cards which effects combine with the alien powers - the flares. Oh, and there is money, asteroids, and other strange stuff. Please don't try to put order in all this, this is all chaos.\n\nCosmic Encounter has a simple and open structure. Before each game, the players decide which rules, which elements, which variants they will use. Furthermore, the game encourage imagination, and it's very easy to create new aliens, new edicts, new moons... There are web sites with hundreds of such add ons, and you can start your visit at the Warp or at the Blogmic Encounter blog.\n\nLike with Knightmare Chess, the strangest thing is probably that it works, and that it works really well. Of course, the complete game with the nine expansion sets from the original Eon edition - of course almost impossible to find - is strictly for old initiates in the cult. But if you start slowly, with no moons or flares, with only one or two alien powers per player, you will slowly discover the zany mechanics and the infinite possibilities of the system. It's a cult game, and it deserves it. If you like clear rules and square games, go your way to Germany. But if you're ready to plunge in the great storm of chaos...\n\nAnd now for the big question: what game? what edition? The complete Eon game, with the nine expansion sets, is surely the best one, the most faithful to the Cosmic spirit. It can be found on Ebay for surrealistic prices... The Games Workshop and West End editions are also out of print, and much less complete. The Mayfair edition had some rules changes that did not find general agreement among the old cultists. The Avalon Hill edition is gorgeous and faithful to the original rules, but definitely incomplete. The FFG edition, published late 2008, is cheap, well produced and more complete than any other except the original Eon. It has a few shortcomings, but it's clearly the best choice\n\nMy take on the FFG edition.\nKevin Wilson, an old Cosmic Encounter fan and addict, has developed the 2008 edition. It’s the most complete since the original Eon. If it sells well, and I bet it will, there will be expansions.\nThe main innovation of this edition is the disappearance of the players’ hex boards. They have been replaced with five cardboard planets in each player’s color. This is a fabulous idea, since it allows for many new alien or card effects, moving planets from a system to another or flipping planets, since they look different on both sides. These new opportunities are not really used in the basic box, but I’m sure players will explore them and they will be used in many different ways in the expansion.\nThis edition is also the most complete since the Eon original game, with 50 different aliens, including a dozen new ones, the corresponding flares and many challenge and edict cards. There is also a new optional rule, technology, which aims to replace the moons – a pity, since I really liked moons. Two expansion sets have already been published. They are cheap, in small boxes, but full of new aliens, new cards, new zany ideas. The FFG version of Cosmic is the richest one since the original eon.",
    "timestamp": 1693605600
  },
  {
    "username": "BG_Archaeologist",
    "rating": 9.0,
    "comment": "Plus all expansion sets except for #8",
    "timestamp": 1689890400
  },
  {
    "username": "RaistlinMajere",
    "rating": 9.0,
    "comment": "[Rating for Avalon Hill version with the addition/adaptation of More Cosmic Encounter and 5 & 6 player boards created using a second copy of the game]\n\nOne of the best boardgame ever played for me. Simple, quite deep, with strong theme and exceptionally fun. I love the moltitude of gaming situations this game can create. Fantastic power interactions.\nAt best with five (or more) players in my opinion.\n\nAvalon Hill version is a bit limited and supports only four players, a real pity because the components are awesome; so I expanded it by myself buying a second copy of the game and recreating some parts from the Mayfair's set.\n_____________________________________\n\nJust bought the FFG edition too; my comment on the new BGG entry.",
    "timestamp": 1688335200
  },
  {
    "username": "ab999",
    "rating": 9.0,
    "comment": "Absolutely amazing for its day. Had all expansions. Played and played and played. We had a binder with house ruled situations for alien conflicts. We nearly always played two aliens each. Never cared for the lucre.\n\nEdit 20230514: Visited my brother for a couple weeks of every day gaming and discovered that he had my 9 expansion Eon set - I did not abandon it to my ex...JOY for me! It's tired, but I'll bling it as best as I can.\n\nHave finally obtained at least one version of all US releases:\nEon 2nd ed (alien cover) with 9 expansions\nEon Big box edition\nWest End version\nMayfair version with More CE\nSimply Cosmic by Mayfair\nAvalon Hill version\nFFG 42nd anniversary edition with all expansions\nCosmic Encounter Duel",
    "timestamp": 1684965600
  },
  {
    "username": "JRAMtheBandit",
    "rating": 10.0,
    "comment": "The highlights of this game are fantastic, especially with conflicting alien powers. The world owes Cosmic Encounter a debt for introducing such heavy asymmetry to the universe of gaming.\n\nI do think the underlying game is not the best though - it's a game about diplomacy where players are very limited in diplomacy. Being an offensive ally is way too strong, especially without any ability to prevent people from just bringing one ship, and the actual ship count is often so irrelevant to the outcome of combat compared to the card values that the ally system is a bit silly. Defensive reward deck fixes a lot of this though.\n\nAn average turn of this game is a 6, but the best turns are 10s, and most games include at least a few of those.\n\nAlso, this game just creates much bigger, memorable moments than almost any other game, and that makes it an immediate 10 in my book.\n\nThe designers really understand how to create mindgames between players and how to design interesting, fun alien powers.",
    "timestamp": 1743631200
  },
  {
    "username": "RikHavok",
    "rating": 9.8,
    "comment": "2/25 I got this version of the game from Peter Olotka himself. He signed it and mailed it to me. It is unpunched. But, he removed the cellophane to sign it.\n\nHas an extra set of brown pieces.",
    "timestamp": 1740265200
  },
  {
    "username": "Doe_do3",
    "rating": 10.0,
    "comment": "I have the complete game with all its expansions and I play regularly. I love the game and play whenever I get the chance.",
    "timestamp": 1719612000
  },
  {
    "username": "davido",
    "rating": 10.0,
    "comment": "It looks like the FFG re-release did in fact 'do Cosmic right'. Love my Eon set, coz the memories remain.\n\nFave power selection: Take 3, keep 1, discard 1, pass 1 (right or left but same for all players). For added fun, use secret powers.",
    "timestamp": 1688248800
  },
  {
    "username": "cthulhux",
    "rating": 10.0,
    "comment": "My favorite game of all time--the Eon addition, that is. I have the original game and all of the expansions. I've played some of the reprints before Fantasy Flight's, but none of them match up to the original!",
    "timestamp": 1686002400
  },
  {
    "username": "Super_Silencer",
    "rating": 10.0,
    "comment": "The original and best. While the later printings from Mayfair and Fantasy FlightS did clarify several rules questions about timing, nothing beats the classic Eon version for pure chaotic fun and spirited discussions among players! And it's great with 5-6 players!\n\nThe creators of Magic: The Gathering credit Cosmic Encounter for being the game that inspired much of how that system works. C.E. remains an all-time classic, decades later!",
    "timestamp": 1685916000
  },
  {
    "username": "yangtze2000",
    "rating": 10.0,
    "comment": "Also own Eon 2nd Edition.",
    "timestamp": 1685311200
  },
  {
    "username": "MikeKn",
    "rating": 10.0,
    "comment": "All time favorite game. Never the same game twice. I don't get to play this anywhere near often enough.",
    "timestamp": 1673305200
  },
  {
    "username": "OldManRick",
    "rating": 10.0,
    "comment": "Eon, Mayfair, and (Now given away) AH editions!!!!!!\nOne of the best multi-players games ever, with variety in each game depending the the set of powers being played. Later Eon expansions got fairly useless (see their ratings below) but the first two added to the game.",
    "timestamp": 1672614000
  }
]