[
  {
    "username": "Folilo82",
    "rating": 1.0,
    "comment": "This game is awful, the theme makes no sense at all and the rules are a convoluted mess... stay away.",
    "timestamp": 1392418800
  },
  {
    "username": "cymric",
    "rating": 2.0,
    "comment": "Unplannable, chaotic, and random. I also have a problem with the game itself: why would you ever want to intentionally weaken a position with strong tree spirits? Because retreating a spirit and making them 'dance' are separate actions, you'll be giving the opponent the first opportunity to take advantage of your now weaker position... to your own detriment if he can manage. It's like sacrificing material in Chess and then discovering that the sacrifice was actually not in your best interests as you'll have gained nothing in return. Or, perhaps more aptly, splitting up your group of marbles in Abalone to get something done... and then losing bigtime as the smaller groups are defenseless against the larger group. The only thing stopping such a stalemate is being unable to form it in the first place, which is luck of the draw entirely. With an RPS mechanism the strict increase in spirit strength would have been broken, and all spirits would have been equally vulnerable.\n\nGames where the only winning move is not to play are broken by definition, but I'm still hoping against better judgment that I'm making an error of some sort. Therefore 1 bonus point to the inevitable ‘1’ of ‘broken’.\n\nUpdate Physically removed from the collection.",
    "timestamp": 1463781600
  },
  {
    "username": "cbdarden",
    "rating": 3.0,
    "comment": "Do Druids shit in the woods? I don't know, but they sure left a steaming pile in this box.",
    "timestamp": 1397253600
  },
  {
    "username": "jerkman",
    "rating": 4.0,
    "comment": "Could be the right game for other, but didn't catch us. Would be sold for 5,- € plus portage.",
    "timestamp": 1757023200
  },
  {
    "username": "LeeLa88",
    "rating": 5.0,
    "comment": "10€ + 1€ Wuz Flohmarkt",
    "timestamp": 1712700000
  },
  {
    "username": "purifiedinblood",
    "rating": 5.0,
    "comment": "fam",
    "timestamp": 1672786800
  },
  {
    "username": "Erik_Wudtke",
    "rating": 6.0,
    "comment": "ungesleevt",
    "timestamp": 1711580400
  },
  {
    "username": "tallike",
    "rating": 5.5,
    "comment": "10€",
    "timestamp": 1705014000
  },
  {
    "username": "andycted",
    "rating": 7.0,
    "comment": "Kinky counterintuitive quick filler which can burn your head if you try to play it very strategically.",
    "timestamp": 1754949600
  },
  {
    "username": "anthientran",
    "rating": 8.0,
    "comment": "Brain-melting. Don’t sleep on this. If you see a copy, buy it.",
    "timestamp": 1748124000
  },
  {
    "username": "BaSL",
    "rating": 8.5,
    "comment": "Interesting..",
    "timestamp": 1411336800
  },
  {
    "username": "RonCarlson01",
    "rating": 9.5,
    "comment": "S010\n\nSleeved",
    "timestamp": 1705791600
  }
]