[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "It's not bad, and I like building the landscape, but it feels so awkward competing/interacting on this map. I can't help but think it's Mexica but less interesting in every way. And way less immersive where you just charge through the map to grab up victory points before someone else, and then it's empty again. The 10 AP is kind of ridiculous haha.\n\nThinking too much about this, how SO many eurogames are about claiming something and jealously chasing off others who might interact. But not violently, only with passive-aggression. It's depressing.",
    "timestamp": 1730588400
  },
  {
    "username": "Nenananas",
    "rating": 1.0,
    "comment": "Like:\n-Area control\n\nDislike:\n-Lots of options in a turn\n-Downtime\n-Too long\n-I don't know how to play well and it's very unforgiving\n\nIt wasn't that bad actually, but I do think there are games out there that are just as thinky as this one, but with easier rules and with much less options to do in your turn. Yes, many options will cause a game more often then not to be more strategical, but I rather have games where you can do just a couple of things that make it a really hard choice of what you want to do. The many options also make it that you have to wait quite a while for your turn.\n\nWhat I really liked was the area control, which I will try to play more games of now.\n\nUPDATE: Ugh... I don't know this game is just so frustrating. It's feels very bad to invest so much in something and have it taken away from you. Although I do like other mean games like Food Chain Magnate. I guess the difference is I know how to play FCM well and I'm just bad at Tikal; that doesn't change my feelings though.",
    "timestamp": 1617660000
  },
  {
    "username": "slimy_asparagus",
    "rating": 1.0,
    "comment": "Played a long time ago. Did not want to play because I found the premise incompatible with modern archaeology.",
    "timestamp": 1595196000
  },
  {
    "username": "vikings40",
    "rating": 1.0,
    "comment": "Overhyped nonsense.",
    "timestamp": 1547247600
  },
  {
    "username": "Cynical",
    "rating": 1.0,
    "comment": "Ugh, never again. There's just so much that's so situational- am I going to be the one who has to spend the three AP on forcing a trade that's beneficial to both players because of the way the turn order falls on a scoring round? Am I going to have 10 pieces at one end of the board that can't do shit because I get sniped? Am I going to get really lucky and draw two of the sime treasure in a row? Am I going to draw a blatantly worse tile than the previous person? I can't control any of it, so why does this take ninety fucking minutes?",
    "timestamp": 1249164000
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "Desperately wants to feel sandbox-y and \"open\" but is significantly more restricted than meets the eye. AP system is neat, though, and simple tile rotation (and opponent placement) can create interesting chokepoints. A decent game, bordering on filler but with a bit more oomph, could see this getting old quickly or if played in rapid succession.",
    "timestamp": 1736118000
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "-WEG\n? 90 Min 2–4 Players p2 p3 p4 Weight: 2.79 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "hxbx",
    "rating": 2.0,
    "comment": "2-4 players, about 2 hours. I find this game very dry - I thought the exploration would be much more fun.\n\nSpending 10 action points each turn is not a mechanic I will be searching out for future gaming experiences.",
    "timestamp": 1504562400
  },
  {
    "username": "rfoth",
    "rating": 2.0,
    "comment": "Update: Four player games are much more interesting. Not sure if the artifacts are worthwhile.\n\nI have only played two player, but believe it is broken for two. There are three possible strategies in the game: Either build up temples, search for treasure, or a comination of both. In a two player game, these choices are reduced mere randomness of the tiles/treasures drawn due to the zero-sum nature of the game (game theory). For example: If player one chooses to search for treasure, automatically there is no incentive for player two to do the same as any single treasure drawn can be swapped by player one to make a better set. In this case, player two will only be helping player one's vp total. Therefore, player two will have to choose only to build temples and hope that player one will not draw good combinations of treasures until the end of the game. At this point, the game has become rote and the players might as well play rock-paper-scissors (though r-p-s has more meta gaming and may be a better game than Tikal).\n\nMy rating reflects the two player \"game\".\n\nHowever, I have not played a 3-4 player game of this and my opinions may change with that experience.",
    "timestamp": 1491602400
  },
  {
    "username": "SCOBYBryant",
    "rating": 2.0,
    "comment": "You fell off the Ziggurat!",
    "timestamp": 1324594800
  },
  {
    "username": "Rilmo",
    "rating": 3.0,
    "comment": "It's just so random, and so tactical. Now I didn't do too well on my only play of this (I actually tied for second place, but first place had us beat by around 50 points (he drew most of the temples)), but I can't imagine feeling good about playing well even if I'd won. It just feels extraordinarily random. It's also way too long for a game this tactical.",
    "timestamp": 1734476400
  },
  {
    "username": "AmandaDesignsGames",
    "rating": 3.0,
    "comment": "Tikal is a game about vulturing and opportunism. There's very few ways to actually get stuff done aside from just stealing what others do. It's also a game that's at the same time quite lucky, because of the impact of the tile draws, and too mathy, especially on scoring rounds, where you have to compare multiple scenarios and see which ones you can combine in your 10 actions.\n\nI think my rating is more a question of style than of quality: I think Tikal is a mostly Take That game in a Euro skin.",
    "timestamp": 1701817200
  },
  {
    "username": "MystLgnd",
    "rating": 3.0,
    "comment": "Remember this one not that deep and exciting to play.",
    "timestamp": 1674687600
  },
  {
    "username": "dpbernath",
    "rating": 3.0,
    "comment": "A classic game that left me unsatisfied",
    "timestamp": 1642201200
  },
  {
    "username": "seepieceeggshell",
    "rating": 3.0,
    "comment": "Teaching time: 10 minutes\nPlaying time: 60-120 minutes\n\nNot much to do and not much room for creativity.",
    "timestamp": 1573254000
  },
  {
    "username": "Bagherra",
    "rating": 4.0,
    "comment": "A WONDERFUL game about travel and expedition (cleverly hidden into a conquest game). Wonderful game to convince your wife to play a little strategy game.",
    "timestamp": 1745272800
  },
  {
    "username": "cinnzel",
    "rating": 4.0,
    "comment": "Los juegos de mayorías se me suelen atragantar y este no ha sido una excepción. Este juego combina exploración con control de enclaves mediante mayorías. Mi sensación es que la exploración tiende a generar bola de nieve para el jugador que más fortuna haya tenido descubriendo losetas.",
    "timestamp": 1716847200
  },
  {
    "username": "trodat123",
    "rating": 4.0,
    "comment": "not my game",
    "timestamp": 1714428000
  },
  {
    "username": "CianciulliQc",
    "rating": 4.0,
    "comment": "Sold",
    "timestamp": 1702422000
  },
  {
    "username": "orange",
    "rating": 4.0,
    "comment": "I would only play the auction version. Nice majority game using the action point system. AP is likely, takes a little longer than I would like for a game with this amount of depth.",
    "timestamp": 1677625200
  },
  {
    "username": "btasam",
    "rating": 5.0,
    "comment": "I don't find the Kiesling/Kramer's action point mechanic enjoyable because the work-to-reward ratio is so underwhelming. I will praise that the overall design is quite interesting in that it brings an explorative sandbox feel, but that's hardly enough to save a game that plays too long and isn't really that fun.\n\nAdditionally, I've only played Mexica once which was not received well by our group. I suspect that my feelings towards the Mask Trilogy will be consistent. These games task players with spending 6-10 action points on ~8-10 available actions. Overall, it feels really dated, but it also feels like it could be really awesome if some of the fat were cut away.",
    "timestamp": 1760652000
  },
  {
    "username": "Weltmacht",
    "rating": 5.0,
    "comment": "It's way too long for what it is. And prone to analysis paralysis.",
    "timestamp": 1755986400
  },
  {
    "username": "DiceMind",
    "rating": 5.0,
    "comment": "Only played on BGA",
    "timestamp": 1755813600
  },
  {
    "username": "Nodens",
    "rating": 5.0,
    "comment": "Freaking beautiful. Just takes too long for the amount of game it is.",
    "timestamp": 1753221600
  },
  {
    "username": "Joka61",
    "rating": 5.0,
    "comment": "BR 1999",
    "timestamp": 1752876000
  },
  {
    "username": "speter22",
    "rating": 5.0,
    "comment": "Alright, I guess the mask trilogy isn’t for me. I don’t love the action-point mechanism, and I’m not sure I enjoy the huge amount of movement restriction that plays out in the course of the game. Restricting your opponent’s movement was a big chunk of the game here, and it didn’t feel super satisfying. Also didn’t love the treasure tiles… it seems like whoever draws them is incentivized to just scarf them up right away, and if you’re a couple of players away, you might not have a chance to get any. Also, the game is too long! I know, I can’t stop complaining about long games!\n\nI just expected to like these K & K games way more. Still a lot of good stuff going on, I still like the openness of the area majority, but there are too many other games that feel similar that I like a lot more and take less time.",
    "timestamp": 1746655200
  },
  {
    "username": "Raskzac",
    "rating": 5.0,
    "comment": "I can see the appeal of the game, but to me it doesn't feel it aged very well. I feel players get to many points, haven't played the physical copy but I suspect it's a little fiddly and prone to AP. It just takes to long for what it is.",
    "timestamp": 1738710000
  },
  {
    "username": "opks22",
    "rating": 5.0,
    "comment": "iOS version",
    "timestamp": 1736636400
  },
  {
    "username": "Delphinium",
    "rating": 5.0,
    "comment": "I never understood how this won SdJ - it never resonated with my gaming group and the action points mechanism felt clumsy.",
    "timestamp": 1730329200
  },
  {
    "username": "Bryle",
    "rating": 5.0,
    "comment": "Perhaps it was this game that inspired the micro turn because turns in Tikal are long and annoying.",
    "timestamp": 1726696800
  },
  {
    "username": "globetrotter",
    "rating": 6.0,
    "comment": "Great game if you don't have players who need to think over their turns too long.\n20+ years later it felt very random and simple.",
    "timestamp": 1760911200
  },
  {
    "username": "krit1789",
    "rating": 6.2,
    "comment": "Tile placement, action point allowance, area majority, and mini set collection. Could be quite slow.",
    "timestamp": 1757368800
  },
  {
    "username": "MissP1ggy",
    "rating": 6.0,
    "comment": "Long time favorite. Love the theme, 10 action point mechanism, materials, the puzzle. But the game overstays its welcome. So I am going to try this variant: https://boardgamegeek.com/filepage/58085/mid-size-tikal-23-c... And am considering that players can take their tile earlier, plus maybe skipping scoring rounds after vulcano, just scoring directly.",
    "timestamp": 1755554400
  },
  {
    "username": "trihydroboron",
    "rating": 6.0,
    "comment": "Although this game has neat ideas (groundbreaking for its time) it is a good example of one that overstays its welcome. It is a bit of a slog.",
    "timestamp": 1754172000
  },
  {
    "username": "csthrockmorton",
    "rating": 6.0,
    "comment": "Traded for Heroes of Terrinoth",
    "timestamp": 1753653600
  },
  {
    "username": "ueyinnafesh",
    "rating": 6.0,
    "comment": "오래 걸린다. 분위기는 좋다. 빠른 서바이브 쪽이 취향(게임은 아예 다르긴 한데).",
    "timestamp": 1753308000
  },
  {
    "username": "GarfieldKlon",
    "rating": 6.0,
    "comment": "#24\n\nOk, but not much you can do, basically you only have one option -> to claim the temples. I tried to win with 90% concentrating on gathering the treasures, I had about 25 points by treasures, but I was last place at the end...",
    "timestamp": 1752184800
  },
  {
    "username": "eddy_sterckx",
    "rating": 6.0,
    "comment": "2025-06-06 : First play. Next game in the quest to play all the classics that somehow slipped through the cracks back then. Still holds up, but has some endearing design decisions that really date it. Stuff like all tiles and treasures getting used, none randomly left out and the obvious one :10 action points to spend all at once, instead of having just one quick action per player per turn.",
    "timestamp": 1749160800
  },
  {
    "username": "Chrysler92",
    "rating": 5.5,
    "comment": "4,50€",
    "timestamp": 1749074400
  },
  {
    "username": "ozangumus",
    "rating": 6.0,
    "comment": "Overrated here I think. Maybe I played less yet.",
    "timestamp": 1740783600
  },
  {
    "username": "Technarius",
    "rating": 6.5,
    "comment": "Initial opinion afte one 2-Player Game:\n\nPros:\n+ The actions are pretty thematic - for Example digging on archeological sites for tresures and temples, building a camp in the middle of the jungle\n+ Nice Artwork\n\nCons:\n- Very mathy. Counting 10 Action Points all the time fells like unnecessary work\n- Doesn't scale well. (With only 2 Players it's really boring, best with 4 Players, 5 Players is impossible...)\n- The thematic actions are \"interrupted\" with permanent counting the Action Points and stepping stones\n- High Downtime, especially in 4 Player-games\n- AP inducing because of many possibilities and constant mathematical counting\n- Nothing outstanding / unique\n- High degree of randomness (Treasures and Tiles)\n\nVerdict: This Area Control Game is for sure not good with 2 Players at all (well, most Area Control Games are not made for 2 Players).\nI have to check it with 4 Players and update this review.",
    "timestamp": 1760565600
  },
  {
    "username": "zasizo",
    "rating": 7.4,
    "comment": "Számomra ez volt az a játék, amely huszonéves koromban visszacsábított a táblás társasjátékokhoz.\nKicsit sok előkészülettel jár és hosszú a játékideje is, ezért jellemzően nem kerül asztalra, (ez a pontszámra is kihat), de ma sem válnék meg tőle, mert leírhatatlanul különleges élmény, ahogyan a játéktáblán a szemünk előtt, a dzsungel sűrűjéből maja templomok bukkannak elő játék közben.\n\nA Tikalban lenyűgözőek nem csak az előkerülő templomok, de az is, ahogyan felfelé növekednek, aszerint, hogy egyre több szintet ásnak ki belőlük a régészcsapatok.\nErős a taktikai és stratégiai gondolkodás szerepe, miközben kellemes interakció van a játékosok között.\nVégig áthatja az elveszett indián kultúra tematikája.\nAz elrejtett kincs megszerzése és az aktív vetélkedés nagyon találó látványvilággal lett körítve.\n\nKB 20 éve van meg, és szép emlékek fűznek hozzá. Bár ma már nem keresem a hasonló, epikus élményt egy játékban, mert az túl sok körülményes szabályt és nehézkesen induló játékmenetet eredményez, ezzel együtt komplex és kimagasló élmény játszani vele.\nAmi nem annyira jó, hogy ha ritkán kerül elő, újra át kell rágni magunkat a hosszú szabálykönyvön, ez pedig ráerősít, hogy ne ezt vegyük elő, ha játszani akarunk valamivel. Ettől függetlenül ez a játék mindig egy régi nagy szerelem marad.",
    "timestamp": 1760133600
  },
  {
    "username": "GeoCosmogon",
    "rating": 7.0,
    "comment": "nw",
    "timestamp": 1760133600
  },
  {
    "username": "Lendengold",
    "rating": 7.0,
    "comment": "Gereon\n(geschenkt)",
    "timestamp": 1759528800
  },
  {
    "username": "joanmoreno",
    "rating": 7.0,
    "comment": "Eurogame de la vieja escuela muy sencillo de explicar, sesudo y con buena dosis de interacción por el posicionamiento. Me encanta que al colocar las losetas se generen diferentes caminos, ya sea para beneficio propio o para complicarle la vida a los demás jugadores.\nLos componentes de la versión super meeple son espectaculares, aunque por lo que sea, los templos huelen FATAL :S\n\nLe penaliza mucho el AP que genera la mecánica de puntos de acción.",
    "timestamp": 1759096800
  },
  {
    "username": "badiolik",
    "rating": 8.0,
    "comment": "Best Action Point Allowance System game. Many choice every turn. Absolutely to play with advanced rules (auction)",
    "timestamp": 1760479200
  },
  {
    "username": "MrBigos",
    "rating": 8.0,
    "comment": "Very good game, but I feel its age. It is a solid title, but missing a spark.",
    "timestamp": 1760392800
  },
  {
    "username": "MorelliBuendia",
    "rating": 7.5,
    "comment": "Supermeeple edition. Gorgeous components. I played Mexica a few years ago and wasn't sold on it, but now I want to give the trilogy another chance, try them all and keep the one I consider best.\n\nI've only tried the 2p Mini Tikal variant so far, but it looks promising.\n\nUpdate: 3p game. Very, very good. I really enjoy how the AP mechanism is implemented here.",
    "timestamp": 1760133600
  },
  {
    "username": "SueJay",
    "rating": 8.0,
    "comment": "A",
    "timestamp": 1760047200
  },
  {
    "username": "Avid_Equinox",
    "rating": 8.0,
    "comment": "Great area control game!\n+ Plenty of meaningful decisions\n+ Plays fast\n+ Different each play\n- AP prone\n- It has an innate element of kingmaking after I've had repeated plays, which soured me on it - it feels quite obvious if you're going to win based on how hard you have to fight for your board space with others from the mid-game onwards. This has lowered it from a 9 to an 8.",
    "timestamp": 1759615200
  },
  {
    "username": "Zouzou825",
    "rating": 8.5,
    "comment": "One of the most famous Wolfgang Kramer game, at lot of strategy on distributing the action points with a decent level of randomness.",
    "timestamp": 1761004320
  },
  {
    "username": "OGRussHood",
    "rating": 9.0,
    "comment": "My 2025 Top 250: #246\nMy 2024 Top 250: #224\nMy 2023 Top 250: #230\nMy 2022 Top 250: #209\nMy 2021 Top 250: #160\nMy 2020 Top 250: #111\nMy 2019 Top 200: #141\nMy 2018 Top 100: #93",
    "timestamp": 1758492000
  },
  {
    "username": "alejandrodzs",
    "rating": 8.8,
    "comment": "clasico",
    "timestamp": 1758146400
  },
  {
    "username": "ultimoratio",
    "rating": 9.0,
    "comment": "UPDATE - Jan 2025: \n\n4 stars\n\n==================\n\nThe treasure tiles are too arbitrary, in comparison the the fight on the temples. Dropping this from 9.5 to 9. Great game, but not an all-time fave.\n\n============\n\nTypical fun Kramer & Kiesling area majority game. Relatively light rule set. For some reason, this game is much more immersive than the other two games in the trilogy - Java/Cuzco and Mexica.\n\nThe game is much more strategic than Mexica and Cuzco with the strategic placement of camps and the logistical benefits that comes with it.\n\nWay better with the advanced rules, which auction the tiles rather than randomly drawing them.\n\nThe Super Meeple edition looks really good.",
    "timestamp": 1757368800
  },
  {
    "username": "CassioFraga",
    "rating": 8.5,
    "comment": "AP-prone. Want to try with more than 2 players.",
    "timestamp": 1755468000
  },
  {
    "username": "SammySnijbonen",
    "rating": 9.5,
    "comment": "Very good usage of the action point mechanism. Almost every turn you're thinking: \"Damn if only I'd have one more action point to pull off everything I want to do...\"\n\n It has a fun learning curve, with great replayability. Every time I play, I feel I've 'upped my game'. Meanwhile, the game itself keeps the balance between experienced and new players with an element of controlled randomness due to the tile draws: you have a rough idea of when a type of tile can come up, but you never know exactly when it will be drawn (e.g. volcano tiles that start a scoring round, or the fact that temples closer to the bottom of the stack have higher point values while treasure spots contain more treasure tokens at the top of the deck than at the bottom).\n\n The Ravensburger edition has a delightfully rustic appearance. I recommend you put on one of the many rainforest YouTube videos in the background, to increase your immersion.",
    "timestamp": 1759701600
  },
  {
    "username": "rafaelpaz",
    "rating": 10.0,
    "comment": "Very well-designed and fun, with easy rules and excellent strategy.\nAn area control game ahead of its time that has aged very well.",
    "timestamp": 1758232800
  },
  {
    "username": "cenealon",
    "rating": 10.0,
    "comment": "2023 New-to-Me Games Ranked\n2024 Top Games\n2025 Top Games",
    "timestamp": 1757023200
  },
  {
    "username": "DarrylFerster",
    "rating": 10.0,
    "comment": "Bought this new for $34.95 US at Hobbytown USA in Wisconsin. (Boy, that was a great game store! I bought a lot of good games at that one stop.)\nThis is one of my very favourite games. I do well at it. 2-4 players. I love the tile discovery aspect, so every game is different. Sometimes we play with the auction variant, but I slightly prefer just taking turns in order, making the best of what you flip over. It's an area control game.\nThis was the first game I bought designed by Kiesling and Kramer. I later bought Tikal II (not as good), and Torres (very good, but I have only played it a few times.)\nFantastic game components. Even a fantastic box insert! It is one of the few Rio Grande Games that I own.\nIt is one of three games by the same designers in the Mask Trilogy. I have not played the others (Java, in 2000, and Mexica, in 2002), but I keep my eyes open for them in game stores. (I now own Mexica.) I understand that they all use the same action point system. Torres is considered the unofficial fourth game in that trilogy, and I agree.\nI love this game!\n\nI bought a second copy for $14 from Connol Radke's garage sale. The rule book is just photocopied though. I gave it to Friesens for Christmas in 2018.",
    "timestamp": 1755036000
  },
  {
    "username": "Takhyon",
    "rating": 10.0,
    "comment": "I'm usually very good at critiquing and nitpicking even my favourite games, but along with a couple of other unicorn games like Concordia or Ra, I think Tikal is perfect as is. Huge props for Super Meeple for bringing this oldie back with an amazing edition with fantastic components and great art that really lets the game shine. It's a very clever mixture of exploration, area majority, and action points, all of which set it apart from a lot of other games.\n\nSo many games that use that use \"action points\" streamline the system by making each different option you can do on your turn cost the same amount of points, and only allowing you to do two things on your turn or something. Tikal does the opposite, by presenting all these different available actions with varying costs, and giving you a super generous ten action points to use on your turn.\n\nPuzzling out how to allocate your ten points to be the most efficient and giving you the best position on the board is super satisfying, and since the board is constantly evolving and expanding, it's a new fascinating puzzle to figure out each turn. Despite of this the game is not rules-heavy or overwhelming at all and pretty much 90% of the information required to play the game can be easily understood from the player aid, it's just how all they all interact together to create this wonderful puzzle with a lot of depth.\n\nThere's also no conflict or removing other player's pieces from the board, and the way scoring rounds work means that everyone has a chance of positioning themselves to score well. I also love how the board is created by the players and is different each game. You're not only deciding where to place the tiles, but also how to orient them, possibly creating blockages and hard-to-access areas on the board.\n\nIt almost has an \"upside-down\" arc to it, typical area majority game starts out with everyone in their own separate area, whereas in Tikal everyone starts in the same spots, with options where to go growing as the game goes on. It also creates this great feeling of exploration because this jungle is slowly being revealed, and the end state of the board is always extremely photogenic.",
    "timestamp": 1749333600
  }
]