[
  {
    "username": "DanFred",
    "rating": 1.0,
    "comment": "Awful \"game\" that rarely classifies as a game. Liar's Dice is basically guess work and hoping one guess right. Liar's Dice is like the game Guess Who in that sense, but with less skill. It's almost impossible to know when someone is lying or not, especially with more players. Liar's Dice is a luck randomfest. I like bluffing games, but I prefer bluffing games with a way to deduce when people are lying or not with some intelligence, and there seems to be very little of it here. I played a bunch on BGA to give the game a fair chance and I hate it each time.",
    "timestamp": 1732489200
  },
  {
    "username": "EinGlasWurstWasser",
    "rating": 1.0,
    "comment": "{\n\"min_duration\": 10,\n\"max_duration\": 20,\n\"players\": [4,5,6]\n}",
    "timestamp": 1732057200
  },
  {
    "username": "criticalcomma",
    "rating": 1.0,
    "comment": "God I am just so, so very bad at liar’s dice, it’s unreal.",
    "timestamp": 1712095200
  },
  {
    "username": "gyroscope1045",
    "rating": 1.0,
    "comment": "No Cards. It's pretty basic, not much going on here. Would rather just play Farkle or Yahtzee.",
    "timestamp": 1682546400
  },
  {
    "username": "Bifford",
    "rating": 1.0,
    "comment": "\"Played\" on BGA. I had NO clue what I was doing the entire game. I randomly chose dice and values without any idea of what to do.",
    "timestamp": 1601762400
  },
  {
    "username": "rutherford82",
    "rating": 1.2,
    "comment": "Would rather play craps.",
    "timestamp": 1589407200
  },
  {
    "username": "The Nue",
    "rating": 1.0,
    "comment": "I disdain Push-Your-Luck mechanics in general, this distills it down to it's worst components to make it awful and bland and then throws in bluffing to boot... hard pass.",
    "timestamp": 1588456800
  },
  {
    "username": "Ugavine",
    "rating": 1.0,
    "comment": "Don't get it??!",
    "timestamp": 1531519200
  },
  {
    "username": "willpell",
    "rating": 1.0,
    "comment": "I will leave the house in order to avoid having to listen to the cacophony of those hard, clunky dice rattling around in those hard, clunky cups. The gameplay is also offensive to me, but I might find it occasionally enjoyable (in a somewhat psychologically unhealthy way), if it were played with more tolerable components (compare with Roll for the Galaxy's softer cups and tiny, round-cornered dice).",
    "timestamp": 1466546400
  },
  {
    "username": "TheMegaTony",
    "rating": 1.0,
    "comment": "bad",
    "timestamp": 1443391200
  },
  {
    "username": "Dryorophus",
    "rating": 1.0,
    "comment": "Not fun in any way possible",
    "timestamp": 1419548400
  },
  {
    "username": "nefelia",
    "rating": 1.0,
    "comment": "so much luck.....",
    "timestamp": 1373925600
  },
  {
    "username": "napolitano1",
    "rating": 1.0,
    "comment": "Really, what's the point?",
    "timestamp": 1371938400
  },
  {
    "username": "JimTrott",
    "rating": 1.0,
    "comment": "What a terrible excuse for a game. How about I think of a number, 1-50, and you wager against other people what I picked. Also, this is going to take, like, 20 minutes.\n\nAwful concept that requires exactly zero strategy or skill. 0/10.",
    "timestamp": 1363388400
  },
  {
    "username": "Michael Ward",
    "rating": 1.0,
    "comment": "06/10/01 Almost mindless dice rolling. Made Yahtzee seem sophisticated. Played once, hated it (maybe because I was sober).",
    "timestamp": 1255557600
  },
  {
    "username": "stephenstover",
    "rating": 1.0,
    "comment": "I Haaattteee this game. i do not like bluffing and bidding games expecially with small amounts of info and this is what this game is.\n\nHowever I have nuemrous copies of most versions of this gaem including perudo.",
    "timestamp": 1235689200
  },
  {
    "username": "adamknight",
    "rating": 1.0,
    "comment": "Beelzebub will be skating to work before I play this again",
    "timestamp": 1188079200
  },
  {
    "username": "darkfinale",
    "rating": 2.0,
    "comment": "Liar's Dice. Seems limited. Better bluffing games out there.",
    "timestamp": 1744495200
  },
  {
    "username": "botanybotany",
    "rating": 2.0,
    "comment": "Austen likes this game. Simone hates it. It's all numbers and dice. Push your luck. Austen taught us, it's called liar's dice. Tom didn't like it either tho I thought he would.",
    "timestamp": 1741647600
  },
  {
    "username": "cinnzel",
    "rating": 2.0,
    "comment": "El clásico \"El mentiroso\" que se puede jugar con dados de póquer, pero con reglas vitaminadas. Cada jugador tiene sus propios dados que, además, son sus vidas. Las rondas se resuelven con los dados de todos los jugadores que irán aumentando sus apuestas hasta que alguien desconfíe.",
    "timestamp": 1716847200
  },
  {
    "username": "pauloantunes",
    "rating": 1.8,
    "comment": "(in the Kids collection.)\nLiar's Dice: bluff and dice rolling is not a combination I like.",
    "timestamp": 1685397600
  },
  {
    "username": "dragonchilde21",
    "rating": 2.0,
    "comment": "This is just not my type of game. I don't like betting, I don't like bluffing, and I don't like elimination games. But I've tried it and now I don't have to play again.",
    "timestamp": 1655330400
  },
  {
    "username": "ssmooth",
    "rating": 2.0,
    "comment": "Only if there is no other pastime in the room and I am begged to join.",
    "timestamp": 1644015600
  },
  {
    "username": "Dynastico",
    "rating": 2.0,
    "comment": "I am not a good liar and probability was always my worst subject on standardized tests.",
    "timestamp": 1522879200
  },
  {
    "username": "eddy_sterckx",
    "rating": 2.0,
    "comment": "2015-08-10 : A sub-par game, but this should have been called \"guessing dice\", there's no actual lying with a straight face mechanic at all.",
    "timestamp": 1475013600
  },
  {
    "username": "blairbeveridge",
    "rating": 2.0,
    "comment": "I hate this game, but the rest of my family loves it",
    "timestamp": 1342562400
  },
  {
    "username": "anti_clockwise",
    "rating": 2.0,
    "comment": "I do like bluffing as a mechanism. Not in this game, apparently...",
    "timestamp": 1296946800
  },
  {
    "username": "PauloSantoro",
    "rating": 2.0,
    "comment": "Please do not ask why did I play this a second time.",
    "timestamp": 1290985200
  },
  {
    "username": "LilyGirl",
    "rating": 2.0,
    "comment": "The game I really can´t stand. Boring and quite bad idea in my opinion.",
    "timestamp": 1254175200
  },
  {
    "username": "Boards of Games",
    "rating": 2.0,
    "comment": "Can't believe this is a Richard Borg game.It is soooo boring...",
    "timestamp": 1237762800
  },
  {
    "username": "dietevil",
    "rating": 2.0,
    "comment": "This game just isn't for me, but everyone else seemed to enjoy it.",
    "timestamp": 1230678000
  },
  {
    "username": "Red Dragon",
    "rating": 2.0,
    "comment": "You could play this with any ordinary set of dice, without any pasted-on 'pirate' or other theme. It may be more interesting with a larger number of players, but I found the two-player game to be useless. Update: played with six starting players, rating of 2 unchanged.",
    "timestamp": 1211839200
  },
  {
    "username": "njsauer",
    "rating": 2.0,
    "comment": "I genuinely do not get this game. I first got it 20 years ago. I have tried introducing it to four very different gaming groups about four to five years apart now. The result has always been the same in that they have asked if we really needed to finish playing the game (they disliked it that much). So, I'm beginning to wonder if this games \"popularity\" is some sort of joke perpetrated by the eurogaming crowd on the rest of the boardgaming community. I truely don't get it.",
    "timestamp": 1163718000
  },
  {
    "username": "Jamie Tang",
    "rating": 2.0,
    "comment": "There are lots of fans, but I'm definitely not 1. Very noisy.",
    "timestamp": 1136502000
  },
  {
    "username": "Enthousiaste",
    "rating": 3.0,
    "comment": "Well, well, well. Nothing exciting here.",
    "timestamp": 1747778400
  },
  {
    "username": "parpari",
    "rating": 2.7,
    "comment": "Extremely basic and linear bluff game. Also, rules are not intuitive enough for non gamer.",
    "timestamp": 1734044400
  },
  {
    "username": "OthelloKeys",
    "rating": 3.0,
    "comment": "Liar's dice. Fun with a group. Can be boring if you are eliminated early.",
    "timestamp": 1728424800
  },
  {
    "username": "kkknnn",
    "rating": 3.0,
    "comment": "This is very difficult game.",
    "timestamp": 1720735200
  },
  {
    "username": "MystLgnd",
    "rating": 3.0,
    "comment": "Looks fun, but becomes broken and boring quickly.",
    "timestamp": 1697407200
  },
  {
    "username": "rseater",
    "rating": 3.0,
    "comment": "an ok game about bluffing, but mostly about seating order and luck\n\nif it were shorter, I'd like it better",
    "timestamp": 1696888800
  },
  {
    "username": "DrShadyVoid",
    "rating": 3.0,
    "comment": "better play Kuzooka instead",
    "timestamp": 1694901600
  },
  {
    "username": "madvogel",
    "rating": 3.0,
    "comment": "Everyone else aside from me always seems to have fun while playing this. Not my type of game.",
    "timestamp": 1690236000
  },
  {
    "username": "VarietyLights",
    "rating": 3.0,
    "comment": "An unholy union of bluffing and pseudo-deduction. Players who are worse at the game get kneecapped with decreasing information, compounding their disadvantages.",
    "timestamp": 1638658800
  },
  {
    "username": "Magnusson",
    "rating": 3.0,
    "comment": "3 - likely won’t play this again.\n\nMost definitely not my cup of tea. The only gameplay is testing your ability to bluff.",
    "timestamp": 1633039200
  },
  {
    "username": "Mandor",
    "rating": 3.0,
    "comment": "Long game. Player elimination.",
    "timestamp": 1603404000
  },
  {
    "username": "scotthk",
    "rating": 3.0,
    "comment": "We only played this online. But it was enough to make us realize we're not going to play it in person. I liked it more than she did. (APR = 1, SHK = 5)",
    "timestamp": 1599948000
  },
  {
    "username": "lastcocoabean",
    "rating": 3.0,
    "comment": "Scrapped for dice.",
    "timestamp": 1597615200
  },
  {
    "username": "zarapukcy",
    "rating": 3.0,
    "comment": "A mi no me divierte tirar dados, ni intentar adivinar lo que tienen los otros jugadores en sus cubiletes.",
    "timestamp": 1596319200
  },
  {
    "username": "Alexonemillion",
    "rating": 3.0,
    "comment": "Meh. Who cares",
    "timestamp": 1593727200
  },
  {
    "username": "HellslayeR",
    "rating": 3.0,
    "comment": "The game is entertaining, it is more of a party game. The luck is so out of control, you are just guessing what your enemies might have. While you are calculating chances of each number, you can make your way a bit better, but to tell the truth Carcassonne, Love Letter and Ticket To Ride is doing the job in a much more elegant and better way. I play this if im asked to, but i will never ask for it.",
    "timestamp": 1574377200
  },
  {
    "username": "adularia25",
    "rating": 3.0,
    "comment": "I was not the first person to go out, but I was the second. I didn't mind making bold assertions. Though I lost because of questioning other people when they were right. My husband was masterful at psyching people and getting them out... but he didn't win either in the end. It's an OK filler, but not really my kind of game, even though it has lots of dice. I'm not one of finding statistics on the fly to be fun. I prefer my story games to be random... not my dice games.",
    "timestamp": 1546470000
  },
  {
    "username": "resolvecherry",
    "rating": 4.0,
    "comment": "4p is definitely too few for it to remain interesting for long. I also prefer Skull in general.",
    "timestamp": 1759615200
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "This variant of Liar's Dice is simple but fun.",
    "timestamp": 1759356000
  },
  {
    "username": "BoardGamingCouple",
    "rating": 4.0,
    "comment": "4/5\nLiar's Dice is a classic game. It still holds up today. Fun times & engaging. Filled with suspense & simplicity.\n\nPerudo / Liar's Dice",
    "timestamp": 1737414000
  },
  {
    "username": "Bal_505",
    "rating": 4.0,
    "comment": "It’d be fun to play intoxicated",
    "timestamp": 1729893600
  },
  {
    "username": "Reedy8",
    "rating": 4.0,
    "comment": "Reasonably fun game from Peru. Dice game, quick to play.",
    "timestamp": 1709506800
  },
  {
    "username": "iadena",
    "rating": 4.0,
    "comment": "It is Liar's Dice. No need to own because I already own dice.",
    "timestamp": 1708988400
  },
  {
    "username": "Spike1979",
    "rating": 4.0,
    "comment": "In versione digitale sull'iPad",
    "timestamp": 1702076400
  },
  {
    "username": "AmandaDesignsGames",
    "rating": 4.0,
    "comment": "As mainsteam games go, it's a good one. It's short and has strong moments. But in the end, it's still rolling and saying numbers.",
    "timestamp": 1701817200
  },
  {
    "username": "QuantoSnackler",
    "rating": 4.0,
    "comment": "I don't get the game here really.",
    "timestamp": 1690754400
  },
  {
    "username": "mikee385",
    "rating": 4.0,
    "comment": "Fun game for large groups of people, especially while drinking. There's some skill to this game, but not so much that the more experienced players dominate the others. While it does have player elimination, games rarely last very long, so eliminated players don't usually feel left out. It can easily be enjoyed by casual and non-gamers, and definitely makes for a great time-filler.",
    "timestamp": 1686434400
  },
  {
    "username": "mountstnobody",
    "rating": 4.0,
    "comment": "Highly overrated. It's just not a good game if played with experienced gamers. The design is best left as a lighthearted, knockabout game of luck, and should not withstand the stress anything more ambitious.\n\nThe 'bluffing' of this bluffing is barely existent except in specific scenarios, and isn't very integral to other people's choices most of the time. And losing dice is often fatal - catching up after a couple of loses is a big ask. The player elimination often feels outright malicious rather than entertainingly unlucky or deserved as other players can easily circle round and trap you into a corner, forcing positions where you have to call a challenge by your predecesssor (who has access to more information) that can be reasonably made, or force you to bid on something you'll probably almost certainly lose. Viable, and I like a mean game, but this often can just descend into a dogpile if you play with overly competitive people.\n\nI'd rather play Skull (better bluffing and bidding) or 6 nimmt (better chaos, player elimination and push your luck).",
    "timestamp": 1673650800
  },
  {
    "username": "lebryant",
    "rating": 4.0,
    "comment": "A classic speculation game. It shouldn't be taken seriously and is more fun when more players are still in play. Once it gets down to 2-3 players, turn order gives a huge advantage. Will happily play it again when in a mood for something light.\n\n---\nlebryant's TOP games of all time\n---\n[2022]: 213/294 (top 72%) | Rating - 4 | Overall Plays - 1\n[2021]: 210/288 (top 73%) | Rating - 4 | Overall Plays - 1\n[2019]: 202/256 (top 79%) | Rating - 3 | Overall Plays - 1",
    "timestamp": 1672786800
  },
  {
    "username": "PfrBraun",
    "rating": 4.0,
    "comment": "Bluff – oder: Nur für die Mensa. Das Spielprinzip ist wahrscheinlich so alt, wie Würfel selbst. Wer wettet richtig, welche Würfel liegen? Die ewigen Bierzeltgarniturspieler:innen werden gleich an „Mäxchen“ denken. Dieses hat noch den Vorteil, dass man nicht nur Würfel verliert, sondern auch noch einen Schnaps trinken muss. Aber mal ehrlich: Spiele unterliegen ja dem persönlichen Geschmack. Wer also gerne ein bisschen zockt, ist mit Bluff sicher gut bedient. Richtig Erfolg in Gruppen hatte ich damit aber nie auf dem Spieletisch beim Spieleabend, sondern nur in der Mensa. Mal eben zwischen den Seminaren und Lehreinheiten ein bisschen gewürfelt und gezockt. Und hinterher mit freigepustetem Hirn zurück in den Unterricht. Als Spiel zum Auftakt oder Ende eines Abends unterliegt Bluff der Mode: Es gibt Neueres und Besseres, Kürzeres oder Kleineres. Kommunikativ ist es nicht, weil man ja immer nur die nächste Wette mithört und nicht antwortet. Und all das macht es eben zu einem hervorragenden Spiel für die kurze Pause in der Mensa. Wenn man die völlig unnötige Verpackung zu Hause lässt, passt das Spielmaterial auch in jeden Rucksack. Bei welcher Gelegenheit und für welche Zielgruppe es sich anbietet, hat sich uns nicht erschlossen. Es hat jedenfalls sonst nie jemand gefragt: „Können wir bitte Bluff spielen?“ Decken wir Bluff mit einem der schwarzen Becher zu!",
    "timestamp": 1659996000
  },
  {
    "username": "GeorgW",
    "rating": 3.5,
    "comment": "It's silly how much worse this is than Mia and Skull.\n\nPros:\nSometimes the dice surprise you and give you a laugh.\n\nIt's basically a free game many people already have lying around.\n\nCons:\nThe player elimination is pretty bad, and can lead to players sitting out for quite a long time. You also get less info the more hits you take, so there's a fall away loser issue of spiraling into having less and less fun.\n\nAbove all, I don't think the game rewards or encourages bluffing. The way to bluff in this game is to throw out a random number that isn't well-represented under your cup. This has several issues:\n\n1: Since the bids rarely go several circles around the board, this may be your one chance to add information to the group and you may not want to take any risks doing this since the punishment may be to sit out for 30 minutes!\n\n2: Since you have so little information about all other players other than their bids, you can't tell if your bluff is meaningful or affects anyone. For example, if you know that someone else has a lot of threes, it could be fun to say that you also have threes to try to trap them! But you have no way of knowing that, so why even bother?\n\n3: You don't actually get anything for calling out a bluff, you can win the game without ever calling and just betting well. This incentivizes playing safe and not really playing the game for as long as you can!\n\n4: Sometimes you don't have a hand that's easy to bluff with. If you roll a bunch of wilds, nothing you say will be a bluff and if you only roll 5s, why bet on anything else that you have no info on?\n\nAlso, there's no way to affect any player but the ones next to you, so the game doesn't feel interactive and the only benefit to more players is that the dice distribution becomes more interesting.\n\nThe biggest con to this is that Mia and Skull exists. Mia is better because everyone has the same information so bluffing is more interesting, also the way I play it means that dice carry over, which usually leads to an escalating bluff going out of control, which is fun. Skull is better because it's much faster and has a different end condition that rewards risk-taking, plus you have much more control over how you want to bluff.",
    "timestamp": 1654552800
  },
  {
    "username": "Bazzisbazz",
    "rating": 4.0,
    "comment": "Don't know which version I have, it is the nice one with the large chunky cups, not the cheap later version. Basically this is a slight iteration of mexen which I played a lot during my student times. It is silly and fun (with the right group and enough beer).\n\nWould get a higher rating if you didn't have the snowballing and player elimination.",
    "timestamp": 1651701600
  },
  {
    "username": "jodokast4",
    "rating": 4.0,
    "comment": "There is a little bit of strategy and calculation here, but mostly it's just luck. I didn't bother trying to read my opponents, I just calculated odds based on my own dice.",
    "timestamp": 1624572000
  },
  {
    "username": "Pandorzecza",
    "rating": 4.0,
    "comment": "Not for me",
    "timestamp": 1623794400
  },
  {
    "username": "shawnmackay1593",
    "rating": 5.0,
    "comment": "A bunch of dice rolling that didn't stay interesting for very long.",
    "timestamp": 1759788000
  },
  {
    "username": "MorelliBuendia",
    "rating": 5.0,
    "comment": "Nice filler that you can play anywhere.\n\nMogul Scale: 1/A.",
    "timestamp": 1759528800
  },
  {
    "username": "fliegen5",
    "rating": 5.0,
    "comment": "Better than I expected for a dice game, use owned dice to play",
    "timestamp": 1755208800
  },
  {
    "username": "Meloni",
    "rating": 5.0,
    "comment": "Dull",
    "timestamp": 1754604000
  },
  {
    "username": "PolarDad",
    "rating": 4.5,
    "comment": "Last played 2025",
    "timestamp": 1753912800
  },
  {
    "username": "mikesanerd",
    "rating": 5.2,
    "comment": "This is a reasonably fun game with a lot of depth, and I can totally see people loving it, but I think the bottom line for me is that I'd rather play poker, which has a lot of the same features but a lot more excitement and strategy. This is a game that seems like it should be fun, but isn't fun in practice for me.",
    "timestamp": 1753308000
  },
  {
    "username": "dthomas97",
    "rating": 5.0,
    "comment": "Don’t buy the game just grab some dice and a few cups.",
    "timestamp": 1752962400
  },
  {
    "username": "malk1983",
    "rating": 5.0,
    "comment": "Juanma 2",
    "timestamp": 1735081200
  },
  {
    "username": "cymric",
    "rating": 5.0,
    "comment": "Simple game of bluff and a little psychology: the problem is often not determining yourself what would be shown on the dice, but rather asking yourself whether you believe the bid made by your predecessor. In the beginning you can apply statistics with some success, but as more and more dice disappear, you just have to be lucky. (Please do not make the mistake of applying probability theory to your decision when there are just a few dice left–the standard deviation will kill you.) Good game for 'winding down' after a long session of hard thinking.",
    "timestamp": 1730070000
  },
  {
    "username": "cbazler",
    "rating": 5.0,
    "comment": "We have the Disney \"Pirates Dice\" version with the fun kitchy cups (expanded to accommodate 6 players).\n\nIt's a nice bluffing game, one that usually goes over quite well with non-gamers. Unfortunately, it's a bit too \"one note\" for me and I quickly get tired of playing, even when my friends keep asking for more.",
    "timestamp": 1728165600
  },
  {
    "username": "alexdesouza",
    "rating": 5.0,
    "comment": "Better than Texas Hold'em Poker for a bluffing and betting game. But I've shared enough joy and laughter playing this game, that I'd say in the right company this game is an 8. (Best with 4+ players who've had a few drinks each.)",
    "timestamp": 1726696800
  },
  {
    "username": "MissP1ggy",
    "rating": 5.0,
    "comment": "Sold\nFun bluffing game. But usually play different type of games.",
    "timestamp": 1722549600
  },
  {
    "username": "riiiiiiiiir",
    "rating": 5.0,
    "comment": "It is enjoying, but rule was difficult.",
    "timestamp": 1720735200
  },
  {
    "username": "HarutoTsunemoto",
    "rating": 5.0,
    "comment": "very interesting!!",
    "timestamp": 1720735200
  },
  {
    "username": "hikachan",
    "rating": 5.0,
    "comment": "I could not understand the rule.",
    "timestamp": 1720735200
  },
  {
    "username": "414448",
    "rating": 5.0,
    "comment": "Bluffing is fun. I'm not much of a fan of completely abstract games though.",
    "timestamp": 1713736800
  },
  {
    "username": "MikeJonez",
    "rating": 5.0,
    "comment": "2022:5/10\n2024:6/10",
    "timestamp": 1712095200
  },
  {
    "username": "boardmathias",
    "rating": 5.0,
    "comment": "It's a bluffing and dice game. Overall its fun, I like it better than other typical dice games.",
    "timestamp": 1711062000
  },
  {
    "username": "marcodegoede",
    "rating": 5.0,
    "comment": "Is a classic gane of bluff",
    "timestamp": 1710025200
  },
  {
    "username": "docpooh18",
    "rating": 5.0,
    "comment": "Liars Dice",
    "timestamp": 1698357600
  },
  {
    "username": "adrian754",
    "rating": 5.0,
    "comment": "A fun party game, mixing dices and bluffing with a twist of luck. It's ok but there are better party games,",
    "timestamp": 1698012000
  },
  {
    "username": "Nicolas Weiss",
    "rating": 5.0,
    "comment": "BGG's standards for the boundaries of individual games never fail to make me grunt a bit. As I write these words, anything called \"second edition\" seems to get automatically granted its own new entry (splitting the forums, comments, reviews, ratings etc.) regardless of any significant change made to the game; but earlier in the history of the database, the opposite and equally baffling extreme was the norm.\n\nHere are Dudo/Bluff/Liar's Dice/Perudo, titles deemed similar enough to be a single game entry. According to BGG, that game is simultaneously public domain, born in the 19th century, has the very 20th century Richard Borg as its designer and has won the Spiel des Jahres in the early 1990es. My first interpretation of this was that Borg had managed to repackage an old public domain game (maybe changing a minor rule in the process) and pretend he designed it himself. Reality is however more complicated than that. After the admittedly minimal amount of research I could be bothered to do, here's my understanding of the history of Perudo:\n\n• Dice games involving cups and bluffing had some level of popularity in South America in the 19th century. One of them may or may not be close enough to modern Perudo, but there is to my knowledge zero historical evidence of it.\n• Richard Borg iterates on a traditional dice game he names Liar's Dice, realises he can't make money from it unless he repackages it with additional components, and adds a board after witnessing that the bidding structure is the only part new players have trouble with.\n• Liar's Dice is published in 1987 and wins the Spiel des Jahres in 1993. This inspires other similar traditional games to borrow good elements from it. One of these games, Dudo, is rebranded as Perudo to hint at a Peruvian origin.\n• Enthusiasts and publishers bend and/or make up facts about Perudo's origins in order to reinforce the exoticism and traditional roots of the game. The Wikipedia page of the game has basically no reliable source, each paragraph of perudo.com's history of the game starts with \"it is believed that\", and sellers of (hand-made) Perudo sets are too happy to overplay the modern mythology surrounding the game.\n• Someone reads that Perudo is an old game, doesn't fact check and adds 1800 as its date in the BGG database.\n\nSo in short, and until proven wrong, I'll consider that Richard Borg is to be credited for the initial design. I'll also consider that so many variants got published without any backlash that you can make your own copy for cheap without feeling like you're ripping Borg off.",
    "timestamp": 1696197600
  },
  {
    "username": "halbert82",
    "rating": 5.0,
    "comment": "Joc de daus amb \"faroleig\" i eliminació de jugadors. Per el que aporta prefereixò el kiriki.",
    "timestamp": 1695160800
  },
  {
    "username": "ucacuscus",
    "rating": 5.0,
    "comment": "goes for way too long",
    "timestamp": 1694901600
  },
  {
    "username": "Metalkid90",
    "rating": 5.0,
    "comment": "Same as Liars Dice",
    "timestamp": 1693173600
  },
  {
    "username": "rcyo88",
    "rating": 5.0,
    "comment": "Social Party Bluff Game with Dice.\n\nGreat Part Game!\n\n.:Best 5-6:.\n\nMy Notes\nCustom Pirate Dice board (omg... messed up on the first printing. cost so much!)\n\nVariant: Davy Jones Locker\nEarn your one of your dice back!\n- Say your favorite pirate catchphrase to indicate that it is exactly the number. If correct, get a dice back from Davy Jones' Locker!",
    "timestamp": 1688421600
  },
  {
    "username": "b0ardgamer",
    "rating": 5.0,
    "comment": "Not a bluffing fan, but happy to play this occasionally. My wife hates it.",
    "timestamp": 1679266800
  },
  {
    "username": "GrandKhan",
    "rating": 5.0,
    "comment": "Fun mechanic, but pretty hard to catch up if you have lost many dice and player elimination is not fun.",
    "timestamp": 1677366000
  },
  {
    "username": "okram",
    "rating": 5.0,
    "comment": "Rating based on 10+ online plays. Games like Skull maybe take the bluffing mechanism to even more minimalistic levels, but maybe it's just that extra layer of randomness and colour that makes this feel more fun and definitely more approachable to casual players. Then again, having 20+ dice in play means \"doing the math\" becomes bit of a drag. You would love to know if bidding for 8 sixes is shooting for the moon, but unless you're Rain Man you just have to trust your instincts. And depending on the person that can be scary.",
    "timestamp": 1673996400
  },
  {
    "username": "Tichu78",
    "rating": 5.0,
    "comment": "FX Schmid",
    "timestamp": 1672700400
  },
  {
    "username": "JudeMartin01",
    "rating": 5.0,
    "comment": "#50 (2021)",
    "timestamp": 1672527600
  },
  {
    "username": "kitsuneFY",
    "rating": 5.0,
    "comment": "平時不喜歡骰類或賭運氣類型的桌遊，但意外的能接受這個遊戲，雖然早早被抓到吹牛出局，但還是會想看到最後鹿死誰手，即使出局還是很有參與感，是個出乎意料喜歡的遊戲。",
    "timestamp": 1672268400
  },
  {
    "username": "Wrecktangled",
    "rating": 5.0,
    "comment": "Not bad by any means, but I just prefer Skull. They play fairly similar, at least in concept and I believe I would choose that one every time If I could.",
    "timestamp": 1663624800
  },
  {
    "username": "Rex_Lui",
    "rating": 5.0,
    "comment": "Dice",
    "timestamp": 1663538400
  },
  {
    "username": "getareaction",
    "rating": 6.0,
    "comment": "A classic with broad appeal, although I've never been sure exactly what the definitive rules are... Received in trade (with Tzolk'in) for Bloomchasers as part of the UK Fair Trade It Forward in October 2025.",
    "timestamp": 1759442400
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".niet compleet : handlanding ontbreekt\nEAN nvt\nGL8",
    "timestamp": 1758492000
  },
  {
    "username": "mmmichiel",
    "rating": 6.0,
    "comment": "leuk met de fam",
    "timestamp": 1758492000
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 5023117252785\nGL2",
    "timestamp": 1758319200
  },
  {
    "username": "Waffleater",
    "rating": 5.5,
    "comment": "Introduce",
    "timestamp": 1757973600
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Fun guessing and bluffing game\n\n- Chaotic, and with player elimination",
    "timestamp": 1757800800
  },
  {
    "username": "Zalbar",
    "rating": 6.0,
    "comment": "B: 5-6\nC: 1,25\nT: 15-30",
    "timestamp": 1757196000
  },
  {
    "username": "adamolanna",
    "rating": 6.0,
    "comment": "giocato su BSW molte volte",
    "timestamp": 1756159200
  },
  {
    "username": "morteigan",
    "rating": 6.0,
    "comment": "Un jeu de gambling, de bluff, de push your luck et d'intuition. Fun à jouer mais en bout de ligne c'est juste correcte à mon avis. Mais vu l'amour que ma blonde et plusieurs de mes amis ont pour ce genre de jeu, j'ai décidé de l'acheter.\n\nÀ voir si la cote va monter.",
    "timestamp": 1755900000
  },
  {
    "username": "Brekhof",
    "rating": 6.0,
    "comment": "Sold this but I bought it again. It was a very good looking version and also maybe my thoghts has changed on this... stay tuned",
    "timestamp": 1755554400
  },
  {
    "username": "toucana",
    "rating": 6.0,
    "comment": "Impressions: Average\n\nYou need to let this game sit and sit until you get the right group of people to play. In the wrong group, the game drags to no end and no one will have fun. It will be a \"not for us\". With the right group - lots of laughs, eye rolls, accusations and other hullabaloo. It will be \"good\" or maybe even \"great\". As such, I will take the middle road and give an average impression. I think that is fair. The game has aged well but there are now plenty of other engaging games worth looking into and that provides a more uniform experience.",
    "timestamp": 1753912800
  },
  {
    "username": "saseki3",
    "rating": 6.0,
    "comment": "Si hace viento es el único juego posible para que jueguen en la playa más de 3 personas… sin viento y no en la playa hay infinitas opciones mejores",
    "timestamp": 1753567200
  },
  {
    "username": "Alquerque",
    "rating": 6.0,
    "comment": "El,clásico juego del mentiroso con un tablero y alguna mecánica adicional. No veía mesa y se puede jugar con dados normales. Vendido.",
    "timestamp": 1752271200
  },
  {
    "username": "smaug007",
    "rating": 6.1,
    "comment": "It's a fair game, easy to teach and play. Seating order plays a significant role.",
    "timestamp": 1751580000
  },
  {
    "username": "Infernotitan2",
    "rating": 6.3,
    "comment": "ok",
    "timestamp": 1751407200
  },
  {
    "username": "lexen",
    "rating": 6.0,
    "comment": "nice party game.",
    "timestamp": 1749420000
  },
  {
    "username": "Pelijussi",
    "rating": 6.0,
    "comment": "If this kind of game can be good, then this is",
    "timestamp": 1744581600
  },
  {
    "username": "capnwaffer",
    "rating": 6.0,
    "comment": "Pretty clean push you luck and bluffing game.",
    "timestamp": 1742684400
  },
  {
    "username": "Djakra",
    "rating": 6.3,
    "comment": "Fun for relaxed times and to joke with your friends. Luck, bleff, risk, all at your service. When dice are low number it feels it drags too much, in particular for eliminated players. Often, less information means less probability to win.",
    "timestamp": 1742425200
  },
  {
    "username": "autumnweave",
    "rating": 6.0,
    "comment": "My 10 year old kids enjoy this.",
    "timestamp": 1740870000
  },
  {
    "username": "rhamsterren",
    "rating": 5.5,
    "comment": "As a game; so so...\nFor social interaction; great.\n\nbluffing, mind reading and luck of the dice",
    "timestamp": 1739833200
  },
  {
    "username": "leshanware",
    "rating": 6.0,
    "comment": "Prêté à Cloé",
    "timestamp": 1738537200
  },
  {
    "username": "Sawney",
    "rating": 6.0,
    "comment": "Spoof with dice!",
    "timestamp": 1737846000
  },
  {
    "username": "Tyndal",
    "rating": 6.0,
    "comment": "A fantastic bluffing game that is swarming with tough choices.",
    "timestamp": 1737673200
  },
  {
    "username": "jmchou",
    "rating": 6.0,
    "comment": "pnp",
    "timestamp": 1737327600
  },
  {
    "username": "bnordeng",
    "rating": 6.0,
    "comment": "I think I played this game once before many years ago. This was fun and I can see that it works well as a lunch-time / filler game. I've been playing it lately and enjoying it quite a bit as a quick-playing game.",
    "timestamp": 1737068400
  },
  {
    "username": "Ross2099",
    "rating": 6.0,
    "comment": "Out of box, 2-4 players.",
    "timestamp": 1736118000
  },
  {
    "username": "mudville9",
    "rating": 6.0,
    "comment": "Finally got a chance to try Liar's Dice via a homemade copy. It's great. The tactile nature of the dice and cups elevate it over something like Skull or Cockroach poker. Very easy game anyone can play.",
    "timestamp": 1735858800
  },
  {
    "username": "LuCy88",
    "rating": 6.0,
    "comment": "A bit old, but gold.",
    "timestamp": 1734130800
  },
  {
    "username": "Olaf Nielsen",
    "rating": 6.0,
    "comment": "Really a 6 players game",
    "timestamp": 1733698800
  },
  {
    "username": "Rygel",
    "rating": 6.0,
    "comment": "SDJ\n\nVery simple game, but fun with the right group.\n\nGot in 2009",
    "timestamp": 1731279600
  },
  {
    "username": "Mailman Mike",
    "rating": 6.0,
    "comment": "Pirate’s of the Caribbean version",
    "timestamp": 1730934000
  },
  {
    "username": "tphon",
    "rating": 6.0,
    "comment": "No cards",
    "timestamp": 1728770400
  },
  {
    "username": "VladEnsel",
    "rating": 6.0,
    "comment": "Fun with friends.",
    "timestamp": 1724623200
  },
  {
    "username": "Marudka",
    "rating": 7.0,
    "comment": "Bez 1 kości",
    "timestamp": 1759096800
  },
  {
    "username": "SkyborneVeggies",
    "rating": 7.0,
    "comment": "Classic\nDice game",
    "timestamp": 1758924000
  },
  {
    "username": "diamondinblue",
    "rating": 6.8,
    "comment": "2024 Oct: 6.5\n2025 Sep: 6.75\nRevising my rating for consistency with my ratings of other games.",
    "timestamp": 1758405600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "Tons of plays. This has been a favorite at game nights. Easy fast game for six. I have the Call My Bluff edition.\n\nKeep",
    "timestamp": 1757541600
  },
  {
    "username": "Jordan_Varbev",
    "rating": 7.0,
    "comment": "Party, Super Light, PYL, Bluffing\n#3, #4*, #5**, #6**",
    "timestamp": 1757368800
  },
  {
    "username": "Imichan",
    "rating": 7.0,
    "comment": "Before BGG, I played ~500 games. Most of them were played in Pirates of the Caribbean Sea: At World's End.",
    "timestamp": 1756677600
  },
  {
    "username": "Nilbogcoffee",
    "rating": 7.0,
    "comment": "(Thrift store find.)",
    "timestamp": 1755208800
  },
  {
    "username": "minimuffin",
    "rating": 7.0,
    "comment": "bon jeu d'apéro",
    "timestamp": 1754949600
  },
  {
    "username": "Bozok",
    "rating": 7.0,
    "comment": "We call it Pirate's Dice. Most call it Liar's Dice. Great party game! Except there is player elimination, which can feel bad. I just have a bunch of dice and plastic cups, not an official version.",
    "timestamp": 1754949600
  },
  {
    "username": "Rorek9",
    "rating": 7.0,
    "comment": "low stakes social deception game",
    "timestamp": 1754863200
  },
  {
    "username": "Zronos3008",
    "rating": 7.0,
    "comment": "Pise",
    "timestamp": 1754172000
  },
  {
    "username": "totero",
    "rating": 7.0,
    "comment": "Work",
    "timestamp": 1752703200
  },
  {
    "username": "nvidia3dfx",
    "rating": 6.8,
    "comment": "• Family / Party game\n• Dice rolling + Push your luck\n• Good filler game for me and my group\n• Cons:\n- RNG at its core. I normally dislike games this random, but since it usually wraps up in around 15 minutes (4-5p), I don’t mind it here\n• Good components\n• Replayability: Low\n• best with 4-5 players\n.\n Personal Rankings\nOne of My Top 10 Party Games\nOne of My Top 20 Dice Rolling Games",
    "timestamp": 1752703200
  },
  {
    "username": "ironvulture",
    "rating": 7.0,
    "comment": "Liars dice is always a hit with any size group. Player elimination is a bummer but it is a fun game.",
    "timestamp": 1752444000
  },
  {
    "username": "The Jade Knight",
    "rating": 6.7,
    "comment": "Belongs to W",
    "timestamp": 1752012000
  },
  {
    "username": "PwnPlow",
    "rating": 7.0,
    "comment": "Un jeu de bluff et de dés simple, efficace et toujours fun à plusieurs. L’ambiance est garantie, surtout avec les bons groupes. On ment, on surenchérit, on se fait avoir… tout ce qu’il faut pour des rires et des tensions légères. Mais à la longue, les parties peuvent se ressembler, et le hasard domine largement la stratégie.",
    "timestamp": 1751234400
  },
  {
    "username": "Kaffedrake",
    "rating": 7.0,
    "comment": "Very simple game of inference and dissimulation. Can be played as quickly as you like and needs only a few dice per player.\n\nI have now tried the variants with variable dice loss and/or wild sixes, they all work. The former adds a little more nerve but also feels a little more random.\n\nThrifted on 17/8 2013, 1/10 2014, 1/12 2021, 12/4 2022 and 12/6 2025.",
    "timestamp": 1749679200
  },
  {
    "username": "Koennen",
    "rating": 7.5,
    "comment": "Pure bluffing. Richard Borg's rules significantly improve the game.",
    "timestamp": 1761009720
  },
  {
    "username": "Drb89_",
    "rating": 8.0,
    "comment": "Bluffing\nDice rolling\nPlayer elimination\n++ Simple\n+ Quick",
    "timestamp": 1760911200
  },
  {
    "username": "fazermozg",
    "rating": 7.5,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "darKOR",
    "rating": 8.0,
    "comment": "very good filler for 4-6 players - just simple fun\n\nlocation: in the Dice Town Box\ngifted to L50",
    "timestamp": 1760133600
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "Differences between Perudo & Liar's Dice: https://boardgamegeek.com/filepage/24809/main-rule-variation...",
    "timestamp": 1759874400
  },
  {
    "username": "JesusMari_",
    "rating": 8.0,
    "comment": "Zee #3 of everyone should play once",
    "timestamp": 1759183200
  },
  {
    "username": "warlock000",
    "rating": 8.0,
    "comment": "Rating for a 4-player experience with the Playte ruleset, a P&P board and dice from Strike.\n\nI didn't expect to like it as much as I did. It's a thoroughly enjoyable bluffing game (I much prefer it to Skull). You don't need even need cups, you can easily cover dice with your hand. A very good night opener!\n\nI keep my P&P board version in the Strike box, both of these are fantastic party dice games.",
    "timestamp": 1759183200
  },
  {
    "username": "ahrnge",
    "rating": 8.0,
    "comment": "It's lit.",
    "timestamp": 1758837600
  },
  {
    "username": "Ateckentrup",
    "rating": 8.0,
    "comment": "Old but still great fun with 5-6 players.",
    "timestamp": 1757541600
  },
  {
    "username": "Abysmul",
    "rating": 8.0,
    "comment": "Liars Dice",
    "timestamp": 1756418400
  },
  {
    "username": "AdAstra2",
    "rating": 8.0,
    "comment": "25th Century Edition",
    "timestamp": 1755122400
  },
  {
    "username": "dbrubeck",
    "rating": 8.0,
    "comment": "Liar's Dice",
    "timestamp": 1754431200
  },
  {
    "username": "conte_nitori",
    "rating": 7.8,
    "comment": "easy, played with easy people, easy evening",
    "timestamp": 1754258400
  },
  {
    "username": "ourmove123",
    "rating": 8.0,
    "comment": "A simple dice & bluffing game.\n\nSupposedly an old-time pirate game.\n\nThe game play loop is very simple, and mechanically strong.\n\nA map that makes scoring easier is necessary in my opinion.\n\nCan be played with any cups/containers and some dice.\n\nBest played with upgraded components to add to the immersion.\n\nThe game involves player elimination, which is the main downside if you care about it.\n\nThe game seems like a strong play-and-while-you-do-whatever kind of game.\n\nEasy to learn and play if you have a map to keep score.\n\nThere's just enough bluffing and probability based strategies to make games different and interesting.\n\nThe theme is okay. The art is nearly non-existent. The game play loop is excellent for a bluffing game.",
    "timestamp": 1752703200
  },
  {
    "username": "blackpawl",
    "rating": 8.0,
    "comment": "2025 / 2024 / 2023",
    "timestamp": 1752616800
  },
  {
    "username": "Brother Abe",
    "rating": 8.0,
    "comment": "May 2025\nTanuki Games $24.99",
    "timestamp": 1752444000
  },
  {
    "username": "SettlerOfGalway",
    "rating": 8.0,
    "comment": "Really fun and laid back, really good bar game.",
    "timestamp": 1752012000
  },
  {
    "username": "GatthePekerd",
    "rating": 9.0,
    "comment": "LUDOTECA IDEAL por Not in my Game.",
    "timestamp": 1759442400
  },
  {
    "username": "mofo83",
    "rating": 8.5,
    "comment": "Update: This is quickly approaching top-5 fave territory. At first I just thought it was a less fun version of Skull, but it's TOTALLY different and in some ways more interesting. The bluffing is so satisfying and easy to pull of, the meta game becomes really interesting too. So easy to teach, great to roll some dice in the little cups, easy enough for kids and non-gamers, great for playing outside in the sun! LOVE it.\n\nIt took me a little while to see the genius of this game, but now it's a favorite. As the bids ramp up, the decision of when to challenge is so interesting and satisfying. The reveal of the dice is unexpectedly entertaining more times than not - especially when the bid is exact! And though there's elimination, it seems to stay close most of the time! Overall, a must-keep game. Really like my Call My Bluff edition, too, with the little dice cups and 90's illustration.\n\nAlso... I used to think this was close enough to Skull that I didn't need to own both. Though the feel of the two games IS kind of similar, they're very different. I might still prefer Skull a tiny bit more, but they're close...\n(Thrifted)",
    "timestamp": 1759356000
  },
  {
    "username": "UnluckiestCat",
    "rating": 8.5,
    "comment": "Classic PYL dice rolling game; the more players the better.",
    "timestamp": 1758405600
  },
  {
    "username": "Dave1995",
    "rating": 8.5,
    "comment": "Amazingly fun with 5+ players and up. Mom and dad aren't as impressed but with all other gaming groups it was a major success.....definitely more plays needed\n\n(Stijn bought a copy for himself and Celia + have played several sessions with their copy)\n\nPolte isn't a huge fan....he thinks it's just okay",
    "timestamp": 1758319200
  },
  {
    "username": "AlPacino11",
    "rating": 9.4,
    "comment": "The best dice rolling - bluffing party game with just a few dice and cups.",
    "timestamp": 1757800800
  },
  {
    "username": "trawlerman",
    "rating": 9.0,
    "comment": "I have the Perudo edition and use a hodgepodge of rules from different editions.",
    "timestamp": 1756677600
  },
  {
    "username": "dwarf",
    "rating": 8.5,
    "comment": "I play when ever I go to Quebec City to see my cousin and niece.\n\nVery enjoyable and light.\n\nUPDATE:\n\nStarted playing at work with colleagues during lunch at work.",
    "timestamp": 1756504800
  },
  {
    "username": "lealitz",
    "rating": 9.0,
    "comment": "très efficace très drôle très simple très addictif on adore les dés on adore les paris c’est superbe",
    "timestamp": 1755381600
  },
  {
    "username": "ItsMagic",
    "rating": 8.7,
    "comment": "small bluffing game-like stimulating tactile confrontative continuously sustaining straightforward;\nfavoured over Pickomino, Skull, Liars Dice, Spoils of War, Lie",
    "timestamp": 1755208800
  },
  {
    "username": "Pandante",
    "rating": 9.0,
    "comment": "A classic bluffing game, that is fun for adults, but tricky for kids as the bluffing and adding (and doing both at the same time) is tricky. With kids, I like playing a slight variation, where the person who called a bluff successfully loses a die, and the first without die wins. This gives a more positive feel to it and also serves as a bit of a catch up mechanic.",
    "timestamp": 1754258400
  },
  {
    "username": "peteg1001",
    "rating": 8.5,
    "comment": "Harmless dice bluffing game. You could substitute with ordinary playing cards or even just use your own d6 and cups!\nI prefer Skull for the theme and aesthetics.\nUPDATE July25. Now our go to post dinner drinking game with friends! Score revised up from 7 to 8.5",
    "timestamp": 1752444000
  },
  {
    "username": "muncleuncle",
    "rating": 9.0,
    "comment": "2-6, Best: 5-6 / 15-30 min\n\nSdJ 1993 (BLEIBT!)\n\nKeine Sleeves erforderlich\n\nTOP 100 PARTY (BLEIBT!)",
    "timestamp": 1751580000
  },
  {
    "username": "Sanae",
    "rating": 8.5,
    "comment": "Une valeur sûre en terme de jeux d'ambiance. Fonctionne très bien auprès de joueurs cherchant un jeu de bluff. Le fait d'avoir des dés et des cups ajoute un aspect ludique et sympa pour les enfants autour de la table.",
    "timestamp": 1746396000
  },
  {
    "username": "oursino",
    "rating": 9.0,
    "comment": "En français. Très bon état.",
    "timestamp": 1744840800
  },
  {
    "username": "Plargyplop",
    "rating": 9.0,
    "comment": "Nowt wrong with a bit of bluffing.",
    "timestamp": 1744149600
  },
  {
    "username": "ultimoratio",
    "rating": 9.0,
    "comment": "UPDATE: just saying once again that the Playte rule set is better and made Perudo a top filler game\n\nPlayte edition rules (which you can retro to your copy) made this the perfect filler game. By eliminating dice based on the difference made this very snappy!\n\n========================\n\nAwesome classic game. Bidding up and keep raising the ante until someone calls someone's bluff. Good players are the ones listening to other people's bid and bid according to the information they are getting.",
    "timestamp": 1742425200
  },
  {
    "username": "Fingoldfin",
    "rating": 8.5,
    "comment": "(aka: \"Dudo\" or \"Cacho\")",
    "timestamp": 1741215600
  },
  {
    "username": "r0cka",
    "rating": 10.0,
    "comment": "4p +",
    "timestamp": 1760652000
  },
  {
    "username": "badassbr",
    "rating": 10.0,
    "comment": "Um dos melhores jogos existente, Dudo, Liars dice, Perudo esse jogo é uma joia!",
    "timestamp": 1760133600
  },
  {
    "username": "angstyzebra",
    "rating": 9.5,
    "comment": "Bluffing/Player Elimination",
    "timestamp": 1758578400
  },
  {
    "username": "Abelardo_Blue",
    "rating": 10.0,
    "comment": "Gambling... What else can I say lmao",
    "timestamp": 1758319200
  },
  {
    "username": "Urbanwatts",
    "rating": 10.0,
    "comment": "Easy to understand why this is a classic. So much fun table talk and the 1v1 at the end just ups the athmosphere so much!",
    "timestamp": 1756764000
  },
  {
    "username": "les_",
    "rating": 10.0,
    "comment": "Perudo, aka Dudo, aka Dice of the Andes, aka Liar’s Dice. A South American game that, according to legend, was created by the Incan empire in the 16th Century. The game also features prominently in the movie Pirates of the Caribbean: Dead Man’s Chest.",
    "timestamp": 1756677600
  },
  {
    "username": "Carchofo",
    "rating": 10.0,
    "comment": "locura",
    "timestamp": 1749074400
  },
  {
    "username": "TForever",
    "rating": 10.0,
    "comment": "Filler game. You have to collectively guess how many dice there are as a group, but it gets harder to say the more dice you lose. It's good tension.",
    "timestamp": 1744408800
  },
  {
    "username": "Chris Schreiber",
    "rating": 10.0,
    "comment": "Do you hear the 'Call of the Cups'? We never tire of this---it's always requested, it's always fun. When I lose, I don't care. When I win, I feel brilliant. What's better than that? I prefer the Perudo edition since the colored plastic cups and dice are good colors and very functional.\n\nUpdate 01/09: Not hitting the table much at all anymore. At one point I really thought this was something we'd play on a monthly basis, but its been months since we've played and no one misses it.\n\nUpdate 6/2020: Man, I love this game. So glad my family got into it. So fun. So easy. Such a gem!\n\nMarch 2025: Buying up used copies off Ebay and gathering dice to do a big tournament at the boarding school where I work.",
    "timestamp": 1742166000
  },
  {
    "username": "ASihm",
    "rating": 10.0,
    "comment": "Simple Dice game. So much fun in groups of 3-5 players. There MUST be a \"disadvantage of losing\", like buying rounds of beverage, doing something embrassing etc.",
    "timestamp": 1740610800
  },
  {
    "username": "AlesDvran",
    "rating": 10.0,
    "comment": "What a great bluffing game, although the turn rules is restrictive",
    "timestamp": 1740006000
  },
  {
    "username": "EParr327",
    "rating": 10.0,
    "comment": "My all time favorite party game for groups of 4-6",
    "timestamp": 1735772400
  },
  {
    "username": "brw12",
    "rating": 10.0,
    "comment": "4 plays:\n\nSpectacularly addictive, competitive, and thrilling. My group exploded with gasps and groans every 5 minutes, and after finishing a game immediately started another.\n\nPlayers do get eliminated, but the game tightens and gets quicker as fewer players (with fewer dice) are left, so it doesn't feel boring on the sidelines.\n\nRules are fairly simple, and then strategy emerges naturally from there, with many wrinkles and opportunities for clever and Machiavellian play.\n\nConsistently a big hit -- there are very few better games in terms of the ratio of complexity to intense, competitive joy.\n\nGame complexity/weight: 2 out of 5",
    "timestamp": 1733007600
  },
  {
    "username": "tolding",
    "rating": 10.0,
    "comment": "Up-rating from a 5 to an 8, really enjoyed it at a lower player count where it felt like there was more control.\n\nUp-rating to a 9 after a few more plays. Such a simple game that is almost at the level of Cockroach Poker for bluffing, fun and laughter.\n\nWith the right group, this game sings and deserves a 10 rating",
    "timestamp": 1732575600
  },
  {
    "username": "qwheeler",
    "rating": 10.0,
    "comment": "There's definitely strategy to this game, and it doesn't necessarily involve lying.",
    "timestamp": 1721167200
  },
  {
    "username": "yuad",
    "rating": 10.0,
    "comment": "This is simple game, so you can do this game with your friends or family.",
    "timestamp": 1720735200
  },
  {
    "username": "immersedreality",
    "rating": 10.0,
    "comment": "5/6",
    "timestamp": 1716069600
  }
]