[
  {
    "username": "njsauer",
    "rating": 1.0,
    "comment": "I don't like the fact that the game can win.",
    "timestamp": 1163113200
  },
  {
    "username": "JohnUt",
    "rating": 1.0,
    "comment": "A very unique concept. Well packaged game. Too bad it sucks. By the end of the only game I played of it I was wishing for death.",
    "timestamp": 1060466400
  },
  {
    "username": "cymric",
    "rating": 2.0,
    "comment": "Filthy Rich gets full marks for inventive use of stationary material: a binder with see-through plastic pouches. Unfortunately, the simple economic game of growth is brought to its knees because of total luck of the die which can bestow you with money in no time flat, or run you into bankruptcy faster than a politician can change his opinion. There is no long term challenge to thie game whatsoever: after a while you enter the Zone which ends when the Moon is in conjunction with Venus and Sagit... Oh, sorry, my bad: when someone scores three cards. (But really, nothing would change if you used the Moon instead.) The second glaring mistake which made me decide with a passion never to play this game again is that taxes can grind the game to a halt. They are meant as an equaliser, but if they show up too often, they do nothing but hinder the game. Mr Garfield, if you design something, please make sure that it will simply end out of its own accord, and not due to pure chance.\n\nI'm tempted to award this with a 1 for utter pointlesness—the winner is the one who was luckiest—but I'll be gentle and up the rating to a 2 instead for the rather original idea of using such a mundane item.",
    "timestamp": 1263682800
  },
  {
    "username": "dddwwwhhh",
    "rating": 2.0,
    "comment": "Played a four player game which was abandoned after three hours. Too long, not much real strategy.",
    "timestamp": 1058306400
  },
  {
    "username": "PikAss",
    "rating": 3.0,
    "comment": "Unbalanced and crude economic game with an overwhelming luck part. The game's layer concept is interesting, but the implemention is quite lame. The game graphics are also pretty bad.\n\nI've played it with three other persons. It was frustrating and unexciting.",
    "timestamp": 1598565600
  },
  {
    "username": "AlasDemigod",
    "rating": 3.0,
    "comment": "Preliminary rating after one play.",
    "timestamp": 1522101600
  },
  {
    "username": "larse",
    "rating": 4.0,
    "comment": "nice idea with the pages but waaaaaay too random",
    "timestamp": 1507068000
  },
  {
    "username": "montsegur",
    "rating": 4.0,
    "comment": "Not the thrilling game I ve expected . X-Pasch is doing the same in a much shorter time and shorter rules. Nice idea with the pages but that s it",
    "timestamp": 1499464800
  },
  {
    "username": "cbrua",
    "rating": 5.0,
    "comment": "Very unique game element (binder system). The heavy luck element ruins most games, though. If you get hits early you get more cash than your opponents and can grab the cheap luxury goods. If you get screwed early you are basically out of the game because it is very difficult to catch up. I enjoy the game on occasion, but it is definitely a luck-fest. If there were a way of balancing things out a little more, and reducing the chilling effect that taxation has, it would be more fun.",
    "timestamp": 1464645600
  },
  {
    "username": "Clockpunk",
    "rating": 5.0,
    "comment": "Fantastically imaginative mechanics and concept, with a theme that matches them impeccably.",
    "timestamp": 1444860000
  },
  {
    "username": "epilgrim",
    "rating": 5.0,
    "comment": "it has a clever design and plays well. I just never seem to play it...\n\nIn 2006 I purged my games and gave this away.",
    "timestamp": 1429394400
  },
  {
    "username": "Wakko",
    "rating": 5.0,
    "comment": "A cute and unique play mechanic, but ultimately a mediocre game.",
    "timestamp": 1404856800
  },
  {
    "username": "Robb327",
    "rating": 6.0,
    "comment": "To donate",
    "timestamp": 1654120800
  },
  {
    "username": "Ranior",
    "rating": 6.0,
    "comment": "Filthy Rich's main draw is the clever idea to have the game involve a binder with card sleeve pages, and you can flip them to an active page, but things still show through the clear sleeves from below.\n\nPlayers buy out ad space on the various pages, and so having something on the bottom page can be good when it shows through, but it can get covered up.\n\nThat central gimmick/idea is pretty cool and there's some fun times around that. The rest of the game is lacking a bit in clarity of rules and in good flow--the random nature of taxes means that you can easily get hammered for your investments instead of them paying out, and given how variable d10 can be in disribution there is a large amount of luck, added on top of drawing cards from the deck that dictate some of what you can or can't do in the first place.\n\nI think the game has some serious issues with play scaling, 2 and 3 player games can too easily be won by rushing luxuries before you even get in to the actual fun/interesting part of the gameplay which is the light economic engine building tied with deciding whom and when to pay to cover over someone else's ad space. I also think it has some bad issues with player elimination for a few weirdly timed events where the base game rules don't allow for a player to sell off to cover costs and instead just eliminates them.\n\nOverall though this is still worth a few plays. If it were possible, this feels like another game that would be a great target for Restoration Games to work their magic on--with some reworking and rules tweaks, think there is still a pretty fun and cool game in the basic framework here.",
    "timestamp": 1646607600
  },
  {
    "username": "heli",
    "rating": 6.0,
    "comment": "http://spotlightongames.com/list/nights/f.html#filthy",
    "timestamp": 1600639200
  },
  {
    "username": "jatang",
    "rating": 6.0,
    "comment": "There are major flaws & you wind up calling the game when taxes let no one advance. Or you limit the win to 2 luxuries. But it's lots of fun & different from everything else out there. It appeals to my twisted sense of humor. Low downtime for a multi-player. Good for an end of night game.",
    "timestamp": 1599084000
  },
  {
    "username": "seraph77",
    "rating": 7.0,
    "comment": "Very inventive 3-D mechanism in how signs are placed. Well worth finding.\n\nOn the downside: Game can drag with four players, and two players benefits from house rule found on BGG to remove cheapest luxuries and multiple hits from taxes or to casino in the same turn (else game ends much too soon).",
    "timestamp": 1745186400
  },
  {
    "username": "stevepwalker",
    "rating": 7.0,
    "comment": "Keep",
    "timestamp": 1735945200
  },
  {
    "username": "TheGreatKhan",
    "rating": 8.0,
    "comment": "Played it a few times before. It was absolutely hilarious and fun to play, both because of the game, but also the kinds of people I played with. Hoping to get my hands on it and relive some of those great moments again.",
    "timestamp": 1639609200
  },
  {
    "username": "sa266",
    "rating": 8.0,
    "comment": "We do play with a few house rules, and never with more than 3, but it's a good fun game, although sometimes a bit dependent on the dice",
    "timestamp": 1467496800
  },
  {
    "username": "kplayer1177",
    "rating": 9.0,
    "comment": "It is only for 5 or 6 but we played it with 7 and even 8 players. That was sooooooooooo much fun.\n\nPlaying with 7 players almost guarantees that every player will go bankrupt sooner or later, causing lots of laughter.\n\nWe didn't know that, but we found out since EVERY player went bankrupt in our game. Was soooo much fun :-)",
    "timestamp": 1463263200
  },
  {
    "username": "everdistracted",
    "rating": 9.0,
    "comment": "Surprisingly awesome! Loved this game from the first try...",
    "timestamp": 1330297200
  },
  {
    "username": "LisArtist",
    "rating": 9.5,
    "comment": "As we play Space Base, sometimes we compare it with this old game that frequently makes it to our game table. It remains a novel game that uses transparent card sleeves to place billboards. It's a gambling game, and a race to place your billboards where the odds are favorable, avoid taxes and buy three luxuries to win. It's not always an even game, but if you enjoy gambling games, this one is still a wonder. It will never leave our collection because it is entrenched in our game group as a classic and part of our group identity. High praise, indeed.",
    "timestamp": 1678834800
  },
  {
    "username": "Tolkana",
    "rating": 10.0,
    "comment": "12\n\nVäldigt unikt spel!",
    "timestamp": 1663106400
  }
]