[
  {
    "username": "tsundoku310",
    "rating": 1.0,
    "comment": "無駄に多いランク",
    "timestamp": 1695592800
  },
  {
    "username": "hacksword",
    "rating": 1.0,
    "comment": "(1 play) Twice the complexity of Asshole, but with half the fun!",
    "timestamp": 1156888800
  },
  {
    "username": "Nico D",
    "rating": 2.0,
    "comment": "3€",
    "timestamp": 1760824800
  },
  {
    "username": "Pandorzecza",
    "rating": 1.5,
    "comment": "Not for me",
    "timestamp": 1628978400
  },
  {
    "username": "heartofanartichoke",
    "rating": 3.0,
    "comment": "Initial Thoughts: At it's core, Frank's Zoo is a shedder with a non-traditional deck (all the cards are animals) and a non-linear hierarchy. Players either beat the card that was just played or pass. Some of the animals have special abilities; for example, mosquitos can bolster the strength of Elephants, and Orcas have no higher card. Also some of the cards score your points, like lions which only score if you have more than 2 of them (at least a pride) or hedgehogs that prevent you from losing points. After the first hand, there's a bit of an overly complex method of creating partners for the subsequent hand. Once players get the flow down it the hierarchy and game administration makes a bit more sense and the choices open up somewhat. However, I still found the decision space a bit small for my liking and the scoring/pairs mixing a bit too complex given its weight. I rarely felt I had many truly meaningful decisions, though the animal theme did help make this a bit more fun.\n\nThe person who taught this to us said there's many groups who really proselytize Frank's Zoo. I can see a group who is very familiar with the cards and flow of the game really getting into more subtle strategy that we likely missed on our initial play. The problem for me is that I found the core game mechanics a bit frustrating given the weight, meaning I'm not particularly keen to get to that next level where Frank's Zoo more likely shines. (2025-04-17)",
    "timestamp": 1744840800
  },
  {
    "username": "ravenskana",
    "rating": 3.0,
    "comment": "Tried this once and it wasn't bad but nothing about it called out to me. If someone in my family suggests playing I will do so with no complaints, but otherwise, I'll probably forget I even own this. It probably belongs in a better home with people who will love it.",
    "timestamp": 1637708400
  },
  {
    "username": "TheMitchMaster",
    "rating": 4.0,
    "comment": "1 play:\nVery disappointed in this. I was looking forward to playing this game for some time and it flopped as hard as any game could. Our game - of which lasted one normal round followed by one partnership round, before being called off - was full of uninteresting decisions, and unsatisfying round end conditions.\nI would want to play this again with a group of trick taking devotees but I can't see it happening.\n\n2 plays:\nOk, this worked better, but it's just not as interesting as other climbing games - and definitely not as interesting as other team shedding games (Bacon specifically). In fact, I see no reason to play this instead of Bacon.\nFrank's Zoo works a lot better if everyone knows the deck composition. I'd wager it doesn't work at all otherwise. Card counting is pretty much essential to play.",
    "timestamp": 1753826400
  },
  {
    "username": "wkover",
    "rating": 4.0,
    "comment": "Sometimes I stumble across one of my old ratings and wonder whether it's still accurate. In this case, FZ is one of the first euros I ever purchased, and my tastes have changed since then.\n\nReplaying 13 years after my initial purchase: The rating doesn't hold. \n\nFix the lion scoring rules to make them less auto-winny and you might have something.",
    "timestamp": 1752703200
  },
  {
    "username": "Indy500sr",
    "rating": 5.0,
    "comment": ".compleet\nEAN 8717371240028\ncd rek 9",
    "timestamp": 1757196000
  },
  {
    "username": "GTAcademy",
    "rating": 5.0,
    "comment": "簡單動物鋤Dee game,有D變化, 要留牌, 但未算好有記憶亮點.\n\n總: 唔玩唔會好大損失",
    "timestamp": 1744840800
  },
  {
    "username": "nnf1",
    "rating": 5.0,
    "comment": "A good trick taking game and great for introducing kids to the concept. Fun when played with four also.",
    "timestamp": 1738623600
  },
  {
    "username": "HollaMonkey",
    "rating": 5.0,
    "comment": "Enjoyed the ladder climb game with animals, but with lots of players you find yourself passing alot. General review was the game was ho hum",
    "timestamp": 1733094000
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "simple card game, nothing special here",
    "timestamp": 1759960800
  },
  {
    "username": "tickbite",
    "rating": 6.0,
    "comment": "A great game that can be quite a lot of fun. It's best played with 4 or 5 people. A problem that frequently surfaces is that people tend to keep their lions too late in the game (when nobody can beat them), which takes a bit of the fun out of it. And ... mosquitos have only two wings! It annoys me every time I see them with four. Other than that - great artwork!",
    "timestamp": 1757023200
  },
  {
    "username": "punkin312",
    "rating": 6.0,
    "comment": "This is a very challenging card game. It took many rounds before I think I started to figure it out. The art is of course adorable. I quite enjoyed this game. I would play this again but maybe lower the # needed for the game to be complete. I felt it lasted a bit too long for me. Very enjoyable!",
    "timestamp": 1756591200
  },
  {
    "username": "PikaPomelo",
    "rating": 6.0,
    "comment": "Played a few times and enjoyed trying to see what cards I could play over others. The water and land animals are somewhat split into two hierarchies. Too complex for me to really understand a strategy, but still enjoyable. I can't remember the details of the team aspect, but that was also weird, but fun.",
    "timestamp": 1754085600
  },
  {
    "username": "serjordah",
    "rating": 7.0,
    "comment": "I need to revisit this cute, \"climbing\" card game that features revolving partnerships, as I recall really liking it when last I played it.\nIt's got just the right mixture of luck and light-strategy to make it a really nice crowd pleaser.",
    "timestamp": 1752012000
  },
  {
    "username": "Pendraggin",
    "rating": 7.0,
    "comment": "Want the 2025 English revised edition",
    "timestamp": 1751752800
  },
  {
    "username": "cabbagekingaf",
    "rating": 8.0,
    "comment": "Cute animal cards are language-independent and require no reading skills. Fun climbing card game where you want to be the first to get rid of all the cards in your hand. May want to add in a few regular playing cards to aid in score keeping. Easier at the basic level, without the advanced varying partnerships.",
    "timestamp": 1758405600
  },
  {
    "username": "Boardgameswithb7",
    "rating": 8.0,
    "comment": "Is this game a hidden gem? I've included this game in my video series over on YouTube, Spotlighting Hidden Gems in Board Games. Watch the entire episode here:\nhttps://youtu.be/lISpRLFaVrw\n\nOr\nRead my review here:\nhttps://boardgamegeek.com/thread/3550695/fun-at-franks-zoo",
    "timestamp": 1757714400
  },
  {
    "username": "Dr D1",
    "rating": 9.0,
    "comment": "Surprising that his clever game is overlooked by the \"Heavies\" in the industry (Tom V hasn't even reviewed it -- I think if he did, it would claim a spot in the top 100). It is a delightful game and everyone clamors to play over and over. I had to buy a new one because we wore out the first. More strategy that you would think, but easily within the grasp of kids 10 and over. UPDATE: as more of my grandkids reach around 10 years old, the more clamoring there is to play this game--over and over.",
    "timestamp": 1736204400
  },
  {
    "username": "ShiannLin",
    "rating": 9.0,
    "comment": "2000 Spiel des Jahres Recommended",
    "timestamp": 1733094000
  },
  {
    "username": "RoGo",
    "rating": 10.0,
    "comment": "just a classic in its genre.\nwith the new 2-3 player variant it is a 10 for me.",
    "timestamp": 1754258400
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "So many climbing games try to stand out, but I still love how this one did it with simple circular paths (and no numbers).",
    "timestamp": 1752703200
  }
]