[
  {
    "username": "anonystu",
    "rating": 1.0,
    "comment": "Excellent concept: exceedingly poor implementation. The disks slip around, the counters are fiddly, the combat is not very interesting, and the scenarios have no depth. Throw in power disks and there's your 1.",
    "timestamp": 1093557600
  },
  {
    "username": "Parliament",
    "rating": 2.0,
    "comment": "Some cool ideas. However, I did not like the combat mechanic of tossing the disks into the air. Killed it for me.",
    "timestamp": 1467583200
  },
  {
    "username": "Deeevorce",
    "rating": 3.0,
    "comment": "Flipping discs and throwing missiles makes for a unique gameplay, but not my cup of tea.",
    "timestamp": 1521414000
  },
  {
    "username": "Nodens",
    "rating": 4.0,
    "comment": "More of everything could probably fix it. Just kidding.",
    "timestamp": 1761121140
  },
  {
    "username": "Yokiboy",
    "rating": 5.0,
    "comment": "I wish this was still around, and more popular. However, it has sort of been lapped by Battleground: Fantasy Warfare.",
    "timestamp": 1638658800
  },
  {
    "username": "Mike Wene",
    "rating": 5.0,
    "comment": "Place holder for list:\nI have most disks from all sets.",
    "timestamp": 1620511200
  },
  {
    "username": "wtrollkin2000",
    "rating": 6.0,
    "comment": "I once rated this much higher, but the random distribution of mostly mediocre units across too many factions really ruined what could have been a decent game (let me buy the units I want instead of units I don't want). Play is still fun however, so I rate the fixed box sets a 7.",
    "timestamp": 1683324000
  },
  {
    "username": "captaincomic",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1672786800
  },
  {
    "username": "faidutti_ludotheque",
    "rating": 7.0,
    "comment": "Je n'ai jamais pratiqué les jeux de guerre avec figurines. Longs, souvent complexes, excessivement simulationnistes, ils demandent, que ce soit pour concevoir les armées ou peindre les figurines, un investissement en temps que je ne suis plus prêt à accorder à quelque jeu que ce soit. Depuis Magic, et même si j'ai fait avec plaisir une ou deux parties de certains d'entre eux, je ne me suis plus non plus plongé dans aucun jeu de cartes à collectionner.\n\nDiskwars a pourtant éveillé ma curiosité. Par son thème, par ses scénarios, par ses règles de construction d'armées, il s'apparente à des jeux avec figurines comme Warhammer, sans avoir pourtant aucun de leurs défauts. Les auteurs, Tom Jolly et Chris Petersen, ont en effet eu à cœur d'alléger autant que possible les systèmes, supprimant tout ce qui fait la lourdeur des jeux de guerre classiques. Pas de figurines à peindre, pas de décors à préparer des heures durant, tout cela est remplacé par des disques de cartons joliment illustrés. Pas de règles de déplacement complexes, puisque les disques avancent en pivotant un certain nombre de fois sur eux mêmes - une idée géniale où l'on reconnait la patte de Tom Jolly, l'auteur de Wiz war. Les projectiles sont tout simplement... lancés d'une pichenette sur la cible. Tout est à l'avenant, faisant de Diskwars un agréable jeu de baston qui ne prend pas trop la tête.\n\nPour des raisons commerciales, Fantasy Flight Games a voulu faire de Diskwars un jeu à collectionner, à la manière de Magic, puisque chaque boite comprend non seulement une armée complète (nains, orques, dragons...), mais aussi quelques disques distribués aléatoirement. C'est un peu dommage, car les pouvoirs et les effets des disques ne sont pas assez variés pour justifier une véritable collection. Avec quatre boites, vous devriez avoir largement de quoi faire deux armées qui tiennent la route et commencer à vous amuser sur la moquette du salon.\n\nLe jeu à cependant quelques défauts. Mal organisées, les règles sont touffues et parfois confuses, alors que le jeu n'est pas véritablement complexe. En outre, contrairement à ce que prétend l'éditeur, Diskwars ne se joue vraiment bien qu'à deux. Malgré tout cela, c'est sans doute le meilleur des jeux de guerre actuellement disponibles. D'ailleurs, des extensions et des adaptations à d'autres univers sont déjà publiées.\n---\nI've never played figurines war games. These games are long, complex, simulations. They need lot of time, to create armies and to paint figurines, and I'm not willing to spend so much time on any one game. Since Magic, I've never plunged myself deeply in any other collecting card game, though I've played a few games of some of them with great pleasure.\n\nDespite this, Diskwars arose my curiosity. The theme, the scenarios, the army-building rules, are those of figurine war games like Warhammer. The authors, Tom Jolly and Chris Petersen, managed nevertheless to remove all the systems and the components that make classical war games so heavy. No figurines to paint, no complex board to set up, everything is replaced with nicely illustrated cardboard disks. No complex movement rules, disks move with rotating on their side - a wonderful system in which one can recognise Tom Jolly, the author of Wiz War. As for the missiles, they are simply... thrown towards their target. Because of all those simple rules, Diskwars is probably the lightest and the most fun of all wargames.\n\nFor commercial reasons, Fantasy Flight Games decided to make out of these ideas a MtG-like collectible game. Each box has a complete army (dwarves, orcs, dragons...), and a few random extra disks. However, the power and effects of the various disks are not different enough to make trying to get a complete collection interesting. With four boxes, you can build two strong armies and have some nice battles with a friend.\n\nThe game is really exciting, but has two flaws. First, the rules are badly written and sometimes obscure, though the game is, in fact, rather simple. Furthermore, and though the publisher pretends that it does, the game in fact doesn't work with more than two players. Despite all this, it's probably the best wargame on the market by now, and it's not surprising that expansions sets, and adaptations of the diskwars system to other universes, have been published.",
    "timestamp": 1695333600
  },
  {
    "username": "Carabor",
    "rating": 7.5,
    "comment": "Unique mechanic design.",
    "timestamp": 1751493600
  },
  {
    "username": "Arven",
    "rating": 9.0,
    "comment": "This was an excellent and innovative game, much cheaper than the miniatures games of the day. In a way it helped FFG to become the Juggernaut it is today.",
    "timestamp": 1528668000
  },
  {
    "username": "mandrathara",
    "rating": 10.0,
    "comment": "Need Baron Gradir, Rampaging Homunculus, Aargoran Celevran,Peasants, Goblin Crossbows",
    "timestamp": 1628460000
  }
]