[
  {
    "username": "Dr Brian",
    "rating": 1.0,
    "comment": "Lowly rated because I never played it, yet owned it for years, and never opened it. I eventually sold it. The topic just never peaked my interest.",
    "timestamp": 1304373600
  },
  {
    "username": "pilotbob",
    "rating": 2.0,
    "comment": "There's just too much randomness in this game. You have very little control over what happens. It feels like an activity.",
    "timestamp": 1428357600
  },
  {
    "username": "pharmabrew",
    "rating": 3.0,
    "comment": "This may have been an acceptable design in 1996 when it came out, but just doesn’t stand up in 2021. Everything you need to do in the game costs money and the only way to get money is for chits you own to randomly be drawn from the cup. That alone is a bad design choice. It can lead to a rich get richer spiral because if someone is lucky and has a bunch of chits drawn one round, they will have more money for the next round to buy and so on. Also, every chit gets put back into the cup at the end of the round so your odds don’t increase round to round except for buying another chit. However, if you don’t have much money because your chits weren’t randomly drawn, you can’t buy much. I bought Boston less than halfway through the game and it wasn’t drawn once because you know…random. The other thing that actually made me laugh later in the game was all of the modifiers that you need to work through when someone is trying to take over a spoke. Ok, I get +2 for this, +1 for that, another +1 for that so I’m plus four. The defender gets +1 for this, +1 for that, and +1 for this other thing for a +3 total. So, I’m a net +1. All of that for a +1 modifier? The worst part is that you have to go through this basic math exercise EVERY time someone goes to take over spot. It is fiddly and brutal. The worst part of this game though is that it drags on interminably. Ugh.",
    "timestamp": 1627164000
  },
  {
    "username": "galen",
    "rating": 4.0,
    "comment": "3",
    "timestamp": 1524434400
  },
  {
    "username": "RogerDHyman",
    "rating": 5.0,
    "comment": "We played this *a lot* when it first came out; but the design is now \"showing its age\". There are simply too many games out there that are much better.\nPros--Nice components. Cons--Far too random in game play; planning does not have many rewards. Too much \"gotcha\" in the game play. Few real decisions.\nI would very much welcome an updated/improved design of this game. Kept it for a long time due to sentimental reasons and some fond memories, but finally let it go to hopefully find a good home..",
    "timestamp": 1722895200
  },
  {
    "username": "Micastiz",
    "rating": 5.0,
    "comment": "My family played this many times but stopped over 20 years ago. At the time it had some game elements that made it interesting but has now been surpassed by so many other games. The randomness is probably the biggest negative as compared to more modern games.",
    "timestamp": 1623276000
  },
  {
    "username": "chrisbrandt",
    "rating": 6.0,
    "comment": "I loved it until I got stuck with all of the plane crashes one game. Dealbreaker for me.",
    "timestamp": 1704754800
  },
  {
    "username": "PlayingK",
    "rating": 6.0,
    "comment": "Simple game that overstays it welcome as the last few rounds seem to be back and forth sways until one player eventually wins.",
    "timestamp": 1697407200
  },
  {
    "username": "Blinko",
    "rating": 6.5,
    "comment": "Shrink-wrap\nListed BGG Marketplace 09-11-25\nLike a railroad game, but with planes.",
    "timestamp": 1757541600
  },
  {
    "username": "mcpranno",
    "rating": 8.0,
    "comment": "Highly addicting to people that love randomness in their games. The basic and advanced game have completely different flavors, so try them both.",
    "timestamp": 1700262000
  },
  {
    "username": "Caspman",
    "rating": 9.0,
    "comment": "Gift from Sean.",
    "timestamp": 1654380000
  },
  {
    "username": "Aaronthewarmonger",
    "rating": 10.0,
    "comment": "This is one of my favorite games to play when my friends come back home! I'm on my third copy due to my chits wearing out, and I have 2 copies in reserve that I hope will take me to the end of my life. There is a lot of randomness, but with 5 and six players the game is a lot of fun, and even the person in last has a chance to submarine the person in first place, or get hot with the dice and get back into it with a little fare wars!",
    "timestamp": 1620079200
  }
]