[
  {
    "username": "nechrach",
    "rating": 1.0,
    "comment": "Stupid design cards are not very diverse should be spread out more.",
    "timestamp": 1656194400
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "I'd like to play other crayon games. This one is just too long for the level of complexity, and likewise it doesn't seem deep enough to warrant getting particularly fast at the game. When an 18xx can be played in the same amount of time there's really no reason to spend an evening pushing trains a few miles a turn.\n\nThe time-lapse of the routes spreading across the map is fun to watch.",
    "timestamp": 1561240800
  },
  {
    "username": "Phuntom",
    "rating": 1.0,
    "comment": "Yuck. Terrible components and extremely booring by today's standards. I'm not even talking about the crayons, which I am willing to overlook. It's impossible to read icons on the goods! And who in their right mind would flip through rulebook reading through a massive list of goods and locations and try to figure out where things go? This may have been \"fun\" in the Tactics II era (i.e. pre-color-TV), but... Gimme a break. The only people that might possibly buy this one are folks that have the locations and routes totally memorized (you know who you are), and have a hankering for some major nostalgia. No modern gamer would could possibly spend time playing this. Avoid - Railroad Tycoon would make a much better investment.",
    "timestamp": 1218578400
  },
  {
    "username": "MamaRat",
    "rating": 1.0,
    "comment": "I love route-building games--Tikal, Thurn & Taxis, Elfenland, La Strada, Amazonas, Settlers, etc. But I HATED this game. Each turn seemed interminable (in the game's defense, I was playing with one friend who's notorious for his analysis paralysis). Visually and thematically unappealing, and the crayon-on-laminated paper format is just plain chintzy.",
    "timestamp": 1170802800
  },
  {
    "username": "Sheylon",
    "rating": 1.0,
    "comment": "Same thing all the other says: boring, downtime, multi-player solo game, yuck, yuck, yuck! A good way to kill an interest in gaming. Adults shouldn't play with crayons.",
    "timestamp": 1110582000
  },
  {
    "username": "RobRose",
    "rating": 1.0,
    "comment": "Need a crayon to play...enough said.",
    "timestamp": 1007766000
  },
  {
    "username": "hiimjosh",
    "rating": 2.0,
    "comment": "This game hasn't aged well. It takes a simple concept and rule set and draws it out for 2-3 hours. The simplicity is pretty much to a bore and I don't really find any appeal to this outside of drawing on the board with crayons",
    "timestamp": 1691013600
  },
  {
    "username": "joshua109",
    "rating": 2.0,
    "comment": "Wife and I found it to overstay its welcome by a long shot. If I recall correctly, there was lots of going through the motions as you waited for your cash to replenish/the board state to line up enough for you to make an interesting decision again.",
    "timestamp": 1655330400
  },
  {
    "username": "Craig Viau",
    "rating": 2.0,
    "comment": "Although I like railroad games this one is like multiplayer solitare.",
    "timestamp": 1232233200
  },
  {
    "username": "brdmartin",
    "rating": 2.0,
    "comment": "Played once, and after an hour, suicide never sounded so good",
    "timestamp": 1230764400
  },
  {
    "username": "concertbandie",
    "rating": 2.0,
    "comment": "Comment from Iron Dragon:\n\n\n\nI don't understand the appeal of any of the crayon rail games, on turn 2 someone was eliminated because a bridge was washed out in front of him and you are not allowed to turn around and he had no money to rebuild (it was only the second turn) and so that was it, he was out. The end game was sort fun, but the 4 hrs it took to get there was worse than getting teeth pulled, I will NEVER play one of these games again!",
    "timestamp": 1222293600
  },
  {
    "username": "lantern314",
    "rating": 2.0,
    "comment": "Takes freakin forever. It seems like you have many turns where nothing interesting happens.",
    "timestamp": 1219096800
  },
  {
    "username": "Zachfromohio",
    "rating": 3.0,
    "comment": "Should not be played with more than 3",
    "timestamp": 1754604000
  },
  {
    "username": "wkover",
    "rating": 3.0,
    "comment": "More fun than Silverton, and MUCH more fun than being exposed to gamma radiation.\n\nFast rules only (increased train speeds: 9->12 and 12->16), without event cards. Purchased as a family game.\n\nUpdate:\n\nPurchased as a family game that would never be played, it turns out.\n\nGame for sale or trade. Help me help you.",
    "timestamp": 1752616800
  },
  {
    "username": "Pandorzecza",
    "rating": 2.5,
    "comment": "Not my game type",
    "timestamp": 1629669600
  },
  {
    "username": "theaaron",
    "rating": 3.0,
    "comment": "Got this game early on when I was trying new games. Started playing it just one time and realized that this is not my kind of game.\n\nSold.",
    "timestamp": 1560981600
  },
  {
    "username": "StarTripper",
    "rating": 3.0,
    "comment": "Tedious",
    "timestamp": 1501624800
  },
  {
    "username": "ExcitingJeff",
    "rating": 3.0,
    "comment": "This game is boring. Really boring. The beginning is a desperate, brutal struggle, to the point of frustration, but once you get your engine up and running, the game becomes an exercise in tedium. It also suffers from a runaway leader problem, and encourages analysis paralysis. Also, the art is hideous. I don't think we'll be breaking this one out again any time soon.",
    "timestamp": 1393196400
  },
  {
    "username": "enavico",
    "rating": 4.0,
    "comment": "- Fiddly, long, old crayon rail classic",
    "timestamp": 1751839200
  },
  {
    "username": "edwardwilfred",
    "rating": 4.0,
    "comment": "I'm sure this game was absolutely amazing in the 80s, but by today's standards I can't help but find it very boring. It's hard to see crayon on the board. I also very much so dislike that you have many turns in which all you do is move your train.",
    "timestamp": 1670799600
  },
  {
    "username": "John Rogers",
    "rating": 4.0,
    "comment": "Slightly more enjoyable than Eurorails for newbies who don’t know their geography. Lacks the tunnels of eurorials or the outback dilemma of Australia.",
    "timestamp": 1635544800
  },
  {
    "username": "ewokracoonbreder",
    "rating": 4.0,
    "comment": "I've lowered this rating because this system is boring. I love the look of the map but the mechanics are pretty dull. Move, drop off goods, take money, draw, repeat for 2-3 hrs. I think if the game only maxed out at 2hrs for 5 players it would be great. Although I'm not really sure how you would do that. And then there are the event cards which do make you more careful about planning your route but in the end just make the game longer.\n\nI know there are a lot of big fans of this game and I did love it at one point and it deserves credit, but it is not for me anymore.",
    "timestamp": 1612479600
  },
  {
    "username": "Namtabandy",
    "rating": 4.0,
    "comment": "I'll lead with my bias: I'm not a huge fan of pick-up-and-deliver (PUAD). I find it tedious as a mechanic and most missteps result in back-tracking (the antithesis of fun). That said, I do kind of like route-building and I always appreciate a good train game.\n\nLet's assume that the PUAD portion is at least average by other people's standards, even though to me it's tiresome. The problem with Empire Builder is the other component building blocks are all below average in their respective categories:\n\n-The engine-buidling is really minimal relative to the scale of the game (the slope is not very steep and not very long)\n-The economic component is flat and disinteresting without space for creative play\n-The game is devoid of any real shared incentives with minimal player interaction (perhaps this is wanting it to be a stock game when it's not, maybe not a fair criticism)\n\nI had many turns go by where I was just moving my piece the maximum distance and then passing. Not many fun things to think about or plan between turns to keep your mind engaged. You make a mental order of operations that is the most efficient combination of options available and you execute. *shrug*\n\nI will say the route-building is pretty fun. And writing on the map is just money. There should be more crayons in games. I also appreciate that this game was a step in a new direction for train games, and honestly the rough outline of what would one day be Union Pacific/Ticket to Ride to me seems evident. I would much rather play TTR than EB. It's faster, the decision space is tighter and more interesting, the game arc has a steeper slope while also achieving a greater dynamic range, and it strips away pieces parts that are ok to let go.\n\nGiven that 1830 was more or less a contemporary, I can't give this one much leeway I'll often afford to older technology. I'm just not excited to play it again. But I guess I would if you love it and want me to.",
    "timestamp": 1589666400
  },
  {
    "username": "143245",
    "rating": 4.0,
    "comment": "There are some things I really enjoyed about it; you almost want to speculate on what goods someone will need as the values are by distance, so picking up trees/tourists/nickle and then heading west to try and get cards that work is an option that *almost* works. The simulation aspect of \"how do rail lines evolve, when do you lease vs buy, etc\" is really fascinating and almost overwhelming for novice players. Unfortunately, this falls flat and shows it's age; the event cards are straight 80s dickage, and the cards in general are difficult to get a solid handle on. Last, so many turns were spent just moving the 12 spaces and waiting. In that regard, it reminds me of High Frontier in so far as you make estimates based on factors that are sort of in your control, but you won't have a solid grasp on the commitment (of rail lines, and early goods/cash), and the second half (or two thirds) of the game is seeing if that commitment pays off. For that reason, I could see the short variant being a serious improvement, but it's just a product of it's age I guess...",
    "timestamp": 1566165600
  },
  {
    "username": "gutrie_es",
    "rating": 5.0,
    "comment": "Uno de los mejores juegos de esta serie.\n\nEl desarrollo es el de un múltiple solitario, cada jugador juega en su caja de arena y no interactua con los demás. El resultado aunque el juego esta bien se hace un poco largo y tedioso hacia la parte final.\n\nCon 2 jugadores está muy entretenido, con mas jugadores puede suponer un tedio y un tostón.",
    "timestamp": 1749592800
  },
  {
    "username": "rynelf",
    "rating": 4.5,
    "comment": "--Sept2005-- Peaceful game with cute mechanics. Very very long, for what it is.\n\n++ Several unlogged plays ++",
    "timestamp": 1680559200
  },
  {
    "username": "rabid_schnauzer",
    "rating": 5.0,
    "comment": "Crayon Rail",
    "timestamp": 1646521200
  },
  {
    "username": "peppermintpark",
    "rating": 5.0,
    "comment": "Recall the feel of playing monopoly, thinking you are never going to finish this? This game has that vibe. Takes too many turns to go back and force, often lengthy wait between turns",
    "timestamp": 1643842800
  },
  {
    "username": "luigi13",
    "rating": 5.0,
    "comment": "problemi a tracciare rotte con matita. cambiato regole",
    "timestamp": 1642028400
  },
  {
    "username": "Solarinus",
    "rating": 5.0,
    "comment": "Sold",
    "timestamp": 1635544800
  },
  {
    "username": "joebelanger",
    "rating": 5.0,
    "comment": "I did not get this game. Brutal.",
    "timestamp": 1610060400
  },
  {
    "username": "xilconic",
    "rating": 5.0,
    "comment": "Maybe not really my style of game? I did enjoy the idea of being able to draw out your own network on the map and I kind of appreciated the econimic side of things. But it's not a game I'd go out of my way for to get played again.",
    "timestamp": 1608505200
  },
  {
    "username": "JamesT",
    "rating": 5.0,
    "comment": "I wanted to like this, but it's just too long.",
    "timestamp": 1575932400
  },
  {
    "username": "jeffwolfe",
    "rating": 5.0,
    "comment": "Crayon rail games never seemed to be worth the effort. I'm glad I played this at least once, but I'm not itching to play again. Update 15 years later: It was fine. Maybe I won't wait another 15 years.",
    "timestamp": 1546470000
  },
  {
    "username": "Dobbin2",
    "rating": 5.0,
    "comment": "Dated. Dull as ditch water and ugly as sin. Thank God the 80's are over.",
    "timestamp": 1545951600
  },
  {
    "username": "yolandavi",
    "rating": 5.0,
    "comment": "I prefer Iron Dragon.",
    "timestamp": 1541804400
  },
  {
    "username": "KatydidWonders",
    "rating": 6.0,
    "comment": "2-6",
    "timestamp": 1745877600
  },
  {
    "username": "HuckmanT",
    "rating": 6.0,
    "comment": "2025 Great game, good fun drawing rails and a neat logistics exercise. Makes you good at geography, too! Less played due to length of time needed. Don't try to substitute Shoney's free crayons...",
    "timestamp": 1738969200
  },
  {
    "username": "yougurt87",
    "rating": 6.0,
    "comment": "Chelsea hasn't played",
    "timestamp": 1738364400
  },
  {
    "username": "cenealon",
    "rating": 6.0,
    "comment": "Why I Got Rid of It",
    "timestamp": 1731020400
  },
  {
    "username": "emike",
    "rating": 6.0,
    "comment": "Long game with minor player interaction and irritating bad luck event cards.",
    "timestamp": 1709420400
  },
  {
    "username": "dhable",
    "rating": 6.0,
    "comment": "Managed to play through the North American title in the series after trying Eurorails at CotN 2019. Maintains the same feel, challenges and level of fun but with a geography that I know better. The load icons are still impossible to get just from the map and require the player aids. Drawing with crayon makes the routing more challenging than something like Ticket to Ride and let's the game move quicker than an 18xx where you're trying to figure out how to leverage the tile set to your advantage. The rules seem simple enough to explain to even the casual gamer but the play length can run a bit long.\n\n\nRating History:\n22 Jan 2024 - 6 (3 plays)\n12 Jan 2021 - 7 (1 play)\n01 Jul 2019 - 8 (1 play)",
    "timestamp": 1705878000
  },
  {
    "username": "RandaPrince",
    "rating": 6.0,
    "comment": "It's one of those games that I probably wouldn't play now, but I remember fondly.",
    "timestamp": 1687125600
  },
  {
    "username": "Pascalculate",
    "rating": 6.0,
    "comment": "- Genuinely like how the game works. It's pretty easy to play, you create lines to do jobs, do jobs to create line. Getting connections to 5 major cities is the hard part, the rest is just spamming the contracts to victory.\n- Being one of the earliest train games, i feel like it was alright for its time, but it needs some more modifications to fit the modern era, but it creates a brutal gameplay that's still pretty fun to play, and i really love the washable crayon provided by Mayfair.\n- From the home rules printed in the box, i think this game has quite some followers. Obviously this is just a template for future train games, but if most modern train games are like this i'm quite intrigued.",
    "timestamp": 1682978400
  },
  {
    "username": "Convisor",
    "rating": 6.0,
    "comment": "My brain hurts too much after playing this.",
    "timestamp": 1675465200
  },
  {
    "username": "Ranior",
    "rating": 6.0,
    "comment": "I like the pickup and deliver style gameplay and the tough choices of what contracts to go for, and the skill in trying to figure out how to do everything efficiently. The rules are relatively simple, and everyone is participating over a shared board and space.\n\nHowever, the parts I don't like include some lengthy downtime as others carefully plan out turns. It doesn't help that you often deliver and then pull some random events and contracts and then have to figure out right then what you're doing which means it's tough to plan ahead to make the turn go faster.\n\nIt's also just a tad on the fiddly end for me with players having to do lots of simple counting and changing of money in order to properly execute the game state. I don't think there's a clear way around it, and the game is interesting in the way it is, but overall there's just a tad too much time being spent on things other than interesting game decisions for this title to be great.",
    "timestamp": 1674428400
  },
  {
    "username": "sctreno",
    "rating": 6.0,
    "comment": "looong.....",
    "timestamp": 1671145200
  },
  {
    "username": "SanHolo39",
    "rating": 6.0,
    "comment": "Extremely long for what it is. And I play pretty much the same way every time.",
    "timestamp": 1661119200
  },
  {
    "username": "2goofy",
    "rating": 7.1,
    "comment": "5th Edition (has Mexico)\nCards NIS\nNever played",
    "timestamp": 1754344800
  },
  {
    "username": "Unitoch",
    "rating": 7.0,
    "comment": "Satisfying gameplay when it comes down to it, but this baby is showing its age. Components and mechanics will baffle gamers used to more streamlined modern game with less fine-grained arithmetic built in. Still, drawing on the board with crayons (or dry erase markers) is cool, even if it is in a game whose style doesn't lend it to frivolity. The game gets better with familiarity, but it'll take dedication to do so, as it tends to run long. Despite all these things, I enjoy playing the game, which I suppose says something about the strength of the mechanics.",
    "timestamp": 1748296800
  },
  {
    "username": "Weezoh",
    "rating": 6.5,
    "comment": "For sale at Adventurer's guild - $20",
    "timestamp": 1735167600
  },
  {
    "username": "tropical",
    "rating": 7.0,
    "comment": "Starting to like this kind of crayon game.",
    "timestamp": 1733007600
  },
  {
    "username": "Rygel",
    "rating": 7.0,
    "comment": "Two Player Value = Good, but more competitive with more players.\n\nThree Player Value = Good, but more competitive with more players.\n\n\nEmpire Builder is the first of the crayon-rail games that set a new standard of \"train\" games and gives players that great \"train\" game feeling.\n\nEmpire Builder uses the tried and true crayon rail building system. Players use crayons to draw tracks on the board. Players then use their rails to make deliveries.\n\nEmpire Builder uses cards to power a simple pick-up and delivery system. Players pick-up good from one city then deliver those goods to another city to earn money. The first to set amount of money wins.\n\nThe crayon rail pick-up and delivery system is easy to learn. New players will quickly learn the game and start drawing their own rails.\n\nWhy not longer inventive, the crayon rail system was new for its time. It is fun to draw on the board. Sort of like a big kids coloring book.\n\nThe artwork is minimal at best, but the components are fine. Same goes for the theme. Empire Builder is more focused on mechanics then art and components.\n\nEmpire Builder is great teaching game. This is a wonderful way to learn the geography of the nation.\n\n\nPros -\n- Tried and true mechanics\n- Easy to learn\n\nCons -\n- Games can go a little long\n\n\nOverall Playability = 6.5\n\nDesign = 7\nStrategy = 8\nLuck = 6\nArtwork & Components = 2\nUse of Mechanics = 8\nTime of Play = 7\nFun = 7\nInnovation = 8\nAnalysis Paralysis = 7\nTheme = 5\n\n\n-------------------------------------------------------------------------------------------------------------------\n\n\nUnique Component - Crayons\n\n\nUnique Mechanic - This was the first crayon-rail game.\n\n\nQuick Thoughts - I really enjoy this game.\n\n\n-------------------------------------------------------------------------------------------------------------------\n\n\n\nGot in 2007\n\n\nTwo Player Game List - http://boardgamegeek.com/geeklist/171376/item/3192819#item31...\n\nThree Player Game List - http://boardgamegeek.com/geeklist/171378/item/3765794#item37...",
    "timestamp": 1731279600
  },
  {
    "username": "Peaceful_Dragon",
    "rating": 6.5,
    "comment": "If I have time.",
    "timestamp": 1729634400
  },
  {
    "username": "seguleh",
    "rating": 8.0,
    "comment": "2-6",
    "timestamp": 1752876000
  },
  {
    "username": "your_warlock",
    "rating": 8.0,
    "comment": "Condition: No box",
    "timestamp": 1750802400
  },
  {
    "username": "dLyonBW",
    "rating": 8.0,
    "comment": "One of the best games ever made. Easy to learn, not so easy to win. No two games are alike.",
    "timestamp": 1750197600
  },
  {
    "username": "gmcnish",
    "rating": 7.5,
    "comment": "Crayon rails. Ok for a lazy sinday afternoon, if the event cards dont conspire against you",
    "timestamp": 1749679200
  },
  {
    "username": "rkeswani",
    "rating": 7.5,
    "comment": "Empire Builder has easy mechanics and focuses primarily on the route-building and transport aspects without getting too bogged down with shares and complex economics. It is newbie friendly.",
    "timestamp": 1740092400
  },
  {
    "username": "NGDedrick",
    "rating": 8.0,
    "comment": "Great game. Easy but does require you to think",
    "timestamp": 1738537200
  },
  {
    "username": "Cragborn",
    "rating": 9.0,
    "comment": "I have the original Mayfair edition plus metal miniatures",
    "timestamp": 1761007020
  },
  {
    "username": "ShiannLin",
    "rating": 9.0,
    "comment": "1982 Charles S. Roberts Best Pre-Twentieth Century Game Nominee",
    "timestamp": 1735599600
  },
  {
    "username": "megsherman",
    "rating": 9.0,
    "comment": "Art & Components: 1 (it breaks my heart to ding this, but…)\nTheme: 2\nRules & Game Play: 2\nReplayability: 2\nEnjoyability: 2\nTotal: 9",
    "timestamp": 1706396400
  },
  {
    "username": "RootRecruits",
    "rating": 9.0,
    "comment": "A really fun game that is never the same.",
    "timestamp": 1698012000
  },
  {
    "username": "gabdewulf",
    "rating": 9.0,
    "comment": "Out of print and thinking about recreating",
    "timestamp": 1691272800
  },
  {
    "username": "cemullin",
    "rating": 9.0,
    "comment": "I played this in college. It was a lot of fun, and well balance between strategy, luck and complexity.",
    "timestamp": 1681164000
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "It's funny how this is such a solitaire train-game, which nobody talked about online because they're obsessed with other train-games. I kinda like it as a guilty pleasure, the spatial aspect helps a lot, but it lasts way too long. Nippon Rails is a neat solution to make it faster at least. Ticket to Ride or Trans America is better for casual gamers, while hardcore gamers would want literally anything else.\n\nThe remake putting maps on the cards will probably shave off a good 30 minutes, even veterans have to examine where everything is. I'm surprised they never did this before.",
    "timestamp": 1729980000
  },
  {
    "username": "camidon",
    "rating": 10.0,
    "comment": "Pick up and delivery, crayon drawing, route finding game. My wife and I enjoy these games. With a few house rules, you can speed up gameplay. We prefer these with 2, as we can play them faster. Never quite the same game twice with the different resources and routes the change with the dealt cards. Definitely some luck involved, but generally good strategy wins out most of the time.",
    "timestamp": 1694124000
  },
  {
    "username": "Ijinnomigite",
    "rating": 10.0,
    "comment": "Yes...my first game took over 12 hours, as more than 6 players (none having played before) rotated through the wee hours of the night, into the 6 player positions. It's a great game for any age capable of counting to twenty.\nAmongst professional train gamers it is a 90-minute game, with a mix of accounting, intrigue, luck, and comradery.",
    "timestamp": 1684792800
  },
  {
    "username": "Guacacole",
    "rating": 10.0,
    "comment": "This game feels like a race in terms of time and money. I love playing the game with an open market of cards to add to the player interaction. While this game is very long, I have always had memorable experiences from this game even if I cannot play this game very often.",
    "timestamp": 1650578400
  },
  {
    "username": "Uhtred25",
    "rating": 10.0,
    "comment": "Love this series of games. No two games are ever the same. Always fun to come up with a new route.",
    "timestamp": 1605999600
  },
  {
    "username": "SteveAten",
    "rating": 10.0,
    "comment": "One of my favorite games!",
    "timestamp": 1603576800
  }
]