[
  {
    "username": "Grimsalt",
    "rating": 1.0,
    "comment": "Tetris jigsaw puzzle with 2P Twixt rules. Sold in 2022.",
    "timestamp": 1642201200
  },
  {
    "username": "KubaP",
    "rating": 1.0,
    "comment": "Looks beautiful, yet also broken.",
    "timestamp": 1472421600
  },
  {
    "username": "Logosync",
    "rating": 1.0,
    "comment": "This game retails for around $40. I bought it on a clearance rack for $5, and think I got ripped off. It came with pretty wooden pieces though, and made a nice present for my mom. Clearly a game for kids, very simple, and clearly the development cost didn't warrant a $40 price tag.",
    "timestamp": 1120082400
  },
  {
    "username": "Poptech",
    "rating": 2.0,
    "comment": "Too much of a simplified chess-like game that I have no interest in ever playing again. The big attractive city pieces are simply a distraction when you quickly realize you are just playing an abstract area control game with tetris pieces. This originally came out in 1978 at the height of garbage boardgaming and it shows. This was just before Milton Bradley tried to breathe life into the hobby with their Gamemaster Series in 1984.",
    "timestamp": 1647558000
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Maybe couple decades ago",
    "timestamp": 1629064800
  },
  {
    "username": "DSAdixits",
    "rating": 2.0,
    "comment": "It's like Go and Blokus got together and accidentally had a baby they kept, not because they wanted it, but because societal pressure made them feel obligated to raise it.\n\nIt's pretty. So leave it out on your coffee table and hope some poor sap eventually comes to marry it so you can quit wasting your life and resources on it.",
    "timestamp": 1614034800
  },
  {
    "username": "Guudys",
    "rating": 3.0,
    "comment": "Beautiful game with wooden pieces. Not into abstract games much though so that wasn't love at first sight.",
    "timestamp": 1651442400
  },
  {
    "username": "bagio99",
    "rating": 3.0,
    "comment": "We have a polystone version. I dry-brushed with white paint one of the sets of buildings to increase contrast: it now looks and \"plays\" better. I consider this game to be lighter than most abstract games because of the limited buildings' shapes. It's a short and pretty time filler.",
    "timestamp": 1644706800
  },
  {
    "username": "elbrycko",
    "rating": 3.0,
    "comment": "Falls victim to some of my standard dislikes of abstract strategy games, though it sure can look nice. Games are always very close and the imbalance requiring totaling scores after switching sides and playing twice seems less than elegant.",
    "timestamp": 1615330800
  },
  {
    "username": "DetroitExpat",
    "rating": 4.0,
    "comment": "I love it for the fact that my brother bought an awesome looking version for us. Every time I see it or pull it out, I think of him playing at school. He loved it and I like that thought. If I had a different house layout where I had place to keep it out, I would. It was also enjoyed by students in the board game group I ran at our local elementary school.",
    "timestamp": 1736636400
  },
  {
    "username": "BoardCarp",
    "rating": 4.0,
    "comment": "blokus does it better",
    "timestamp": 1706482800
  },
  {
    "username": "millsyboy",
    "rating": 4.0,
    "comment": "I’m not the biggest fan of “pure abstract” games, but this must be one of the most accessible.",
    "timestamp": 1697061600
  },
  {
    "username": "Expfcwintergreen",
    "rating": 5.0,
    "comment": "The game is pretty, but that's about it",
    "timestamp": 1753653600
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A tile placement game where players take turns placing one of their pieces into the board, with at least one side touching something you've already placed. If you enclose an area, the other player can not place into that region anymore. Additionally, if you enclose another players pieces you capture it. The player who plays as many pieces as possible wins. At the end of the game, players scores the number of boxes on the tiles player has left that can not be played. The player with the lost score wins.\nThe game has similar to go.",
    "timestamp": 1739574000
  },
  {
    "username": "jaieless",
    "rating": 5.0,
    "comment": "Used - April 2024",
    "timestamp": 1721340000
  },
  {
    "username": "DrGraph",
    "rating": 5.0,
    "comment": "Looks good, but the strategy is a little too simple.",
    "timestamp": 1716328800
  },
  {
    "username": "JayJayGee",
    "rating": 5.0,
    "comment": "This one is probably more flash than substance. Love the board and wooden elements (probably more than *playing* the game). Makes players feel like Renaissance city planners, which is probably a decent enough role.",
    "timestamp": 1711148400
  },
  {
    "username": "Bromden62",
    "rating": 5.0,
    "comment": "2 players",
    "timestamp": 1707174000
  },
  {
    "username": "weishaupt",
    "rating": 6.0,
    "comment": "Light, fast, nice abstract game.",
    "timestamp": 1757973600
  },
  {
    "username": "winchesterkaveman",
    "rating": 6.0,
    "comment": "I picked up and old, well played copy in a charity shop, and its has lasted well. A fun and simple unpretentious polyomino placement game for 2 that goes perfectly with a cup of tea and a biscuit or two.",
    "timestamp": 1753740000
  },
  {
    "username": "Sak_Yahiko",
    "rating": 6.0,
    "comment": "Adquirido el 18/07/2025\nYOON 600 M/U",
    "timestamp": 1753394400
  },
  {
    "username": "Nadialove",
    "rating": 6.0,
    "comment": "2 p",
    "timestamp": 1752012000
  },
  {
    "username": "guimel",
    "rating": 6.0,
    "comment": "Beatiful wooden version of this strategy game. Was too strategic for M. Sent to Revive All.",
    "timestamp": 1745704800
  },
  {
    "username": "Glic2003",
    "rating": 6.0,
    "comment": "Very nice plastic components in the 1980s Mattel version.\n\nI played this one a lot, and the strategy is a bit too simplistic. Given equal knowledge between players, I believe the player who places the cathedral should always lose (because it's a wasted turn and the first player has an advantage).\n\nIt's also limited to just two players.",
    "timestamp": 1745445600
  },
  {
    "username": "Nigo81",
    "rating": 7.0,
    "comment": "2j",
    "timestamp": 1760652000
  },
  {
    "username": "MythiccRare",
    "rating": 6.8,
    "comment": "Not Bad - Snappy little enclosure and blocking abstract. Gorgeous. Use the Tom Lehmann house rule.",
    "timestamp": 1759874400
  },
  {
    "username": "timeodanaos",
    "rating": 7.0,
    "comment": "Wooden board & pieces.",
    "timestamp": 1756245600
  },
  {
    "username": "pieforteeth",
    "rating": 8.0,
    "comment": "School collection",
    "timestamp": 1760479200
  },
  {
    "username": "zedeemia",
    "rating": 8.0,
    "comment": "A lot of nostalgia and sentiment attached to this quick-playing abstract for me as I played it many times as a child with many fond memories. The wood version I now have is lovely and tactile.",
    "timestamp": 1756072800
  },
  {
    "username": "VardaofStars",
    "rating": 8.0,
    "comment": "I have a wooden version of this same game. Really love playing it, nice, simple rules, but plenty to think about. Almost reminds me of chess.",
    "timestamp": 1754431200
  },
  {
    "username": "Snoopyloopy24",
    "rating": 9.0,
    "comment": "very fun",
    "timestamp": 1755727200
  },
  {
    "username": "NicoleClark",
    "rating": 9.0,
    "comment": "Elegant, simple strategy placement game. Our daughter loved playing this when she was 8 and gives us a run for our money now at 10! Just wish it was more transportable. But excellent game.",
    "timestamp": 1722722400
  },
  {
    "username": "Jaradakar",
    "rating": 9.0,
    "comment": "I love the physicality of this game. Excellent two player capture territory and/or try to fit all your pieces on the board. Simple enough to teach kids at a young age, too.",
    "timestamp": 1701644400
  },
  {
    "username": "DaveLeLacheur",
    "rating": 10.0,
    "comment": "Timeless game. Great strategic planning. Cathedral-placer has a big disadvantage, but if you alway splay games in pairs that evens out.",
    "timestamp": 1754344800
  },
  {
    "username": "pastoralicegames",
    "rating": 10.0,
    "comment": "Alice’s copy",
    "timestamp": 1741215600
  },
  {
    "username": "Cyranodejavier",
    "rating": 10.0,
    "comment": "Fantástico!! Le teníamos muchas ganas a este viejuno y en esta versión de Mattel que no nos ha defraudado en absoluto. Me ha encantado y a mis hijos también!!",
    "timestamp": 1711580400
  }
]