[
  {
    "username": "Arontje",
    "rating": 1.0,
    "comment": "Cant really tell why, just dont like this game.",
    "timestamp": 1641855600
  },
  {
    "username": "Pandorzecza",
    "rating": 1.0,
    "comment": "The plot here is so stupid",
    "timestamp": 1630015200
  },
  {
    "username": "joebelanger",
    "rating": 1.0,
    "comment": "Forgettable.",
    "timestamp": 1475445600
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "-WEG\n? 60 Min 2–4 Players p2 p3 p4 Weight: 3.06 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "DaniDCR",
    "rating": 2.0,
    "comment": "Otro más estilo Steam... pero cuántos de trenes hay que sean de este estilo?? qué poca imaginación! Al Carlos le apasiona, pero yo no le ví ninguna diversión.",
    "timestamp": 1439157600
  },
  {
    "username": "VoodooXT",
    "rating": 2.0,
    "comment": "Alright train game. First time playing and didn't get a lot of what was going on. I'm sure it's a good game, but not for me. Would not play again.",
    "timestamp": 1371247200
  },
  {
    "username": "Indy500sr",
    "rating": 3.0,
    "comment": ".compleet\nEAN 9783930635269\nL1",
    "timestamp": 1757109600
  },
  {
    "username": "Bertuccia",
    "rating": 3.0,
    "comment": "Rules unnecessarily complex, scoring seems unbalanced, vetoing gets abused. Never again.",
    "timestamp": 1712872800
  },
  {
    "username": "SpoolerMonkey",
    "rating": 3.0,
    "comment": "Played once and it just didn't click for me. Having peviously played many of the cube rails games I was expecting something similar. However this feels way to abstracted and a much more mathsy game.",
    "timestamp": 1679007600
  },
  {
    "username": "kniziagamer",
    "rating": 4.0,
    "comment": "Interesting principle but very dry and unintuitive.\n\nThere’s also no ideal edition. The original looks ugly and the new edition has the disadvantage that you don’t see directly on the map where you get which good.",
    "timestamp": 1725314400
  },
  {
    "username": "quietcorn",
    "rating": 4.0,
    "comment": "This game is similar to Chicago Express or American Rails, or any of those games where players are laying track, buying stocks in companies and trying to connect those companies to cities to improve their value for endgame scoring. The things that make this game stand out are the way if one rail line runs into another it scores one last time for the player with the most shares, then it dissolves and becomes a part of the company it ran into, with players trading 2 shares in the dissolving company for 1 in the new one. This creates some odd opportunities as players get large point rewards for having the most of their station markers on a line when the line connects to something new, so expanding a smaller line with lots of your markers, might eventually connect to and cause you to be in the lead for a longer line.\n\nGeneral gameplay is a hassle however, as anyone's action to add a rail to a line can be contested by any player who holds shares in that line. They can bid shares to basically take your turn for you. It's interesting in theory, that the player with the most control might give up some of their lead to keep opponents from linking things in bad ways for their position, but I found this to really drag down the flow and fun of the game, at least as compared to this game's cousins.\n\nScoring is also a hassle, as eventually everything connects to nearly everything else, so there's a lot of counting each time something touches something new, as you get credit for each location the line touches. As the train lines blob into each other, the downtime of counting this out grows more and more.\n\nNot unplayably bad, but I don't see ever wanting to play this over the other stocks and rails games.",
    "timestamp": 1721685600
  },
  {
    "username": "asfhgwt",
    "rating": 4.0,
    "comment": "No luck element equals chess-like play. Complex scoring system.",
    "timestamp": 1715032800
  },
  {
    "username": "Forgeforgeforge",
    "rating": 4.8,
    "comment": "Smart but fucking miserable. I keep trying it because I know it's smart but every time my experience sucks.\n\nfeels like trying to throw a punch in dreams.",
    "timestamp": 1742770800
  },
  {
    "username": "Marlydru",
    "rating": 5.0,
    "comment": "A",
    "timestamp": 1736550000
  },
  {
    "username": "edosan",
    "rating": 5.0,
    "comment": "UPDATE: While I appreciate the game, I think just having Acquire is just fine. Traded.\n\nKnizia's take on Acquire. With that in mind, I think I need a couple more plays to decide if it's worth having both.",
    "timestamp": 1721599200
  },
  {
    "username": "DarkJjay",
    "rating": 5.0,
    "comment": "I had it on my shelf for a long time, and every other time I looked at it I had to come to terms with the fact that I didn't really want to play it. It's a new thing though, I'm not into train/stock games. This is a highly accessible one and I still wasn't feeling it",
    "timestamp": 1716328800
  },
  {
    "username": "ryansdavis",
    "rating": 5.0,
    "comment": "I recognize that this game is \"good.\" But the strategies seem so hard for me to understand, and I play this so rarely, that I cannot seem to get into the groove of this one, ever.",
    "timestamp": 1707865200
  },
  {
    "username": "Galatolol",
    "rating": 5.0,
    "comment": "Hard for me to rate. The game is fine, I enjoyed my two plays. I find it more opaque than most cube rails which is an advantage as it doesn't feel so much like logic puzzle. The veto system and company merging are clever. Stations seem to be the key whereas industry markers aren't very important.\n\nI have to play it one more time before I decide if I want to keep this.\n\nEDIT: I don't really feel like revisiting this.",
    "timestamp": 1707260400
  },
  {
    "username": "Ddyraw",
    "rating": 6.0,
    "comment": "My first play was not as fun as I thought, but totally willing to try some more and see if it is better than I think",
    "timestamp": 1759615200
  },
  {
    "username": "TrevorJr26",
    "rating": 6.0,
    "comment": "Hmm not sure about this one yet. It's very much Acquire meets Through the Desert but seems more complex than both due to more areas of scoring. Had two players who didn't really get on with it. Not Knizia's best but it merits further investigation.",
    "timestamp": 1756072800
  },
  {
    "username": "mribnik",
    "rating": 6.0,
    "comment": "[X]",
    "timestamp": 1754863200
  },
  {
    "username": "danielmleitao",
    "rating": 6.0,
    "comment": "Rated: 06/2025\nEdited: -",
    "timestamp": 1748815200
  },
  {
    "username": "GTAcademy",
    "rating": 5.5,
    "comment": "networking building+ route majority+ 加少少stock\n\n+互動性好高，可以互搞\n\n--非常abstract, 唔直觀到難理解，唔知點入手\n--隻game推進好慢，感覺好拖沓，個人好唔鐘意\n-play time 以呢個重度同體驗黎講亦太長，中段有捱到完既感覺。\n\n總：體驗一般，唔好玩",
    "timestamp": 1747432800
  },
  {
    "username": "NormandyWept",
    "rating": 6.0,
    "comment": "An interesting train game with all the usual shared incentive play that entails: the two-tier contest for company ownership, with players able to score points by having the most stations on the line or the most shares, is definitely interesting.\n\nIt's a shame that game is this opaque: it's difficult to imagine teaching this to anyone I know in real life. In many ways I find it quite surprising it's designed by Knizia as it differs a lot from his other games. Whilst certainly not the heaviest game in its genre given it's a train game, it's hard to imagine getting this played regularly enough to allow it to hit the heights of his other games for me personally.",
    "timestamp": 1747000800
  },
  {
    "username": "Technarius",
    "rating": 7.0,
    "comment": "Initial Review after one Game:\n\nPros:\n+ Solid Knizia's typical tile laying game. In my opinion this one ist better than Babylonia because in Stephensons Rocket is no luck involved.\n+ The new edition is really beautiful\n+ Interesting shared board where everyone can influence everything\n+ Unique Merging and Veto mechanisms for a Knizia tile layer. Veto mechanism makes more sense than i thought before erhe game, as you have to calculate if you want to loose your shares before you Veto any decisions...\n+ No randomness at all\n+ Very interactive\n\nCons:\n- Difficult to plan ahead, as the other players have so much agency on the board state\n- Not very scalable in tems of the player count. 5 Players is impossible, 2 players makes no sense. 4 Players is the only sweet spot.\n- Low Replayability as there is only one map available in the old Version\n\nVerdict: It's not the best R. Knizia tile laying game. I find Samurai and Y&Y/Huang better. But it is also not the worst one, as it is IMHO better than Babylonia, Through the Desert, Blue Lagoon, Rebirth, Orongo and Cascadero. So it's in top 3 of Knizias Tile Layers for me.\nIMHO it's also better than other Stock Holding Games Like Acquire, Spectaculum.\nStays in my collection.",
    "timestamp": 1760565600
  },
  {
    "username": "smurfodeth",
    "rating": 6.5,
    "comment": "Feels like the bastard child of Acquire and Wabash Cannonball that has been raised on Knizian tile layers. The veto mechanism is particularly brilliant here, with all the structured bullying of an auction but with a different scope of considerations beyond the usual financial ones. Opaque and mean, and very good, it strays from his other, more popular tile layers, but I think I like it better for it. My two main gripes are it takes longer than I would prefer (I can play Bus or Hansa Teutonica in the same timeframe, and I'd probably prefer to play Bus or Hansa Teutonica), and I favor games in this design space that use money as both a tool and as your score.",
    "timestamp": 1759442400
  },
  {
    "username": "jaceycole",
    "rating": 7.0,
    "comment": "8.0 - 1 play, 4 players - Very neat cube-rails style game by the good Dr.! I'd like if you like cube rails, you'll like this. I'd say it's actually a little less opaque, but a bit heavier. In playing it in many ways felt like Hansa Teutonica. The VETO system is brilliant and makes for very interesting decisions and interaction. This is a very interactive game. All scoring is for majorities, so every aspect is competitive. The merge mechanic is also neat. It's fun gobbling up other trains. My main criticism would be that it played too long (a bit over 2 hours) and the build up felt a little sloggy and laborious and then the end game ramped up unexpectedly quickly. Very much a ramp game. Also, it feels like a 1 share difference can make a massive impact for end game scoring and can kinda make the whole build up feel unimportant. Although I really enjoyed my play, and the production is beautiful, I could see myself more often pulling our Hansa Teutonica or one of the Iron Rails games over this.\n\n7.0 - 2nd play, 3 players. This game plays better at 3 I think, the board is just as full, you simply get more turns. I think I determined it's not a game for me. Perfect information and a little hard to stop a player with the lead. Feels like it builds up a little too slowly and ends a little too quickly. I really want to like it, cuz I think the veto mechanism is super great and many of the scoring dynamics are very interesting and entangled. But I just don't find myself feeling the 'fun' in it. I think I really do need a dose of luck in longer, heavier games.\n\nP.S. I don't know what I was thinking in the past when I said it felt similar to Hansa Teutonica, that's ignorant new-gamer speak, lol.\n\nCulled: Not a game I'd find myself excited to play again.",
    "timestamp": 1757887200
  },
  {
    "username": "theblobb",
    "rating": 8.0,
    "comment": "w/ Eastern USA & China boards",
    "timestamp": 1759615200
  },
  {
    "username": "cannoneer",
    "rating": 8.0,
    "comment": "Since then I've played a few more times, and each time I do learn a bit more, but I still feel like it's very hard to know what's a good play throughout much of the game - the board state is so open, it feels like you can basically do anything, and the game does not give you any clues or hints as to what you might want to be doing! - I could see this being a very big selling point & feature if I played this game many times - finding out for myself what works and what doesn't, but for just a few plays so far, it feels a bit frustrating. But I know there's a good game there, and I do enjoy it while playing, even if I feel a bit befuddled and lost through much of it!\n\nI want to like this, but I feel very lost during the majority of the game - it’s really tough to know what I should be doing, or how small actions early in the game may affect the final scoring which is a very large part of final scores. For example, in the final scoring for stations and shares in my most recent game, I scored 21 total out of my 74 points, and my wife scored 31 total out of her 77 points. That’s a LARGE proportion of points that are VERY hard to predict until quite late in the game, and almost impossible to INFLUENCE at that point. At least, that’s what I’ve observed so far.",
    "timestamp": 1756418400
  },
  {
    "username": "superspacedinvader",
    "rating": 8.0,
    "comment": "Yeah, this ia excellent & not imitated by other games..",
    "timestamp": 1754085600
  },
  {
    "username": "sorcretic",
    "rating": 9.0,
    "comment": "Feb. 2025 #30: Stephenson's Rocket is my favorite version of Acquire and my favorite cube rail to boot. (And the fifth Knizia on the list.) Agonizingly opaque, I typically can't tell how well the game is going until halfway through, and by then it's usually too late. Maneuvering yourself to get those whopping majorities at the end of the game seems like the key to everything, but it's also maddeningly hard to do. (It almost feels like The King is Dead in this way.) That's the kind of thing that drives me to play a game again and again.\n\nJul. 2024 #27\n\nJan. 2024 #25: What a weird, interesting game! Half cube rail, half Acquire, with rather opaque strategy. Not knowing how to play well makes me want to play a lot more. My #6 Knizia game.",
    "timestamp": 1756504800
  },
  {
    "username": "barnyams36",
    "rating": 9.0,
    "comment": "Just one play, and I admit it was difficult to get the whole concept. But the game left me thinking, and the more I think, the more I see. Really different game among Knizia's, it is actually a kind of hidden majority game, very well disguised. Quite unique, certainly a game to be discovered much more deeply. I was quite impressed with my first game.",
    "timestamp": 1750111200
  },
  {
    "username": "Samuel Vriezen",
    "rating": 9.0,
    "comment": "Yeah, good game. Lots of twists making strategy very non-obvious. Fascinating shares game (and the weirdest shares system I've seen). How do you build your majorities and how do you use them?",
    "timestamp": 1749420000
  },
  {
    "username": "chaoticgood4life",
    "rating": 10.0,
    "comment": "The three simple actions give rise to an incredible tangle of competing priorities, incentives, and repercussions.\nWhile this is the heaviest Knizia game I have played, both in terms of rule set and brain usage required, Stephenson’s Rocket is far from a kitchen sink Euro design with complexity for complexity’s sake. Everything here is tightly interconnected and the game flows beautifully once you’re a few rounds in.",
    "timestamp": 1760220000
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "Train Game\n\nReiner Knizia is one of my favorite designers, and I've been getting into trains more recently, so this is an obvious fit for me. There was little bookkeeping or supply to track, and the auction options and results were always transparent. Very good stuff. Peak zero-luck gaming.",
    "timestamp": 1759356000
  },
  {
    "username": "hcmacro",
    "rating": 10.0,
    "comment": "Love this game. Flubbed some rules early (like not extending same railway twice on a turn).\n\nSecond Play: Love, love, this game. Maybe Knizia's best. Just ride the choo-choo train and embrace the chaos.",
    "timestamp": 1757368800
  }
]