[
  {
    "username": "smntt",
    "rating": 1.0,
    "comment": "no idea",
    "timestamp": 1748728800
  },
  {
    "username": "Esyhpe",
    "rating": 1.0,
    "comment": "AI",
    "timestamp": 1748210400
  },
  {
    "username": "Yonger",
    "rating": 1.0,
    "comment": "This is just a place holder for all the games played. Does not make sense to rate the individual cool unpublished game here.",
    "timestamp": 1745877600
  },
  {
    "username": "mgoddard",
    "rating": 1.0,
    "comment": "Rating a 1 to get this off my lists that call out \"unrated games\". This si obviously the catch-all for unpublished or removed games from BGG.",
    "timestamp": 1725832800
  },
  {
    "username": "InamotoWMB",
    "rating": 1.0,
    "comment": "What's Your Game? are scammers, don't buy anything from them! (look up Madeira Kickstarter for evidence)",
    "timestamp": 1718143200
  },
  {
    "username": "barnyams36",
    "rating": 1.0,
    "comment": "13/10/2012 Gluck Auf, from Kramer&Kiesling. Absolutely delicious mining game. Worker placement to take actions, scoring by majorities on the delivered materials. A bit more than one hour, it goes to the level of Tinners' Trail, for example. I hope they can finally release it.\n\n6/7/2013 Patios de Córdoba. By Jesús Torres. Nice game with character selection to get nice flowers for your patio. It has a bit of memory which is not my favourite.\n\n23/8/2013 Body Party. Crazy game about trapping cards with your body... and your partner's.\n\n24/8/2013 Patios de Córdoba\n\n5/4/2014 Ambientado en casos de Sherlock Holmes, visita a localizaciones con puja. Simpático.\n\n18/8/2014 Fakes, de Allué. Sí está publicado. Juego de contar verdades y mentiras, y que el resto adivine al mentiroso. Puntuación a lo Dixit.\n\n20/8/2014 Sticky Words. Juego de relacionar símbolos conceptuales para formar frases populares, canciones...\n\n18/8/2015 Vaqueros: Duelos de velocidad colocando cartas. A mi me pone de los nervios, pero como todos los de velocidad.\n\n20/8/2015 Polaris: Una persecución entre dos submarinos manejados por dos grupos de cuatro personas, cada uno dedicado a una tarea. Se juega en tiempo real, tiene mucha comunicación y unas dosis de estrés de narices. Muy original.\n\n20/8/2015 Pandemia España: versión de Pandemia con ciertos cambios. No puedo con el sueño que tengo y lo dejo, pero parece interesante si te gusta Pandemia.\n\n28/12/2018 1066 Colección de sets de Knizia con toques de lo más interesante en lo que respecta a las losetas que van apareciendo y orden de turno. Por supuesto, con mucho, mucho balance. Lo traerá seguramente Ludonova.\n\n28/12/2018 The Last Emperor. Otro Knizia, este es Samurai 2.0, pero con un cambio claro de concepto. En lugar de tres puntos en juego, este es un juego de puntuación constante, donde las conexiones entre tus losetas juegan un papel fundamental. Ludonova.\n\n16/10/2022 Pirratas, de Óscar Romero, Falomir. Infantil, flicking y cartas con efectos. Jugado con mitad de reglas. Festival 2022.",
    "timestamp": 1666044000
  },
  {
    "username": "Merlin8888",
    "rating": 1.0,
    "comment": "Boring",
    "timestamp": 1634594400
  },
  {
    "username": "alternativemeeples",
    "rating": 1.0,
    "comment": "This is stupid and should not exist",
    "timestamp": 1621288800
  },
  {
    "username": "GamingEconomist",
    "rating": 1.0,
    "comment": "Its another leftie low hangig fruits Board Game against Trump. Yawwwnnnn. The people who come up with such \"Games\" are blind when they have to take a look at the problems created by their beloved group.\n\nI wonder if there will be a Biden Board Game. Of course not",
    "timestamp": 1615849200
  },
  {
    "username": "Keatus",
    "rating": 1.0,
    "comment": "I am over playing prototypes, I value my time to much.",
    "timestamp": 1606345200
  },
  {
    "username": "Piru",
    "rating": 1.0,
    "comment": "An unreliable company, which swindles people",
    "timestamp": 1599256800
  },
  {
    "username": "darkfinale",
    "rating": 2.0,
    "comment": "Game where you are passing boards and trying to maximize your score. Uninteresting theme, artwork, idea.",
    "timestamp": 1744495200
  },
  {
    "username": "JohnWaffles",
    "rating": 2.0,
    "comment": "Incredibly light... game? I'm not sure what the main mechanic of this game is supposed to be. There are hidden roles, but they don't really matter, as it is difficult to actually do anything about opposing roles. Similarly, some turns you aren't able to actually play any cards that affect the board in a meaningful way. Not sure if this deck is specific for this game or is from something else, but the art doesn't do anything for me either.",
    "timestamp": 1696197600
  },
  {
    "username": "HiveGod",
    "rating": 2.3,
    "comment": "Real playtesting is real work—and I'm here to do the exact opposite of that.",
    "timestamp": 1688335200
  },
  {
    "username": "Mint eh",
    "rating": 2.0,
    "comment": "Waste of brand, terrible interface both online and in physical components, weak and straight up boring puzzles, shamefully light on story and atmosphere, sounds are gratingly annoying. 2 stars not 1 because of included cthullu butt plug.",
    "timestamp": 1680904800
  },
  {
    "username": "Ades",
    "rating": 2.0,
    "comment": "This is a pure and simple computer puzzle game with graphics from the 90-ties. More could be expected today. There are many better puzzle computer games for that money. I wrongly thought the game would be like an escape room game in the style of Exit or Unlocked with computer assistance and narration. My invited boardgame friends bailed out after a couple of minutes. I had to play it alone.",
    "timestamp": 1678489200
  },
  {
    "username": "drlizb",
    "rating": 2.0,
    "comment": "Great theme, but poor App integration: crashes constantly and interactive elements not aligned with graphics.",
    "timestamp": 1678230000
  },
  {
    "username": "emike",
    "rating": 2.0,
    "comment": "Kokomo\n- Midwest train board game\n- terrible game on the first (and only) play\n- may never look at this again",
    "timestamp": 1643065200
  },
  {
    "username": "DeviantMagick",
    "rating": 2.0,
    "comment": "Rbow by Charley Cross, self published as Arbo Arts LLC",
    "timestamp": 1597096800
  },
  {
    "username": "kaepone",
    "rating": 2.0,
    "comment": "Played once. Went all in on chocolate and scored 40 points. Lost to another player who scored over 50 using the same strategy who rushed chocolate triggering end game. Pretty much the only difference is he didn't roll triples to get a Spooky Die Toothbrush.",
    "timestamp": 1581980400
  },
  {
    "username": "DarwinsRib",
    "rating": 2.0,
    "comment": "Boring and broken card game.",
    "timestamp": 1278108000
  },
  {
    "username": "dr glaze et al",
    "rating": 2.0,
    "comment": "Overrated, IMHO, and not nearly as good as the classic \"Das Vinderschwinden\". YMMV.",
    "timestamp": 1117749600
  },
  {
    "username": "Shababalabada",
    "rating": 3.0,
    "comment": "$29.99 (purchased 2023)\n\nI rarely review games on BGG, but I feel compelled to review this. I love Arkham Horror Files games. Arkham Horror the Card Game is my all time favorite game, I own everything for Mansions of Madness and play it regularly, and I enjoy playing both Eldritch Horror and Arkham Horror board games. I also enjoy escape-room-type experiences. So needless to say, I was very excited to see this product launch. I don't think I have ever been so disappointment with a game purchase. There is nothing redeeming about this game. The story is terrible. The voice acting is mediocre. The interface is unintuitive at best (I found myself forced to use hints only to discover there was an object I could interact with that I had no idea I was allowed to interact with). Moreover, the Deluxe edition is completely pointless. I was excited to at least use these chunky pieces that were in the box. Nope - they are useless, since all of the pieces you need to interact with need to be manipulated on the screen in some what. So ultimately I paid $29.99 for a keychain and a couple other little trinkets. In my opinion, this is neither worth your time or money. The most I could justify spending on this knowing what I know now is about $5. I hope I've saved at least one other person from making the same mistake I did.\n\nGifted away (2025)",
    "timestamp": 1750543200
  },
  {
    "username": "amurderdoll",
    "rating": 3.0,
    "comment": "This is \"Escape from Innsmouth\", ergo the escape room style game in the world of Arkham Horror",
    "timestamp": 1722981600
  },
  {
    "username": "Rajja29",
    "rating": 3.0,
    "comment": "Its a one time play through game. You don't even need any of the physical materials in the box other that the sheet that has the code to play. Kind of disappointing",
    "timestamp": 1709074800
  },
  {
    "username": "dragonster",
    "rating": 3.0,
    "comment": "This is a board game called \"Guns and Butter\" which seems to be a combination of Monopoly and Risk, where each country has an economic and military value which it needs to achieve before it attacks. Keeps getting new rules each time we play (or certainly seems that way).",
    "timestamp": 1700089200
  },
  {
    "username": "Nerdvik",
    "rating": 3.0,
    "comment": "Not for me.",
    "timestamp": 1696370400
  },
  {
    "username": "holf",
    "rating": 3.0,
    "comment": "排數字遊戲，玩家會分成兩種，獲勝方式不同，基本上就是抽卡將卡片打出依序排列，五張牌即完成一列，好人要在兩列完成的排中有個三張正面卡，壞人則是在一完成的列中有三張負面卡。應該歸類於兒童遊戲。",
    "timestamp": 1693692000
  },
  {
    "username": "StalkerB",
    "rating": 3.0,
    "comment": "A browser based escape room that should absolutely not be sold as a board game.\n\nAs a browser based escape game, it's okay. As a £35 board game, not so much.\n\nDespite playing the 'deluxe' version, it was never once **required** that we use the tat that comes in the box and nine out of ten times was easier to use their digital counterparts.\n\nThis is a bargain-basement point'n'click on Steam that is masquerading as a board game.\n\nAnd bear in mind I've played a ton of Exits, every Unlock, every Decktective, every Deckscape, own all the Chronicles of Crime, played Sherlock/Mythos Tales, Detective Season One and Batman, all the Micro-Macros, several app driven games - including Mansions... I'm not against things that are not 'traditional' board games. But I did not expect to spend the evening in front of my browser clicking on things with nothing to make us look up from the screen to work with one another on what was provided in the box.\n\nI would rate it a 1, but for what the game is, it would be about a 6 or 7 (rating it as an escape game). It has a number of fiddly, slow parts, but that is because it's limited by being a browser game, so will split the difference.\n\nAgain, as a warning, this is not a baord game or a game you will sit around a kitchen table playing. It is 100% browser based, there is nothing to do outside the browser, with some physical items that are reproduced in game.",
    "timestamp": 1678230000
  },
  {
    "username": "CHRISDH",
    "rating": 3.0,
    "comment": "Super basic roll and write without the roll. There's not much to it. The gameplay feels bland without room for clever play.",
    "timestamp": 1673132400
  },
  {
    "username": "larryjrice",
    "rating": 3.0,
    "comment": "FIRST IMPRESSION:\n\nDidn't do much for me. It has the interesting concept of playing on everyone's board with you having the freedom to travel through a canyon on your own board that no one else can. It is pretty much about trying to cut off your opponents from scoring points through tracks and perhaps seeing how much you can mess with them while maximizing your points. So if that's up your alley, perhaps this is the game for you! :-)",
    "timestamp": 1670713200
  },
  {
    "username": "FranklinTV",
    "rating": 3.2,
    "comment": "UPDATE: Pub Meeple Ranking Engine Dec 2020 (Rating: 3.151). - historical score, given tops my Geeklist!",
    "timestamp": 1615676400
  },
  {
    "username": "seppo21",
    "rating": 3.0,
    "comment": "[The following comment was for Formula 1: Officially Licensed Board Game. It was converted to Unpublished Prototype on 2020.11.10. The copy that I played in the BGG.con library seemed fully completed when we played years ago. Not sure why it's status was changed.]\n\nI really like racing games, possibly second to only train games. I'm always interested in trying new games to see what new take they have on the genre. This was a great disappointment. The movement by the rules is fairly uninteresting. The variable card hands could give someone a slight advantage. However, the boost roll is the game breaker. There really is no reason no to try the boost essentially every turn of the game. Our experience is that the person with the most successful boost rolls will win, no matter how well the other players play. That just doesn't make for a good game. The sad thing is that Ghenos can do better. [01/08/2011]",
    "timestamp": 1605826800
  },
  {
    "username": "EllenCaroline",
    "rating": 4.0,
    "comment": "Heist Duel - Jacob Masana - Wolf Crest Game Con - August 2025\nVery confusing trick-taker.",
    "timestamp": 1755381600
  },
  {
    "username": "lee elektrik",
    "rating": 4.0,
    "comment": "CANDY CRAZE - Average Roll and Write, somewhat confusing rule book. Not sure what the main map adds (except rules questions), and if chocolate bars can be beaten.",
    "timestamp": 1750456800
  },
  {
    "username": "Olafslomp",
    "rating": 4.0,
    "comment": "Played on BGA",
    "timestamp": 1724018400
  },
  {
    "username": "refecs",
    "rating": 4.0,
    "comment": "играл на BGA филлер, игра не понравилась",
    "timestamp": 1715464800
  },
  {
    "username": "Necroblaster3000",
    "rating": 4.0,
    "comment": "Feels like this could have used a bit more playtesting.",
    "timestamp": 1710111600
  },
  {
    "username": "visard",
    "rating": 4.0,
    "comment": "Placeholder for games before they are added to BGG. In general I am not interested in playtesting prototypes.",
    "timestamp": 1702422000
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "Sturgeon's Law applies. I need to be convinced to play your newest dumpster fire.",
    "timestamp": 1698966000
  },
  {
    "username": "tiagoVIP",
    "rating": 4.0,
    "comment": "Designer: Benjamin Roucayrol\nPlaying time: 5-10 Min\nWeight: 1.25 / 5\nPublisher: (Self-Published)\nPlayer count: 1-5 (best with: 2)\n\nCOMPLEXITY: Very low\nCOMPONENTS: N/A\nDOWNTIME: Low\nFUN: Low\nINTERACTION: Medium\nPLAYING TIME: Low\nLUCK: Medium\nREPLAY VALUE: Medium\nSOLITAIRE: Medium\nTHEMATIC: Low\n\nComments: Unpublished Prototype is a family card game about hidden roles, hand management and set collection. The ideia is that players will draw cards and use them to either make 2 rows of positive feelings or one with negative, depending on the side the players are. Cards must be placed in ascending order, and one stack can be moved to be place on another, still respecting the number order and the limit of 5 cards. Whatever side first meet their condition will be the winner!\n\nUnpublished Prototype is very simplistic and I think will only work for the light gamer, as there isn't much options with just draw, play, move. The hidden roles doesn't stay hidden for much, and it doesn't even matter, as knowing what one is trying to do won't stop someone from doing - and is always clear if one condition or other is near to be done and one side needs to prevent it.\n\nWas so short I have no real issue with it, just doesn't have the want to try much more times. Can't really recomnend, but wouldn't mind playing on occasion.",
    "timestamp": 1691618400
  },
  {
    "username": "rexchow2015",
    "rating": 4.3,
    "comment": "line and write, network building game\nsimple game and nothing stands out from other similar games",
    "timestamp": 1674601200
  },
  {
    "username": "tiagoVIP",
    "rating": 3.5,
    "comment": "Designer: Chris Backe\nPlaying time: 20-30 Min\nWeight: 1.50 / 5\nPublisher: Board Game Hub\nPlayer count: 2-5 (best with: 5)\n\nCOMPLEXITY: Low\nCOMPONENTS: N/A\nDOWNTIME: Very low\nFUN: Low\nINTERACTION: Medium\nPLAYING TIME: Low\nLUCK: Very low\nREPLAY VALUE: Medium\nSOLITAIRE: Very low\nTHEMATIC: Low\n\nComments: Unpublished Prototype is a family game about line drawing, simultaneous action and route building. The ideia is that players will draw at the same time on a board, then passing it, with everyone trying to make the best routes to see the animals and place their camping lodges. Once a number of boards are filled with lodges, the game will end, and the person with the most points will be the winner!\n\nWhile Unpublished Prototype has way more interaction than most roll and write (which this one feels similar to), and also have zero luck, as there are no roll of dice or reveal of cards, the gameplay quickly became samey, as without the random elements, there is truly little to work around/ Everyone will try to block the others, and some will be able to avoid this better, and will likely win, and that is it. The interaction, while meaningful, can't really be felt: I was just placing my circles and triangules and making routes, with little thought about who I was messing with, or who blocked me. There was a big disconnection between players, and having more people while it makes scoring harder, doesn't really add to actually properly playing with them.\n\nOverall, due to its dry nature and detached players, Unpublished Prototype simply failed to hit the mark with me. Was alright to get to know it, as a play doesn't take long, still it will likely be a one and done type of deal (though I did played more than once), as I have little desire to play more than I already did.",
    "timestamp": 1673132400
  },
  {
    "username": "garry_rice",
    "rating": 4.0,
    "comment": "This is more about what appeals (or doesn't) to me than the game perhaps. This can be a nasty game with players blocking each other (and yes, you probably should be doing so) and it just isn't fun for me.",
    "timestamp": 1670799600
  },
  {
    "username": "jatang",
    "rating": 5.0,
    "comment": "Different games",
    "timestamp": 1750284000
  },
  {
    "username": "bggmatje",
    "rating": 5.0,
    "comment": "[October 2020]\nA PNP roll and write game where you collectively walk through the neighborhood and try to fill your personal basket with candy.\n\nFun to play once on Halloween, but that's about it.\n\nRequirements:\n- PNP\n- 5 dice in five colors",
    "timestamp": 1749679200
  },
  {
    "username": "Zalasta",
    "rating": 5.0,
    "comment": "It’s an odd pass and write game that is perhaps a tad too cutthroat for me. Since you are passing the map around, what you planned to draw next might not be possible by the time it gets back to you again, as this is all about blocking others while accomplishing your own goals. The theme is all right, and while there is nothing too terrible about Rift Valley Reserve, it’s honestly just not the type of game style that I prefer, and the ironic thing is by the last few moves you might be drawing extra stop that will give you negative points because there is nothing else you can put down.",
    "timestamp": 1733007600
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "Wreck - A Riever game similar to Slide 5.\n\n\nMorgan game of machine building\n\nBraggart - A Riever game of making up stories. Very funny.\n\n\nMorgan game Fate",
    "timestamp": 1731625200
  },
  {
    "username": "moonfrog",
    "rating": 5.0,
    "comment": "Descent Of The Dwarf (0), Hero's Greed (0), Minotaur Madness (1), Planet Seekers (3), Quest for the Crown (1), Valkenburg Castle II (0)\n.....(x) = number of plays.",
    "timestamp": 1725055200
  },
  {
    "username": "Sedd",
    "rating": 5.0,
    "comment": "Es ist interessant, durch einen Ort (Spielekneipe, Spieleverein, Biblothek/Ludothek, usw.) auf Leute zu treffen, die das selbe Hobby teilen. Und manchmal bekommt man auch unveröffentlichte Dinge vorgestellt.",
    "timestamp": 1723327200
  },
  {
    "username": "emike",
    "rating": 5.0,
    "comment": "Warthog\n\nAfrican animal and habitat card game. Some playtesters like it better than I do. The game needs work.",
    "timestamp": 1722290400
  },
  {
    "username": "alzsara",
    "rating": 5.0,
    "comment": "The aim is to draw lines (hiking trails) on scenic maps that are as long as possible and pass by scenic spots (lions et al drawn on the map) for max pts. The feature (?) of the game is you draw one thing (either a stop or a line or a tent) and then pass the board on to the next player, so it takes 3 times around the table to build a trail (made of 2 stops and a line connecting them). When playing with gamers you’ll find that by the time it gets to you the third time, that line you wanted to draw between your stops is now blocked by someone else’s stop, which makes for a game of finding routes that are not in other people’s interest to block (hmm) or go the blocking route yourself. Which makes for ongoing bouts of hope and denial which mostly ends in frustration.",
    "timestamp": 1720648800
  },
  {
    "username": "schnaeuf",
    "rating": 5.0,
    "comment": "funny for me, but not for all",
    "timestamp": 1695852000
  },
  {
    "username": "Nerdvik",
    "rating": 5.0,
    "comment": "A sufficient \"roll and write\" game (minus the rolling), but doesn't have anything that stands out.",
    "timestamp": 1695852000
  },
  {
    "username": "tankbard",
    "rating": 5.1,
    "comment": "Nexus Robot Arena: 3.8\nDogfight: 5.8\nUnnamed Auction Deckbuilder: 7.3\nUnnamed Polyomino Game: 6.0\nLoam: 6.8",
    "timestamp": 1687989600
  },
  {
    "username": "iadena",
    "rating": 5.0,
    "comment": "Not a board game. It is components to a online puzzle game. It is a one time experience. You don't need the physical components to play. They are cool to have.",
    "timestamp": 1683842400
  },
  {
    "username": "jukejudlow",
    "rating": 5.0,
    "comment": "I suppose if you like solving a series of puzzles in an adventure style video game, you might like it. It wasn't a terrible experience--but the \"deluxe\" pieces aren't really worth it. Still, it is kind of neat. Kind of. Definitely not a boardgame.",
    "timestamp": 1680991200
  },
  {
    "username": "sirale",
    "rating": 5.0,
    "comment": "The dice-bag push your luck element would be somewhat interesting and does have some simulation value, though without a mechanism to put time-pressure on the ghostbusters during Phase 1 never re-rolling is always optimal. This is easily fixed, for instance, by letting Gozer advance every 4 turns, which works well.",
    "timestamp": 1680213600
  },
  {
    "username": "eliaskos",
    "rating": 5.0,
    "comment": "Very atmospheric, o.k puzzles but...its a pc game. No board game here",
    "timestamp": 1676329200
  },
  {
    "username": "JohnWaffles",
    "rating": 5.0,
    "comment": "I want to like this game more than I do, as there is a little bit of risk/reward balancing with attempting to sneak in a big play, or some abstract game-esque puzzling that can happen while trying to find the best way to further your board state and block your opponent with a single drawing. But so many of the moves end of feeling like the unsatisfying aspects of a game like Tic Tac Toe or similar abstract games, where you don't really get to DO anything. Yes, maybe you have blocked your opponent, and that does count for something as far as the point totals go, but the FEEL of the game is off then. I wish I had better words to explain it, and I'm sure the right group would appreciate that tactile nature of the game, but it just didn't work out for me. I am wondering if it had to do with the theme and my expectations going into the game.",
    "timestamp": 1675465200
  },
  {
    "username": "holf",
    "rating": 5.0,
    "comment": "在動物園(?)裡畫線規劃參觀路線的遊戲，每位玩家有自己的圖版，而圖版則是玩完之後會傳給下一位，遊戲結束時計算自己在每個圖版上的分數加總決定勝負。分數來自於穿越多少區域、露餡上是否有動物、有沒有未連接的點，是否有帳篷…線畫的越長可以經過越多區域，但同時也可能會被其他玩家阻擋，要決定自己得分路線同時順便擋住其他人的確是最佳方式，但好像樂趣少了一點",
    "timestamp": 1673132400
  },
  {
    "username": "dogterom",
    "rating": 5.0,
    "comment": "some are good some are bad lets give a average score",
    "timestamp": 1667775600
  },
  {
    "username": "emike",
    "rating": 5.0,
    "comment": "Blackbeard's Rubies\n- tile-laying board game\n- meh\n- haven't played it in recent years\n- I'm sure it needs work.",
    "timestamp": 1650664800
  },
  {
    "username": "emike",
    "rating": 5.0,
    "comment": "Switcheroo\n- minor abstract board game\n- meh",
    "timestamp": 1650578400
  },
  {
    "username": "emike",
    "rating": 5.0,
    "comment": "Warthog\n- African animal card tableau game\n- not fun yet\n- needs work",
    "timestamp": 1643065200
  },
  {
    "username": "VincentDarlage",
    "rating": 5.0,
    "comment": "\"Dixon to Carrier: Scratch One Flattop\" playtest. Not sure if this game ever did come out.",
    "timestamp": 1619388000
  },
  {
    "username": "Asmoridin",
    "rating": 6.0,
    "comment": "Really just a placeholder ranking. There are a few such games I've played that qualify, mostly good, but I'll wait until the games are actually out, when I will rate them.",
    "timestamp": 1755813600
  },
  {
    "username": "yamaraus",
    "rating": 6.0,
    "comment": "Candy Craze. Turned unpublished. A solid Halloween flavored roll 'n write that could be played by a group. Best with younger kids around age 5-6 for candy-drawing-excitement. Rated as such.",
    "timestamp": 1750284000
  },
  {
    "username": "cogstockeros",
    "rating": 6.0,
    "comment": "Candy Craze - Pretty thinky for a roll 'n write. However, due to the theme, it won't come out more than once a year.",
    "timestamp": 1750284000
  },
  {
    "username": "Yokiboy",
    "rating": 6.0,
    "comment": "Who doesn't love testing prototypes?",
    "timestamp": 1749074400
  },
  {
    "username": "asta",
    "rating": 6.0,
    "comment": "I consider this entry as a cover all for all games I 'try' to design and get people to play, plus all published and to be published games that I am yet to play... It would get a ten if it was a real game i.e Always want to play and expect this will NEVER change. Proud to be a gamer!\n\nBelow are the play tests I have done:\n10/2/06 My Race game\n17/2/06 My Race game STATUS Abandoned\n23/10/10 Zirk's Spies 1939 game\n17/11/10 Spies of 39\n23/1/11 My Tennis idea STATUS On hold\n18/5/11 Spies of 39\n5/6/11 Jarratt Gray's Spy Game (Will be watching this one)\n3/7/11 Komodo\n8/10/11 Komodo Basic, Komodo Advanced, Komodo Co-op X2\n9/10/11 Raid the Pantry\n13/10/11 Raid the Pantry\n15/10/11 Raid the Pantry\n17/12/11 Spies of 39\n21/3/12 Spies of 39\n24/3/12 Spies of 39\n15/4/12 SchilMil's Monkey Game (now - Kenakalan)\n2/6/12 Zombie House\n8/9/12 Tit4tat (now - Granny Wars)\n10/9/12 My Meerkat game\n13/9/12 My Meerkat game STATUS on hold\n12/5/13 Guardians of the orb\n2/6/13 Manifest\n5/6/13 Spies of 39\n21/8/13 Damon's Hawaii\n24/11/13 Spies of 39\n4/12/13 My heist game STATUS reworking, although probably abandoned after playing[REDACTED] (and Burgle Bros later)\n1/3/14 Damon's Freudian game\n16/3/14 Spies of 39\n10/9/14 Damon's CIA vs KGB\n11/10/14 Bridal Battle, Spies of 39, Damon's CIA vs KGB\n12/10/14 Damon's CIA vs KGB X3\n22/11/14 SchilMil's Rock Band\n25/2/15 Vampire Goat of Gurnsey\n15/7/15 Cat Capers\n5/9/15 Slapjack (Code breaking game)\n28/2/16 Food Pyramid game at Paperjam KoC\n19/3/16 Murder among the Mateys (Online Murder mystery party http://www.nightofmystery.com/shop/)\n29/1/17 Murder at the Scarlet Pilchard (D&D style murder mystery written by James)\n27/12/17 Monster Photographers\n15/4/20 Paw Patrol\n16/4/20 Paw Patrol\n6/6/20 Paw Patrol\n5/8/20 Dark Street (Zirk Spies)\n21/8/20 Paw Patrol\n5/1/21 Paw Patrol\n20/4/22 A Matter of Taste\n6/8/22 Pussy Brawler\n13/5/23 Monster Rock\n10/6/23 Monster Rock\n1/3/25 A Murder in Cairo (James written Murder Mystery RPG)",
    "timestamp": 1740783600
  },
  {
    "username": "bryanldoughty",
    "rating": 5.5,
    "comment": "Bryan Doughty's Role Selection Playing Card Game by Me!",
    "timestamp": 1736809200
  },
  {
    "username": "Platinum_Gamer",
    "rating": 6.0,
    "comment": "Steel Colleseum",
    "timestamp": 1719180000
  },
  {
    "username": "enzo622",
    "rating": 6.0,
    "comment": "Catchall",
    "timestamp": 1700866800
  },
  {
    "username": "Farsol",
    "rating": 6.0,
    "comment": "I don't remember these specifically, so giving a default of 6.",
    "timestamp": 1694037600
  },
  {
    "username": "Wentu",
    "rating": 6.0,
    "comment": "a 6 is very generous for this, but I want to give credit to the mechanic for passing the same board around. the game itself is a bit puzzling (and I like that) but very constricted.",
    "timestamp": 1693000800
  },
  {
    "username": "ZargonDDG",
    "rating": 6.0,
    "comment": "More depth than I thought at first glance, but not really meant for ultra-competitive play.",
    "timestamp": 1689372000
  },
  {
    "username": "DaGreenMachine",
    "rating": 6.0,
    "comment": "A fun idea but not balanced very well.",
    "timestamp": 1668380400
  },
  {
    "username": "Victoria_hermit",
    "rating": 6.0,
    "comment": "Solo or 2 player blind bid game with tetris map and majority control. A great deal of luck of the draw but looks like it plays well and is interesting. Not generally interested in 2 player games. Willing to try but little desire to buy.",
    "timestamp": 1667516400
  },
  {
    "username": "bbkoene",
    "rating": 6.0,
    "comment": "2 x : The game was Uma-Jirushi. I'm not sure yet : very tactical, not strategic. Maybe a too big kingmaker effect. But it needs more plays.\n1x : 18BE : no score yet\n1x : Hades en nog wat : no score yet\n1X \"audition\" : kind of coloretto, nice to play : 7",
    "timestamp": 1666216800
  },
  {
    "username": "Wajabix",
    "rating": 6.0,
    "comment": "I consider that the game i tested about zombies was a good idea but is focused to a very specific player base. It is dedicated to the hardcore board game enthusiast. The core gameplay is very fun but the rules in the game sometimes feel overwhelming, to a point where I personally felt I couldn´t keep going without the guidance of the dev. When it comes to movement and the hord movement perhaps there could be a different variety of indicators, as I found it confusing to tell one horde of zombies apart from the other. Overall it is a very fun and original idea, but perhaps not my kind of board game.",
    "timestamp": 1652392800
  },
  {
    "username": "crimescene",
    "rating": 6.0,
    "comment": "nice",
    "timestamp": 1645570800
  },
  {
    "username": "Jose-san",
    "rating": 6.0,
    "comment": "Print and Play\n\nBlood Bowl card game",
    "timestamp": 1644534000
  },
  {
    "username": "emike",
    "rating": 6.0,
    "comment": "Beware the Dragon\n- set collection card game\n- ready to submit",
    "timestamp": 1643065200
  },
  {
    "username": "Legomancer",
    "rating": 6.0,
    "comment": "Rating a 6 so it doesn't show up in my \"Played and Unrated\"",
    "timestamp": 1641769200
  },
  {
    "username": "BigD527",
    "rating": 6.0,
    "comment": "Logged plays for this game are either my own game designs that, if they eventually become BGG entries, will change over to that, or when I am playtesting a game that cannot be discussed. A rating of 6 is the default.",
    "timestamp": 1641250800
  },
  {
    "username": "Cayca",
    "rating": 6.0,
    "comment": "Alien Horde",
    "timestamp": 1636585200
  },
  {
    "username": "AlexFS",
    "rating": 5.5,
    "comment": ".",
    "timestamp": 1631484000
  },
  {
    "username": "Walt Mulder",
    "rating": 7.0,
    "comment": "Central Park: HEAT playmat",
    "timestamp": 1751234400
  },
  {
    "username": "botticus",
    "rating": 6.5,
    "comment": "Rating for Rift Valley Reserve which never made it past BGA, I guess?",
    "timestamp": 1751061600
  },
  {
    "username": "RaffertyA",
    "rating": 7.0,
    "comment": "Alex Sorbello's next game, inspired by the combat mechanic of Friedrich (but not a clone).\n\nBryce's Blast Jack",
    "timestamp": 1749852000
  },
  {
    "username": "bryanldoughty",
    "rating": 6.5,
    "comment": "More & More by me! 13 plays.",
    "timestamp": 1736809200
  },
  {
    "username": "HansSPP",
    "rating": 7.0,
    "comment": "The Road to Innsmouth - Deluxe Edition",
    "timestamp": 1732143600
  },
  {
    "username": "lemdavefn",
    "rating": 7.1,
    "comment": "Troyes 2 Print and Play (PNP): I prefer this to Troyes Dice.",
    "timestamp": 1730070000
  },
  {
    "username": "ianne",
    "rating": 7.0,
    "comment": "Jarratt's Australia AoS board (http://www.boardgamegeek.com/play/details/2849990)\n\nJarratt's Letter's of Marque (originally Totem and more recently re-themed as a spy game) (http://www.boardgamegeek.com/play/details/2742572)\n\nJarratt's Old World.\n\nCarl & Jarratt's Endeavor prototypes.\n\nJarratt's \"European Powers\" Endeavor expansion.\n\nAndrew Rae's Reformation.\n\nAndrew Rae's Dawn of Nations.\n\nBrian's Extravagances.\n\nMark R's NZ Age of Steam.\n\nCarl's asymmetric war game.\n\nJohn's NZ Ticket to Ride expansion.\n\nGordon's nameless semi-cooperative eco-politics game.\n\nMy new track for Detroit Cleveland Grand Prix.\n\nAmanda's Manifest\n\nMartin Wallace's technology based war game (http://boardgamegeek.com/play/details/11942831)",
    "timestamp": 1724536800
  },
  {
    "username": "Damlog",
    "rating": 7.0,
    "comment": "Psychic Detective game was engaging ,but with 7 players it took too long.\nGot to streamline gameplay while being able to engage everbody\nat the same time. A difficult task but worthwhile if I succeed.",
    "timestamp": 1723500000
  },
  {
    "username": "emike",
    "rating": 7.0,
    "comment": "Champion Racehorses\n\nPlayers manage and race historical thoroughbreds. Players decide when, at what distance, and against whom to race their horses Race results are determined by likelihoods based on real past times.\n\nI haven't worked on this for several years.",
    "timestamp": 1722290400
  },
  {
    "username": "Damlog",
    "rating": 7.0,
    "comment": "\"Mega city Planner\" takes inspiration from Sprawlopolis / Railroad Ink\nand tile layers like Karuba. Race to complete North to South connections\nand East to West connections. Gain victory points by connecting as many\n12 outer city roads and rails as possible. Build massive areas to gain the favour of city council members. ( Capitalist / Home Owners Association\n/ Industrialist and Nature lover) Train lovers and car drivers also want\nthe longest routes possible to enjoy their form of transportation.\nI`ve always been enamored by tile layers and enjoy this sort of\nactivity while at the same time racing to complete several objectives\nbefore the other players. May the best planner win.",
    "timestamp": 1719871200
  },
  {
    "username": "shaveandahaircut",
    "rating": 7.0,
    "comment": "My WWI game is among the unpublished games I have marked as played with this. So is Michael's StageCraft and Gizmo games. Also Ruthie's frog game.\n\nMost recently playtests of Mad Avenue.",
    "timestamp": 1718143200
  },
  {
    "username": "Walt Mulder",
    "rating": 7.5,
    "comment": "Watkins Glen: HEAT playmat",
    "timestamp": 1751234400
  },
  {
    "username": "Walt Mulder",
    "rating": 8.0,
    "comment": "Zandvort: HEAT playmat",
    "timestamp": 1751234400
  },
  {
    "username": "emike",
    "rating": 8.0,
    "comment": "Timelines of the Multiverse\n- board/card game\n- more realistic than any published time travel game\n- successful major playtest\n- still with some rough edges, but base concept works well",
    "timestamp": 1750284000
  },
  {
    "username": "emike",
    "rating": 8.0,
    "comment": "Ghosts in the Castle\n\n- relatively simple board game\n- enticing castle board and gameplay;\nan abstract in disguiese\n- closing in on final version",
    "timestamp": 1722290400
  },
  {
    "username": "Damlog",
    "rating": 8.0,
    "comment": "\"Restaurant Monarchs\" takes inspiration from Chinatown / Lords of Vegas and Food Chain Magnate. Build up different restaurant types : Toast / Burger / Pizza or Sushi bar to gain the most value for the stock in your\ncorporation. Hire chefs / waitresses / increase seating capabilities / advertise and drive up product awareness to attract customers\nWhy no other game has used \"Biblios\" drafting as a game mechanic\nis baffeling to me. Throw in some wheeling and dealing and marketing\nand you have a game that catches my attention at least.",
    "timestamp": 1719871200
  },
  {
    "username": "Nikomakhos",
    "rating": 8.0,
    "comment": "O game\n- five tricks, last trick winner wins\n- smaller number wins\n- suit avoidance: if play same suit, loses\n- trump suit and loser suit\n- first won trick is in your hand the next round. (So deal only three.)\n- all aces lose to all kings.",
    "timestamp": 1714255200
  },
  {
    "username": "robert_huang",
    "rating": 7.5,
    "comment": "New games good, unpolished games less good but still good to see ideas.",
    "timestamp": 1710802800
  },
  {
    "username": "natokh",
    "rating": 7.5,
    "comment": "Ptolemaeus",
    "timestamp": 1707519600
  },
  {
    "username": "MrSaturn17",
    "rating": 8.0,
    "comment": "Placeholder for Tiny Tin Titan.\nhttps://boardgamegeek.com/thread/1420658/wip-tiny-tin-titan-...",
    "timestamp": 1703199600
  },
  {
    "username": "JAskier",
    "rating": 8.0,
    "comment": "Mlem 22.04.23 7/10",
    "timestamp": 1690495200
  },
  {
    "username": "Keenlow",
    "rating": 8.0,
    "comment": "Really fun old school point and click adventure escape game with cool props. Already looking forward to the next one!",
    "timestamp": 1678662000
  },
  {
    "username": "edoved",
    "rating": 9.0,
    "comment": "Geisha",
    "timestamp": 1751320800
  },
  {
    "username": "emike",
    "rating": 9.0,
    "comment": "Dragon Cities\n\n- major prisoner's dilemma game\n- fairly simple rules\n- major player interaction\n3 publishers have taken the prototype, played it, and eventually rejected it. Still a '9' in my book.",
    "timestamp": 1750284000
  },
  {
    "username": "SoBoardTogether",
    "rating": 9.0,
    "comment": "Thieves of Valeria",
    "timestamp": 1747087200
  },
  {
    "username": "Celtic",
    "rating": 9.0,
    "comment": "\"Excellent - very much enjoy playing\".\n\n'Cheese'\n'Cloud/Jump' - Martin Wallace\n'Danger Dominoes'\n'Dragon' - published as 'Dragonscroll', Essen 2014\n'Husky' - published as 'Snow Tails', Essen 2008\n'Jungle' - published as 'Antics', Essen 2010\n'Knigel' - gods, hexes, races, runes plus San Jan action selection attack,\nbreed, build, convert, expand etc\n'Namibia' - Siegertitel des Autorenwettbewerbes (Strategiespiel) 2008/09\npublished as\nNamibia, Essen 2010\n'Noir' - published as 'Steam Noir: Revolution', Essen 2013\n'Nome' - unpublished\n'Ostrich' - published as 'Savannah Tails', Essen 2009\n'Pentagram' - published as 'The 3 Commandments', Essen 2008\n'Pivot'\n'Pups' - published as 'Mush! Mush! - Snow Tails 2', Essen 2013\n'Roketto' - Hanabi-inspired variants, with Silver/Gold deck, second with teams\n'R&W Traders' - Sean Orms (Conpulsion)\n'Rainbows' - published as 'Game of Gnomes', Essen 2015\n'Red'\n'Rats' - published as 'Hameln', Essen 2006\n'Scottish Tour'/'TdE'\n'Scunner'\n'Stills'\n'Wave' - published as 'Poseidon's Kingdom', Essen 2011\n'Witch' - published as 'Spellbound', Essen 2012",
    "timestamp": 1740956400
  },
  {
    "username": "wdneill1982",
    "rating": 9.0,
    "comment": "Great game. Very arcade-like gameplay feel. It combines aspects of Infinity, Warhammer and Magic the Gathering into a neat and unique game package. I was unsure about the diceless system going in, but now I am sold on it.",
    "timestamp": 1727560800
  },
  {
    "username": "emike",
    "rating": 9.0,
    "comment": "Galactic Search\n\nThis is a board game where players are starship captains flying real distances visiting actual star systems in our galaxy, in search of wealth, influence, and relative youth.\n\n- board/card sandbox game\n- key original concept\n- science fiction + science fact\n- my opus\n- should be ready to submit within a year",
    "timestamp": 1722290400
  },
  {
    "username": "Areskifolt",
    "rating": 8.5,
    "comment": "How can people give such low rates to a beautiful gem like this, I don't understand  Definitely a very strategic game. Highly recommend on BGA.",
    "timestamp": 1698184800
  },
  {
    "username": "Nyrina4life",
    "rating": 9.0,
    "comment": "This game is obviously not going to be for everyone, but I quite enjoyed it. It's very simple and relaxing. A nice quick game between more complex games or if you're just not feeling like a heavy game, get in a game or two and be happy. It took my party a turn or two to really fully understand what we were doing and once we did, the race was on. 9/10 will play again.",
    "timestamp": 1694296800
  },
  {
    "username": "jaceycole",
    "rating": 9.0,
    "comment": "To the Booty!",
    "timestamp": 1692655200
  },
  {
    "username": "JCadice",
    "rating": 9.0,
    "comment": "Great concept game. MInis are amazing. I can't wait for it finally to be released!",
    "timestamp": 1692309600
  },
  {
    "username": "atm2727",
    "rating": 9.0,
    "comment": "Unfortunately, my copy was stolen by a Westalis smuggling ring.",
    "timestamp": 1681423200
  },
  {
    "username": "Metadna",
    "rating": 10.0,
    "comment": "Hidden gems inside.\nhttps://www.boardspace.net/",
    "timestamp": 1754172000
  },
  {
    "username": "Walt Mulder",
    "rating": 9.5,
    "comment": "Nurnburing: HEAT playmat",
    "timestamp": 1751234400
  },
  {
    "username": "SultanSevy",
    "rating": 10.0,
    "comment": "Includes games I've designed and which are mostly finished, but haven't been published yet:\n\nSword of Severnia (fantasy battles with miniatures, 16 troop types, brigades & battle-groups, Reserves, Leaders/Heroes/Mages/Specialists, Troop Builder spreadsheet for creating customized unit stat-sheets, initiative and special action cards, innovative command/control, fog-of-war events, shaken troops, Mojo tokens, panic meter). Easily my #1 favorite mass-battle game.\n\nWarlords of Hexenstein (quick-play fantasy battles with miniatures on hex-gridded battlefield, element bases, Warlord/Hero/Wizard, command dice via bag-draw, actions points, fate-card play). Lots of fun, with less rules overhead compared to most wargames.\n\nTiny Tank Blitz (fast-play tank battles with 1/72 scale miniature tanks on hex-gridded battlefield, card activation, action points, fate-card play). I designed this as a more-fun alternative than more fiddly tank games and it works well with multiple players too.\n\nDwarfnuckle (2-player fast-play card battler, fantasy theme, poker dice combat, fatigue points).\n\nTournament of Brutes (fantasy gladiator fights, gambling, spectator participation, variable player powers).",
    "timestamp": 1746136800
  },
  {
    "username": "SageClock",
    "rating": 10.0,
    "comment": "I have way too many prototypes I've made over the years, sitting around the house. I should start getting more of these published.\n\nI'll use this to record plays of both mine and other designer's games going forward. Probably playtested hundreds of prototypes before this, but never bothered to record them all on here before.",
    "timestamp": 1742166000
  },
  {
    "username": "EddyKansas",
    "rating": 9.5,
    "comment": "What I'm looking for.",
    "timestamp": 1741129200
  },
  {
    "username": "Barazantathul",
    "rating": 10.0,
    "comment": "My only 10, I love playing prototypes!",
    "timestamp": 1737414000
  },
  {
    "username": "bryanldoughty",
    "rating": 9.5,
    "comment": "Robot Miners game by me! 2 plays.",
    "timestamp": 1736809200
  },
  {
    "username": "hillsidecouncil",
    "rating": 10.0,
    "comment": "Evening\n\nThe sunlight thins, the view empties:\nBack from a walk, I lie under the front eaves.\nFairweather clouds like torn fluff\nAnd the new moon like a whetted sickle.\nA zest for the fields and moors stirs in me,\nThe ambition for robes of office has long since\nturned to loathing.\nWhile I live, shall I take your hand again\nSighing that our years will soon be done?\n\nHan Yu (768-824)\ntranslated by Arthur Waley",
    "timestamp": 1709506800
  },
  {
    "username": "njr75003",
    "rating": 10.0,
    "comment": "Contributed to V2.0(1) rules, so I'm a BIT biased. Still, it's a good game!",
    "timestamp": 1702767600
  },
  {
    "username": "dieterminator",
    "rating": 10.0,
    "comment": "A game of a friend who deserves support",
    "timestamp": 1675119600
  },
  {
    "username": "pikkusiili2000",
    "rating": 10.0,
    "comment": "I always have a game cooking on the back burner and love to have people play it with me.\nI also enjoy testing other peoples games and have done tests for several publishers.",
    "timestamp": 1669762800
  }
]