[
  {
    "username": "tempar",
    "rating": 1.0,
    "comment": "For miniatures, didn't play",
    "timestamp": 1477346400
  },
  {
    "username": "JoffiJoffi",
    "rating": 1.0,
    "comment": "Even when I was a child and easily impressed by a game`s look I hated this one.",
    "timestamp": 1140994800
  },
  {
    "username": "Korwin",
    "rating": 2.0,
    "comment": "A primitive dungeon crawlers.\nThe problem is, I never really liked dungeon crawlers to begin with",
    "timestamp": 1612220400
  },
  {
    "username": "John Tenzer",
    "rating": 2.0,
    "comment": "This a game which floated in the backwater of HeroQuest.\n\nIt has mostly its nice looking monster miniatures and some terrain going for it.\n\nThe heroes and rules rather disappointing. If you can't die in a fantasy adventure game, there is no risk and no satisfaction to it playing on both the heroes or the villains side.\n\nAt best it's a child pleaser for kids 10- of age, but even for that HeroQuest does it better.\n\nBuy it cheap as a thematic monster miniatures collection for your roleplaying sessions and drop the game itself.",
    "timestamp": 1509836400
  },
  {
    "username": "SamLL",
    "rating": 3.0,
    "comment": "Much more toy than game - there aren't really any interesting decisions to be made of the course of play, and Korak seems almost totally fated to lose. But the plastic looks good!",
    "timestamp": 1711407600
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "My child self was as unfamiliar with Das Schwarze Auge as with Warhammer, so he really came to these kinds of fantasy dungeon crawlers without any pre-established preferences. And while I'd like a good underdog story that could give Games Workshop a run for its money, Dark World turned out to be the neutered output of a theoretically great design. The 5-player version could have become a memorable asymmetric game, had the Korak player been granted any of the agency and lethality required to offset the race between the good guys, who each only wants to end the game by defeating Korak for as long as their character is (seemingly) ahead in score. Unfortunately its boring map, bare bones decision making and unwarranted rigidity in the unfolding of its only scenario relegate Dark World to the rank of \"worse HeroQuest\".",
    "timestamp": 1665612000
  },
  {
    "username": "Ghosting49er",
    "rating": 4.0,
    "comment": "Heroquest rippoff",
    "timestamp": 1760479200
  },
  {
    "username": "gatonomada",
    "rating": 4.0,
    "comment": "Funny, simple, playable, nice miniatures...",
    "timestamp": 1619906400
  },
  {
    "username": "tocoking",
    "rating": 4.5,
    "comment": "I finally stripped it for parts. The game is not good. The visuals and components were one of the best in their time. It was a shame they didn't deliver good rules (like HeroQuest).",
    "timestamp": 1696888800
  },
  {
    "username": "doomeron",
    "rating": 5.0,
    "comment": "Bought this as a teen by accident. I thought it would have something to do with the pen&paper rpg going by the same name and which I was curios about and wanted to get into (still not sure why they even used the same name as I can't see the connection...).\nThe game was ok, had some nice ideas and some great components. Played it some times but liked the components more than the game.\nUltimatly didn't bother taking it with me when I moved out. It was lost over the years but I don't think I would play it again even if I still had it.",
    "timestamp": 1664402400
  },
  {
    "username": "AsdrubaelV",
    "rating": 5.0,
    "comment": "+ 3D terrain.\n- Poor version of Heroquest. No sense of exploration. Death is meaningless for the 1st half of the game. Its' all luck.",
    "timestamp": 1659218400
  },
  {
    "username": "jonpaget",
    "rating": 5.0,
    "comment": "The game is OK, but the figures are fantastic. We've used them in lots of different fantasy games since.",
    "timestamp": 1643842800
  },
  {
    "username": "Aurion254",
    "rating": 5.5,
    "comment": "Such amazing components for such a mediocre game. It had so much potential but falls short of the mark.",
    "timestamp": 1754431200
  },
  {
    "username": "Roogie",
    "rating": 6.0,
    "comment": "COMPLETO!!",
    "timestamp": 1712613600
  },
  {
    "username": "PopeBrain",
    "rating": 6.0,
    "comment": "(2 plays) It looks like a fabulous game, but does not play like one. There are occasional tactical plays that feel like a fun strategy adventure, in between lots and lots of dull and predictable decisions. There is room to house-rule this into something fun.",
    "timestamp": 1681164000
  },
  {
    "username": "Floydski",
    "rating": 6.0,
    "comment": "A competitor of Hero Quest from the 1980's. Very light and fun in it's own right. An incredible 3d board, ok figures and a fun competitive - coop with a bit of video game style mechanics.",
    "timestamp": 1670540400
  },
  {
    "username": "Fabov",
    "rating": 7.0,
    "comment": "Simple et sympa pour un public jeune. Le jeu date mais c’est toujours un petit plaisir à jouer",
    "timestamp": 1746914400
  },
  {
    "username": "neoscully",
    "rating": 7.0,
    "comment": "German original version",
    "timestamp": 1728943200
  },
  {
    "username": "rooninzen",
    "rating": 8.0,
    "comment": "Calidad en componentes y buena cantidad. Puede haber rejugabilidad apesar de ser los mismos jugadores. Se disfruta mas a muchos jugadores.",
    "timestamp": 1737500400
  },
  {
    "username": "hunteil",
    "rating": 8.0,
    "comment": "Kids love the feel of this board game. It's easy enough for a 4 yr old to play due to the minimal reading and strategy. It's a great starter game for kids. But not something that can provide a lot of replay value for adults. My rating is based on kids enjoying it a lot and wanting to play it more. Note, the Korak/DM player must be old enough to read and understand rules.",
    "timestamp": 1706742000
  },
  {
    "username": "viking4a",
    "rating": 9.0,
    "comment": "Very good condition, complete, (23,05+7,50)=30,55€, ebay",
    "timestamp": 1463868000
  },
  {
    "username": "pipboy101",
    "rating": 8.5,
    "comment": "This is a great game but really should be assembled by someone over 14 years old. This should not be for 10 Y/O plus. Now for the game it really needs more than two players to really enjoy this game. But when the game it going it is a fast paced dice roller miniatures game. This is a good gate way game into D&D and or miniatures games as the rules are straight forward and simple. I am not going to give this a must have but you will not be disappointed if you pick this up complete at a good price.",
    "timestamp": 1455750000
  },
  {
    "username": "willyb63",
    "rating": 10.0,
    "comment": "Dark World is the best game to play with family.\nLet me explain.\nThe good:\n1. I have 2 kids and every other game has you killing each other player, this game does not. You all play together to kill the boss. Big win for any family.\n2. The models and landscape/board game are excellent!\n3. Simple to play and I have added a few extra dice, to make it a bit harder when the kids are used to it.\n4. A surprise element when you try and kill a monster, the kids love it.\n5. Look at what you get! I bought mine on eBay for £19 all in!\nThe bad:\n1. It’s the same game every time, just kill the bad guy.",
    "timestamp": 1499032800
  },
  {
    "username": "lordleachim",
    "rating": 10.0,
    "comment": "i loved this game back when i was a kid. great details and an interesting storyline, this game introduced me to more advanced games like heroquest and eventually to dungeons and dragons. really fantastic miniatures and a wonderfully complex board, complete with rooms and castle. great game.",
    "timestamp": 1345500000
  }
]