[
  {
    "username": "scordo13",
    "rating": 1.0,
    "comment": "I hated this game!",
    "timestamp": 1639263600
  },
  {
    "username": "Constantinople",
    "rating": 1.0,
    "comment": "Excruciating, like filing taxes. Could not finish the game!\n\n\n\n\n10/25/2010\n\nI just ran across this entry accidentally.\n\nTHE MOST AWFUL GAME OF ALL TIME!!\n\nUnless you are an accountant.",
    "timestamp": 1441317600
  },
  {
    "username": "Riever32",
    "rating": 1.0,
    "comment": "Zzzz... enough said.",
    "timestamp": 1431295200
  },
  {
    "username": "JamesTatlow",
    "rating": 2.0,
    "comment": "Typical old game. Missing turns, random winner. Whatever, better things to play.",
    "timestamp": 1468620000
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "I played it when I was a child and now in 2016 again. But I'll play it never again. Too much luck involved. Start player has a big advantage. And it takes too long for a simple game like that.",
    "timestamp": 1455663600
  },
  {
    "username": "Rob Doupe",
    "rating": 2.0,
    "comment": "Ugly and tedious. Feels like a mathematics educational tool for elementary schools.",
    "timestamp": 1261782000
  },
  {
    "username": "Carwynhywel",
    "rating": 3.0,
    "comment": "-",
    "timestamp": 1727560800
  },
  {
    "username": "lebryant",
    "rating": 3.0,
    "comment": "A simple racing game with a slight pitch of luck involved. It's surprisingly good for a game that came out in the 70s but it seems that there's only one right strategy (start slow, sprint in the second half) which means it's doubtful I'd want to play it again.\n\n---\nlebryant's TOP games of all time\n---\n[2022]: 228/294 (top 78%) | Rating - 4 | Overall Plays - 1\n[2021]: 226/288 (top 78%) | Rating - 3 | Overall Plays - 1\n[2019]: 195/256 (top 77%) | Rating - 4 | Overall Plays - 1",
    "timestamp": 1689112800
  },
  {
    "username": "lexen",
    "rating": 3.0,
    "comment": "What you call a average game. Good but not great...",
    "timestamp": 1680127200
  },
  {
    "username": "Nodens",
    "rating": 4.0,
    "comment": "I like the race and dislike all the math.",
    "timestamp": 1757368800
  },
  {
    "username": "NOOCX",
    "rating": 4.0,
    "comment": "Clever, mechanical and boring. I wished I would play Pachisi instead. The game has quite a bunch of fans, I'm not one of those.",
    "timestamp": 1704927600
  },
  {
    "username": "bneffer",
    "rating": 4.0,
    "comment": "Old school race game with old school aesthetics and gameplay. Classic, but not much reason for me to play this one again.",
    "timestamp": 1701817200
  },
  {
    "username": "PiecesOfToast",
    "rating": 4.5,
    "comment": "Solid game to learn and play but it seems like there is 1 stratgy to win so it can get repetive quickly. Best played when you play 1 or 2 times.",
    "timestamp": 1758146400
  },
  {
    "username": "Overexposed",
    "rating": 5.0,
    "comment": "Too complex for what it's supposed to be; the need to look moves up in rulebook tables is a shame. But the game's over fifty years old.",
    "timestamp": 1722549600
  },
  {
    "username": "millsyboy",
    "rating": 5.0,
    "comment": "It's much better that it looks like it would be! The arithmetic is a bit of a brain-burner towards the end of the game as players come within striking distance of the finish. Hanging back seems like a decent strategy, worthy of the \"Hare and Tortoise\" setting.",
    "timestamp": 1722463200
  },
  {
    "username": "Donnerdrummel",
    "rating": 5.0,
    "comment": "Verkaufen\nSchule",
    "timestamp": 1715551200
  },
  {
    "username": "Nye27",
    "rating": 5.0,
    "comment": "fine roll and move game, nothing particularly interesting, wouldn't play again.",
    "timestamp": 1709938800
  },
  {
    "username": "jaieless",
    "rating": 5.0,
    "comment": "October 2021 Used",
    "timestamp": 1704841200
  },
  {
    "username": "Lendengold",
    "rating": 6.0,
    "comment": "Gereon\n(gekauft)\n\nNICHT SICHER OB DIE RICHTIGE VERSION AUSGEWÄHLT",
    "timestamp": 1760565600
  },
  {
    "username": "yng21",
    "rating": 6.3,
    "comment": "Was introduced to Hase und Igel as a firm family favourite. I think their copy from the early 80s. A meaningful experience. Strong game of the goose vibes in the finish which dragged just a bit. Much mathier than expected and all the better for it. Looks like a children's game but really isn't. Stone cold classic for a reason and keen to play again with the family.",
    "timestamp": 1757714400
  },
  {
    "username": "Maximaler",
    "rating": 6.0,
    "comment": "Hase und Igel",
    "timestamp": 1757455200
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN nvt\nGL2",
    "timestamp": 1757368800
  },
  {
    "username": "snoozefest",
    "rating": 5.5,
    "comment": "Hated my first play, many years ago. Finally played it again Jan 08: not so bad! Rating 4-->6. A race/math game of optimizing your leaps forward and your drops backwards, to try to get your bunnies to the finish line. A little randomness (yours only if you choose, by landing on a hare space) is nice, too.\n\nEach player gets 65 carrots and n lettuce (# varies with player number). Move forward as many spaces as you want (1 hare/space max), paying according to #spaces (triangle progression: 1, 3, 6, 10, etc.). Alternatively, move backwards to first unoccupied tortoise space. Spaces have different features:\n- numbered (1/5/6, 2, 3, 4): if that is your place in the race, get 10x carrots; then move on.\n- hare: roll d6, look at chart for effects\n- carrot: if starting here, either take or lost 10 carrots as your move.\n- lettuce: flip token over. Next turn, flip back face up, discard 1 lettuce, earn carrots = 10 x position in race.\n- tortoise: get 10 carrots/space you moved backwards to get here.\nTo cross the finish line, you must have 0 lettuce left, and may have only 10 x (position in race) carrots in hand.",
    "timestamp": 1747951200
  },
  {
    "username": "Bulak",
    "rating": 5.5,
    "comment": "Verkoop",
    "timestamp": 1746396000
  },
  {
    "username": "mr0santan",
    "rating": 7.0,
    "comment": "Way better than I thought it would be. Crunchy numbers with hilarious dice rolls and screwage. A true gem.",
    "timestamp": 1756677600
  },
  {
    "username": "Knothyelf",
    "rating": 7.0,
    "comment": "the original German version has FAR superior art, and is a true classic.",
    "timestamp": 1754604000
  },
  {
    "username": "gmcnish",
    "rating": 6.5,
    "comment": "Early euro, still feels quite different. Lots of calculations to get the movement right,",
    "timestamp": 1749679200
  },
  {
    "username": "mawilson4",
    "rating": 8.0,
    "comment": "What a delight! So, ok, I played this live with friends online, with video and audio allowing for an experience that closely approximates over-the-table play. However, the online module also did the math for us. The frequent mathy exchanges of carrots in this one could easily become onerous in-person, even with player aids to help with the calculations. Those docking it for the frequent arithmetic aren't wrong.\n\nThat aside, I found myself smiling and laughing extremely frequently. If anyone dogmatically tells you that capricious randomness (of the card draws) and things like making players skip a turn are always bad design decisions, it's likely they're just repeating common wisdom that's become the modern groupthink and haven't opened themselves to joys like this game.\n\nIt's also not devoid of tactics and strategy; far from it, in fact. While card draws for example can swat you down at times, the game is still rewarding of savvy planning and attention to others' play. It's a lot of roughly calculated risk-taking, which makes outcomes (good or ill) quite entertaining and not nearly as random as its silly race theme might have you believe.\n\nI look at the board and see an updated Game of the Goose, a game that's existed for centuries and has hundreds of historical variants. And sure, a tiny bit of that DNA is here. But while I won't espouse Game of the Goose as a plaything beyond its value as a cultural and historical artifact, Hare & Tortoise is in the hands of an assured designer who has crafted something quite worthwhile and replayable.",
    "timestamp": 1760824800
  },
  {
    "username": "Rontuaru",
    "rating": 8.0,
    "comment": "I danced around trying this title for so long (even picking up the other racing game of similar namesake that plays wholly distinctly, and is more suited for kids, which turned out to be a success in its own way). But boy, oh, boy did it live up to its reputation. There's nary a frivolous mechanism to be had here, as it is truly a consistent cycle of number crunching and (re)calculated risk-taking and all the way down. And yet, my worst fears did not materialize: that it would be too dry, and too mathy, to enjoy. I don't hate math in my games, and in fact often revel in it, but I was worried that, on paper, you've nothing to in Hase und Igel *but* count carrots and play cards, with minimal interplay. The carrot-counting is necessary to play well, but these calculations are grafted onto the track in a way that transforms the game into something that feels more like a living abstract. Racer positioning dictates carrot flow, backtracking is as alluring and essential as any forward sprint, and the scarce cabbage spaces force sharp contests and encourage screwage.\n\nIt reminded me less of a \"roll\"-(put your pitchforks down, I know it's not rolling)-and-move race and more of a mathematical duel, where every decision to advance is a conclusion borne of both arithmetic and psychology. That this game has, historically, supported numerous annual tournaments tells you there’s competitive and strategic depth under this age-old fable's skin. It is clearly resilient to the astute gamer seeking a filler that punches well above its weight.\n\nWhat it won’t do (and I wholeheartedly agree with this common criticism) is wow anyone craving glitz or dazzle. The events deck is subdued rather than spectacular and there are no other offshoot special cards, nor are there track-related aberrations or shortcuts, nor flashy unique-to-a-racer abilities and other chrome that you'd likely find in many modern racing games. In Hase und Igel, it’s just you, your math, and your wits, poised against those of others in a positional contest stripped to the bone. I think the game is all the more enduring for it.\n\nP.S. - The Ravensburger edition has this lovely, timeless aesthetic that really suits the theming. Seek that out, if you can.",
    "timestamp": 1760479200
  },
  {
    "username": "jackycola",
    "rating": 7.5,
    "comment": "Geil um in der Familie zu streiten aber auf viel höherem Niveau als Monopoly!",
    "timestamp": 1760306400
  },
  {
    "username": "Elfboy486",
    "rating": 9.0,
    "comment": "Beautiful little race game. It is much more intellectually stimulating than your typical race game. I hope this will hit the table more often.",
    "timestamp": 1732748400
  },
  {
    "username": "Ishbel_adventurer",
    "rating": 9.0,
    "comment": "Luckily purchased original version, which is a beautiful board. Very much enjoy playing this and clever mechanic of carrot management.",
    "timestamp": 1728684000
  },
  {
    "username": "davidjanda",
    "rating": 8.5,
    "comment": "Spiel des Jahres\n1979",
    "timestamp": 1709506800
  },
  {
    "username": "ShiannLin",
    "rating": 10.0,
    "comment": "1979 Spiel des Jahres Winner",
    "timestamp": 1736377200
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "used",
    "timestamp": 1690063200
  },
  {
    "username": "Cuchulainn1795",
    "rating": 10.0,
    "comment": "It's Hare & Tortoise... a classic... it has to get a 10!",
    "timestamp": 1679180400
  }
]