[
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "The game is structured like an abstract and then has a dice element for randomisation of additional cube resources? Double layered majorities are an interesting idea, as is the collapse of the board into fewer regions but the randomness and length of game (60 minutes) mean this is not something I'd ever choose to play.",
    "timestamp": 1750197600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Counting up cubes and figuring out who even controls a region, it’s so goddamn tedious. And then rolling dice to determine your next actions, so it’s not even a diplomatic game. And the pain of having to recalculate EVERYTHING when cubes get added. Arrggh.\n\nGames really downgraded after Catan. Even King is Dead is more fun than this, has less procedural steps.",
    "timestamp": 1745013600
  },
  {
    "username": "TumbleSteak",
    "rating": 1.0,
    "comment": "A truly horrible game. The worst game I've ever played. The experience is absolutely broken in half by the randomness. If the knight refill was not random either player chosen or based on the result of the action you took there could be more game here. As it is you might as well just roll dice a few times to see who wins, save yourself 59 minutes, and play a better game. There are some interesting mechanics but in the three games I've played with three players I've seen one player completely locked out from controlling any colour despite not having placed any knights on to the board in two of those games.",
    "timestamp": 1437084000
  },
  {
    "username": "cardshark28800",
    "rating": 1.0,
    "comment": "I'm sure that I missed out on lots because it wasn't made clear during the teaching, but I just don't feel like I need to play this ever again.",
    "timestamp": 1412632800
  },
  {
    "username": "Waltertrem",
    "rating": 1.0,
    "comment": "Poor, luck driven game. What does it offer in the first place?",
    "timestamp": 1289775600
  },
  {
    "username": "Zeusman",
    "rating": 2.0,
    "comment": "Non-Library Copy",
    "timestamp": 1688594400
  },
  {
    "username": "dead jawa",
    "rating": 2.0,
    "comment": "Well the more I play this game the more it appears to me that it's all about what you roll with the dice. When I win it seems much more to do with the colors I rolled than the decisions I made, and same thing for when I lose. More and more it seems like great mechanics that add up to very little.",
    "timestamp": 1632002400
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Nie wygląda dobrze",
    "timestamp": 1628978400
  },
  {
    "username": "dtmm",
    "rating": 2.0,
    "comment": "Played 3 player. Choosing discs for turn order either felt chaotic if you weren't willing to permute, or tedious if you were. The dice would seem to add a pleasant information horizon to limit thinking ahead, but because they happen at the end of your turn, they contributed to a feeling of either frustration or obviousness at the beginning of your next turn.\n\nFor several turns in a row, I couldn't change the game in a way favorable to me, while others could, taking obvious advantages available to them. Then, when I built up the right majorities in my court, I forced other players to feel frustrated when they could do nothing to counter my advances.\n\nIt feels unengaging to be stuck, waiting for an opportunity to advance, and unpleasant to feel others' frustration when you can advance only because there's nothing they can do to stop you. It's undramatic. Where's the risk-taking? Where's the suspense?\n\nI had high hopes after all the good reviews, but this game is definitely not my cup of tea. The chess-like permutation, the randomness being used to limit player interaction, and the lack of tactical and endgame tension are all deal killers. Considering my similar disappointment with Clans, I will be hesitant to play other Colovini games.",
    "timestamp": 1497045600
  },
  {
    "username": "petegrey",
    "rating": 2.0,
    "comment": "I thought this one was going to require some study and playtime to really evaluate it.\n\nNo, another try shows I don't want or like it. Got rid of it. I don't seem to like Colovini games",
    "timestamp": 1277589600
  },
  {
    "username": "jeremylgunter",
    "rating": 3.3,
    "comment": "19/40\n\nvery good\n\n1#14",
    "timestamp": 1670022000
  },
  {
    "username": "lactamaeon",
    "rating": 3.0,
    "comment": "I picked this game up a while back. I didn't really enjoy it, and would not be interested in playing again.",
    "timestamp": 1568844000
  },
  {
    "username": "Wolfram",
    "rating": 3.0,
    "comment": "Didn't click",
    "timestamp": 1551222000
  },
  {
    "username": "pecquereau",
    "rating": 3.0,
    "comment": "15.00",
    "timestamp": 1433109600
  },
  {
    "username": "chinless",
    "rating": 3.0,
    "comment": "One of the first modern games I ever played, and didn't like it. Would like to try again now.",
    "timestamp": 1412287200
  },
  {
    "username": "rkleopold",
    "rating": 4.0,
    "comment": "!!!!! Goes",
    "timestamp": 1760738400
  },
  {
    "username": "Ephorus",
    "rating": 4.0,
    "comment": "What I like:\n- Interesting area majority mechanism with areas that get bigger over time. Pretty abstract, but I tend to enjoy these kind of games.\n\nWhat I dislike:\n- I don't enjoy the end game. Too dependent on switching majorities and luck with the die. Also, it seems that ties are pretty common.",
    "timestamp": 1757887200
  },
  {
    "username": "Fernegul",
    "rating": 4.0,
    "comment": "Boring",
    "timestamp": 1747346400
  },
  {
    "username": "lulu35",
    "rating": 4.0,
    "comment": "yucata.de gravon.de BGA w2.6 r2(36+58)-4 b3\nSASSE (Partnership ?) okk 17, 44, (35)",
    "timestamp": 1681855200
  },
  {
    "username": "candoo",
    "rating": 4.0,
    "comment": "Not a bad little medium game. Some intracacies. However, as the game progresses and the islands merge, there can be large swings with games turning on a dime. Also, it is a game that can be luck dependent with dice rolls. The components are of good quality and are fairly attractive.",
    "timestamp": 1565128800
  },
  {
    "username": "dosxtres",
    "rating": 5.0,
    "comment": "+3",
    "timestamp": 1741906800
  },
  {
    "username": "mawilson4",
    "rating": 5.0,
    "comment": "Tactical, mostly abstract experience. I like the deterministic area control mixed with the semi-randomness of cube distribution and resupply. The tension between playing cubes to your Court or to the board is good, as is the turn order structure.\n\nI'm honestly struggling to say why this is rated as it is when similar older titles are better for me. It's just lacking true surprise or the spark of interpersonal or strategic transcendence that so many of its famous peers have from this era. I need it to provide a bit more, and it doesn't have that in the tank.",
    "timestamp": 1740956400
  },
  {
    "username": "verandi",
    "rating": 5.0,
    "comment": "Played once as a 3p with the dice; would definitely try the diceless variant next time. I'm not giving up on this yet, but I do feel that it's more clever than a good game. It's highly tactical and defensive, and ultimately I feel like my choices were too constrainted; even for a 30-45 minute game I felt there wasn't enough agency.",
    "timestamp": 1717884000
  },
  {
    "username": "Nomohr",
    "rating": 5.0,
    "comment": "10€",
    "timestamp": 1708038000
  },
  {
    "username": "MikeBwithoutadot",
    "rating": 5.0,
    "comment": "New in collection april 07\nAfter first 3 plays: Nice game mechanism, feels different.\nI wonder if this one will \"stay\" (after a couple of plays I got rid of Clans from the same designer)\nFor now the luck of the dice seems to be too big, so next time I'll try the variant posted here.\n\nNL: Vlot te spelen tactisch spel met geluksfactor. Zit leuk in elkaar, weet alleen nog niet oftie ook na vaak spelen leuk blijft. Wil 'm wel eens met 3 of 4 proberen.\n\nUpdate jan '21: gave it away",
    "timestamp": 1700780400
  },
  {
    "username": "Marthinoth",
    "rating": 4.5,
    "comment": "Yucata",
    "timestamp": 1680213600
  },
  {
    "username": "tiagoVIP",
    "rating": 5.0,
    "comment": "Designer: Leo Colovini\nPlaying time: 60 Min\nWeight: 2.58 / 5\nPublisher: Rio Grande Games\nPlayer count: 2-4 (best with: 3)\n\nCOMPLEXITY: Low\nCOMPONENTS: Medium\nDOWNTIME: Medium\nFUN: Medium\nINTERACTION: Medium\nPLAYING TIME: Medium\nLUCK: Low\nREPLAY VALUE: Medium\nSOLITAIRE: Very low\nTHEMATIC: Very low\n\nComments: Carolus Magnus is an abstract strategy game about area influence and hand management. The ideia is players will use their cards to have the best position in the turn order and to move the Nature pawn. Then they will place tokens either on their own boards, to increase their influence in the colors, or on the islands, to have a stronger position there, once the pawn moves to that island. The first player to add all their control pieces to the main board, or have the most control pieces at the end of 10 rounds, will be the winner!\n\nCarolus Magnus was alright, with the main decision point being: use the tokens either in the personal board, for increase influence in a color; or on the central board, to gain control of islands. I enjoyed the swingy nature, as island connect with each other when adjacent and controlled by the same person, which can lead to some big changes on pawns on the board when a big island is lost.\n\nOverall, while not bad, with lean rules. meaningful interaction and good variation, I was mostly left cold, with little to keep me coming back and remaining interested; and this prevents Carolus Magnus from becoming much more than just a ordinary experience, with little left to remember afterwards; and unremarkable games are simply lost in the crowd.",
    "timestamp": 1675119600
  },
  {
    "username": "coxy_fc",
    "rating": 5.0,
    "comment": "Clever, old fashioned, but not one I find interesting enough to play more.",
    "timestamp": 1668121200
  },
  {
    "username": "casualcasual",
    "rating": 5.0,
    "comment": "I'm still living off the fumes of this one which I played several years ago and quite enjoyed. An early taste of that good, open, \"what the hell do I do\" elixir.\n\nHaving played it more recently again - well, a little abstract for me perhaps, still enjoyable though.",
    "timestamp": 1627336800
  },
  {
    "username": "jax900",
    "rating": 5.0,
    "comment": "After 1 2-player game. Initial rating (there's a room for 1 point improvement).\n\nThis is an original game, but just doesn't appeal to me. Yet _another_ game from Colovini, whom I'm not a fan of.\n\n[Randomness can be too much of a factor here, but it's possible to verify it only after a few games]",
    "timestamp": 1625695200
  },
  {
    "username": "VibroChimp",
    "rating": 6.0,
    "comment": "Neat game, but the strategic choices feel a little too constrained for my taste. There are a lot of other area control games that I’d rather play before I choose this one.",
    "timestamp": 1715896800
  },
  {
    "username": "Stas",
    "rating": 6.0,
    "comment": "Rating based on one play. Good 3-player game.\n\nLast played: April 2007",
    "timestamp": 1710630000
  },
  {
    "username": "fourquartets",
    "rating": 6.0,
    "comment": "Found this one to be a little too dry for our tastes and a bit too swingy with the dice. Have only tried it at 2p but J tried it with more and did not improve his take on it. I liked it abit more than him but I was also good at it.",
    "timestamp": 1708210800
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Very original area majority game\n\n- Some design choices make it feel old",
    "timestamp": 1708038000
  },
  {
    "username": "djnesq",
    "rating": 6.0,
    "comment": "This one is growing on me, but I wonder whether it ever makes sense to place a cube in the territories. Also, the ending sometimes comes too abruptly.",
    "timestamp": 1707433200
  },
  {
    "username": "fnord23",
    "rating": 6.1,
    "comment": "venice connection",
    "timestamp": 1705532400
  },
  {
    "username": "cbazler",
    "rating": 6.0,
    "comment": "A good tactical abstract game with just enough randomness to keep it from feeling too chesslike. The circular track allows you to plan several turns in advance, and competition over color majorities/territories can get tense.\n\nI will say it's not uncommon for a runaway leader to develop if one player gets one or two tough islands to take, but thankfully the game isn't terribly long.",
    "timestamp": 1705186800
  },
  {
    "username": "JoshuaStarr",
    "rating": 6.0,
    "comment": "A very pure area control game where the game is about when dominance is checked.\n\nI could see how the game could possibly devolve into an incremental stalemate, so I will need to see if this becomes an issue with more plays.\n\nI must admit that the game is about as dry as they come though.",
    "timestamp": 1700262000
  },
  {
    "username": "sh4mike",
    "rating": 6.0,
    "comment": "A good abstract puzzle, but bland across the board.",
    "timestamp": 1699916400
  },
  {
    "username": "stephaniepa",
    "rating": 6.0,
    "comment": "An abstract game where the majority rules. It's an older version of Eriantys, which is much prettier but essentially the same game.",
    "timestamp": 1688162400
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Played it, but did not make a giant impression on me, forgettable",
    "timestamp": 1759442400
  },
  {
    "username": "ThingsThing",
    "rating": 7.0,
    "comment": "2.58 Complexity Played @ 4P\nNormally I'm not a big fan of any type of Co-Op, but working together in teams against other teams, without saying a word, was a really fun experience.\nHeads up your teammate maybe prone to facepalming!\nSlammed the first game due to the other team, not being able to read each other's intent.\nSecond game I made two costly mistakes that cost us game!\nHilarious, adds another layer thanks to the communication rule!\nThanks to the no communication rule, this game does not suffer from anyone player on the teams to become the Alpha Gamer.\nI'll admit no communication left me befuddled, amused, frustrated, but feeling like I accomplished something when fusing lands or conquering others!\nConsidering buying this game!!!",
    "timestamp": 1759356000
  },
  {
    "username": "shammois",
    "rating": 7.0,
    "comment": "Very dynamic, very interactive game of control. For whatever reason - perhaps my entirely subjective aversion to pure abstracts, which only Knizia seems to shrug off - it doesn't quite sing to me in the same way as, say, Medina, Mexica, or Babylonia do. But it's solid.",
    "timestamp": 1758492000
  },
  {
    "username": "Euroman",
    "rating": 7.0,
    "comment": "Fun game! Thinky strategy but not a brain burner.",
    "timestamp": 1758405600
  },
  {
    "username": "Takhyon",
    "rating": 6.5,
    "comment": "Re: \"Eriantys\". Even though both Carolus Magnus and Eriantys are still fairly similar in gameplay feel, I prefer basically all the small rules changes they made into Eriantys. IMO pretty much the only thing this older version has going for it anymore is the regions being polyhexes that lock together nicely. However that minor fun production gimmick is no way worth it to seek out this version, even if you don't happent to like the theming or the art style of Eriantys. That's because I've found out that old beige euros like this one are nowadays so visually off-putting to most modern board gamers that they would rather spontaneously combust than sit down to play them.",
    "timestamp": 1756504800
  },
  {
    "username": "AMERICANBOYBAND",
    "rating": 8.0,
    "comment": "Comments\nLove how the board shrinks and the potential for big swings.",
    "timestamp": 1760133600
  },
  {
    "username": "dariodero",
    "rating": 7.5,
    "comment": "Ottimo con tre giocatori. Piuttosto impegnativo.",
    "timestamp": 1755727200
  },
  {
    "username": "Major Geek",
    "rating": 8.0,
    "comment": "7/11/25",
    "timestamp": 1752876000
  },
  {
    "username": "wread",
    "rating": 8.0,
    "comment": "Evergreen",
    "timestamp": 1747951200
  },
  {
    "username": "Korrun",
    "rating": 8.0,
    "comment": "Initial rating (2024): 7.5\n\nWant to play some more. I really like the idea, but not sure if the random cube draw is too impactful.\n\nInteresting area control game that makes you balance your control of each color with your control of the board.",
    "timestamp": 1747864800
  },
  {
    "username": "trodat123",
    "rating": 9.0,
    "comment": "this is another \"old German game\" with simple rules and a phantastically engaging gameplay. The dice might turn off some strategic gamers but I really like it because it takes away some of the aspects you have to consider. It is really cool to see in which colours you can get the majority or keep it and adjust your strategy to it. The biggest problem is that you can be in a very bad situation early on when you just always end up \"second\" and just cannot change this state because you get the wrong colours but it happens seldomly and the game is pretty short so that's not a big of a deal to me.",
    "timestamp": 1759615200
  },
  {
    "username": "sorcretic",
    "rating": 9.0,
    "comment": "Feb. 2025 #33: I enjoy stock games, but I am often frustrated by their linearity. Your returns from a company are proportional to the number of shares you own, so gaining one more share doesn't change things dramatically, and your score is often closely correlated to another player's who has similar shares. This works to create runaway leaders and hinders large swings of fortune. Carolus Magnus (as well as The King is Dead, Pax Pamir 2E, etc.), on the other hand, allows for this by replacing linear stocks with majorities. If you have one more share in blue, you get all the benefits, not just a marginal increase. In Carolus Magnus, you might take over a color in one turn, grab a territory, pivot to a different color in the next, and rapidly consolidate into a win. This leads to a relatively short, highly dynamic game that's a blast to play.\n\nJul. 2024 #33\n\nJan. 2024 #30: There's a mini-genre of \"two-level area majority\" games, including The King is Dead, Turncoats, and even Pax Pamir, but for my money Carolus Magnus (and the reprint Eriantys) is the best. It plays in under 45 minutes, but has huge potential for big swings and clever tactics. Some randomness in dice rolling is alleviated by playing the bag draw variant. Or, just play again!",
    "timestamp": 1750802400
  },
  {
    "username": "ciceroni",
    "rating": 9.0,
    "comment": "A lot of tension and interesting decisions in this unassuming box. So far I have only played with two players which works very well, but I assume it is even better with more.",
    "timestamp": 1739401200
  },
  {
    "username": "DrGraph",
    "rating": 8.5,
    "comment": "Great game for 2 or 3 players. Don't know why it's rated so low on BGG.",
    "timestamp": 1715119200
  },
  {
    "username": "c_crs",
    "rating": 9.0,
    "comment": "Absolute banger",
    "timestamp": 1714860000
  },
  {
    "username": "baltibob",
    "rating": 10.0,
    "comment": "Great combination of game mechanics make this challenging and very enjoyable.",
    "timestamp": 1677193200
  },
  {
    "username": "zenpunk",
    "rating": 10.0,
    "comment": "Another Colovini masterpiece.",
    "timestamp": 1659304800
  },
  {
    "username": "hurricanej",
    "rating": 10.0,
    "comment": "Probably my favorite 3-player game.",
    "timestamp": 1612047600
  },
  {
    "username": "ridgebacks",
    "rating": 10.0,
    "comment": "My wife loves this game.",
    "timestamp": 1609455600
  },
  {
    "username": "kataclysm",
    "rating": 9.5,
    "comment": "2014.04.21 It's enjoyable and there's a lot of room for strategy and plotting. There's a definite social reading / theory of mind aspect involved in the selecting of the number discs at the beginning of a round. The turns move quickly: all you do is place three cubes and move the emperor token. But within that quick turn, you've got a great deal of swaying power. The area control battles feel Tigris & Euphrates-y, only more streamlined. The pacing feels right in that the game speeds up when things start getting dicey: since the 15 territories merge, near the end of the game you might have only 5 territories, meaning the emperor moves around them much more speedily. Really fun. (Based on a two-player session.)\n\n2014.05.03 Upping the rating. This is the Ticket to Ride of area control games.\n\n2015.02.22 Had to up it even more. It's just that good. Gets more fun with every play.",
    "timestamp": 1599948000
  }
]