[
  {
    "username": "Pandorzecza",
    "rating": 1.0,
    "comment": "No",
    "timestamp": 1629842400
  },
  {
    "username": "isfella33",
    "rating": 2.0,
    "comment": "A boring game about currency collection. Almost more boring than actually collecting coins and cash from other nations, something I have done and would rather do than play this game.",
    "timestamp": 1554415200
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Fine filler game. A bit linear, alas",
    "timestamp": 1757368800
  },
  {
    "username": "leisenstein",
    "rating": 4.0,
    "comment": "I like the general idea and mechanism of the game but the luck of your opening and just kind of ruins it. You're opening hand may not determine the winner of the game but it can definitely determine who is NOT going to win.\n\nIf you're opening hand has $90 in it and the person to your right has $240, it's hard to recover from that.",
    "timestamp": 1659218400
  },
  {
    "username": "Nijoth",
    "rating": 5.0,
    "comment": "Didnt work on 3, nerds to be trird at higher player counts",
    "timestamp": 1759960800
  },
  {
    "username": "PickledPepperedPlum",
    "rating": 5.0,
    "comment": "Play count: 3\n\nThe Good:\n+Room for somewhat agonizing decisions of whether you give up what you've collected thus far to potentially bigger gains.\n+Room for tracking other players.\n+There is a sense of timing/pacing, where you can have cards come and go from your hand, and back to your hadn for the final play.\n\nThe Not So Good:\n-You can find yourself holding onto 15-20 cards in one hand, which can be tough to handle, especially if cards are sleeved.\n-With the straightforward set collection, you may lock yourself into certain playstyles. In other words, once you complete a triplet, you're less likely to ever spend those cards. The triplet scores you 100 points on its own. Why give it up?\n\nOther Thoughts:\n-Need more plays at 3+ player count to get a better sense of the game.",
    "timestamp": 1758837600
  },
  {
    "username": "Sindre",
    "rating": 6.0,
    "comment": "A fine game. Great for the time.",
    "timestamp": 1756159200
  },
  {
    "username": "xionc",
    "rating": 6.0,
    "comment": "Quite a nice betting game",
    "timestamp": 1752098400
  },
  {
    "username": "dusteppe",
    "rating": 7.0,
    "comment": "Very pleasant set collection game that feels like simple, more streamlined version of Cat Blues. A lot of interactivity in that you bid for cards from the market but also for other player's hand, so you need to be careful about what you pay in order to get what you need. I suspect card counters are going to fare much better than tactical players, but that's true of almost every card game by Knizia...however, there is enough opacity to keep things interesting. The Allplay production is very nice.",
    "timestamp": 1760911200
  },
  {
    "username": "Cuchulainn1795",
    "rating": 8.0,
    "comment": "Fun game with art I find much more appealing than Allplay's new version. From what I understand, Allplay has changed the rules slightly, and by all accounts, they've definitely improved the game. However I don't know very much about these changes so can't really say anything else about them. My version is fun however, so if Allplay has only made it better, kudos to them!",
    "timestamp": 1759788000
  },
  {
    "username": "DanFred",
    "rating": 9.0,
    "comment": "Reiner Knizia easily has the best track record of any designer I have played. Even his not as well known stuff is amazing. I love Money! A great game that feels like Arborteum is a way as you constantly want to get cards but not give them up and many time you have to make some tough choices and give up good stuff to get even better stuff hopefully further down the road. I love hand management and set collection games and Money does not disappoint.",
    "timestamp": 1734217200
  },
  {
    "username": "Cyrsal",
    "rating": 10.0,
    "comment": "KS",
    "timestamp": 1760392800
  }
]