[
  {
    "username": "Victoria_hermit",
    "rating": 1.0,
    "comment": "OMG! So boring, SO SO BORING! Sail boat combat nightmare for dice rollers.",
    "timestamp": 1667080800
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "Plotting movements for Sailing vessels = Plodding movement -- just not as relentlessly boring as in submarine games, if that's a consolation. There are much better systems to simulate the glorious Age of Sail out there: don't waste your valuable gaming time here.",
    "timestamp": 1286661600
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1633557600
  },
  {
    "username": "John Rogers",
    "rating": 2.0,
    "comment": "The game is 30+ years old and it shows. The rules need streamlining and updating, the components suck when compared to modern war games, and the learning curve is high for anything above the base game. Really what this comes down to is a 2 hour plus exercise in move-fire-move; rinse and repeat. For what it offers it should be no longer than 60 minutes max.",
    "timestamp": 1489359600
  },
  {
    "username": "WilcoxDave",
    "rating": 3.0,
    "comment": "Too tedious for me.",
    "timestamp": 1522274400
  },
  {
    "username": "John Vasilakos",
    "rating": 3.0,
    "comment": "Dated, with several problems, like a boarding system that is way too effective , but can be fixed with House rules",
    "timestamp": 1249855200
  },
  {
    "username": "B_Moores",
    "rating": 4.0,
    "comment": "I've probably rated this far too low. It does work",
    "timestamp": 1706482800
  },
  {
    "username": "Electric Joe",
    "rating": 4.0,
    "comment": "Long the standard of Age of Sail board wargames, its basic model has been improved or at least tinkered with by any number of designers since, and bested by Close Action.",
    "timestamp": 1630101600
  },
  {
    "username": "beardandglasses",
    "rating": 5.0,
    "comment": "Thrift/yard sale find",
    "timestamp": 1736290800
  },
  {
    "username": "Massyman",
    "rating": 5.0,
    "comment": "Got this AH classic back in the 70's. Probably has held up better than other games of the same age. Not beyond possibly getting it out again sometime. I wouldnt seek it out to buy though if something happened to my copy.",
    "timestamp": 1728856800
  },
  {
    "username": "Carlos Palomino",
    "rating": 5.0,
    "comment": "Of the 25-or-so hex-and-counter wargames from the 70's, I find this second only to Panzergruppe Guderian in lasting value.",
    "timestamp": 1713996000
  },
  {
    "username": "RommelDAK",
    "rating": 5.0,
    "comment": "I guess I'm one of the few people who didn't like it, but I gave it to a wargamer who was lusting after it!",
    "timestamp": 1641164400
  },
  {
    "username": "hwtrtgp",
    "rating": 6.0,
    "comment": "Good as a variety change of pace from other (and probably better) games.",
    "timestamp": 1741474800
  },
  {
    "username": "exceedinglywell",
    "rating": 6.0,
    "comment": "unpunched",
    "timestamp": 1678230000
  },
  {
    "username": "mothertruckin",
    "rating": 6.0,
    "comment": "Has the feel of a good classic. I like a game with a bit of paperwork. Probably won't get much play out of it since I'm less into naval warfare than other topics.\n\ngave to Miller.",
    "timestamp": 1673391600
  },
  {
    "username": "dderidex",
    "rating": 6.0,
    "comment": "(Review on 2 non-logged plays) This game is a lot of fun. Not much to say about it - it's an Age of Sail combat game. The ships have pretty basic weapons, but, then, it's age of sail. They fire cannons. That's it. Damage is recorded with tracks for hull and sails - more of each for bigger ships. It's an easy to play game and record keeping is not terribly rough with it, allowing fairly large numbers of ships to be involved in the actions in a simple 2-player game during an evening.",
    "timestamp": 1669330800
  },
  {
    "username": "caltexn",
    "rating": 6.5,
    "comment": "Loved the Trafalgar scenario. A few other balanced scenarios that were enjoyable to play, facing the grapeshot, boarding, and wind issues making for an immersive game. Second behind Midway of my all time favorite war games.",
    "timestamp": 1754344800
  },
  {
    "username": "brooksre",
    "rating": 7.0,
    "comment": "Fun to play. Excellent use requiring planning of future moves.",
    "timestamp": 1738710000
  },
  {
    "username": "ReignsEternal",
    "rating": 8.0,
    "comment": "box tops looks rough, however the game is unpunched and everything looks real clean inside. Bought at garage sale.",
    "timestamp": 1750284000
  },
  {
    "username": "dylansofia",
    "rating": 8.0,
    "comment": "Played this to death in the late 70's....it was mind blowing at the time. Very nostalgic...but still plays well today.",
    "timestamp": 1744322400
  },
  {
    "username": "Gutzwald",
    "rating": 9.0,
    "comment": "classic",
    "timestamp": 1755813600
  },
  {
    "username": "panzerfaust501",
    "rating": 9.0,
    "comment": "Played this classic too many times to remember! Always fun.",
    "timestamp": 1739487600
  },
  {
    "username": "mbryant01",
    "rating": 10.0,
    "comment": "Outstanding age of sail tactical game. Game by which all other age of sail tactical games are compared. Living rules tournament edition rules makes this the best set of tactical rules in my humble opinion. Always willing to play. Add miniatures and this is the \"cat's meow.\" I have been a historical war gamer for more than 50 years, and this is my favorite board war-game.",
    "timestamp": 1753308000
  },
  {
    "username": "x6ftundx",
    "rating": 10.0,
    "comment": "Best wooden ship game ever",
    "timestamp": 1745100000
  }
]