[
  {
    "username": "Dice Driven Gamer",
    "rating": 1.0,
    "comment": "Ten minutes to set up. Play for 20 seconds. Fun...",
    "timestamp": 1468792800
  },
  {
    "username": "Spinner158",
    "rating": 1.0,
    "comment": "remove 1, crash\nremove 1, crash\nremove 1, crash\nremove 1, no crash... winner!",
    "timestamp": 1462226400
  },
  {
    "username": "zarkov",
    "rating": 1.0,
    "comment": "the fastest game in the world, 30 seconds to set up and another 30 seconds to play. Often somebody doesn't do anything before the game is over.",
    "timestamp": 1387494000
  },
  {
    "username": "quietcorn",
    "rating": 2.0,
    "comment": "This is a cute Dexterity game where you try to remove objects from a disk balanced on a ball and stick without tipping the thing over. There's a knack to setting the thing up. The game has some fun tension, but my group was unbelievably bad at the game, causing it to fall pretty much every round. I wasn't thrilled with the damage this game caused my wooden table when it fell, or the big loud BANG it makes when it falls. I like this game, but I don't feel it's worth the cost of refinishing my table, and I don't think it's better than other Dexterity games I own.\n\nThis game features a wheel of action options. Each turn, everyone secretly selects the action they want on their wheel and simultaneously reveals. If players went to one action more than another, the ability of that action area gets halved. The board may make the game look like a point salad, but everything ties together tightly so you can't ignore anything the way you do with point salad. Mechanism-wise the game is very familiar. There's little new and different happening here, but it's a competent remix of familiar mechanisms. The component quality is also very nice. The magnetic wheel in the center of the board is especially cool.\n\nHowever, I found the experience of play to be somewhat frustrating. Since the mechanisms are so intertwined, everyone needs to do every action, which makes it difficult to predict where other players will go. Having several turns in a row stuck with the half action penalty is a major sandbag to whatever plans you had. Guessing what your opponents will do depends a lot on your ability to read their game state from their personal tableau featuring cards and tokens with small, uncolored icons upside down and from across the table. This isn't a problem unique to this game, but frustrating none the less.",
    "timestamp": 1716415200
  },
  {
    "username": "Pandorzecza",
    "rating": 1.5,
    "comment": "Nie lubię takich gier",
    "timestamp": 1639522800
  },
  {
    "username": "Ange_Berlin",
    "rating": 2.0,
    "comment": "Wow. Ten minutes of setup for a 45 second game? Oh boy",
    "timestamp": 1579474800
  },
  {
    "username": "dshrier",
    "rating": 3.0,
    "comment": "Setting up is a challenge before even playing the game. Looks better than it plays.",
    "timestamp": 1601244000
  },
  {
    "username": "Destrio",
    "rating": 3.0,
    "comment": "not really a game and more of a practice of balancing and measuring weight by feel.",
    "timestamp": 1511650800
  },
  {
    "username": "pickboy87",
    "rating": 3.0,
    "comment": "Too much setup for not enough payout. Interesting concept, but I can't say I'll be buying it. Nice pieces though and the \"scale\" variant is hilariously awesome.",
    "timestamp": 1459548000
  },
  {
    "username": "aaj94",
    "rating": 4.0,
    "comment": "Excellent, if frustrating, stacking game. Fun pre-game-night distraction!",
    "timestamp": 1734562800
  },
  {
    "username": "AmassGames",
    "rating": 4.0,
    "comment": "Clever but poor balancing game. Like beasts of balances, you get few turns. In this game, lucky to get one\n\nGoogle AmassGames for more",
    "timestamp": 1706482800
  },
  {
    "username": "luija",
    "rating": 4.0,
    "comment": "5+",
    "timestamp": 1645484400
  },
  {
    "username": "fuzen",
    "rating": 5.0,
    "comment": "Can be a little chaotic, with loud, crashing wipeouts aplenty. The wipeouts are actually a bit of a problem, since the pieces bounce all over the place and it can be a turnoff for many. Still, tremendous table presence and far more interesting than Jenga.\n\nUpdate: too chaotic with too much loud crashing / cleanup for the game that you do get.",
    "timestamp": 1732662000
  },
  {
    "username": "pmagnus",
    "rating": 5.0,
    "comment": "Fun, more as a pastime than as a game. It’s lame if the platter always crashes first time around the table. So the fun is mostly in figuring out how to get most or all of the pieces off, rather than in the competition.",
    "timestamp": 1731279600
  },
  {
    "username": "adamscott",
    "rating": 5.0,
    "comment": "Hard to set up the game. Decently fun for a play or two.",
    "timestamp": 1707433200
  },
  {
    "username": "ying8383",
    "rating": 5.0,
    "comment": "有很精緻的桌遊道具，但要維持平衡也不是一件容易的事，需要動動腦想出相對位置、拿對適當的重量。",
    "timestamp": 1704754800
  },
  {
    "username": "HsinYi",
    "rating": 5.0,
    "comment": "嚴重懷疑他根本沒要給人玩的意思，從遊戲設置開始就在考驗平衡，要玩要先想辦法把木板放到軟木塞球上，比遊戲本身還難！",
    "timestamp": 1703804400
  },
  {
    "username": "tracylin",
    "rating": 5.0,
    "comment": "可以困難也可以簡單的平衡遊戲!下方的圓柱上有一顆珠子，使得平衡板容易搖晃，玩家必須在平衡的狀態下拿下上方的幾何積木，如果翻倒就輸了。如果要讓特教班的孩子訓練手部的精細動作，還可以將珠子撤除，讓板子維持平面狀態，減少挫折感。",
    "timestamp": 1698530400
  },
  {
    "username": "kastel",
    "rating": 6.0,
    "comment": "F",
    "timestamp": 1733439600
  },
  {
    "username": "iadena",
    "rating": 6.0,
    "comment": "Fast alright dexterity game. It is dependent on the group based upon how much fun you will have. You want to take pieces off the table without it falling over. Most points wins. Negative points for those who cause the table to fall over. I like it more than Jenga. It a good filler because I am concerned with how long the charm will last if it was chose for long play session. No need to own.",
    "timestamp": 1724191200
  },
  {
    "username": "p6232056",
    "rating": 6.0,
    "comment": "遊戲規則非常簡單，但是要想辦法平衡就有挑戰，適合給特教班的孩子玩，練習動作控制及注意力",
    "timestamp": 1704668400
  },
  {
    "username": "lindaaaaa",
    "rating": 6.0,
    "comment": "這款遊戲真的很考驗手眼協調，每次拿積木都要小心翼翼，不然就會慘遭淘汰。遊戲的品質很好，積木和圓盤都是木頭製的，很有質感。",
    "timestamp": 1704063600
  },
  {
    "username": "hanru",
    "rating": 6.0,
    "comment": "平衡天使。一片放在基座上的木盤承載著積木，玩家輪流拿取積木，若沒有根據重力法則，木盤會開始傾斜，因此要試著讓整個基座維持平衡，是一個讓玩家與旁觀者覺得相當刺激的遊戲，可以讓小朋友訓練靈敏操作。",
    "timestamp": 1702162800
  },
  {
    "username": "minminhan",
    "rating": 6.0,
    "comment": "可以用來練習手眼協調、衝動控制，除了要穩定的把拿方塊起來，還要思考盤子斜向哪邊，要拿哪個比較好，適合大小朋友一起玩。",
    "timestamp": 1698620400
  },
  {
    "username": "wwwidonja",
    "rating": 6.5,
    "comment": "A really fun dexterity game that is a bit hindered by the difficulty of setting it up.",
    "timestamp": 1737673200
  },
  {
    "username": "purplecow55",
    "rating": 7.0,
    "comment": "A dexterity game where players are taking objects (cones/cubes/pyraminds of various sizes) off a circle survive balanced on a stand connected by a wooden ball.\nA point for each object collected, -1 for a failed attempt of taking an object off the board, and -4 points for tipping over the board.",
    "timestamp": 1724104800
  },
  {
    "username": "Wiesel",
    "rating": 7.0,
    "comment": "It's great when you manage it to set up the game. You need a very fine hand, so it is a horrobly bad game with clumsy players.",
    "timestamp": 1707174000
  },
  {
    "username": "p00q",
    "rating": 8.0,
    "comment": "It is exactly what you think it is.",
    "timestamp": 1748124000
  },
  {
    "username": "upike",
    "rating": 7.5,
    "comment": "Nothing to get crazy about, but it's a very nice, elegant dexterity game that has some real choices to be made and is challenging enough to be a real game. Suitable for both adults and kids and as a party game. Not a game I would seek out, but if you find it available for a reasonable price, it's definitely worth checking out. Keep in mind that the diameter of the wooden board requires for it to come in a huge box.",
    "timestamp": 1734822000
  },
  {
    "username": "Spe009",
    "rating": 8.0,
    "comment": "很有趣的遊戲！一開始甚至不相信一整個平面可以站立在短柱上。要把一個個小物件拿下來的過程，相當有力學的體驗感。過程中可以自然而然讓玩者體驗重力及力矩的關係。",
    "timestamp": 1697666400
  },
  {
    "username": "Mandychii",
    "rating": 9.0,
    "comment": "透過遊戲可以認識不同的立體圖形，加上每個立體圖形有不同的重量、有的會滾來滾去無法放置在平面上，所以更加有挑戰性！雖然顏色單調不過很刺激",
    "timestamp": 1670886000
  },
  {
    "username": "Phoebechang",
    "rating": 9.0,
    "comment": "考驗平衡及反應的能力，在快要倒下之前還有機會可以調整和移動，因此很適合和學齡前的小孩玩，透過反覆練習可以表現得很好。",
    "timestamp": 1639609200
  },
  {
    "username": "puli9009",
    "rating": 9.0,
    "comment": "當您從搖擺的盤子上取下零件時全部所有零件都灑了一地的畫面真是太經典了，這就是這款桌遊遊戲迷人好玩的地方。平衡動作、小心翼翼是玩這款桌遊必備的技巧，而玩家的專注力與策略就顯得相當重要了！",
    "timestamp": 1638831600
  },
  {
    "username": "Amberlin",
    "rating": 10.0,
    "comment": "是一種訓練動作的遊戲，當然還包含思考選擇哪一個積木離開平衡板，相當需要技巧性，要將擺放所有積木的圓盤放上就很不容易，可以培養孩子耐性、手部精細動作，像疊疊樂一樣既要選擇抽取哪一塊積木、又要保持平衡，抽取時要放慢動作，相當有挑戰性的遊戲，緊張刺激又好玩。",
    "timestamp": 1633989600
  },
  {
    "username": "Friendless",
    "rating": 10.0,
    "comment": "Good fun game, beautifully made. Always played very casually chez moi, and maybe not as absorbing as it could be as a consequence. Although it is not a game I want to play all the time, I've decided to rate it a 10 as it's absolutely genius design and succeeds magnificently at what it does.",
    "timestamp": 1550876400
  },
  {
    "username": "goinup",
    "rating": 10.0,
    "comment": "A great game. We love to play. It is fun, exciting, intense ...",
    "timestamp": 1465941600
  }
]