[
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "Tedious, worthless, horrendous AH garbage.",
    "timestamp": 1719525600
  },
  {
    "username": "feda05",
    "rating": 1.0,
    "comment": "POINTLESS!!! It completely depends on the luck of the draw.",
    "timestamp": 1261868400
  },
  {
    "username": "Mindmaster21",
    "rating": 2.0,
    "comment": "Une seule partie au compteur, je n'ai pas aimé le système qui m'a donné l'impression d'un grand vide stratégique. Un jeu d'ambiance et d'apéro qui ne me donne pas envie de rejouer.",
    "timestamp": 1309989600
  },
  {
    "username": "akapastorguy",
    "rating": 2.0,
    "comment": "My memories of this game are extraordinarily negative - combining the randomness of the cards with the negotiation element didn't work for me. (I felt the same way about the Alea game about the 7 wizards.)\n\nThere's a new version which some in my group really like - I probably ought to give it another try.",
    "timestamp": 1248040800
  },
  {
    "username": "domus_ludorum",
    "rating": 3.0,
    "comment": "Too long for what it is, too random for how long it is, huge slices of luck, a rich-get-richer aspect and despite a great theme, the game displays thematic dissonance in the form of the players contributing to both the Axis and the Allies - who/what actually are you.\n\nWas looking forward to playing this but very disappointed.",
    "timestamp": 1557698400
  },
  {
    "username": "MonteCristo23",
    "rating": 3.0,
    "comment": "The theme is pointless, as it makes no difference as to which side you are from round to round. Pretty boring.",
    "timestamp": 1275516000
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "communal cards\n strategically shallow\n tediously tactical\n lousy ludonarrative",
    "timestamp": 1582585200
  },
  {
    "username": "djnesq",
    "rating": 4.0,
    "comment": "Some of the historical info on the cards is interesting, but creating enough strength to win the encounters usually means too much uncomfortable negotiation.",
    "timestamp": 1515625200
  },
  {
    "username": "Yvan13",
    "rating": 5.0,
    "comment": "Jeu de cartes, très aléatoire, avec un peu de bluff",
    "timestamp": 1684015200
  },
  {
    "username": "ljw74us",
    "rating": 5.0,
    "comment": "e4",
    "timestamp": 1421449200
  },
  {
    "username": "aaronsibley",
    "rating": 5.0,
    "comment": "yawn",
    "timestamp": 1412200800
  },
  {
    "username": "TomVasel",
    "rating": 5.0,
    "comment": "Very fun with a good crowd, but can drag down if people play too slowly...",
    "timestamp": 1406325600
  },
  {
    "username": "Rygel",
    "rating": 6.0,
    "comment": "A card game about WWII naval battles. OK game. Fun and light.",
    "timestamp": 1731279600
  },
  {
    "username": "Rallye72",
    "rating": 6.0,
    "comment": "boxed, AH card game\n\n2-6 players",
    "timestamp": 1692568800
  },
  {
    "username": "SeanC",
    "rating": 6.0,
    "comment": "Rating based on vague recollection. It was reasonably evocative of submarine warfare - I never felt I was just \"playing cards\".",
    "timestamp": 1652911200
  },
  {
    "username": "brennanr",
    "rating": 6.0,
    "comment": "Maybe a bit more basic than I expected given all the buzz about this. (After 1 game)\nTraded away. OK but not good enough to keep.",
    "timestamp": 1578783600
  },
  {
    "username": "JCovaleski",
    "rating": 7.0,
    "comment": "I enjoy this, even though I am not very good at it.",
    "timestamp": 1585519200
  },
  {
    "username": "ewokracoonbreder",
    "rating": 7.0,
    "comment": "I enjoy Pacific Typhoon much more. The play in this game ends up being much more cagey with out as many opportunities for crazy hands.",
    "timestamp": 1534370400
  },
  {
    "username": "Ben_Bos",
    "rating": 8.4,
    "comment": "Lots of luck but easy going and a little WW2 flair\nSimply put: a good card game.\n\nUPDATE: the newest version (called Atlantic Storm Admiral) added SOLO play., with solo rules found on the BGG website of the game.\n\nI upgraded this now to a 8.4. The game deserves it.",
    "timestamp": 1738969200
  },
  {
    "username": "Rogue_ace",
    "rating": 8.0,
    "comment": "*\nPaid 50 at convention for it. Great deal at the time.",
    "timestamp": 1694037600
  },
  {
    "username": "Paul Risner",
    "rating": 9.0,
    "comment": "I enjoy this game probably more than any other. I play it once a year or so, at the World Boardgaming Championships, and look forward to the table-talk, and gamesmanship.",
    "timestamp": 1593208800
  },
  {
    "username": "Peter Bartlett",
    "rating": 8.5,
    "comment": "1 play shown but really there have been many more at conventions that I haven't remembered to add. This is a great game, fun to play.",
    "timestamp": 1538863200
  },
  {
    "username": "kwhite1",
    "rating": 10.0,
    "comment": "P",
    "timestamp": 1757973600
  },
  {
    "username": "Imagine",
    "rating": 9.5,
    "comment": "Nice game, beautiful artwork, interesting yet unnecessarily complex mechanics. Needs at least 4 people to play. Shines with 5.",
    "timestamp": 1674687600
  }
]