[
  {
    "username": "Dr Brian",
    "rating": 1.0,
    "comment": "Diplomacy is a great game, but this never got any interest from anyone. Perhaps because we are not major Dip players. I'm sure it is better than my low rating.",
    "timestamp": 1304373600
  },
  {
    "username": "Kamikazi",
    "rating": 2.0,
    "comment": "It's diplomacy with a twist. Unfortunately that twist is simply putting the same game on a different map. This is not a game that is improved by a simple change of scenery.",
    "timestamp": 1195772400
  },
  {
    "username": "jimok",
    "rating": 3.0,
    "comment": "Even when I was a hard-core Diplomacy addict, I hated this game. Finally sold it.",
    "timestamp": 1705014000
  },
  {
    "username": "EarlofBronze",
    "rating": 4.0,
    "comment": "Played pre BGG",
    "timestamp": 1682287200
  },
  {
    "username": "zurn",
    "rating": 5.0,
    "comment": "One of the worse popular variants, there are serious balance issues: France doesn't have a chance, Russian/Turkish strategy is somewhat single-minded (the eastern Russian centres are less interesting than you think), and Japan, the UK, and Holland enjoy too good starting positions with better access to clusters of centres than the rest.",
    "timestamp": 1414274400
  },
  {
    "username": "msaari",
    "rating": 5.0,
    "comment": "Less interesting than original Diplomacy.\n\nIndifferent.",
    "timestamp": 1362610800
  },
  {
    "username": "dash.jp",
    "rating": 6.0,
    "comment": "• Used. No box, stored in Deluex Diplomacy box.",
    "timestamp": 1725746400
  },
  {
    "username": "rnijholt",
    "rating": 6.0,
    "comment": "Last time I played this was many years ago.",
    "timestamp": 1697925600
  },
  {
    "username": "HerrDoktorWho",
    "rating": 7.0,
    "comment": "Diplomacy can, and is, played on many different maps. This is one. Better than some, worse than others. However, it is professionally produced and that means something.",
    "timestamp": 1625004000
  },
  {
    "username": "GrimacePCH",
    "rating": 8.0,
    "comment": "A great variant to the game, this one taking place in the Far East. Still playable up to 7, but covers very different areas and utilizes countries of Japan, the Dutch, the Turks, China, and then the usual French, British and Russians. This time, though, there are TWO countries spanning the entire board (Russia and Britain). If you've played the base games so many times that you're super familiar with where to move to and the key locations on the Europe map, then look into this game as it has all of the cleverness of the original, but with a new layout that offers all the challenge of the game anew!",
    "timestamp": 1727128800
  },
  {
    "username": "catosulla",
    "rating": 8.5,
    "comment": "Good game. Only danger appears to be with letting the UK get too powerful. Otherwise, I can play this version or the original, it makes little difference to me. As always, it is the mix of players and personalities that makes or breaks this game. I have played this twice thus far, once as Holland and once as the UK and I won as the UK the second time. Good game overall.\n\nWhen I let this go, I found a bunch of old order sheets from a game my students played in the strategy club I sponsored inside from back in 2008.\n\nLet go NK 7/11/25.",
    "timestamp": 1752184800
  },
  {
    "username": "GlorifiedGutsyGaming",
    "rating": 10.0,
    "comment": "A new map in a slightly newer time period than the original. I had a great time with it. There is a remake coming that I'd love to get a look at too. Russia gets a train mechanism to move through their country faster, and some islands have bridges. I'd like to play more of it to get a better feel of the different powers.",
    "timestamp": 1759096800
  }
]