[
  {
    "username": "KlausScharpf",
    "rating": 1.0,
    "comment": "Felt totally random and without any control. Sad, since the plastic pieces looked just great",
    "timestamp": 1265670000
  },
  {
    "username": "Akke",
    "rating": 2.0,
    "comment": "The basics of this game are fine and it can be fun if luck evens out at the beginning, giving all players some pumps and money to spend. The luck of the dice can remove one player from contention after a few rounds because rich get richer in this game. The new version can make this even worse because economy changes tend to happen every four turns, allowing the same players to sell gasoline at the best price all game.",
    "timestamp": 1579042800
  },
  {
    "username": "Ironmanowar",
    "rating": 3.0,
    "comment": "Too random. Imagine the market finally gets to prosperity, every player gets to sell stuff but I can’t because before the turn order gets around to me again it dumps. Yep everyone in my company was in a coma for a year we missed it.",
    "timestamp": 1603926000
  },
  {
    "username": "Lowengrin",
    "rating": 4.0,
    "comment": "Prior to playing this one, I may have mixed it up in my head with Peak Oil as McMulti's other name is Crude: The Oil Game. In any case, I was expecting a map of some sort and not a simple grid for a player board. I was therefore expecting something less abstract and not something that feels almost \"roll and write\". In fact, if the spaces for sold assets weren't freed up but just X'd off, it could be a roll and write. My biggest problem with the game was it's total randomness. There are 36 squares and each square has exactly a 1 in 36 chance of activating. There are six rows and six columns, each has exactly a 1 in 6 chance of activating. So did it really matter if you put a drill in the 1-1 spot or in the 3-6 spot? No, it didn't unless you are superstitious. The only meaningful decision when placing an object was that of keeping spaces open for 2x2 refineries. I suppose if you wanted to, you could place in the same spaces as your opponents (or not) so when the shared die activated a space, you'd both get the same thing (or not). Whether copying an opponent's grid would really have any real impact, I have my doubts as the market fluctuates between each player's turn. The only meaningful decision in this game is what to buy and when and often that is dictated by how much money you have available at the time as much as it is by market conditions.",
    "timestamp": 1740697200
  },
  {
    "username": "FranklinTV",
    "rating": 5.1,
    "comment": "Yet to be played (31/12/12). Apparent classic reprinted (July 19). I would rather just play Acquire as an economic game. UPDATE: After a decade, unplayed, I think its time to let it go (Rating: 5.125, Dec 2022)",
    "timestamp": 1672441200
  },
  {
    "username": "Katabrok",
    "rating": 5.0,
    "comment": "Catan with more luck and longer and no negotiation (but this is good). Well, a bad game.",
    "timestamp": 1568412000
  },
  {
    "username": "dosxtres",
    "rating": 5.5,
    "comment": "?",
    "timestamp": 1741906800
  },
  {
    "username": "bigfranco",
    "rating": 5.6,
    "comment": "Archived",
    "timestamp": 1732489200
  },
  {
    "username": "Lendengold",
    "rating": 7.0,
    "comment": "Gereon\n(gekauft)",
    "timestamp": 1759528800
  },
  {
    "username": "larryonov",
    "rating": 8.0,
    "comment": "Best: 4",
    "timestamp": 1738105200
  },
  {
    "username": "jwilhm",
    "rating": 9.0,
    "comment": "Sell",
    "timestamp": 1725832800
  },
  {
    "username": "Gernspieler",
    "rating": 10.0,
    "comment": "One of the best economic games",
    "timestamp": 1199574000
  }
]