[
  {
    "username": "tbrofromspace",
    "rating": 1.0,
    "comment": "Cursed.",
    "timestamp": 1743631200
  },
  {
    "username": "ajie426",
    "rating": 1.0,
    "comment": "Condottiere，简单的游戏，但是要打很久，第三轮被掀了\n策略就是开始打小战力，同时不给自己的下家偷鸡。\n感觉没啥操作感，完全在看手气",
    "timestamp": 1703286000
  },
  {
    "username": "manux1251",
    "rating": 1.0,
    "comment": "De lo peor que he jugado. Nunca más.",
    "timestamp": 1581030000
  },
  {
    "username": "jaderaistlin",
    "rating": 1.0,
    "comment": "Gosh, its war with pretty pictures.",
    "timestamp": 1317765600
  },
  {
    "username": "BotD",
    "rating": 1.0,
    "comment": "Major problems in this game. Possibility of stalemate and as hands grow in size a lot of wasted time and frustration. Card play is interesting, the game built around it is not.",
    "timestamp": 1137020400
  },
  {
    "username": "thegreatbandini",
    "rating": 2.0,
    "comment": "Terrible teach hampered this game, but wouldn't play again. Lots of downtime and a customised rule set might have been a factor.",
    "timestamp": 1718920800
  },
  {
    "username": "shayan_sa",
    "rating": 2.0,
    "comment": "It is a bidding game at its core, however, it is so unpredictable that only feels like chaos, 4 players is a bad game for me but 3 players is a disaster! after a few plays, there was no place for this game in my collection.",
    "timestamp": 1648850400
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Strange game",
    "timestamp": 1627164000
  },
  {
    "username": "pablito76",
    "rating": 2.0,
    "comment": "Awful and unuseful map of Italy. Too much conditioned by luck. Basically it is only a card game. It lasted from half hour to 3 hours, independently from the number of players! We tried to play a lot before decreeting its banishment.",
    "timestamp": 1475704800
  },
  {
    "username": "sirkerry",
    "rating": 2.0,
    "comment": "just don't like it",
    "timestamp": 1472335200
  },
  {
    "username": "Luds",
    "rating": 3.0,
    "comment": "Mediocre card game where players feud over territories in a battleline type war with cards where each battle drags on and on and on due to use of multiple special cards. Very little fun and extremely repetitive while excruciatingly long for what it is.",
    "timestamp": 1696024800
  },
  {
    "username": "sodapop1999",
    "rating": 3.0,
    "comment": "This is my first card/ board game",
    "timestamp": 1694296800
  },
  {
    "username": "H4wkins",
    "rating": 3.0,
    "comment": "Did not work with my gaming group. Fell flat after 3 plays.",
    "timestamp": 1670540400
  },
  {
    "username": "dogterom",
    "rating": 3.0,
    "comment": "do not remember it",
    "timestamp": 1667775600
  },
  {
    "username": "benshever",
    "rating": 3.0,
    "comment": "My group really hated this game. Felt lucky with the illusion of control.",
    "timestamp": 1619301600
  },
  {
    "username": "Laslow",
    "rating": 4.0,
    "comment": "Ez az a játék, amit valahogy sosincs igazán kedvem elkezdeni, viszont ha már játszok vele, akkor kivétel nélkül mindig nagyon élvezem, jobban, mint a többi játékot. Azt szeretem benne leginkább, hogy lehetőséget ad blöffölni és folyamatosan más-más taktikával küzdeni a tartományokért. Igaz, két játékos esetén általában terítjük a lapokat, de több játékosnál bejön a képbe az is, hogy hagyhatom a többieket egymással harcolni, és amikor legyengültek, akkor sorra elfoglalni minden tartományt előlük. És mindezt nehéz megvalósítani, mert ha meg már túl gyengék, akkor újraosztás következik, azaz új lapokat kapnak és megerősödnek. Szóval nehéz az egyensúlyt megtalálni, de annyi biztos, hogy minden egyes játékot nagyon szoktam élvezni!",
    "timestamp": 1741906800
  },
  {
    "username": "Wigdogger",
    "rating": 4.0,
    "comment": "Ha, on some level, I can appreciate the harsh feelings that this game brings out. But it's also a sonofabitch of a game, with tons of chaos and mucky card play that's highly dictated by luck. I can't say I was all that compelled to really play this one again.\n\nAnd honestly, it would probably play slightly more tactically at two, three or four players, but playing at five (or six, as we did) just seems wild to me. You have a ton of players with a ton of cards, and yet the whole deck isn't out. So you have this massive amount of variables in other peoples' hands, and then a massive amount of unknown cards not in the game.\n\nAs the map is tightly contested -- first player to win five territories or three adjacent wins the game -- you want to strategically think about when to go for territories and when to hang back. There's sort of a weird card draw mechanic that you can time if most people have run out of cards, but that is really still dictated by random card luck that people have.\n\nJust being honest, I went through about five hands (over two games) where I didn't see one of the special \"drummer\" cards or a single \"10\" strength card. It was mostly a collection of low-strength cards or \"scarecrows\" that let me retreat a troop card from battle. But those just delay the inevitable win for someone else. I think I drew one \"bishop\" in those same five rounds, whereas others had several and could just spike my best cards, even when I waited to play them.\n\nIt's one of those games where I think there isn't really much of a game here. The map is so tight and chaotic that the person who draws two good hands in a row will just win one, two or three battles, controlling key parts of the map. At that point, you're left just floundering, hoping you win a battle or two, but you're ultimately kingmaking somebody and just kind of waiting for the game to end.\n\nI can dig games with timing and tactics that way, but when the card strength and powers are so wildly swingy and imbalanced, it feels more like artifice. Everyone is essentially punching themselves out at key points in order to win a fight, but the person who has card luck will win one extra fight and probably the game, as there's just not room for bad luck or losing a few early fights. Not with that many players.\n\nMaybe there's a nice tactical three-player game here, but what I played might as well have been Munchkin and just bopping each other randomly. Sure, you can card count partially, but you don't know what is in the game and isn't. And if you have a bad hand or two, you aren't winning the game at all. You're kingmaking and counting time.\n\nOh, and demerits to the game for no player aids or reference on the cards for reminding what their powers are.",
    "timestamp": 1741561200
  },
  {
    "username": "fabericus",
    "rating": 4.0,
    "comment": "Fab'\nMarch 2006\nSold\n1x 4-player game\n\nUsed to be a very good game. Unfortunately it did not pass the test of years. A bit to long, a bit unbalanced, a bit rpetitive. Not bad mind you, just outdated. It nevertheless remains one the prettiest games I own.",
    "timestamp": 1695074400
  },
  {
    "username": "chaps357",
    "rating": 4.0,
    "comment": "Good game, with bluffing and a kind of auction mechanism.\nQuite luck dependant I think\nNeed to try it again\nI have a very nice old version",
    "timestamp": 1675724400
  },
  {
    "username": "ayumequi",
    "rating": 4.0,
    "comment": "Only one game but I felt it could be interesting.",
    "timestamp": 1672527600
  },
  {
    "username": "TheLand",
    "rating": 5.0,
    "comment": "You draw some cards, you play some cards, other people cancel the cards you played. A trick-taking game just longer and more complicated than other trick-taking games.",
    "timestamp": 1761033600
  },
  {
    "username": "Sortrose",
    "rating": 5.0,
    "comment": "Card driven area majority game with some fun bluffing opportunities and tactical maneuvers, but ultimately too determined by luck of the draw.",
    "timestamp": 1746223200
  },
  {
    "username": "warlock000",
    "rating": 5.0,
    "comment": "Rating for 3rd edition FFG rules:\nVery simple area control game with a neat bluffing element, but it's too random and unpredictable for my taste.\n\nJust remember - keep the player count low (I would say that 3 players is the sweetspot). Never play this game with more than 4 people, it's no longer a filler game this way, it just drags and the downtime gets unbearable, especially if you run out of cards too fast and all you can do is just sit and watch.\n\nBy the way, there's a really ugly stalemate \"glitch\" in this game, you have to use some homerules or common sense to deal with it.\n\n/update: Reaquired, I need to play it with 2nd edition rules.\n\n/update, February 2025: Played it with the old rules and I disliked it even more, I hate that the bishop is an instant battle ender. It is annoying instead of being tense, you just cancel whatever just happened in the past few minutes and you absolutely cannot plan for it. I'd give this game a 3/10 with classic rules, it feels chaotic and not fun.\n\nThere's something about this game that feels stiff and underbaked. I don't like how new cards enter the game and that it's just impossible to do well with certain hands you are dealt.",
    "timestamp": 1743458400
  },
  {
    "username": "krit1789",
    "rating": 5.4,
    "comment": "Area majority and hand management. Rather bland. The hidden card variant makes the game a bit more interesting, though.",
    "timestamp": 1743116400
  },
  {
    "username": "smurfodeth",
    "rating": 5.0,
    "comment": "There’s a fair amount of the DNA of this game that fits my tastes, but I’d much rather play Taj Mahal within this sort of game space.",
    "timestamp": 1736118000
  },
  {
    "username": "mjhake",
    "rating": 5.0,
    "comment": "Land grab game where you battle by using cards. Too long.",
    "timestamp": 1729980000
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A card based area bidding? game where players are trying to win 4 adjacent regions on a map. Starting with the first player, they will start the auction on any region. Then that player will play a card, and all other players may play a card or pass. Play continues around and around until all players pass. The player with the highest sum will win the region and game play continues until win condition is met.",
    "timestamp": 1729720800
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Fun light area control game, use the old 2E rules they are much better! Can be swingy i.e. it's more poker than bridge.",
    "timestamp": 1724796000
  },
  {
    "username": "Stas",
    "rating": 5.0,
    "comment": "Simple fun bluffing game, but with a bit too much luck and an almost crippling rich-get-richer problem. This was my \"gateway\" into boardgaming.\n\nLast played: GASPcon 2015",
    "timestamp": 1710630000
  },
  {
    "username": "tigerted2k3",
    "rating": 5.0,
    "comment": "1.96",
    "timestamp": 1710543600
  },
  {
    "username": "Brucie_Lee",
    "rating": 6.0,
    "comment": "Uff - I really like this one in some regards and don't like it at all in others. I can't seem to figure out what the best strategy is and always seem to be at the mercy of what cards I am dealt. The mechanic whereby you don't automatically redraw back up to your hand limit after each battle is really cool and forces you to be a bit more careful or cautious when you choose to go \"all in\".\n\nBut I've seen that once players start to get a few regions claimed, the extra cards they do get when we redraw are quite powerful, even if they aren't high value cards as it gives them more options.\n\nSo yeah - I like it a lot but I just can't seem to grasp what I should be doing in order to win.",
    "timestamp": 1758664800
  },
  {
    "username": "nimzo28",
    "rating": 6.0,
    "comment": "Août 2025: Vieille note de février 2017 (8) revue à la baisse. J'éprouve encore du respect pour ce jeu et suis content de l'avoir dans ma ludothèque, mais il faut avouer que j'ai évité les occasions de le proposer lors de mes soirées de jeu des dernières années... ;(",
    "timestamp": 1755468000
  },
  {
    "username": "rharn",
    "rating": 6.0,
    "comment": "Tense area majority game that teaches you about how to stall and not overcommit to the board state. Seems prone to kingmaking and wild swingy games, but maybe that's a feature not a bug.",
    "timestamp": 1755122400
  },
  {
    "username": "Raul Catalano",
    "rating": 5.5,
    "comment": "Interesting game with very good mechanics ... but soo long to play it becomes boring. Pity.",
    "timestamp": 1753653600
  },
  {
    "username": "ZirkvandenBerg",
    "rating": 6.0,
    "comment": "Fantastic group fun. As we got to know it better, passing became more of a feature of the game, which diminishes the fun somewhat. UPDATE: The passing sort of ruins the game. Reducing the rating.",
    "timestamp": 1751925600
  },
  {
    "username": "icheyne",
    "rating": 6.0,
    "comment": "Similar to Ivanhoe, but inferior because of lack of variety, plus it is easy to run away with a win. Best played when all players are of same standard.",
    "timestamp": 1751580000
  },
  {
    "username": "phibilip",
    "rating": 6.0,
    "comment": "PnP\n\nMy Dad likes it which is neat; he's a hard person to find games for. I'm learning that maybe I just don't really like auction games. I don't hate it; I'll play whenever Dad picks it, but I never will pick it.",
    "timestamp": 1751234400
  },
  {
    "username": "kyk10pes",
    "rating": 6.0,
    "comment": "1 play at 6p. Light area control with a bit of hand management. Lots of luck & ran a bit long for its weight.",
    "timestamp": 1750888800
  },
  {
    "username": "LazyMcCrow",
    "rating": 6.0,
    "comment": "3-6",
    "timestamp": 1748469600
  },
  {
    "username": "kilianbognar",
    "rating": 6.0,
    "comment": "As others said: a hand of 10s are better than a hand of 1s. There's not much you can do about it, the wiggle room is that the other players don't know what you have, and whether you have a nuke up your sleeves or not.\n\nI would like it more if the map meant more, and if it didn’t have the chance to stretch past two hands (it just isn't substanital enough to warrant a longer playtime than that). Bacouse of the latter, it's probably better with fewer people than more.",
    "timestamp": 1745272800
  },
  {
    "username": "byfed",
    "rating": 7.0,
    "comment": "Un juego de Cartas con un minitablero de la italia del renacimiento, dividida en 17 estados. Se trata de obtener conquistar 5 estados conectados entre sí siguiendo determinado criterio, o 6 estados no siguiendo dicho criterio. La conquista se realiza mediante enfrentamiento por cartas, con reglas bastante sencillas. Tiene cartas de legionarios, (de poderío militar) y otras cartas especiales que simbolizan el poder de la iglesa, las influencias políticas, las estaciones\nEl juego está bastante bien, aunque el factor suerte tiene más peso del que me suele gustar en un juego.\nLo he probado a cinco, y después de hacerlo mi opinión ha mejorado bastante. Le subo de 6.5->7\n\nMi hermano tiene una copia desde hace muchos años, no se por qué, ni quien se la regaló ni nada, pero como no creo que lo use, ni lo venda, ni haga nada con él, lo añado a mi colección. Está en Nuevo Parque de toda la vida",
    "timestamp": 1760824800
  },
  {
    "username": "SammySnijbonen",
    "rating": 7.0,
    "comment": "I got drawn to this game because of the box art on the FFG edition...\n\nLuckily, the game is fun. The rules are built on two basic skills: hand management and bluffing. Players all get dealt an equal starting hand (in the number of cards, not in their types), and they use it in a series of 'battles' to conquer provinces in Renaissance Italy. The map on the (small) game board is thus used as a scoring track. However, conquering a certain number (depending on player count) of provinces adjacent to each other can also bring victory. So there's a spatial element to the scoring track, too.\n\nThe 'battles' consist of players going clockwise and either choosing to play a card into their active battleline or passing. Passing means they're out of this struggle, but they keep their cards for future use. Battles go on until every player has passed, then the one with the highest valued line gains control of the province. Many of the cards also have special abilities, either augmenting a player's own battle line, removing cards from his enemies' battle lines, or providing bonuses and penalties to all cards played in this battle.\n\nPlayers' hands don't get replenished until all but one of them has no cards left. Then each player gets to draw as many cards as he started with, plus bonus cards for each of the provinces he owns. The player who has cards left can keep some of them. This means that you have to carefully weigh your decision to play another card or to pass, as playing too many cards might mean you gain the current province but are out of the battles for a few others because you lack the soldiers to fight for you. Both bluffing and hand management revolve around this idea.\n\nN.B.: An added bonus is the beautiful artwork that Tomasz Jedruszek - one of my favorite board game illustrators - did on the FFG edition of this game. It is very atmospheric and beautiful to look at.",
    "timestamp": 1759701600
  },
  {
    "username": "AliReza_Ka",
    "rating": 6.8,
    "comment": "It's one of the best if u play with more than 4 player\nAnd if all the player completely know how to play and understand the game completely.\n2 and 3 player mode is not as good as more than 4 and kinda boring too.",
    "timestamp": 1759183200
  },
  {
    "username": "BoomDooger",
    "rating": 6.5,
    "comment": "Chels: 6\nAnt: 7\n\nA fantastic card game of tempo, bluff, and provocation - there's so much play in each hand, the threat of a loss pushing conservative players to lunge, patience rewarded with fuller hands, and the promise of a hand refill tempting players to commit. One of Ant's hidden gems.",
    "timestamp": 1758924000
  },
  {
    "username": "MeeplePerson1776",
    "rating": 6.5,
    "comment": "Currently sitting at 6.5 as I can’t seem to find the right ruleset that works. I agree that only play this at 4 or 5 players. I agree that the Spring cards should be taken out. I agree that win condition should be 3 adjacent cities to win or 5 total anywhere. As far as the bishop, if I ever get a chance to play this again - I would have the",
    "timestamp": 1758664800
  },
  {
    "username": "danielmleitao",
    "rating": 8.0,
    "comment": "Rated: 04/2023\nEdited: -",
    "timestamp": 1760911200
  },
  {
    "username": "TheSlushySnake",
    "rating": 8.0,
    "comment": "Medieval Italy-Themed, Area-Control + Hand Management Game.\n4-6 Players. (Best With 4-5 Players).",
    "timestamp": 1760047200
  },
  {
    "username": "RadiantRabbit",
    "rating": 7.5,
    "comment": "play with each player having the same personal draw deck (using 2 copies of game)",
    "timestamp": 1760047200
  },
  {
    "username": "pumaman123",
    "rating": 8.3,
    "comment": "Sehr gutes Spiel!",
    "timestamp": 1759096800
  },
  {
    "username": "Bal_505",
    "rating": 8.0,
    "comment": "what a game!",
    "timestamp": 1759010400
  },
  {
    "username": "joanmoreno",
    "rating": 9.0,
    "comment": "Sensacional juego en el que pujaremos con nuestras cartas para sumar más fuerza que nuestros rivales y así controlar ciertas áreas. Tiene muchísimo faroleo y admite partidas de hasta 6 jugadores.\n\nLas habilidades especiales de las cartas son fáciles de recordar y dan mucho juego, la interacción es total. La mecánica de control de áreas está bien integrada y sirve para establecer la condición de victoria.",
    "timestamp": 1759096800
  },
  {
    "username": "cenealon",
    "rating": 9.0,
    "comment": "First Impressions\n2024 Top Games\n2024 New-to-Me Games Ranked\n2025 Top Games",
    "timestamp": 1757023200
  },
  {
    "username": "Fernegul",
    "rating": 9.0,
    "comment": "excellent drawings in this edition",
    "timestamp": 1752530400
  },
  {
    "username": "treunes",
    "rating": 8.5,
    "comment": "I loved this! Played it with 6, the owner said \"meh, it's a mean game, I do not particularly like it that much\", but I know I had read good things about it, and I loved it! It's also pushing your luck (are you going \"all in\" to claim that region?), it has some \"epic battles\", you can indeed block others, but there can be counterblocks, highly interactive, I add it to my wishlist, definitely!",
    "timestamp": 1752444000
  },
  {
    "username": "Kucacho",
    "rating": 9.0,
    "comment": "Is easy to learn and teach, and you have to take risks sometimes. Is very fun.",
    "timestamp": 1751320800
  },
  {
    "username": "SirAfshin",
    "rating": 10.0,
    "comment": "I have another version of this game called Rakab (رکب), which is the core gameplay rules with redesign of the theme for the Bakhtiari people from Iran.\nA fun a entertaining game to play with friends who love a good share of competition. And the Gwent lovers.",
    "timestamp": 1756072800
  },
  {
    "username": "Andrasthegab",
    "rating": 10.0,
    "comment": "What a grande Game.",
    "timestamp": 1756072800
  },
  {
    "username": "capt_neb",
    "rating": 10.0,
    "comment": "All-timer!",
    "timestamp": 1748988000
  },
  {
    "username": "Spada_",
    "rating": 10.0,
    "comment": "14+. Strategy. 2-6 players - Best: 4, 5",
    "timestamp": 1747605600
  },
  {
    "username": "Boxer Santaros",
    "rating": 10.0,
    "comment": "2025-02-18:\nAs you and your fellow players auction for territory in Italy you not only have to contend with the opposing armies. Religious interference, betrayers and even the weather will factor into the upcoming battle. Knowing when not to enter the auction is a key factor as you try and position yourself for victory. New players will be put off by the infrequent card draw, but the game is about playing to the strengths of your hand while avoiding pitfalls.\n\nThere is a definite case of too many editions-itis here though. You will have to find the right rule-set that works for your group, but what you end up with is one fantastic experience.",
    "timestamp": 1739833200
  }
]