[
  {
    "username": "jwski",
    "rating": 1.0,
    "comment": "I loathe this game with the white hot hatred of a thousand dying suns.",
    "timestamp": 1755900000
  },
  {
    "username": "tectactoe",
    "rating": 1.0,
    "comment": "A rudimentary, mind-numbingly simple game that will almost surely lead to physical violence. A \"party\" game through-and-through, but even party games need not be this cacophonous. \"But it mimics the stock exchange!\" And who said that was a good thing?",
    "timestamp": 1737500400
  },
  {
    "username": "JMDToaster",
    "rating": 1.0,
    "comment": "Within one round the game was easily broken and exploited to the point where no player could win",
    "timestamp": 1722376800
  },
  {
    "username": "Bomberdave",
    "rating": 1.0,
    "comment": "great if you love screaming I guess",
    "timestamp": 1716415200
  },
  {
    "username": "johnbuckingham101",
    "rating": 1.0,
    "comment": "I can't sleep until I say the names, Edgar Cayce, Harry Gavitt and George S. Parker",
    "timestamp": 1673650800
  },
  {
    "username": "Pandorzecza",
    "rating": 1.0,
    "comment": "Not for me",
    "timestamp": 1627596000
  },
  {
    "username": "jeffwiles",
    "rating": 1.0,
    "comment": "Blech. Chaos, screaming, and a stupid bell.",
    "timestamp": 1466287200
  },
  {
    "username": "KitsuAeryn",
    "rating": 1.0,
    "comment": "This game is pure chaos, at least with the folks I typically play with. There's too much noise, and the cacophony makes it impossible for me to enjoy.",
    "timestamp": 1424300400
  },
  {
    "username": "McJarvis",
    "rating": 1.0,
    "comment": "Fun filler",
    "timestamp": 1388703600
  },
  {
    "username": "halucinagen",
    "rating": 1.0,
    "comment": "I'd rather eat this than play it.",
    "timestamp": 1388185200
  },
  {
    "username": "Elocution Safari",
    "rating": 1.0,
    "comment": "Defies description of a game.\nClearly Broken.\nYou won't catch me dead playing this.\n\nI'm not saying you're better off playing something else. I'm saying you're better off playing nothing.\n\nPit deserves a special place in Hell, right next to child molesters and people who talk at the theater.",
    "timestamp": 1348005600
  },
  {
    "username": "jayouzts",
    "rating": 1.0,
    "comment": "Pit is not a game. Pit is simply an excuse for extroverts to get together, embrace their inner two-year old, and shout at each other at the top of their lungs. Absolutely no redeeming qualities whatsoever. Horrid.",
    "timestamp": 1321916400
  },
  {
    "username": "fineprinte",
    "rating": 1.0,
    "comment": "Don't have to play to know it is bad!",
    "timestamp": 1292799600
  },
  {
    "username": "vivafringe",
    "rating": 1.0,
    "comment": "The reason this gets the lowest rating over even banal stuff like Candyland is that this is the only game I own that encourages yelling. Every game ends with everyone just screaming at each other, which is something I just can't stand. While the mechanics of the game are somewhat entertaining, it's never worth the migraine that comes afterward.",
    "timestamp": 1261263600
  },
  {
    "username": "GeneSteeler",
    "rating": 1.3,
    "comment": "I still have nightmares about this game \"Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two Two...\"",
    "timestamp": 1241128800
  },
  {
    "username": "cesartustro",
    "rating": 1.0,
    "comment": "Me parece una absoluta chorrada de juego. Para ponerme a gritar y tirar cartas a unos y otros, prefiero casi cualquier otro party game.",
    "timestamp": 1232924400
  },
  {
    "username": "Axelfudge",
    "rating": 1.0,
    "comment": "Another game that was left here. I played this and it annoyed me to no end. It's a lot of laughs but everyone is just yelling at eachother. Just not my cup of tea.",
    "timestamp": 1210370400
  },
  {
    "username": "Sheylon",
    "rating": 1.0,
    "comment": "I don't like games where you have to yell at each other constantly.",
    "timestamp": 1079737200
  },
  {
    "username": "Deltonbrack",
    "rating": 2.0,
    "comment": "I hate live auctions like this.",
    "timestamp": 1748988000
  },
  {
    "username": "Viewtiful_Justin",
    "rating": 2.0,
    "comment": "Wanted to purge, Robb vetoed.",
    "timestamp": 1729634400
  },
  {
    "username": "artem88",
    "rating": 2.0,
    "comment": "450",
    "timestamp": 1725228000
  },
  {
    "username": "PolarDad",
    "rating": 2.0,
    "comment": "Childhood",
    "timestamp": 1719439200
  },
  {
    "username": "heavymetalboardgamer",
    "rating": 2.0,
    "comment": "Wow this was dumb.",
    "timestamp": 1674860400
  },
  {
    "username": "Leuname",
    "rating": 2.0,
    "comment": "Waaaay to chaotic for me. Not to mention I'm a generally quite person, and to win this you have to be loud.",
    "timestamp": 1652220000
  },
  {
    "username": "kfbunny",
    "rating": 2.0,
    "comment": "trash",
    "timestamp": 1629064800
  },
  {
    "username": "Brucie_Lee",
    "rating": 2.0,
    "comment": "I do not enjoy this game AT ALL!\n\nThe version I played didn't have the bell to signal the start and end of the game so as soon as you get your cards people are shouting to trade.\n\nI like to get my cards in order first (it's an OCD thing) and then start trading - i.e. when the bell is rung and everyone is ready. I find it stressful.\n\nIt's also really loud and I don't find it relaxing but actually stress-inducing. Of course I like board games where people get excited and it gets loud at times, but not when it's the core mechanic of the game.\n\nDefinitely not for me, sorry, but at least it's over quite quickly if we do play it.",
    "timestamp": 1583449200
  },
  {
    "username": "Gola",
    "rating": 2.0,
    "comment": "One play with six. It was okay for five minutes, and then I started to hate it. Pretty much any game in which the main mechanism is shouting over your opponents is not going to get much traction with me.",
    "timestamp": 1581807600
  },
  {
    "username": "adrianliew93",
    "rating": 2.0,
    "comment": "(IOS Version)",
    "timestamp": 1578610800
  },
  {
    "username": "rfoth",
    "rating": 2.0,
    "comment": "Classic commodity game, but has very little resemblance to real life. Good, quick party game, but nothing else. Scoring of the commodities is a little obscure since the game plays too fast for players to actually plan their scoring effectively. The addition of spoons (# determined by (# players - 1)) increases the fun and drama of the game.",
    "timestamp": 1573426800
  },
  {
    "username": "Rumpy_Pumpy",
    "rating": 2.0,
    "comment": "Just people shouting random numbers out repeatedly until they win. Belongs in a bottomless pit.",
    "timestamp": 1539381600
  },
  {
    "username": "scizztil",
    "rating": 2.0,
    "comment": "This is not a game. It is just yelling loudly at each other until someone is lucky enough to get a corner on something. Who cares? Entertainment for stupid people.",
    "timestamp": 1453244400
  },
  {
    "username": "imoo",
    "rating": 2.0,
    "comment": "邦題：　ピット",
    "timestamp": 1441317600
  },
  {
    "username": "Shadoglare",
    "rating": 2.0,
    "comment": "It's freakin' Go Fish with a larger number of players. Although I would admit others at the table seemed to be having a good time, I really just did not enjoy this mindless yell-fest of a game.",
    "timestamp": 1419807600
  },
  {
    "username": "John Rogers",
    "rating": 2.0,
    "comment": "This game is loud and obnoxious. At least it ends soon enough.\n\nWIFE RATING - 4",
    "timestamp": 1412114400
  },
  {
    "username": "squash",
    "rating": 2.0,
    "comment": "When the ONLY fun thing about playing this \"game\" is slamming the bell, and the copy of the game being played on doesn't have a bell because it was broken on the first play of the game, what's the damn point?!? I could see how people who enjoy yelling at other people and getting excited about things might enjoy this, and the theme of frantically working the stock-market floor comes through surprisingly well (I assume that's what the theme is supposed to be). But holy pit, this is not the game for me. Game design: 1.5/5 Personal enjoyment: 0.5/5 Total: 2/10",
    "timestamp": 1411423200
  },
  {
    "username": "GrantAZ",
    "rating": 2.0,
    "comment": "3-8 Players",
    "timestamp": 1393455600
  },
  {
    "username": "midnightfaerie",
    "rating": 3.0,
    "comment": "2025",
    "timestamp": 1752962400
  },
  {
    "username": "taksw222",
    "rating": 3.0,
    "comment": "Too loud to play.",
    "timestamp": 1745272800
  },
  {
    "username": "millsyboy",
    "rating": 3.0,
    "comment": "I just can't play this sort of game - I can't shout quick enough. Other people clearly enjoy enjoy it more than I do.",
    "timestamp": 1721512800
  },
  {
    "username": "bdcroom",
    "rating": 3.0,
    "comment": "I don't like it. But I have hearing problems and this game gets loud if anyone is having any fun. Kid's love the bell and always steal it out of the box to just use it and get yelled at by their parents when it's not game night.",
    "timestamp": 1716933600
  },
  {
    "username": "tibbles",
    "rating": 2.5,
    "comment": "Blech, fast dealing real time games are not for me. Also relies on being able to physically reach everyone at the table to trade with, which was an issue in my play. Unsurprisingly the people seated in the center were the only ones who could assemble a winning hand.",
    "timestamp": 1715205600
  },
  {
    "username": "authentic",
    "rating": 3.0,
    "comment": "This game gets chaos energy well, but chaos is usually frustrating.",
    "timestamp": 1705186800
  },
  {
    "username": "burker",
    "rating": 3.0,
    "comment": "Never really got to grips with this game.",
    "timestamp": 1703199600
  },
  {
    "username": "s2alexan",
    "rating": 3.0,
    "comment": "I just don't like realtime games. I'll do whatever I can to avoid this.",
    "timestamp": 1689976800
  },
  {
    "username": "Destrio",
    "rating": 3.0,
    "comment": "Simulates an open live market. The more frantic blind trades you can execute, the more likely you'll get what you need before others. More of an activity than a game for me.",
    "timestamp": 1686952800
  },
  {
    "username": "Commanders",
    "rating": 3.0,
    "comment": "3-8 players",
    "timestamp": 1674687600
  },
  {
    "username": "Finn Krogstad",
    "rating": 2.5,
    "comment": "If there is not enough yelling in your day, try Pit.",
    "timestamp": 1673996400
  },
  {
    "username": "musicalanarchy",
    "rating": 3.0,
    "comment": "Definitely need the right group for this to be entertaining. It's fine, but not one I feel the need to go back to.",
    "timestamp": 1667775600
  },
  {
    "username": "wildthayne",
    "rating": 2.5,
    "comment": "I can't play this game--the anxiety puts me into cardiac arrest.\n\n{The last time I played (was forced to play) this game, I managed to take the zen approach and stay peaceful. I did, however, end with more negative points than the winner had positive points.}",
    "timestamp": 1643842800
  },
  {
    "username": "djnesq",
    "rating": 3.0,
    "comment": "Speed, noise, and trading --- not the three game attributes that I most appreciate.",
    "timestamp": 1612738800
  },
  {
    "username": "jaieless",
    "rating": 3.0,
    "comment": "A faintly decorated shouting match. Great to warm up the lungs.\n\nUsed",
    "timestamp": 1608073200
  },
  {
    "username": "AcemanBR",
    "rating": 3.0,
    "comment": "Mecânica crua de um jogo muito antigo. É divertido, mas existem jogos mais lapidados com a mesma ideia de leilão em tempo real. Um exemplo é o brasileiro Tinco.",
    "timestamp": 1592431200
  },
  {
    "username": "Michael Ward",
    "rating": 3.0,
    "comment": "Obtained as a gift, sometime in the mid-1970's, I think.\n~ December 13, 2004: Per the rules booklet I have a 1964 edition.",
    "timestamp": 1589493600
  },
  {
    "username": "dvmartin",
    "rating": 3.0,
    "comment": "Not my kind of game, but my in-laws love games like this and Spoons where everyone is frantically shouting at each other. I like a quieter game with inscrutable rules that lasts for ten hours, so to each their own.",
    "timestamp": 1579561200
  },
  {
    "username": "dustkan",
    "rating": 4.0,
    "comment": "$2 sleeved\nFamily Party Card\nWorld's liveliest card game. Trade 1! Trade 2! Trade 3! Corner the market.\nPit! is an open-outcry commodity trading game where players offer trades by crying out the number of cards the way to swap (1, 1, 1 or 3, 3, 3) but not their identity. Collect all of one commodity and corner the market to win.\nM: Commodity Speculation, Negotiation, Real-Time, Set Collection, Trading",
    "timestamp": 1740006000
  },
  {
    "username": "Telaz",
    "rating": 3.5,
    "comment": "My rating(50%): 4\nMy “want to play-again” rating(50%): 3\nMy overall rating: 3.5\nPlays: 15+\n\nA party type game just not enjoyable!",
    "timestamp": 1713391200
  },
  {
    "username": "MikeJonez",
    "rating": 4.0,
    "comment": "2023:5/10\n2024:4/10",
    "timestamp": 1706310000
  },
  {
    "username": "Kernelcorndog",
    "rating": 4.0,
    "comment": "4-8 (6-8) light",
    "timestamp": 1702422000
  },
  {
    "username": "B_Moores",
    "rating": 4.0,
    "comment": "Shouting is fun. For a while",
    "timestamp": 1684015200
  },
  {
    "username": "AletheaAurora",
    "rating": 3.5,
    "comment": "A childhood favourite. There's a bit of bluff and trade, but honestly as set collection goes it just doesn't really feel satisfying or balanced compared with most other games of a similar style.",
    "timestamp": 1673910000
  },
  {
    "username": "cnedrow",
    "rating": 3.5,
    "comment": "Obnoxious. It's amazing that such a boring game can be so loud.",
    "timestamp": 1672441200
  },
  {
    "username": "Alekzys25",
    "rating": 4.0,
    "comment": "Extremadamente ruidoso, aunque divertido, solo lo recomiendo jugar con gente que le guste los party games cortos o que les encante el ruido y los gritos.",
    "timestamp": 1666908000
  },
  {
    "username": "pauloantunes",
    "rating": 3.6,
    "comment": "When I play I use the Lisbon Tram 28 bell or Halli Galli bell and Allegra's cards.",
    "timestamp": 1659391200
  },
  {
    "username": "lushchords",
    "rating": 4.0,
    "comment": "Eh... it's an energetic game and I would only take it out if I was looking for something really quick to play... (but then again, I would ALWAYS choose jungle speed over this one)",
    "timestamp": 1644447600
  },
  {
    "username": "melx",
    "rating": 3.5,
    "comment": "Games for Geekgold April 2011:\nhttp://www.boardgamegeek.com/geeklist/65632/item/1621749#ite...\n\nNot my game... too noisy \n\nsold on facebook",
    "timestamp": 1641769200
  },
  {
    "username": "patrickpd",
    "rating": 4.0,
    "comment": "Okay for an old-school party game. Overall, I like Bohnanza a lot more.",
    "timestamp": 1617746400
  },
  {
    "username": "Kevin Moody",
    "rating": 4.0,
    "comment": "Simple enough to play with young kids, but they'll always lose due to lack of aggressiveness, therefore there are just too many better modern games that would be played before this.",
    "timestamp": 1598220000
  },
  {
    "username": "mudville9",
    "rating": 4.0,
    "comment": "An annoying exercise in shouting at one another",
    "timestamp": 1590962400
  },
  {
    "username": "jbaileymusic",
    "rating": 4.0,
    "comment": "Sleeved.",
    "timestamp": 1588543200
  },
  {
    "username": "citylife",
    "rating": 4.0,
    "comment": "Crazy fun even if its a bit of a headache. Good for a laugh.",
    "timestamp": 1577746800
  },
  {
    "username": "DeadFrog",
    "rating": 4.0,
    "comment": "A lot of chaos. The only fun is in tracking what other people are doing and somehow trying to use that to your advantage.",
    "timestamp": 1558821600
  },
  {
    "username": "big_booboo",
    "rating": 4.0,
    "comment": "If you want to know whether you would like this game, try screaming random numbers at your friends for an hour straight",
    "timestamp": 1555365600
  },
  {
    "username": "robweg10",
    "rating": 5.0,
    "comment": "orange Parker Brothers version with bell",
    "timestamp": 1760047200
  },
  {
    "username": "DocGerbil",
    "rating": 5.0,
    "comment": "Great game if you want to induce a migraine.",
    "timestamp": 1756850400
  },
  {
    "username": "adamredwoods",
    "rating": 5.0,
    "comment": "Played across my life. Rated as FAMILY game.\n\nYes, I've played this recently. It's crazy and I rarely win. It's random, because some people will not trade certain cards until later. It can get chaotic and loud.",
    "timestamp": 1756504800
  },
  {
    "username": "mr_ben_jen",
    "rating": 5.0,
    "comment": "collect one type of commodity by yelling what you need and trading in chaos. Enh.",
    "timestamp": 1748469600
  },
  {
    "username": "JFed01",
    "rating": 5.0,
    "comment": "party game",
    "timestamp": 1747260000
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "probably the best rowdy party game there is!",
    "timestamp": 1746309600
  },
  {
    "username": "earendt",
    "rating": 5.0,
    "comment": "Seems like a game you'd play before you improv or public speak.",
    "timestamp": 1745186400
  },
  {
    "username": "TForever",
    "rating": 5.0,
    "comment": "This is a good game, but loud. It's real time trading, and great when you dupe other players, but chance if you get the set you need. It's fine, but your voice gets hoarse after 30 minutes.",
    "timestamp": 1744408800
  },
  {
    "username": "sireeshaaluri",
    "rating": 5.0,
    "comment": "Up to 8\nBest - 6-8",
    "timestamp": 1742425200
  },
  {
    "username": "aaj94",
    "rating": 5.0,
    "comment": "It's Pit, you know what you're getting into when you come to the table. It's not going to set the world on fire, but it's still a fun game with some life in it. You must check out Kuhhandel Master for a modern take on this classic.\n\nPit is a classic card game that almost everyone has played. It's over a hundred years old, and while it's definitely got some wrinkles and blemishes, I think this game would hold up. I'm always on the hunt for games that play well at a high player count.",
    "timestamp": 1734562800
  },
  {
    "username": "docspouse",
    "rating": 5.0,
    "comment": "2-8 players",
    "timestamp": 1733007600
  },
  {
    "username": "klaypoll",
    "rating": 4.5,
    "comment": "Played as a kid.",
    "timestamp": 1729807200
  },
  {
    "username": "oldgoat3769967",
    "rating": 5.0,
    "comment": "Boring party game with lackluster game mechanics",
    "timestamp": 1726005600
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "a quick and simple real time trading game.",
    "timestamp": 1721858400
  },
  {
    "username": "JaredEagle",
    "rating": 5.0,
    "comment": "Edgar Cayce\nHarry Gavitt\nGeorge S. Parker\nWinning Moves",
    "timestamp": 1719266400
  },
  {
    "username": "mixmixmix",
    "rating": 5.0,
    "comment": "what a silly yet fun way to spend 10 minutes",
    "timestamp": 1716933600
  },
  {
    "username": "Shifty85",
    "rating": 5.0,
    "comment": "A frantic trading game that is basically just a bunch of yelling.",
    "timestamp": 1716415200
  },
  {
    "username": "asfhgwt",
    "rating": 5.0,
    "comment": "A fun party game for 5 or more. It will make you hoarse.",
    "timestamp": 1712959200
  },
  {
    "username": "LuisGomez",
    "rating": 5.0,
    "comment": "[Unsleeved]",
    "timestamp": 1706050800
  },
  {
    "username": "Navybear78",
    "rating": 5.0,
    "comment": "Best played when there's cheating involved!",
    "timestamp": 1699657200
  },
  {
    "username": "Ellogeyen",
    "rating": 5.0,
    "comment": "2-4 plays (2015)",
    "timestamp": 1696802400
  },
  {
    "username": "gpioski",
    "rating": 5.0,
    "comment": "Best at 6-8. Plays 4-8.",
    "timestamp": 1695247200
  },
  {
    "username": "bculver91",
    "rating": 5.0,
    "comment": "A family classic that is always utter mayhem (7 person family!!). Lots of good memories logged in this game",
    "timestamp": 1683756000
  },
  {
    "username": "Gaterspiel",
    "rating": 5.0,
    "comment": "x",
    "timestamp": 1682028000
  },
  {
    "username": "SplinterBlade",
    "rating": 5.0,
    "comment": "It's been a long time since I played Pit, but if you want pure trading negotiation in real time with minimal rules, look no further. This is frantic, fast paced fun that will largely conceal the slightly inadequate design underneath.",
    "timestamp": 1680300000
  },
  {
    "username": "pennincao",
    "rating": 5.0,
    "comment": "Gave to Haley",
    "timestamp": 1679868000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 5.0,
    "comment": "Too loud",
    "timestamp": 1677798000
  },
  {
    "username": "rwodonnell",
    "rating": 5.0,
    "comment": "Tags: Keep, Archive",
    "timestamp": 1675810800
  },
  {
    "username": "halaweenie",
    "rating": 5.0,
    "comment": "Its fine. Good to play with a lot of people but very simple and I can see it getting boring fast.",
    "timestamp": 1673305200
  },
  {
    "username": "pipwoodie",
    "rating": 5.0,
    "comment": "Party Game",
    "timestamp": 1671318000
  },
  {
    "username": "dskrodzki",
    "rating": 5.0,
    "comment": "The chaos, shouting, and rush to collect a set of 9 cards is a lot of fun for the first few rounds, but it soon outstays its welcome when you realize the game doesn't end until someone reaches 500 points. Players typically end up trading the same cards over and over again and it's almost pointless trying to collect the the low-scoring commodities when wheat is out there worth 100 points. The bull and bear cards add a nice twist to make the game more interesting, but they don't seem to be implemented well since 2 players have one extra card each round. Overall, this game can be exciting and fun, but it gets boring fast.",
    "timestamp": 1671145200
  },
  {
    "username": "br4nmuff1n",
    "rating": 5.0,
    "comment": "2 plays",
    "timestamp": 1669590000
  },
  {
    "username": "tycham85",
    "rating": 5.0,
    "comment": "many fond memories of screaming at one another around the dining table trying to hedge the market. really depends on the crew.",
    "timestamp": 1662156000
  },
  {
    "username": "mikebro115",
    "rating": 5.0,
    "comment": "5 plays",
    "timestamp": 1661724000
  },
  {
    "username": "adamphipps11",
    "rating": 5.0,
    "comment": "3-8 Players\nBest: 6-8",
    "timestamp": 1655244000
  },
  {
    "username": "Fencejummper",
    "rating": 5.0,
    "comment": "Fun, Frantic game with very little skill. It was something that would be fun with the right group.",
    "timestamp": 1654380000
  },
  {
    "username": "Auroric",
    "rating": 5.5,
    "comment": "A game my family has enjoyed for years. Not much of a game, but gets people yapping and having a good time. I'll actually still play this when others want to. Some of my non gamer friends' favourite.",
    "timestamp": 1759183200
  },
  {
    "username": "mhinto",
    "rating": 6.0,
    "comment": "4-8 players.",
    "timestamp": 1759096800
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 5425016920282\ncd rek 6",
    "timestamp": 1757196000
  },
  {
    "username": "guimel",
    "rating": 6.0,
    "comment": "Vintage party game. Possibly donated",
    "timestamp": 1754863200
  },
  {
    "username": "mikeduy",
    "rating": 6.2,
    "comment": "MY PRECIOUS!",
    "timestamp": 1754431200
  },
  {
    "username": "EllenCaroline",
    "rating": 6.0,
    "comment": "1.15 weight",
    "timestamp": 1751493600
  },
  {
    "username": "andy61",
    "rating": 6.0,
    "comment": "Very old party game which I also played in my childhood. Silly and noisy fun.",
    "timestamp": 1750802400
  },
  {
    "username": "rbcross62",
    "rating": 6.0,
    "comment": "Complete and all components are in great condition. Box is worn from age.",
    "timestamp": 1750629600
  },
  {
    "username": "dylanv2",
    "rating": 6.4,
    "comment": "Fast and chaotic. Enjoyable for a time before it gets too repetitive.\n\nComponents: 6.5\nArt: 6.5\nTheme: 6\nMechanism: 6.5\nEnjoyment: 6.5",
    "timestamp": 1750543200
  },
  {
    "username": "Idiot_for_Life",
    "rating": 6.0,
    "comment": "Best at 6+\nVery short length\nLoud party trading set collection game.",
    "timestamp": 1748296800
  },
  {
    "username": "Coralouwho",
    "rating": 6.0,
    "comment": "#LetterP\n#Foods #Grains #Barley #Corn #Oats #Soybeans #Sugar #Wheat",
    "timestamp": 1742943600
  },
  {
    "username": "Leradomi",
    "rating": 6.0,
    "comment": "Weight : 1.15",
    "timestamp": 1741906800
  },
  {
    "username": "bandit_boy7",
    "rating": 6.0,
    "comment": "In recent plays I learned that the fun in this game really depends upon playing it with the right group. I remembered this as a blast to play, but recently I was voting to end it early.\n[Result: dropped from 2010 ranking of 7.5]\n\nSold to Dave. (2/01/2025)",
    "timestamp": 1738450800
  },
  {
    "username": "Tolkienfan3324",
    "rating": 6.0,
    "comment": "Card Game",
    "timestamp": 1737673200
  },
  {
    "username": "Regnad Kcin",
    "rating": 6.0,
    "comment": "My copy is missing the box bottom. The styrofoam insert that holds the bell and cards is rubber-banded together with the box top.\n\nNot for play at the library. Lots of shouting.\n\nDonated 11/24 (to the library, ironically)",
    "timestamp": 1737068400
  },
  {
    "username": "repear",
    "rating": 6.0,
    "comment": "6 - Ok - will play if in the mood",
    "timestamp": 1736031600
  },
  {
    "username": "Mountaingardner",
    "rating": 6.0,
    "comment": "3-8 Player",
    "timestamp": 1735426800
  },
  {
    "username": "juanitogan",
    "rating": 6.0,
    "comment": "Found used somewhere years ago. Missing two Corn cards so must play with 6 or less, or play the original non-Bull-Bear version with Bull and Bear as Corn. One wheat card marked with paint (mostly removed but not entirely). Rules missing.",
    "timestamp": 1731884400
  },
  {
    "username": "Rygel",
    "rating": 6.0,
    "comment": "Fast action \"live\" trading game. Fast and fun.\n\nGot in 2007",
    "timestamp": 1731366000
  },
  {
    "username": "W1LDH0R53",
    "rating": 6.0,
    "comment": "1 Card Sleeves",
    "timestamp": 1730674800
  },
  {
    "username": "Katinzahat",
    "rating": 6.0,
    "comment": "Billionaire version",
    "timestamp": 1730674800
  },
  {
    "username": "jeeves",
    "rating": 5.5,
    "comment": "3",
    "timestamp": 1726956000
  },
  {
    "username": "azeem",
    "rating": 6.0,
    "comment": "Pit is not a shining star of strategy or market manipulation games. What it is is a dead-simple ruleset that allows a group of tired players to have some laughs before getting kicked out of the venue for being too noisy.\n\nBest use of a bell in a game I've seen yet.",
    "timestamp": 1726524000
  },
  {
    "username": "MRomeo99",
    "rating": 6.0,
    "comment": "Fun chaotic party game.",
    "timestamp": 1725832800
  },
  {
    "username": "vejrum",
    "rating": 6.0,
    "comment": "Very light, random, fun, 100+ years (from 1904) old trading game.",
    "timestamp": 1724450400
  },
  {
    "username": "ooogene",
    "rating": 6.0,
    "comment": "I remember playing this as a kid. It also remember it being as loud as it turned out to still be. Good hilarious fun. My kids loved it!",
    "timestamp": 1721340000
  },
  {
    "username": "LucaTrolese",
    "rating": 5.5,
    "comment": "Very noisy game to be played with the right group. Market could stack for a while but game is so fast that you can do multiple sessions. Nice graphic and packaging",
    "timestamp": 1718488800
  },
  {
    "username": "tommayj",
    "rating": 6.0,
    "comment": "An old beloved classic.",
    "timestamp": 1718056800
  },
  {
    "username": "Brother Abe",
    "rating": 6.0,
    "comment": "Maria’s pre 2015",
    "timestamp": 1712440800
  },
  {
    "username": "robr148",
    "rating": 6.0,
    "comment": "Pit gets better and better with each added player. We appreciate how this game can fit into whatever time window we have, large or small.",
    "timestamp": 1708988400
  },
  {
    "username": "xihoxoh181",
    "rating": 6.0,
    "comment": "No disfruto los juegos donde haya que gritar",
    "timestamp": 1708383600
  },
  {
    "username": "rickwhatever",
    "rating": 6.0,
    "comment": "3-8",
    "timestamp": 1708038000
  },
  {
    "username": "Awkward_Meeple",
    "rating": 5.5,
    "comment": "Complete - 2 sets\n1 - 1919 edition\n1 - 2009 Parker Brothers Edition",
    "timestamp": 1704841200
  },
  {
    "username": "heyitshenry",
    "rating": 6.0,
    "comment": "Fun!",
    "timestamp": 1703977200
  },
  {
    "username": "Jmarkmoss",
    "rating": 6.0,
    "comment": "old classic, I didn't play it much, but my wife's family did 12/18/23",
    "timestamp": 1702940400
  },
  {
    "username": "Bobit",
    "rating": 6.0,
    "comment": "A lot of frantically shouting (or signalling) numbers for better or worse. Otherwise a mix of a memory game, some strategies to making trades that might seem horrible because you're sure someone won't budge, some \"bidding\" for the higher point cards. So maybe more nuance that Dutch Blitz, so that's nice. Creative.",
    "timestamp": 1702335600
  },
  {
    "username": "dries1965",
    "rating": 7.0,
    "comment": "PNP",
    "timestamp": 1761052440
  },
  {
    "username": "moonerie",
    "rating": 6.5,
    "comment": "Note: Fun, silly, very casual game if played with loud and/or competitive people. Very easy to pick up but also (I'm guessing) potentially not very interesting with the wrong group. Would rate higher if the group was guaranteed to be the right type to enjoy this game (though automatic -1 point in rating for whoever is sitting next to Karen hahahahah)\n\nI am perfectly happy not owning this game (haha)",
    "timestamp": 1760306400
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN nvt\nGL4",
    "timestamp": 1757800800
  },
  {
    "username": "fromeea",
    "rating": 7.0,
    "comment": "Justin Heimer: 5\nRosalie Phillips: 5\nAmy Peschong: 7\n\nCharlie McCarron: 8;",
    "timestamp": 1757541600
  },
  {
    "username": "beat9946",
    "rating": 7.0,
    "comment": "2024/12/24処分",
    "timestamp": 1757455200
  },
  {
    "username": "EnderRevan",
    "rating": 6.5,
    "comment": "CARLOTA",
    "timestamp": 1757282400
  },
  {
    "username": "MNGirl",
    "rating": 7.0,
    "comment": "Oh gosh. We have had a good time with this game.",
    "timestamp": 1755122400
  },
  {
    "username": "Evandeel",
    "rating": 7.0,
    "comment": "A great game for quick frantic fun. I'm surprised it came out in 1903 though, it doesn't like something that came out around the same time as the birth of 500 and Monopoly!",
    "timestamp": 1753826400
  },
  {
    "username": "Ternal2",
    "rating": 7.0,
    "comment": "Q5",
    "timestamp": 1753653600
  },
  {
    "username": "Maawdawg",
    "rating": 7.0,
    "comment": "gifted 3",
    "timestamp": 1751493600
  },
  {
    "username": "ProverbialLightbulb",
    "rating": 7.0,
    "comment": "Keeper",
    "timestamp": 1750629600
  },
  {
    "username": "goodknee",
    "rating": 7.0,
    "comment": "Front Shelf",
    "timestamp": 1750456800
  },
  {
    "username": "KatydidWonders",
    "rating": 7.0,
    "comment": "3-8 Love this game, played silently while camping once.",
    "timestamp": 1745964000
  },
  {
    "username": "PedroG",
    "rating": 6.5,
    "comment": "Fun, loud, quick filler. Usually good for a laugh.",
    "timestamp": 1745100000
  },
  {
    "username": "demyduy",
    "rating": 7.0,
    "comment": "7 solo si se juega con 5 personas para adelante\nSino, el juego baja a puntaje de 6",
    "timestamp": 1744840800
  },
  {
    "username": "vionemc",
    "rating": 7.0,
    "comment": "Simple chaos, but you'll get bored of it fast",
    "timestamp": 1743116400
  },
  {
    "username": "MohammadKamyabi",
    "rating": 7.0,
    "comment": "An engaging party game",
    "timestamp": 1742598000
  },
  {
    "username": "cajun_catfish",
    "rating": 7.0,
    "comment": "[3-8] PARTY/CARD: Frenzied Stock Market/Trading game that always is wacky and intense",
    "timestamp": 1739746800
  },
  {
    "username": "chanyuekong",
    "rating": 8.0,
    "comment": "3-8",
    "timestamp": 1760220000
  },
  {
    "username": "SVan",
    "rating": 7.5,
    "comment": "The loudest game I've ever played. Can't believe this game is 100 years old, because it is just as fun as any game designed today.",
    "timestamp": 1756677600
  },
  {
    "username": "ZSeba",
    "rating": 8.0,
    "comment": "Risas asegurada",
    "timestamp": 1756072800
  },
  {
    "username": "Frank Hamrick",
    "rating": 8.0,
    "comment": "Used to be a favorite. But I'm not into FAST (quick reaction) games or PARTY games any more (in my old age). Yet, some of my most fun, hilarious gaming memories come from playing Pit. A great family game. Be ready for fast, loud, hilarious moments. A great ice breaker!",
    "timestamp": 1755986400
  },
  {
    "username": "ruelgaviola",
    "rating": 7.5,
    "comment": "Deluxe edition with bell",
    "timestamp": 1755986400
  },
  {
    "username": "niledesign",
    "rating": 8.3,
    "comment": "This was a family favorite growing up and I still love playing this game. It is an excellent party game with loads of loud, boisterous interaction.",
    "timestamp": 1754949600
  },
  {
    "username": "MithanYunson",
    "rating": 7.8,
    "comment": "Great card game. Fun player interaction",
    "timestamp": 1754172000
  },
  {
    "username": "ueyinnafesh",
    "rating": 8.0,
    "comment": "진짜 클래식이다. 왁자지껄하고 재밌음!",
    "timestamp": 1753308000
  },
  {
    "username": "FATHERwise",
    "rating": 8.0,
    "comment": "It's so simple. But I love it and so do my kids. Good chaotic, strategic fun!\nGifted the official deck to my sister, we continue to play it with the cards from the game \"kawaii crush\".",
    "timestamp": 1751407200
  },
  {
    "username": "Racelympics",
    "rating": 8.0,
    "comment": "2017 edition. Broke my family the first time I played this game with them. Decided to sell it, because we already have two other copies.",
    "timestamp": 1750543200
  },
  {
    "username": "mawilson4",
    "rating": 8.0,
    "comment": "Fun times, albeit with a shortened play time (250 or 300 points as opposed to the more traditional 500 to end the game). It could easily overstay its welcome, but is easily enough house ruled to a manageable length.\n\nIn all, it's a rather random, social party game; in other words, just my style. The race in each round gives everything a necessary tension, and provides some small decision points around the timing of certain trades. The Bull and Bear cards - a necessity to make the game more amusing and frantic - are only 2 among many in the deck. Yet each round of the game will feature a mini-game of hot potato involving one or both them, which makes for an amusing loss mitigation puzzle amidst the larger goals of the game.",
    "timestamp": 1748124000
  },
  {
    "username": "Hoyu",
    "rating": 8.0,
    "comment": "House Rule:\n- Play up to 200 points to speed up the game.",
    "timestamp": 1747605600
  },
  {
    "username": "HerbertML",
    "rating": 7.8,
    "comment": "Excellent real-time game. Your neighbors will hate it.\n/*#R5*//*stay*/",
    "timestamp": 1745100000
  },
  {
    "username": "HughCross",
    "rating": 8.0,
    "comment": "i have fond memories playing this game with my family and non-gamer friends. The joy, energy and chaos that fills up the room is unmatched, it's incredibly easy to set up and teach and ringing the bell is such a nice hit of dopamine.\nJust like in Just One we play it until we get tired of it, usually a few rounds. Party games like these are not meant to keep track of scores, just play for the joy of it.\nI'll never forget my cousin jumping out of her chair and dancing after her first win.",
    "timestamp": 1744668000
  },
  {
    "username": "splashdamage",
    "rating": 8.0,
    "comment": "Mia",
    "timestamp": 1743289200
  },
  {
    "username": "jarev",
    "rating": 8.0,
    "comment": "Eiga",
    "timestamp": 1742684400
  },
  {
    "username": "kingwilli",
    "rating": 7.5,
    "comment": "[NR] (#111) Pit is an older game that I enjoyed as a kid and with our kids. Still a loud and good time as a great party game.",
    "timestamp": 1741993200
  },
  {
    "username": "darthteits",
    "rating": 8.0,
    "comment": "Con micas Sleeve Kings",
    "timestamp": 1740524400
  },
  {
    "username": "bmilli333",
    "rating": 9.0,
    "comment": "Now this is a thriller. Pit takes the simplest of concepts but brings the absolute gauntlet to the gaming table. All it requires is cards and a bell and it brings the party! This one is so much fun and really gets the energy pumping! All instances that involve Pit were a great time had by all and that's the kind of gaming experience I dig!",
    "timestamp": 1760306400
  },
  {
    "username": "AlPacino11",
    "rating": 8.6,
    "comment": "With 6 or more players, it's definitely the most entertaining party game choice.",
    "timestamp": 1757800800
  },
  {
    "username": "Eighteencharacters",
    "rating": 9.0,
    "comment": "Fast and frantic party game. Not for everyone but I love it when in the mood for loud fun.",
    "timestamp": 1754776800
  },
  {
    "username": "lookitzpancakes",
    "rating": 9.0,
    "comment": "Best party game ever (as long as you’re playing with 4 or more).",
    "timestamp": 1749247200
  },
  {
    "username": "Martian186",
    "rating": 9.0,
    "comment": "This one I always enjoy, yet It does carry a lot of nostalgia value for me as well.",
    "timestamp": 1748296800
  },
  {
    "username": "BeepoisonGameMadness",
    "rating": 9.0,
    "comment": "La Feria de las Pulgas de Titirilquén.\n\nSimilar a Happy Salmón, todos los jugadores pelean para que los pesquen, la campana es genial y el juego es simple y caótico, mientras más jugadores mejor, todos van a estar gritando ahkrico.\n\nEl valor de las cartas no debería importar mucho y no vale la pena mantener registro de cuantos puntos tiene cada uno.\n\nLa versión de 31 minutos es la mejor, que mal que los flojonazos no crearan un juego propio y se limitaran a hacer un re-skin de un juego sin copyright, Jani Dueñas embarrándola de nuevo.\n\nTa weno.",
    "timestamp": 1746914400
  },
  {
    "username": "Gumstep",
    "rating": 9.0,
    "comment": "An uproariously good time.",
    "timestamp": 1742511600
  },
  {
    "username": "ultimoratio",
    "rating": 9.0,
    "comment": "One of the best trading games I have played. Plus points for being so dead simple",
    "timestamp": 1736982000
  },
  {
    "username": "jealousofyou",
    "rating": 9.0,
    "comment": "4-8, best 6-8\nTiny",
    "timestamp": 1735426800
  },
  {
    "username": "Afal91",
    "rating": 9.0,
    "comment": "Genera mucho caos, y eso es genial. Lo que me gusta es que dentro de todo el caos, hay un pelín de estrategia: si no caes en pánico, debes recordar negociar con varias personas distintas. En fin, me parece una genialidad de filler.",
    "timestamp": 1731106800
  },
  {
    "username": "charmed_0215",
    "rating": 9.0,
    "comment": "Legacy",
    "timestamp": 1730070000
  },
  {
    "username": "Jotitax",
    "rating": 9.0,
    "comment": "FERIA DE LAS PULGAS DE TITIRILQUEN (CHILE)\nJuegazo! Pura diversion",
    "timestamp": 1710284400
  },
  {
    "username": "artvad3r",
    "rating": 9.0,
    "comment": "With the right larger group, this is one of the best games to play.",
    "timestamp": 1710111600
  },
  {
    "username": "tgen",
    "rating": 8.5,
    "comment": "Own",
    "timestamp": 1705446000
  },
  {
    "username": "DayBernal",
    "rating": 9.0,
    "comment": "Muuuuuy divertido, es de los juegos donde las risas y gritos de emoción o desesperación no van a faltar. Lo he jugado con diferentes grupos de amigos y todos amaron el juego, mi mamá gusta del juego tambien y gente más experimentada igual.",
    "timestamp": 1703199600
  },
  {
    "username": "AndreChapman",
    "rating": 9.3,
    "comment": "Real time trading / set collection card game\nhttps://drive.google.com/folderview?id=1Hd0TUbwA5tV_9079PUev...",
    "timestamp": 1698706800
  },
  {
    "username": "MarthaFuller73",
    "rating": 9.0,
    "comment": "Amazing party game",
    "timestamp": 1698012000
  },
  {
    "username": "faidutti_ludotheque",
    "rating": 9.0,
    "comment": "Deux, deux, deux!\n\nUn siècle d'existence, déjà, pour l'un des jeux les plus modernes et les plus fous qui soient. le principe est simple: imaginez un jeu de sept familles. Dès que la distribution des cartes est terminées, les joueurs peuvent s'échanger des cartes comme ils veulent, dans le désordre le plus complet. Le premier à avoir une famille a gagné…\n\nBon, j'exagère un peu, il y a quelques règles. Il y autant de familles que de joueurs. On propose, faces cachées, un certain nombre de cartes identiques. Dès que quelqu'un d'autres proposent le même nombre de cartes, on échange. Quand on a une famille, on tape sur la sonnette, et il y a une pénalité en cas d'erreur… Pour corser le tout, il y a le taureau et l'ours, qui peuvent se mélanger à d'autres cartes. L'un est un mistigri qui fait perdre des points à celui qui l'a lorsque la partie se termine, l'autre un joker qui peut aider à gagner... ou faire perdre des points si un autre gagne.\n\nVoila, c'est tout. Seul reproche: les cartes, de qualité \"classique\" sont bien fragiles pour un jeu où on se les arrache, et le jeu n'a pas une durée de vie très longue. Donc, gardez la sonnette et, comme moi, refaites vous un jeu en carton épais, filmé des deux côtés, indéchirable. Et profitez en pour rajouter quelques familles, de façon à pouvoir jouer plus nombreux encore…\n\nIl y eut, dans les années 70, une édition française, appelée Cambio, qui était depuis longtemps devenue introuvable. Fort heureusement, une nouvelle édition, dans laquelle les classiques céréales sont remplacées par des bovins, est prévue pour 2008 chez mes amis belges de Repos Prod..\n\nDe très nombreux jeux directement inspirés du Pit sont parus ces dernières années - Remmi Demmi, Zaubercocktail, Wheedle, Carambouille. Tous sont amusants à jouer, mais aucun n'a la sauvagerie et l'évidence de l'original.\n\n\nTwo, two, two!\n\nThis game is around now for almost a century, and it's still one of the most hectic and modern ones. The idea is th simplest of all: imagine a game of happy families. Deal the cards. Then all players can trade cards as they wish, without any turn order or such bothering rule. The first player with a complete family wins…\n\nWell, OK, there are a few more rules. There are as many families as players. Cards for trade are held face down, and the trade is made as soon as another player holds the same number of cards. When a player has a family, he hits the bell, and there are penalties for those who are wrong. Furthermore, there are two special cards, the bear and the bull. One is wild, but is also a penalty if you don't win, the other is a penalty.\n\nThis time, that's all. The only flaw of the game is the cards, that are often treated with great violence. They usually last about ten games before one or another is teared up to pieces. So keep the bell and, like me, make your own card game with heavy cardboard, laminated on both sides, impossible to break or cut. And, by the way, add two or three more familes so that you can play with more people. The more, the merrier…\n\nAnd if you buy it, buy the \"luxus\" edition, with the bell. A pit without bell is like a suitcase with no handle. Evenbetter, look for the belgian edition, to be published in 2008, with extra optional rules and noisy funny cows instead of mute and boring cereals.\n\nMany card games directly derived from Pit have been published these last few years. Remmi Demmi, Zaubercocktail, Wheedle, Carambouille are no bad games, and are fun to play, but none of them has the wild evidence and savagery of the original Pit.",
    "timestamp": 1693605600
  },
  {
    "username": "Pvergarae",
    "rating": 10.0,
    "comment": "Solo tienes que juntar los personajes y ganar!!!!\nme encanta la campana, es tan estresante!!!!",
    "timestamp": 1743717600
  },
  {
    "username": "TimDMighty",
    "rating": 10.0,
    "comment": "An incredible, chaotic and fun party game.\n\nYou are trying to corner the market on one commodity through trading with others in the group. The trick is that you do not know what the other people are trading.\n\nThe way you trade is to shout out how many cards you are willing to trade, at the same time that everyone else is doing the same. If you can agree to the number of cards you want to trade with someone else, you swap those cards.\n\nBut, watch out, if you get the Bear it sinks you 100 points.\n\nThis game is great if you have someone that gets overly excited about things during a game because they will tip their hand in the most hilarious ways!\n\nIf you like, loud, crazy, chaotic party games, this is a game you will love.",
    "timestamp": 1737673200
  },
  {
    "username": "Mad_Munoz2",
    "rating": 10.0,
    "comment": "This game is a hit at most game tables I bring it to. My family has been playing pit for decades, as our pit is a set from the 1960's. Simple, fun, and there are few games like it!\nA couple of notes about the game\n1. It is loud, so if you like quiet games this is not the game for you.\n2. It is extremely fast-paced, so if you prefer a slow game, it is also not for you.\n3. It can play fewer, but I wouldn't play it with less than 5. 6-8 is certainly the sweet spot, but it can play up to 10 well if you have two different sets of the game.\n4. I don't recommend playing with the bull and bear, as it's an additional rule that in my opinion doesn't add much to the game.\n5. The initial scoring objective in the rules is about 500 points if I remember correctly. This is hilariously ridiculous as a score to win. The game is a blast, but its sweet spot is about 20 minutes of play per session, 30 tops. I have personally lowered the score needed to win to 150 and feel it works well.\n6. Maybe doesn't apply to most, but I play it with English-learning students from other countries(I'm from the U.S.), and they always love it. It is a great game to play if not everyone speaks the same language.\n7. Also good to have a calm and slower paced game in your collection that you can play afterwards, because everyone's energy level will be sky high, and everyone will likely just got done being loud, so good to decompress afterwards.\nI hope that everyone enjoys!",
    "timestamp": 1737414000
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "Trading as a loud party game, and not as a quiet euro game? Sign me up.",
    "timestamp": 1729893600
  },
  {
    "username": "CryingHero",
    "rating": 10.0,
    "comment": "More players more madness. Try a silent round for ultimate chaos.",
    "timestamp": 1714082400
  },
  {
    "username": "Indiana_Chad",
    "rating": 10.0,
    "comment": "This is a really fun card game. My parents played it and taught to me when i was about 12. It’s fast and frantic as it’s all happening in “real time” making trades and tying to “corner the market”. Give it a try as I’ve had friends of all ages who found they enjoyed it after a few plays.",
    "timestamp": 1704927600
  },
  {
    "username": "GrittyWillis",
    "rating": 10.0,
    "comment": "WIFE: 10\n\nthe loudest most fun party game to exist maybe....film your sessions and enjoy watching the insanity.",
    "timestamp": 1703631600
  },
  {
    "username": "kaelorian",
    "rating": 10.0,
    "comment": "1.16",
    "timestamp": 1681423200
  },
  {
    "username": "hripka",
    "rating": 10.0,
    "comment": "Excellent action-packed game. Bull and Bear cards introduce luck and bluffing to this fun game.",
    "timestamp": 1671318000
  },
  {
    "username": "sculley",
    "rating": 10.0,
    "comment": "30+ plays. Quite possibly the most (laughing) fun you will have playing ANY game. Best with as many players as you can find to play it, especially if they are family.",
    "timestamp": 1660168800
  },
  {
    "username": "thebogdan",
    "rating": 10.0,
    "comment": "Two Two Two Two Two",
    "timestamp": 1654380000
  },
  {
    "username": "bubbajonez",
    "rating": 10.0,
    "comment": "Played",
    "timestamp": 1646866800
  },
  {
    "username": "scuzzos",
    "rating": 10.0,
    "comment": "It's wild yo.",
    "timestamp": 1645484400
  },
  {
    "username": "Jeruzelsky",
    "rating": 10.0,
    "comment": "The best party game.\nBut you NEED card protecting sleeves. Cards WILL get bent.",
    "timestamp": 1614726000
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "used",
    "timestamp": 1609801200
  },
  {
    "username": "SkyeL53",
    "rating": 10.0,
    "comment": "Can’t lie, this game has so many great memories attached to it that I probably scored it so high due to its nostalgia factor.",
    "timestamp": 1593986400
  },
  {
    "username": "simoncorne",
    "rating": 10.0,
    "comment": "Very simple card game involving a lot of frantic shouting. Lots of fun. Played a basic, three-player game.\n\nPicked up another cheap early copy from a charity shop, now at school.",
    "timestamp": 1588629600
  },
  {
    "username": "sqdldr",
    "rating": 10.0,
    "comment": "One of the best introductory games out there.\n\nLoads of replayability. Quick, and loud.\nEverything a (insert your classification of the game mechanics here) game should be.",
    "timestamp": 1573772400
  }
]