[
  {
    "username": "Big Bad Lex",
    "rating": 1.0,
    "comment": "Unfortunately on 26-11-2009, BGG were instructed to remove all uploaded files all all GW games. Even those files with no copyrite material.\n\nThe games might be OK but the company attitude to it's customers is definitely broken. All my GW game ratings are reduced to '1's until GW mend their piss poor attitude to their client base and files are allowed to be reinstated..",
    "timestamp": 1259190000
  },
  {
    "username": "Tsaar",
    "rating": 2.0,
    "comment": "Had it in he 90s. On one evening me and some friends painted all the miniatures, but it remained unplayed.\nGave it away a couple of years ago and at least it's being in use for W40K adventures now.",
    "timestamp": 1474149600
  },
  {
    "username": "Salo sila",
    "rating": 3.0,
    "comment": "It felt more aimed at running Warhammer campaign than being a game in its own right, so I wasn't so keen on it.\n\nSold on BGG Market.",
    "timestamp": 1605222000
  },
  {
    "username": "lparigi34",
    "rating": 3.5,
    "comment": "Not a good game per-se, can be long... Better if used as a campaign control system...",
    "timestamp": 1633989600
  },
  {
    "username": "HardCore",
    "rating": 5.0,
    "comment": "Fiddly. Too many rules for what is. Still fun to move plastic around.",
    "timestamp": 1677798000
  },
  {
    "username": "RalfMalf",
    "rating": 5.0,
    "comment": "I liked the idea of it but found it a bit boring. There were always better games to play, even back in the early '90s.",
    "timestamp": 1677625200
  },
  {
    "username": "chrisgledhill",
    "rating": 6.0,
    "comment": "Empire-building in a fantasy setting using hexes was a neat idea.\nPerversely; the minis now look tame compared with the tons of plastic that are served up with TI3/4, Eclipse, WotR and their ilk.",
    "timestamp": 1717970400
  },
  {
    "username": "lordtoede",
    "rating": 6.0,
    "comment": "Great idea and fun to play but extremely dependent on luck",
    "timestamp": 1672268400
  },
  {
    "username": "Parsdunk",
    "rating": 7.0,
    "comment": "X",
    "timestamp": 1661032800
  },
  {
    "username": "Colemaninho",
    "rating": 8.0,
    "comment": "Empire building in the WFB universe, awesome. An experience I keep trying to achieve with other empire builders, but likely never will due to the rose tinted glasses",
    "timestamp": 1511132400
  },
  {
    "username": "Pete_Morrigan",
    "rating": 8.5,
    "comment": "Enjoyed this loads, even in standalone mode, in my youth. Just creating maps was fun, loads of nice miniatures. Would probably cost a small fortune if it was released today. Wish I still had it.",
    "timestamp": 1660600800
  },
  {
    "username": "Raf Richman",
    "rating": 10.0,
    "comment": "Tengo que valorarlo con un 10! El juego es una joya para dirigir campañas de warhammer , armies of arcana o cualquier wargame. Así que hay que valorarlo como eso, no es para jugarlo en 2 horas ni 4, sino para tenerlo montado y llevar una campaña a lo largo de meses. Facilmente adaptable con reglas de la casa que se nos ocurran. La mejor combinación son los hexagonos de plástico que sacacó GW hace unos años con las reglas de esta versión Old School (circula el pdf por internet).",
    "timestamp": 1578351600
  }
]