[
  {
    "username": "cesartustro",
    "rating": 1.0,
    "comment": "Juego de cartas de bazas. Un rollo.",
    "timestamp": 1335650400
  },
  {
    "username": "Eiska",
    "rating": 2.0,
    "comment": "Why did I play this? I don't like murder mystery games at all. Also, this game is too fucking long.",
    "timestamp": 1524693600
  },
  {
    "username": "SultanSevy",
    "rating": 3.0,
    "comment": "Confusing. Couldn't wrap my head around the rules during an initial read-thru, which turned me off from this card game. Tempted to throw it in the trash.",
    "timestamp": 1747173600
  },
  {
    "username": "EllenCaroline",
    "rating": 4.0,
    "comment": "used to own",
    "timestamp": 1750802400
  },
  {
    "username": "SochaDJ",
    "rating": 5.0,
    "comment": "Only game that ever led to a fight. I tried explaining this game to my in-laws while on vacation. I went through the cards and explained alias and alibi's but my sister-in-law got angry and wanted to know the strategy she should use. I explained no one knew because none of us had ever played the game before. We'll try a test hand and see how it goes. She refused to let it go which I couldn't understand. She threw a fit and stormed off. It was weird to say the least. Needless to say, the game never made it to the table.... ever. But its still a funny joke from time to time. \"Rummy anyone?\" brings out snickers with the family. Looked like a great game.",
    "timestamp": 1741302000
  },
  {
    "username": "adesireg",
    "rating": 5.0,
    "comment": "Small Box",
    "timestamp": 1740178800
  },
  {
    "username": "muncleuncle",
    "rating": 6.0,
    "comment": "2-4, Best: 2 / 45 min\n\n?\n\nTESTEN, KANN EVTL. WEG",
    "timestamp": 1751580000
  },
  {
    "username": "holycopralite",
    "rating": 6.0,
    "comment": "Purge",
    "timestamp": 1739746800
  },
  {
    "username": "Epictetus2023",
    "rating": 7.0,
    "comment": "Never played. Trade with all the other mystery Rummy Games combined, No box, all the games kept together in bags and plastic bin.",
    "timestamp": 1761097500
  },
  {
    "username": "Choukou",
    "rating": 8.0,
    "comment": "This game is great at 2p. The rules are some of the worst written I've ever come across but the juice is well worth the squeeze. The theme works really well and I find the gameplay really satisfying.",
    "timestamp": 1759096800
  },
  {
    "username": "peacmyer",
    "rating": 8.5,
    "comment": "Tension of the Ripper escaping adds quite a bit. Gift to the Gordons; MRJ. Spare copy intended for RLM. Copy coming for RLM via BGG Trade.",
    "timestamp": 1760824800
  },
  {
    "username": "akumabro",
    "rating": 10.0,
    "comment": "Fun. Rummy lends itself well to the theme of solving a mystery. Relaxing gameplay. Scales well. Great 2 player game.",
    "timestamp": 1676588400
  }
]