[
  {
    "username": "davegw78",
    "rating": 1.0,
    "comment": "Never actually owned this one; just have some counters from this game.",
    "timestamp": 1628287200
  },
  {
    "username": "djberg96",
    "rating": 1.0,
    "comment": "Comments are based on the First Edition. The Coalition has more ships, more money, and a better production schedule. With a predictable and consistent percentage based combat system, when does the miracle happen for the Allies? Never. In short, the game is solvable with the right mix of builds and repairs for the Coalition.\n\nThe designer clearly assumed the Klingons would be attrited from a massive Kzinti homeworld assault. Instead, the Klingon player can use the Lyrans for cannon fodder on the outlying systems and pin the rest of the Kzinti fleet on their homeworld while building a massive fleet to swarm the Federation player with.\n\nThat, combined with an absurdly lengthy rulebook (I've read that the 2010 version is up to 146 pages), gobs of counters, obscene playing time, excessive record keeping and a complete lack of strategic command & control, make this game a complete turd.",
    "timestamp": 1412805600
  },
  {
    "username": "Electric Joe",
    "rating": 2.0,
    "comment": "Ambitious, but ultimately crushed by its own bloated order of battle. Too big to play unless you have a sizable and steady SFB gaming group, or you do some \"trimming.\"",
    "timestamp": 1630101600
  },
  {
    "username": "Alyiz",
    "rating": 2.0,
    "comment": "I thought I would really love this game. Hex and chit space wargame? That's exactly up my alley. Insanely complex? Bring it on! Except, unfortunately not. This game is not complex. It's insultingly simple.\n\nFrom the moment you start reading the rules, one thing will start to become abundantly clear: you do not \"play\" Federation & Empire, not much anyway. I have the 2016 reprint with all the latest rules changes so this is the fairest review that can be given.\n\nIn F&E, what you actually do is faithfully remake the entire history of Star Trek, with a few minor accounting differences here and there. The game has an accounting ledger where you write in what you spend and where each turn. However, you can't build certain ships until certain turns, and you're just given them. Everything in the game is locked down by areas of space and turn count. It's like waiting until a certain time to be given permission to actually play this.\n\nUnderneath all that is clearly a robust wargame waiting to get out. Unfortunately, we couldn't even finish this because we were tired of playing \"Mother May I\" with a board game's rules. It was insulting from start to finish. Hard pass forever.",
    "timestamp": 1487286000
  },
  {
    "username": "stuuk",
    "rating": 3.0,
    "comment": "Too much of everything in a mostly unplayable package.\nPlayed back when I didn't have kids and a job. Even then I'm not sure we enjoyed playing it, or just slogged through. Back then game complexity was just fine. Now I want the designer to do some work and not simply add more rules.\nWould need to be shrunk by 90% and totally re-engineered to make this a game.\nThat said I don't know how much life ADB has left. Not a lot I suspect.",
    "timestamp": 1522360800
  },
  {
    "username": "grimsmirk",
    "rating": 3.0,
    "comment": "Rated low because it has two choices for combat resolution: Play out a game of Star Fleet Battles, which would make it nearly impossible to complete a game. Or, use a quicker combat system that is just a grind where attrition takes out the smaller fleet.",
    "timestamp": 1358031600
  },
  {
    "username": "nyhotep",
    "rating": 4.0,
    "comment": "The completist in me made me buy the expansions, even though I detest the StarFleet Universe.\n\nI'm not particularly fond of Star Trek in any case, but SFU is just vile, non-canonic drivel that bears no resemblance to the TV/ Movie Star Trek universe.",
    "timestamp": 1654812000
  },
  {
    "username": "Michael Ward",
    "rating": 4.0,
    "comment": "Obtained 07/16/86.\n~ August 30, 2004: Takes forever, since no mater how much you hurt a neighbor he can on his turn churn out copious amounts of replacement ships.",
    "timestamp": 1589493600
  },
  {
    "username": "SeanC",
    "rating": 5.0,
    "comment": "A strategic/operational treatment of the SFB universe, which kind of fell flat, especially with very dry economic & combat systems.",
    "timestamp": 1481065200
  },
  {
    "username": "turks1966",
    "rating": 5.0,
    "comment": "Way to complicated, not a very easy game to get into, could have been so much more. Box has some damage, way it came when I got it.",
    "timestamp": 1457132400
  },
  {
    "username": "calandale",
    "rating": 5.0,
    "comment": "Fairly tedious game with little to offer in and of\nitself, but served as the ultimate scenario generator.\nUnfortunately, in that role, the tremendous imbalance that\ncertain races (mainly drone users) have in giant fleet\nSFB battles was made absolutely clear; my group never\nfavored such on their own, but this game opens up\nwith the Klingon-Kzin war, and even speed 20 drones in fleet\nactions trump every other weapon system - a fact not\nreflected in F&E itself, so IF you wanted to play out\na few interesting battles, you'd get wildly different\nresults from what the game depicts.",
    "timestamp": 1424386800
  },
  {
    "username": "Vexation",
    "rating": 5.0,
    "comment": "It is definately a very good monster game, but way too hard for me",
    "timestamp": 1346968800
  },
  {
    "username": "von_ubelmann",
    "rating": 6.0,
    "comment": "This is the hardest game I have had to rate, simply because of how sprawling it is. I've been playing it for several months now, so in a sane world and with a sane game, that would give me enough experience to fully feel out the system and feel confident in my judgement.\n\nBut we are talking about the madness that is Federation & Empire.\n\nThe game is very modular, so your group has the ultimate say on just how complex you want to make the game. That customizability is probably the best thing Federation & Empire has going for it. But it is also a rabbit hole filled with seemingly endless options. There are rules for just about every situation imaginable. And that, I admit, was part of the initial draw for me, but living it now is also overwhelming. Until you experience it, I don't think anyone can really prepare themselves for the amount of rules Federation & Empire brings to the table.\n\nThat said, I will not fault Federation & Empire for the scope of it's rules. No, it never claimed to be anything less than a comprehensive treatment of an interstellar war. Instead, I will focus on two main issues I have with the game: combat and freedom.\n\nThe combat in Federation & Empire has the feel of smashing toy spaceships together. It is one of the simplest aspects of the game, it drags on far past it's welcome, and there is a lot of it. You place your units on a battle board, the attacker and defender each roll a d6, and cross reference your roll with the total firepower of your ships on a percentage chart for how much damage you inflict on the other fleet. Repeat the process until one player retreats or is wiped out. There isn't a lot to it compared to the rest of Federation & Empire, and it becomes a slog. Now, you could fix this by playing out the battles via Starfleet Battles, which is great combat system, but then you have just raised the complexity of the game to the power of another game, and with the amount of ships and battles, beyond the scope of one person per power. It is a fix, but it is a fix turned up to 11.\n\nMy second issue with the game is freedom. From what I understand of the lore, Federation & Empire tells the story of how a interstellar war broke out among the great powers of our neck of the galaxy. So, when you play Federation & Empire, you are playing the story of not any war, but that specific war. The sides are locked in, there is no diplomacy, the entry of powers into the war is scripted, and you have scheduled of what units you can buy each specific turn. This is not a sandbox game, this is a re-enactment of a war that you would get in the same way if you were playing a wargame on WWII, for instance. But while I can get enjoyment from that style of game about events that actually happened, to do so with Federation & Empire I'd have to be more invested in the lore of Amarillo's Starfleet universe than I am.\n\nFederation & Empire is really like nothing else. It is an experience, one that is going to last me a long time more. And I get to spend it with people I enjoy hanging out with. I do have fun with it, and I am sure I will have more fun with it. But after the war finishes, I don't think I will ever make such an investment into the game again.",
    "timestamp": 1625868000
  },
  {
    "username": "Cleitus the Black",
    "rating": 6.0,
    "comment": "I have the original 1986 version, which has the advantage of being somewhat streamlined (if you can use the word in relation to this game at all).\n\nIt is still very clunky, with many things that need to be recorded on paper. Definately not for the faint of heart. But, there is no other game quite like it, and if you want a wargame of the Star Trek universe, and an indepth one, this is the only game in town.\n\nStill, I can't help but redesign, in my head, certain aspects of it every time I play. With just a little thought, this could be made a much better game.\n\n(How about point tracks instead of written records for the economic aspects of the game?)",
    "timestamp": 1618437600
  },
  {
    "username": "cynewulf44",
    "rating": 6.0,
    "comment": "the only game I have that need the expansion set to do the main game setup. I have played bits of this but the full game is just totally unachievable in anything resembling an sensible timeframe",
    "timestamp": 1595196000
  },
  {
    "username": "Apophatic",
    "rating": 6.0,
    "comment": "Had issues but the SFB play test group here house ruled it and developed a replacement in the long wait for a re-print",
    "timestamp": 1558389600
  },
  {
    "username": "PilotB52",
    "rating": 7.0,
    "comment": "Nice strategic companion to the tactical oriented Star Fleet Battles game.",
    "timestamp": 1688680800
  },
  {
    "username": "NavarreGamer",
    "rating": 7.0,
    "comment": "Grand strategic space game that has just too many rules. More time is spent chasing rules than enjoying the game. So much so, we have modified to suit, prefer Space Empires.",
    "timestamp": 1611010800
  },
  {
    "username": "Arastimir",
    "rating": 8.0,
    "comment": "Plus PDF of 2010 rules.",
    "timestamp": 1708210800
  },
  {
    "username": "SpyAvon",
    "rating": 8.0,
    "comment": "complex and fun lol....as long as someone else knows the rules",
    "timestamp": 1627077600
  },
  {
    "username": "zaarin7",
    "rating": 9.0,
    "comment": "There is not another game like this. I have had the opportunity to play the first 10 turns twice over the years. I would love to play the campaign out. I'm up for Vassal/Skype play. I've also got Cyberboard but would need help with opening the game. I have bought every version listed here and every expansion every done. I have bought at least three copies of every counter sheet ever done minimum, up to six of some. I probably have\n55K+ counters for this game.\n\nNow have my rule book updated complete to the latest expansion books. Also have all 3 of the Compendiums.",
    "timestamp": 1750975200
  },
  {
    "username": "dalec",
    "rating": 9.0,
    "comment": "I'm a former SFB player and love the theme, Hex and counter of the SFB wars. General War is too long, I normally play one race against another Lyran vs. Kzinti, etc",
    "timestamp": 1707865200
  },
  {
    "username": "jwood314",
    "rating": 10.0,
    "comment": "My second favorite Monster game after WiF. I have been playing this since 1989.",
    "timestamp": 1688335200
  },
  {
    "username": "johnwong882",
    "rating": 10.0,
    "comment": "+ Plantary Operations\n+ Combined Operations\n+ Advanced Operations\n+ Strategic Operations\n+ ISC War\n+ Large Scale Map\n+ Early Beginning\n+ Minor Empires",
    "timestamp": 1650405600
  }
]