[
  {
    "username": "trawlerman",
    "rating": 1.0,
    "comment": "This is the game that convinced me that I hate blind bidding.",
    "timestamp": 1687989600
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "Blind bidding and take that cards. I'm out.",
    "timestamp": 1669244400
  },
  {
    "username": "grasa_total",
    "rating": 3.0,
    "comment": "For me, fell to the big drawback of multiplayer blind-bid games (\"surprise! you lose.\") And the large variation in spell power sat uneasily with the rest of the game.\n\nRedeeming factor: Hey, it's by Richard Breese!",
    "timestamp": 1732575600
  },
  {
    "username": "dakotamassie",
    "rating": 4.0,
    "comment": "Its way too long for what it is\nAlso some of the cards are way too mean\nThe game is way too random for how long and frustrating it is",
    "timestamp": 1757714400
  },
  {
    "username": "bggmatje",
    "rating": 5.0,
    "comment": "[December 2021]\nI was interested in this game because it has quite some cool mechanisms and looks like it has a nice game flow. But I didn't enjoy playing it. Blind bidding, take that actions, there is just too much chaos that can mess up your plan. And you do it four times in a row.\n\nI went in thinking this was a strategy game, but it is actually a beer and pretzel game. Even as a beer and pretzel game, I think this one is mediocre. Would rather play something like Libertalia or RoboRally.",
    "timestamp": 1708815600
  },
  {
    "username": "ziph4",
    "rating": 5.0,
    "comment": "Morgenland",
    "timestamp": 1699138800
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "FAQ: https://boardgamegeek.com/filepage/29374/alladdins-dragons-f...\n\nIt's just okay.",
    "timestamp": 1759874400
  },
  {
    "username": "ShiannLin",
    "rating": 6.0,
    "comment": "Re-implements: Keydom\n\n2003 Nederlandse Spellenprijs Nominee\n2001 International Gamers Awards - General Strategy; Multi-player Nominee\n2001 Games Magazine Game of the Year Winner\n2000 Meeples Choice Award Nominee",
    "timestamp": 1736722800
  },
  {
    "username": "mjacobsca",
    "rating": 7.0,
    "comment": "I really enjoyed this game!",
    "timestamp": 1759096800
  },
  {
    "username": "systemsam",
    "rating": 7.5,
    "comment": "A good light game with some legs to it. A nice intro to worker placement with use of powers and cards. That and the blind bidding keeps it entertaining for all.\nTop tip: take an artefact from each pile blind and return to the box - adds mystery and keeps the length down.",
    "timestamp": 1757455200
  },
  {
    "username": "germanggek",
    "rating": 9.0,
    "comment": "Extremely exciting worker placement game with lots of interaction, quickly explained rules and a pleasant playing time. Great!",
    "timestamp": 1737673200
  },
  {
    "username": "Tolkana",
    "rating": 10.0,
    "comment": "11\n\nIntressant familjespel",
    "timestamp": 1661205600
  }
]