[
  {
    "username": "marcus_t_k",
    "rating": 1.0,
    "comment": "CULLCULLCULLCULL",
    "timestamp": 1713996000
  },
  {
    "username": "Koko_Lores",
    "rating": 1.0,
    "comment": "JKS",
    "timestamp": 1642546800
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1630360800
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "Played twice. Felt like I was doing nothing. No fun at all for me.",
    "timestamp": 1416697200
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Circus Flohcati: Japanese edition - \"Treasures of Summer\"",
    "timestamp": 1712440800
  },
  {
    "username": "Maglinkinpark",
    "rating": 3.0,
    "comment": "This was a 20 minute activity of pulling cards at random and laying them down for points. VERY uninteresting.",
    "timestamp": 1635199200
  },
  {
    "username": "PizzaChip",
    "rating": 4.1,
    "comment": "Zbieranie zestawów z elementem ryzyka. Można pograć z dziećmi lub z braku laku w jakimś pubie. W innym przypadku nie poświęcę na to swojego czasu, gdyż myślę, że jest masa innych tytułów z podobnym poziomem trudności i czasem trwania, jak Pchli cyrk.\n\nOcena po 1 partii w 3 osoby. Czas gry = 16 min.",
    "timestamp": 1716242400
  },
  {
    "username": "pvtparts",
    "rating": 4.0,
    "comment": "The take that elements really date this game and make it a bit of a flop for me",
    "timestamp": 1695592800
  },
  {
    "username": "pitonowie",
    "rating": 5.0,
    "comment": "Very simple push Your luck, set collection game with \"Knizia touch\" on final scoring. Plays fast because decisions are rather obvious.",
    "timestamp": 1760133600
  },
  {
    "username": "Wigdogger",
    "rating": 5.0,
    "comment": "An okay filler, but something about it didn't evoke the joy of \"Flip 7\" or the emotion of something like \"Sea Salt and Paper.\" Those other games just create more big moments and feeling, and I think the art is also better in something like SSAP.\n\nThis is your standard push-your-luck card game, where you flip up cards and hope to not match suits. If you do, you bust and get nothing. Normally, you can stop at any time and take a card from the display. You want, ideally, cards from each of the 10 suits (your highest card of each suit is what scores), but you can also make sets of three of the same number for a quick 10 points that's locked in. If you get all 10 suits, you get a bonus 10 points.\n\nAgain, everything is fine in this, including the art, but something about the pace and chance-taking just wasn't as potent in this for me when I compare it to the bombast found in \"Flip 7.\"",
    "timestamp": 1757628000
  },
  {
    "username": "rauschpotato",
    "rating": 5.0,
    "comment": "1 play, 4p:\nI wonder if this game is ultimately draw, draw, draw to get 10 colors in hand first. There's rules about cards in hand at the end of game being points, and sets you can place down for 10 points. But all of that is meaningless if a player can get 10 colors in hand, which doesn't seem difficult.",
    "timestamp": 1752703200
  },
  {
    "username": "Dromman",
    "rating": 5.0,
    "comment": "Meh",
    "timestamp": 1749592800
  },
  {
    "username": "selwyth",
    "rating": 6.0,
    "comment": "Nice take on Rummy/Mahjong that augments the push-your-luck nature, always the best part of them. Simple rules, plays fast, elegant. Knizia is a master of setting up decisions with scary odds (Lost Cities, Ra).\n\n4+3",
    "timestamp": 1759528800
  },
  {
    "username": "Table43",
    "rating": 6.0,
    "comment": "A good press your luck card game with set collection and hand management that all works well. I have several different versions with art I prefer.",
    "timestamp": 1758405600
  },
  {
    "username": "Ephorus",
    "rating": 6.0,
    "comment": "What I like:\n- Casual and easy push your luck game with some twists.\n- Scoring leads to trade-offs. Do I got for the low trios, do I go for high cards, very situational but nice if the plan works out.\n\nWhat I dislike:\n- Not sure if the Take That cards are necessary.",
    "timestamp": 1757282400
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 794764086263\ncd rek 2",
    "timestamp": 1757196000
  },
  {
    "username": "couchlife",
    "rating": 7.0,
    "comment": "10/20/25 - Fun, fast, and light, but just not as good as similar games I own.",
    "timestamp": 1760911200
  },
  {
    "username": "HetSpelletjeskoppel",
    "rating": 7.0,
    "comment": "? Game instructions:\nIn Circus Flohcati, you try to collect as many circus cards as possible. Shuffle all the cards and form a draw pile. On your turn, choose a card from the face-up cards. If there are no cards next to the pile, draw a card from the pile and place it face up. You may draw as many cards as you wish, but you must stop when you select a card or when you turn over a card that is already face up on the table. Place the new card on the discard pile. If you turn over an action card, you must perform the action. Before your turn ends, you may make a trio (3 cards of the same value), which earns you 10 bonus points. You can also make a Gala Show (10 different attractions). With a Gala Show, you score 10 points and the game ends immediately. The game also ends when the draw pile is empty. You get points for cards in your hand, trios, and any Gala Show you may have. The player with the most points wins the game.\n\n⭐ Our review:\nWe think Circus Flohcati is a fun, fast-paced game. The artwork is funny and the rules are simple. A game lasts a maximum of 20 minutes, making it ideal for in between other activities. It is sometimes a huge gamble whether to continue drawing cards or to take a card from the available cards. This makes it a fun push-your-luck game.",
    "timestamp": 1760047200
  },
  {
    "username": "Drb89_",
    "rating": 7.5,
    "comment": "Hand management\nPush your luck\nNice production",
    "timestamp": 1760911200
  },
  {
    "username": "Fencejummper",
    "rating": 7.5,
    "comment": "Quick and easy drafting game. I like the simplicity of the gameplay and the art is nice.",
    "timestamp": 1760306400
  },
  {
    "username": "Brother Abe",
    "rating": 9.0,
    "comment": "May 2025\nGameNerdz $10.97",
    "timestamp": 1752444000
  },
  {
    "username": "flamejuggler",
    "rating": 8.5,
    "comment": "bring on the freaky anthropomorphic fleas. vintage circus fan.",
    "timestamp": 1747260000
  },
  {
    "username": "Bogarona",
    "rating": 10.0,
    "comment": "Een luchtig en snel kaartspel, met veel geluk. En dat dien je te beproeven wil je die mooie hoge kaarten krijgen.. of ga je voor veilig en pak je een open, maar lagere kaart voor een set van 3. De 3 actiekaarten in het spel zorgen voor een vleugje pit.\nHet spel heeft meer in zich dan op het eerste gezicht laat zien, maar ja, het blijft natuurlijk een Knizia.\n\nBlijft in de collectie.",
    "timestamp": 1752789600
  },
  {
    "username": "SpaceAlien",
    "rating": 10.0,
    "comment": "2p, lost",
    "timestamp": 1748901600
  }
]