[
  {
    "username": "RonCarlson01",
    "rating": 1.0,
    "comment": "G036",
    "timestamp": 1383606000
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "Unnecessary expansion that adds complexity, game time, and most importantly in the case of the Anniversary edition, also extra box volume which El Grande simply doesn't need.",
    "timestamp": 1760911200
  },
  {
    "username": "Citery",
    "rating": 3.0,
    "comment": "In an effort to smooth the randomness of the action decks in the base game, the deterministic player hands of K&I somehow create more tactical chaos in El Grande. There are now potentially five(!) copies of a destructive action card floating around at the table instead of just one or two, and they can be deployed by anybody with little foreknowledge or means of rebuttal. The order that cards came out in the base game could be admittedly swingy, but what could happen in a round was always known and usually manageable. In comparison to the wild west of K&I's action buffet, the base game's variance looks sedate.\n\nThe distribution of the new actions seems off as well, being tilted more towards court denial and straight up removal of opponents' pieces rather than caballero movement on the board, which always maintained a satisfying presence in the base game because the entire \"1\" deck was dedicated to variable and powerful move actions. This variation has been replaced by a static and underpowered Intrigue card, which never seemed to allow for the subtle caballero management of the base game's intrigue deck.\n\nThe fusing of the action cards with the turn order bid also fails to capture any of the excitement of the draft/bid in the base game, and much of the texture of managing your opponents' positions against the shared pool of actions has been lost. The drama of this section of the game has been completely neutered, and it was absolutely central to El Grande's charm.\n\nThis is a radical variant with lofty goals, and I respect what it was trying to accomplish, but if El Grande had shipped like this, as the designers supposedly intended, I would have never taken to it. Sure, it was a crunchy experience on its own terms, but it wasn't the irreverent El Grande I know and love, and unfortunately for K&I, expansions are a zero-sum game.",
    "timestamp": 1666648800
  },
  {
    "username": "JoshuaStarr",
    "rating": 4.0,
    "comment": "A \"better\" game that is actually worse. This game eliminates luck by letting each player build a hand of 13 (out of 18) action cards at the beginning of the game. For me though, this variant took away the soul of the game while making it far more chaotic and less predictable. In the original, each round a set of 5 possible actions are presented to you and the players must think through what each other wants. In this expansion, on the first round there are something like a million possible things that can happen (18*17*16*15*14). It takes what is essentially an auction for 5 items and makes it a guessing game about 50 items and ultimately subverts the soul of El Grande.",
    "timestamp": 1700262000
  },
  {
    "username": "Subaru77",
    "rating": 5.0,
    "comment": "Csak az érzés maradt meg, hogy már az alap El Grande sem jött be, ez pedig fokozta a szenvedést.",
    "timestamp": 1591480800
  },
  {
    "username": "Deeevorce",
    "rating": 5.0,
    "comment": "Played it once, but I like the other expansion (Grand Inquisitor and Colonies) better.",
    "timestamp": 1521414000
  },
  {
    "username": "millsyboy",
    "rating": 6.0,
    "comment": "It is certainly still El Grande at the core, but players at the end of the bidding turn order now have quite a bit of potential power to decide who will get the king or intrigue actions, and who will get to play their card action. El Grande certainly does not need any expansions, but if you know the original game well and would appreciate some variety, this could be worth checking out (it has been included in the big box and decennial editions of El Grande)",
    "timestamp": 1761077640
  },
  {
    "username": "HughCross",
    "rating": 6.0,
    "comment": "a reverse of the tradional formula! not very fun tho but nice to play once in a while",
    "timestamp": 1748469600
  },
  {
    "username": "Philip Honeybone",
    "rating": 7.0,
    "comment": "Storage - Hall 11",
    "timestamp": 1712440800
  },
  {
    "username": "muncleuncle",
    "rating": 8.0,
    "comment": "2-5, Best: 5 / 90 min\n\nSdJ 1996 (BLEIBT!)\nDSP 1996 (BLEIBT!)\n\n?\n\nTOP 250 (BLEIBT!)",
    "timestamp": 1751580000
  },
  {
    "username": "Pollux1969",
    "rating": 9.0,
    "comment": "Wow, this so so much better than any Risk variant! Still with modern feeling...",
    "timestamp": 1741302000
  },
  {
    "username": "treunes",
    "rating": 10.0,
    "comment": "See my comment for El Grande Big Box (2015)",
    "timestamp": 1686002400
  }
]