[
  {
    "username": "Dragoons_Kane",
    "rating": 1.0,
    "comment": "One of the worst games in the history of games. Really, really terrible and un-fun. Shame on Avalon Hill for publishing this.",
    "timestamp": 1394406000
  },
  {
    "username": "ericleesmith",
    "rating": 1.0,
    "comment": "What a turkey! For collectors only. I have already sold my copy on eBay.",
    "timestamp": 1288825200
  },
  {
    "username": "jose633",
    "rating": 1.0,
    "comment": "This game is a real mess. Not fun at all.\nMess and unreadable rules = Berg's game.",
    "timestamp": 1229209200
  },
  {
    "username": "DONALD65",
    "rating": 1.9,
    "comment": "This has to one of the worst games published by the Avalon Hill game company. Berg is often viewed as a great designer and when I bought this I had many of his games and I viewed them extremely positive. Unfortunately this game was not typical of the other games he designed that I purchased. The rules are so poorly presented that in some respects it is virtually unplayable without major inhouse modifications. Even with these house rule change the game is a mess. It was an extreme task to learn, relearn, modify and attempt to play. This should not happen in ones hobby that should be a fun engaging activity. And relaxing past time.This was a complete exercise in futility. A waste of time, patience and money. Thankfully I have very few games like this in my collection. For me this was a one off for Berg as he went on to produce some great games such as the MOI series.",
    "timestamp": 1741302000
  },
  {
    "username": "anibal",
    "rating": 2.0,
    "comment": "What the f#%!ing game is this!.beautiful counters, board and cards but the game is horrible.laying on the bed or watching tv is more exciting and funy than playing.",
    "timestamp": 1210111200
  },
  {
    "username": "mats-k",
    "rating": 2.0,
    "comment": "Playing the Indians is like spending other people's money - the best strategy is to waste as many people as possible while getting VPs, because someone else will probably get them next turn. Degenerate, borders on broken.",
    "timestamp": 1205967600
  },
  {
    "username": "xlegion",
    "rating": 3.0,
    "comment": "Standard Richard Berg fare. Too much chrome destroys the whole 'fun factor' in playing it. Too long to play, needed a developer to make this a gem. (It's not) One of the worst rule books that I have ever read.",
    "timestamp": 1557093600
  },
  {
    "username": "robvollman",
    "rating": 3.0,
    "comment": "Had a good historical feel, but wasn't much fun to play. For me at least.",
    "timestamp": 1386543600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 3.0,
    "comment": "We abandonded this one before finishing our first game.",
    "timestamp": 1371765600
  },
  {
    "username": "gramsdad",
    "rating": 4.0,
    "comment": "Created during the last days of Monarch Avalon Hill's existence, Geronimo's rules suffer from a lack of organization and coherence. It's obvious that the game was rushed out and an attempt at decent editing was skipped, which is too bad because a large-scale examination of the entirety of the Indian Wars in the American West is unique to wargaming. The photo of Berg wearing a native headdress, and bears a bit of testament to his hubris. Still, Geronimo's components are good, and with a little work, an experienced gamer could make the game into a fun experience. It's interesting that this game was an influence on Toppen's Navajo Wars and Commancheria.",
    "timestamp": 1737500400
  },
  {
    "username": "Tyson2015",
    "rating": 3.9,
    "comment": "On the surface this should be a solid game. The components are good and even somewhat better then typical for 1995. The game itself is a complete miss. The rules are very unclear and will take a huge investment in time to comprehend. Playing the game will help a bit but vast time and effort will be exhausted in this process. In the end due to the poorly written rules and cumbersome mechanics the game become tedious and not worth the effort. Played with several opponents who typically gave up play after a few turns. Most found the topic a draw but the game itself a complete bore due to the constant rule misinterpretations and ambiguities. Most found the process of flipping through the rule book a complete drain and game downer. It probably took me 5-6 hours to go through the rules and an equal amount of time to fumble through game play. In the end this type of investment in time is not worth it it for a lack lustre game that was exhaustive to learn and play. Shame because I have owned this game for years and finally had the time and other players needed for game play and it turned in to a complete bust.",
    "timestamp": 1735599600
  },
  {
    "username": "Beyak",
    "rating": 4.0,
    "comment": "BURNED IN FIRE, OCTOBER 2017\nPoorly written or organized rules ruin this game.",
    "timestamp": 1556056800
  },
  {
    "username": "Flyer",
    "rating": 5.0,
    "comment": "American Indian Wars\nSolo Playable\nAvalon Hill",
    "timestamp": 1730934000
  },
  {
    "username": "dragooned",
    "rating": 5.0,
    "comment": "VERY interesting system of a difficult subject. But, couldn't figure out how the raids worked, so had great difficulty playing. I just chucked a bunch of rules & played a simplified version.",
    "timestamp": 1598133600
  },
  {
    "username": "Denist",
    "rating": 5.0,
    "comment": "1-5",
    "timestamp": 1575846000
  },
  {
    "username": "Apophatic",
    "rating": 5.2,
    "comment": "Ok, confession time. It was part of a group purchase of games from a liquidation warehouse.",
    "timestamp": 1545778800
  },
  {
    "username": "keoga",
    "rating": 5.0,
    "comment": "sin destroquelar",
    "timestamp": 1389135600
  },
  {
    "username": "Dr Brian",
    "rating": 5.0,
    "comment": "On my list to play. The rating could be adjusted. We'll wait and see.",
    "timestamp": 1303941600
  },
  {
    "username": "anton",
    "rating": 6.0,
    "comment": "Not one of Richard Berg's best efforts, though the game always holds out the hope that America's First Peoples can stymie the efforts of the US Cavalry and send the likes of George Armstrong Custer and that Chivington monster home to their wives in a couple of sacks.",
    "timestamp": 1740610800
  },
  {
    "username": "spelgalen100",
    "rating": 6.0,
    "comment": "(X) Sleeved Cards.\n(550kr)",
    "timestamp": 1685916000
  },
  {
    "username": "collezionista",
    "rating": 6.0,
    "comment": "45",
    "timestamp": 1650405600
  },
  {
    "username": "williamhillis",
    "rating": 6.0,
    "comment": "This game out in the waning days of Avalon Hill, and I feel that it missed its audience. I'm guessing that it wouldn't pass the PC test today, because it faithfully describes and rates the tribes in comparison with each other, including historic enmities, and doesn't romanticize them at all.",
    "timestamp": 1640646000
  },
  {
    "username": "B41939",
    "rating": 6.0,
    "comment": "Playable by a group with lots of time; we've done it. Fairly enjoyable, once you get through the rules (lots of Bergian chrome; everybody needs to bone up on them before game day). My group had the player who famously said, \"When I say you go to the reservation, you go to the reservation!\" Our playings reveal (at least to us) that whoever gets the U.S. in the last turn(s) of the game will win, so we halve VPs gained by the palefaces after the ACW. If nothing else, a Berg game can be educational!",
    "timestamp": 1608073200
  },
  {
    "username": "equestriancdr",
    "rating": 6.0,
    "comment": "Played the solitaire campaign game. It was a near thing as the U.S. barely made it to 14 states by the end of the game. But as in history, the odds are not favorable for the Indian player. The game is a good history lesson with limited replay value.",
    "timestamp": 1440367200
  },
  {
    "username": "Massyman",
    "rating": 7.0,
    "comment": "I like this game and have played through it several times. Just needs a few house rules which are easy to develop as you go along and the weak spots become apparant. I always have a pen and paper handy when playiing any game for just such occasions so that is a total non-issue in terms of how I rate a game.",
    "timestamp": 1728424800
  },
  {
    "username": "peterparker65",
    "rating": 7.0,
    "comment": "avalon hill collection",
    "timestamp": 1648504800
  },
  {
    "username": "Jocab",
    "rating": 7.0,
    "comment": "Old Classic.",
    "timestamp": 1630188000
  },
  {
    "username": "mtgjudge",
    "rating": 7.5,
    "comment": "Seldom-seen theme which uses an interesting mechanic (new roles each turn) to replicate that period in American history.",
    "timestamp": 1722204000
  },
  {
    "username": "stefanmiker",
    "rating": 8.0,
    "comment": "Great subject & boardgame about the great Indian leader & his wars against the U.S.Army!!!Almost every Indian tribe detailed appears in that game!!!One of my favourites!An all time classic title by Avalon Hill & i suppose the absolute Indian Wars Game!",
    "timestamp": 1660946400
  },
  {
    "username": "wolvespot",
    "rating": 8.0,
    "comment": "I appear to be in the minority but I really enjoyed this game. Great theme, plenty of chrome. Rules took some time to get my head around but after a turn or so the game flowed quite smoothly although a bit long at 8 to 10 hrs for the campaign. Not a problem though when playing solo.",
    "timestamp": 1483830000
  },
  {
    "username": "Dragonaris",
    "rating": 9.0,
    "comment": "A unique theme portraying the expansion of the settlers towards the West coast and the effects on the native Indian population. Sadly, this game has been under rated. The hard map depicts the central and western US states, the counters represent: the Indian tribes of the era, generals, artillery, settlements, rail expansion, weather, statehood and even Mormon columns. The rule book is clear and straightforward. After one game turn the players get the feeling of the play. All players are handling Indian tribes apart from one who will be the US. On the next game turn all players switch tribes and another one becomes the US player. The US player earns points from winning battles, putting tribes on reservation and for completing the rail expansion. The Indian players win points by maintaining their independence and blocking further expansion. The Indian players have an easy task if it wasn't for the inter-tribal differences and hostilities. Indian players should focus on earning points and not battling each other, after all their main enemy is the US. Each player should also keep note that he will get to be the US at least once on each game play; previews policies might backfire when his turn comes up. The game concept is an opportunity to witness history unfolding before your eyes and realize the cruel reality that befall on the natives. An excellent simulation that wargamers will not regret owning it.",
    "timestamp": 1389999600
  },
  {
    "username": "gnoccarello",
    "rating": 9.0,
    "comment": "Great & intense!",
    "timestamp": 1121378400
  },
  {
    "username": "tlaraver",
    "rating": 10.0,
    "comment": "Los EE.UU. - los conflictos de la India, un período trágico de la historia.\n\nCada turno, los jugadores son asignados al azar un lado para jugar - ya sea tribus indias o los EE.UU. Sólo un jugador representa los EE.UU. cada turno, mientras que los otros jugadores tienen cada uno un número de tribus indias bajo su control. jugadores de la India llegan a seleccionar uno o dos de sus tribus activos, pero el resto se reparten al azar ellos. Por lo general hay tribus indias más disponibles de lo que están activos en cada turno, pero los jugadores no saben realmente cuáles son inactivos. Esto puede ser perturbador para el jugador EE.UU. ya que debe decidir dónde desplegar sus limitados tropas y columnas.\n\nTodos los jugadores compiten para ganar puntos de victoria. El jugador de EE.UU. se enfrenta a la tarea de la construcción de suficientes recursos (acuerdos, ciudades, ferrocarriles, minas, etc.) para mantener los estados existentes y convertir los territorios en estados. Los jugadores de la India desempeñan el papel de la guerrilla para ganar puntos de victoria, pero también puede negar recursos para el jugador EE.UU.. Sin embargo, se debe tener mucho cuidado de no sufrir demasiadas bajas, ya que esto podría causar su tribu para ir en reserva o se extinguen, que cuesta muy caro en el reproductor de puntos de victoria.",
    "timestamp": 1531605600
  },
  {
    "username": "ledzep571",
    "rating": 10.0,
    "comment": "more classic Avalon Hill. bad ass..",
    "timestamp": 1531173600
  },
  {
    "username": "mzaninotti",
    "rating": 9.9,
    "comment": "Fantastic, but like impossible to finish\n10 hour of play and only 5 turns...",
    "timestamp": 1251151200
  }
]