[
  {
    "username": "Martin_Gamer_1974",
    "rating": 1.0,
    "comment": "Became unplayable in Sep 2025.",
    "timestamp": 1758232800
  },
  {
    "username": "rgtft",
    "rating": 1.0,
    "comment": "Sad Ted R. designer.",
    "timestamp": 1757887200
  },
  {
    "username": "supervalkyrie",
    "rating": 1.0,
    "comment": "Cull Pile?",
    "timestamp": 1757628000
  },
  {
    "username": "Half_Amateur",
    "rating": 1.0,
    "comment": "a pathetic design. rancid",
    "timestamp": 1757541600
  },
  {
    "username": "MJhapsburg",
    "rating": 1.0,
    "comment": "Tedious and repetitive. Historically accurate as a long stalemate. Insufferable as a game",
    "timestamp": 1722722400
  },
  {
    "username": "Merlin8888",
    "rating": 1.0,
    "comment": "Too long",
    "timestamp": 1642546800
  },
  {
    "username": "jet747",
    "rating": 1.0,
    "comment": "In providing a rating for the game, I decided to judge it against the description of the game printed on the back of the box:\n\n\"Both players will find their generalship and strategic abilities put to the test as Paths of Glory's innovative game systems let you recreate all the dramatic events of World War I.\"\n\nI had initially been very excited to discover this game on a topic that interests me a lot and on which I have read widely. I decided to buy it on the strength of the overwhelming positive ratings and reviews it has received over many years.\n\nI dismissed a lot of the criticism regarding complex rules (they aren't) and length of time to play (yes it's more than an evening, but very manageable compared to many hard core war games). Having now played it multiple times and invested a considerable amount of time beforehand to thoroughly learn the rules, including several solitaire play throughs and reading through the plethora of FAQs and other questions posted on various forums. , I can now appreciate and wholeheartedly concur with the main substantive criticisms already mentioned elsewhere in these ratings. These fall into two main categories namely:\n\n1. Game play and outcomes do not resemble anything like WW1.\n\nI couldn't sum it up more succinctly than someone who as already rated it here who said:\n\n\"Any similarity between this game and The Great War is purely coincidental.\"\n\n2. The game is overwhelmingly influenced not by astute play, but by luck where a single combat result has the potential to completely swing the game one way or the other. It is impossible to arrest the momentum of whichever side comes off best in a major battle. The loser is forced into a cascading spiral of sub-optimal card play to try and arrest the situation and the winner has carte blanche to amplify the success exponentially.\n\nSo the game's claim that \"Both players will find their generalship and strategic abilities put to the test\" is pure fantasy. Possibly the most luck dependent game I've played in 40 years of war gaming.\n\nIf you have no particular interest in or understanding of WW1, I guess it could be satisfying on some level. However, a historical gamer will find this game just too much like fantasy and way too luck dependent . Needless to say I am extremely disappointed with it, given the hype surrounding it.\n\nAs a generic game I could stretch the rating to a 4, however, judged against the criteria referred to above, I rate it at 1.",
    "timestamp": 1641596400
  },
  {
    "username": "Beery",
    "rating": 1.0,
    "comment": "Just way too complicated for me.",
    "timestamp": 1601589600
  },
  {
    "username": "tempar",
    "rating": 1.0,
    "comment": "TOO LONG",
    "timestamp": 1445551200
  },
  {
    "username": "lapja",
    "rating": 1.0,
    "comment": "1 because I cannot rate it lower. I'd give it -20",
    "timestamp": 1335564000
  },
  {
    "username": "Thatsnotme",
    "rating": 2.0,
    "comment": "8+ timer",
    "timestamp": 1737846000
  },
  {
    "username": "bkasten",
    "rating": 2.0,
    "comment": "This game is an archetypical example of everything I despise about CDG wargames.",
    "timestamp": 1658700000
  },
  {
    "username": "Laurentiu",
    "rating": 2.0,
    "comment": "Too complex, too many rule exceptions, too long to setup and play.",
    "timestamp": 1563919200
  },
  {
    "username": "Carlos Palomino",
    "rating": 2.0,
    "comment": "The mechanics are simplified to the point of goofiness, viz., the out-of-supply effects. Furthermore, I learned nothing about WWI.",
    "timestamp": 1431122400
  },
  {
    "username": "DeletedUser389997",
    "rating": 2.0,
    "comment": "It may be a terrific game, but it ain't World War One. I gave my copy away.",
    "timestamp": 1327532400
  },
  {
    "username": "Herr Niemand",
    "rating": 2.0,
    "comment": "All I ask in a wargame is that the historical outcome at least be possible to achieve. In PoG, a historical outcome is, strictly speaking, impossible due to the nature of the event-coupled cards. At first I was intrigued by this game, but when I realized that an historical result could never occur -- despite all those wonderful events catalogued in all those cards -- well, I'd rather play some other fantasy game. For instance, the US seems to always enter too late, while the Russians hang on too long -- and in my book two wrongs don't make a right! If you're interested in a game about WW1 where events can never transpire as in history, PoG stands right along The Guns of August at the top of that *heap.*",
    "timestamp": 1308434400
  },
  {
    "username": "markcarlson",
    "rating": 2.0,
    "comment": "As boring as trench warfare.",
    "timestamp": 1198450800
  },
  {
    "username": "M St",
    "rating": 2.0,
    "comment": "An alternate history game about a war that takes place on a WW1 European map but obviously with entirely different armies. Whatever it is about, WW1 it isn't.",
    "timestamp": 1178661600
  },
  {
    "username": "Grinner",
    "rating": 2.0,
    "comment": "I don't get why this is so well liked. This type of game is set up so that the cards will have the rule exceptions on them, yet there are pages of errate with more exceptions. Whole rules which are, at best, inferred. An author who belittles the players (read through the Consimworld stuff). Sorry, not for me.",
    "timestamp": 1155333600
  },
  {
    "username": "sos1",
    "rating": 2.0,
    "comment": "Rating this game makes me realize the Geek rating definitions need work. I KNOW this game is better than a \"2.\" There's definitely quality here. But it's so far removed from my taste that I don't want to play it again. Any rating of 3+ states I might be tempted to play again, and that's simply not going to happen. I guess I'm forced to rate it on taste instead of being able to rate it on quality.",
    "timestamp": 1084572000
  },
  {
    "username": "rstites25",
    "rating": 3.0,
    "comment": "CDG with a lot of chrome. Played a couple of solo games when first getting into wargaming. It looks like a game designed more for balanced gameplay than a true historical simulation. There is a variant that is supposed to play more historical, which I should probably try out.\n\nFor me, it probably won't get much play going forward because it likely won't provide the historicity that I'm looking for solo and it's too heavy to try to get a non-wargamer to play.",
    "timestamp": 1703890800
  },
  {
    "username": "Hepa",
    "rating": 3.0,
    "comment": "Really poorly written rules. Takes ages to master them",
    "timestamp": 1687298400
  },
  {
    "username": "asl geek",
    "rating": 3.0,
    "comment": "Like watching a movie you've seen multiple times. Something very drastic has to happen for the outcome to be anything but historical. More like a history lesson than a game.",
    "timestamp": 1672614000
  },
  {
    "username": "Rattoso",
    "rating": 3.0,
    "comment": "It's a rulebook for nitpickers, full of exceptions and restrictions. For those who prefer to complicate their lives. The cards, which are supposed to speed up the game, are in turn full of exceptions.",
    "timestamp": 1626127200
  },
  {
    "username": "private19022M",
    "rating": 3.0,
    "comment": "A WWI-themed game that left me cold. Not sure what folks learn about WW1 playing this.",
    "timestamp": 1612566000
  },
  {
    "username": "OMD56",
    "rating": 3.0,
    "comment": "Does a good job of simulating wars on two fronts. I like how the cards are introduced based on how committed a side is to the war. And I like how easy to read the chits are.\n\nIt is WAY too long. Combat, while easy to understand, is too simple for the length of game. Part of me wishes it didn't use cards for all the actions. To sum up my biggest complaint, it feels too much like work.\n\nInitial Score: 5",
    "timestamp": 1571263200
  },
  {
    "username": "wellevorkanagawa",
    "rating": 3.0,
    "comment": "way, way, way too long! represents the war fine I think, because you play round after round for minimal changes... not my cup of tea",
    "timestamp": 1509490800
  },
  {
    "username": "ratbulogg",
    "rating": 3.0,
    "comment": "minor country entry handled poorly. crt broken apparently, as is the common perceptionthat russia never falls.",
    "timestamp": 1327100400
  },
  {
    "username": "philipwalker35",
    "rating": 3.0,
    "comment": "An overrated game which is bairly playable. The French are given too high ratings and the their is no way for the Americans to come in on the German side as they almost did in history. This game was made by someone with little imagination and a limited understanding of history.",
    "timestamp": 1310335200
  },
  {
    "username": "Chris_Milne",
    "rating": 3.0,
    "comment": "OK. I've come late to the party, but what's the fuss about? So over-analysed now that the game seems to have driven out the history (what the hell's going on with the Italian and Turkish fronts anyhow? Did the Germans and Austrians really give a monkeys about what happened to Turkey?) The apparent need to manage one's cards carefully (mustn't play these events lest one end up with hands full of 2 and 3 Ops cards at the end) irritates me as well.\n\nMuch prefer the leader-oriented CDGs like Wilderness War or Wellington.",
    "timestamp": 1257289200
  },
  {
    "username": "dmaher1890",
    "rating": 4.0,
    "comment": "Not sure why i do not really like it. Just seems to lack something to draw me into the game. But that said WW I is not really my thing. I may try For The People but I am unsure.",
    "timestamp": 1712872800
  },
  {
    "username": "XenonRadon",
    "rating": 4.0,
    "comment": "This games only makes sense when both players are experienced.\nIf not, the game often end within the first 3 turns, though it should have 20 turns.\nAnd then most events won't happen at all.\n\n-Commented after playing 10+ games.",
    "timestamp": 1696716000
  },
  {
    "username": "apuleio",
    "rating": 4.0,
    "comment": "Ok, it's fun and full of tense, but many things about ITALIA are wrong:\nMAP: there isn't connection between Milano-Bologna-Ravenna while this was one of the MOST IMPORTANT ROAD since roman times. Asiago should be mountain space (many alpine battles where fought there). Venezia should be \"swamp\" since many rivers cross the plain around there. Maggiore should be a \"corps only\" space.\nUNITS: are underrated at least for the defence.\nREINFORCEMENTS: the center of managing units was Milano, not Roma, so new & recreated units should appear at Milano.\nCONDITIONS: Italian army had many deficiences in heavy weapons when entered war, but was immediately able to launch many and bloody offensives and this along all the war, so units should start at full state and replacement points should be more.\nPOLITICS: NO foreign armies (of both alliances) should enter Italia for political reasons.\nOVERALL CONSIDERATION: Italia proved herself a RESOURCE not a DEBT for the Allies; was a situation quite different from WWII: Italian engines were sold Worldwide, Italian troops were sent in France and Balkans...\nVICTORY: real italian weakness was political and emotional, so Italia would be out of war if Milano or Bologna were conquered by Austrians.\nPlaying with the standard rules means Italia out of the game in a couple of turns if you have a clever/expert CP player; the strategic situation on other fronts is irrelevant: nothing can save italian units from destruction immediately after war declaration and is impossible to recreate them with a replacement rate so low. Thumb down for Italian front.\nAnd what about Soviet Revolution, never happened in 12 plays? Same for US intervention...",
    "timestamp": 1685743200
  },
  {
    "username": "darthboywonder",
    "rating": 4.0,
    "comment": "Too long, too abstract, and too full of subsystems that become increasingly bizarre, degenerate, or unhistorical as the game progresses. The supply rules are demonstrably absurd, the game's obsession with Italian VP spaces and Italian offensives is a head-scratcher, the army/corps systems are a mess, and the way the game tries to simulate \"total war\" mostly ends up looking like a bunch of neutral nations joining the war at arbitrary times for arbitrary reasons and proceeding to do next to nothing.\n\nThe trade-offs are indeed challenging and advancing putting oneself out of position is indeed a tricky puzzle and those things are enough to make the first 4-5 turns of the game reasonably enjoyable, even if they don't make any sense.\n\nObviously this was a hugely important game in its time but boy howdy has time caught up to it.",
    "timestamp": 1649800800
  },
  {
    "username": "cfarrell",
    "rating": 4.0,
    "comment": "Another little bout of play in 2021, and time has caught up to these games *hard*. I just don't know if it's because we've gotten a bunch of great Mark Simonitch games in the last 10-15 years (The US Civil War, Caesar: Rome vs Gaul, Normandy '44, and more), plus then Napoleon's Triumph and Guns of Gettysburg, the whole vastly superior No Retreat! line, and then my revisiting and re-appreciating classics like Storm Over Arnhem and Up Front, but omg this is really not good! It's unbearably long, it's painfully abstract, many of the tradeoffs make no sense, and it's fiddly. Plus of course the huge balance problems that were smoked out years ago. We didn't have much else going on in 1999, so it had that going for it then! But the longevity of this game really is not earned. It's time for it to either be rebuilt, acknowledging its many flaws that we've put up with over the years, or retired.\n--\nI've knocked down my rating a touch in the last year as age has caught up with Paths of Glory to some degree. Now, don't get me wrong, this is still an excellent game, one of the best wargames in the past 10 years - but it doesn't seem to quite go \"over the top\". Part of this is that the wierd trade-offs (why is Russian and French activity mutually exclusive? Didn't they usually try to coordinate their efforts?) often make play often feel more like Princes of Florence than Hannibal or Grant Takes Command or Breakout: Normandy (just to pick some other rather abstract, but still highly successful, wargames). Holes in the game have also openend up; it works brilliantly when the situation follows broadly historical lines, but shudders rather badly (from both a game and historical viewpoint) when historically implausible strategies are persued. The major problems are two: firstly, the unrealistically high VP value and vulnerability of Italy, to the point that the game revolves around it to an unhealthy degree; secondly, the Russian Capitulation Sequence doesn't work because of the near-impossibility of getting the Limited War cards in the sequence into play while still getting to Total War in a timely manner. Another non-trivial weakness in the game seems to be the portrayal of tanks; arguably the war-winning technology gets entirely short shrift with only one incredibly limited card, while the admittedly important but less successful Stoss offensives get what, some 4 much more powerful cards? Cards with very few restrictions? These design decisions seems to distort things to the degree that you often get wacky, ahistorical results when players start to game the system (and let's not forget, \"gaming the system\" is something we should expect players to do, since that's what playing a game is). Finally, PoG doesn't seem quite \"dense\" enough for the full campaign; that is to say that like virtually every Raicer \"big\" game I've played, it's somewhere between somewhat and much too long for what it is.\n\nAs a random comment, although I resisted it for some time, I've come to accept that the full optional setup in the rulebook should be used, and the 8-card hand is probably highly desirable as well. The strength of the game is such that even with these problems, PoG is still an excellent, top-tier type game, which should tell you somthing. It just seems to miss by a bit the \"enduring classic\" status it might have achieved. All in all, a fine game, but several leagues short of Hannibal in terms of replayability, narrative, and design robustness. It makes me wish for a new edition that takes a fresh look at the design with the benefit of hindsight.\n\nWhile Barbarossa to Berlin has some issues, including a ludicrous amount of eratta (update: not an issue anymore with the reprints), I think it's the more solid and more interesting fundamental game. It didn't get the same \"wow\" factor as PoG, since it was a follow-on game and doesn't have quite the same really sharp hooks that PoG did. But it is much more robust, and more tactically interesting.",
    "timestamp": 1628114400
  },
  {
    "username": "gruntheri",
    "rating": 4.0,
    "comment": "Was a big disappointment for me, knowing that it ranks very high on the BGG war games list. Too simple combat system with too much luck : the weight of the die roll is very high. The main reason I don't like this game is that there are too many exceptions which bring nothing extra to the game. I suppose they were added to provide more historical flavor, but in most cases all these exceptions don't hold you back from playing a non-historical \"what if\" scenario. Don't get me wrong, I don't mind complex game rules with tons of exceptions, but then they need to deliver game story. This one doesn't.",
    "timestamp": 1618005600
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "prolonged playtime \n dramatic dice",
    "timestamp": 1584486000
  },
  {
    "username": "thomasprowell",
    "rating": 4.0,
    "comment": "It doesn't quite fit my notion of what The Great War should feel like, but it is undeniably involving.",
    "timestamp": 1579042800
  },
  {
    "username": "Konstantin",
    "rating": 4.0,
    "comment": "Why I don't like the game system and traded it away:\n\n- Too many exceptions in the rules.\n\n- On many fronts nothing happens at all throughout the whole game.\n\n- The events should be out of control of the players and happen randomly (this would be muche more fun and tension!); e.g. why do players influence the weather?\n\n- The decision-making between events and activations doesn't make any sense\n\n- the effects of out of supply are ridiculous\n\n- you can spend all your activations on the same unit(s) without any logistical restrictions\n\n- the game is too scripted and tries to force you into a certain pattern\n\n- you are encouraged to take gamey decisions which have nothing to do with history: play weak cards as events even if you aren't interested in the event just to get rid of the card; don't play strong cards for events because you want to keep the card in the game",
    "timestamp": 1572822000
  },
  {
    "username": "Reverend Pete",
    "rating": 4.0,
    "comment": "I like the style, but I'm not so big on wargames.",
    "timestamp": 1536789600
  },
  {
    "username": "gunthercanada",
    "rating": 5.0,
    "comment": "Should have just been a eurogame. I guess good for tournaments, but I found the \"feel\" of the war lags behind the card play. The split event vs ops decision is fine, but then maybe there should be MORE action phases/turn? Or maybe a way to play two cards (one Ops, one event, or two ops of different types)/action? I dunno, seems off to get an army as a reinforcement and not be able to have it deploy to the front until a subsequent action (if I am interpreting the rules correctly).",
    "timestamp": 1706569200
  },
  {
    "username": "bonillarau",
    "rating": 5.0,
    "comment": "Este es un juego que marcó una forma de hacer wargames impulsados por cartas y que es muy popular. Desafortunadamente, ser el primero de su subclase le ha supuesto tener serios problemas de manera que no resulta ni un buen juego ni una simulación viable de la PGM. Jugué dos partidas con adversarios algo peculiares en las que el juego más o menos funcionaba, pero el resto de veces se ha desplomado como un castillo de naipes.",
    "timestamp": 1694988000
  },
  {
    "username": "guiscardo",
    "rating": 5.0,
    "comment": "Like most card driven games, it tends to be abstract, not coherent with the historical period and with the mechanisms of the conflict in question. Even paths of glory does not escape this fate. As a game it's still fun",
    "timestamp": 1673564400
  },
  {
    "username": "A3RKev",
    "rating": 5.0,
    "comment": "Just don't see the attraction to this game. Amusing to watch the German super armies tear through the opposition often taking no losses in a World War One game. Corps are ridiculously fragile for all involved.\nVastly overrated",
    "timestamp": 1660428000
  },
  {
    "username": "_EGA_",
    "rating": 4.5,
    "comment": "Варгейм;",
    "timestamp": 1659996000
  },
  {
    "username": "clownPL",
    "rating": 5.0,
    "comment": "After years of playing it, some new insights:\nThere is a lot of buzz around this game, unfortunately mostly because of its mechanics, than being any \"good\" FWW game.\nIn Paths of Glory close to the actual (real?) course of the frontlines and game as a history is obtained only because the mechanics have been optimized for it, forcing us to play something that IS NOT FWW, which DOES NOT WORK like FWW, but mathematically leads to a similar result.\nI think PoG and couple of others games shows zenith of CDG's, where mental abilities to play and memorize cards and micromanaging of rules are not related to history, but give some awkward \"feel\", that may lead us to think that we play \"historical\" game.\nWhich is sadly not true.",
    "timestamp": 1659391200
  },
  {
    "username": "zaubererer",
    "rating": 5.0,
    "comment": "Paths of Glory is probably one of the best war games, it definitely has some nice elements, but it still has the same issues that all war games have, it is extremely complicated, takes too long, and has tons of dice rolling, which makes it in the end too random especially for its complexity. Very ugly components.",
    "timestamp": 1656885600
  },
  {
    "username": "eric_s13",
    "rating": 5.0,
    "comment": "I didn't appreciate this game.\nIt's probably a good game but not a wargame",
    "timestamp": 1646694000
  },
  {
    "username": "williamhillis",
    "rating": 5.0,
    "comment": "If a game's mechanics punish players' ahistorical choices with equally ahistorical outcomes (i.e., those not possible using technologies or resources that were then available), that's a serious design flaw. I don't think POG was very well thought through, except as an application of then-new card-driven mechanics to a neglected subject (WWI).",
    "timestamp": 1640646000
  },
  {
    "username": "sheriffharry",
    "rating": 5.0,
    "comment": "The \"out-of-supply\" rule is ridiculous considering how easily one can \"encircle\" the opponent in some part (East) of the point-to-point map.",
    "timestamp": 1635199200
  },
  {
    "username": "dirubin",
    "rating": 5.0,
    "comment": "Very tense with hard choices. Central Powers are locked into their biggest historical mistake (the Schlieffen plan). It is terribly hard to trigger Russian withdrawal or American entry despite separate decks that heavily script the action; in fact, I have never seen either occur, even in multiple PBeM tournaments against experienced players. That, and the Draconian supply rules, punctures any sense of versimilitude — I can’t even pretend I’m involved in some alternate history. I estimate that I played the standard version 15 times; the more I played it, the less I liked it. Its golden reputation and ludic virtues made me stick with it longer than I should have.\n\nDesigner's historical variants in the PoG Player's Guide are interesting.\n\nDon’t miss the Kirk Douglas movie of the same name!",
    "timestamp": 1604358000
  },
  {
    "username": "Gwynor",
    "rating": 5.0,
    "comment": "Card play is fantastic (scarce resources and tempo management), but battles are too swingy (often you have the same chances to completely wipe out whole armies or be completely wiped out in a single roll). Very long also (more than one hour per turn, up to 20 turns).",
    "timestamp": 1579474800
  },
  {
    "username": "Benoitl33",
    "rating": 4.9,
    "comment": "A solid treatment of WWI at the strategic level, works well, plays well although the number of rules exceptions and specificities makes it daunting at times.\n\nIt helps to know the decks well in order to make enlightened decisions, like for most CDG.\n\nSupply rules are tricky to manage but once you have understood them well and understood the map structure, its ok.\n\nAddition after several more plays:\n\nGame takes at least 8 hours to completion. Ends before USA enters war. There's a lot of emphasis on action in Turkey, Romania, Bulgaria, Balkans... too much perhaps.\n\nAnother addition after another play with the Deluxe edition:\n\nI am now convinced that this may be a great game but links with history are accidental. Very swingy, it doesn't take much to throw the game off to a premature ending. Again, no beginning of a Russian revolution let alone US entry in a game that was conceded on GT11 (Fall 1916).",
    "timestamp": 1561327200
  },
  {
    "username": "jbhuter6041",
    "rating": 5.0,
    "comment": "Very unforgiving game. The few games I've played have resulted in massive losses on both sides due to armies being out of supply at the end of a round. Not sure if the above is typical play or a result of our inexperience and aggressive play. I was initially put off by this razor's edge feel. However, I keep thinking about the game and want to play again. A good indication of a good game and one with good replayability.",
    "timestamp": 1548025200
  },
  {
    "username": "Giovanni Toletti",
    "rating": 5.0,
    "comment": "Vendo a 40€ consegna a Milano in zona Bovisa o spedizione in tutta Italia con spese a carico del destinatario\nGood game, but very bad simulation. The only way to achieve historical result is to play for them and not for winning",
    "timestamp": 1528408800
  },
  {
    "username": "markasol",
    "rating": 5.0,
    "comment": "Disappointing game - not a good simulation of WW1, there are much better and much more enjoyable games out there",
    "timestamp": 1521500400
  },
  {
    "username": "canitoswar",
    "rating": 5.0,
    "comment": "No hay zoc señores.\n\nThere is no zone of control, dude.",
    "timestamp": 1487977200
  },
  {
    "username": "Duereloi",
    "rating": 5.0,
    "comment": "Not an accurate presentation of history, and the rules are a mess",
    "timestamp": 1442872800
  },
  {
    "username": "lordvoldemort",
    "rating": 5.0,
    "comment": "A card driven war game similar to Twilight Struggle but set in World War I. It is a good game, highly thematic and well done. But it takes far too long to play and learn. It is 12-24 hour game. I just don't want to play a game that takes that long no matter how good it is. It does have a lot of the heavy war-game mechanics as well. I just don't want to play this one again.",
    "timestamp": 1442872800
  },
  {
    "username": "Gryfon",
    "rating": 5.0,
    "comment": "Great looking game. Obviously a good system based on the number of subsequent games using it. That being said, in this particular environment, I am not particularly fond of this game. Almost every game we have played has seen decisive results in '14/'15. The Western Front seems to have an awful lot of movement compared the to actual event. I think there are two things at work: 1) unit density is low; no nations have enough units to hold historical lines without leaving something too weak to hold, and 2) the game is very chess-like in that one bad move can cost you the war, and a bad play is not evident until several moves (or turns) later, meaning that you have to have extensive experience to play and know all the pro's/con's associated with each card.\n\nSo you end up with a game that is probably balanced, but that ends up having little to do with WW1. The missing includes:\n\n1-Russian capitulation; the Russians are way too resilient\n2-Americans; no russian capitulation, no Americans\n3-Italy being non-decisive; Italy is so weak and VP ripe, Germans, British and French will be drawn in like a counter-factual hurricane.\n\nincluded Player's Guide and deluxe map",
    "timestamp": 1409954400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "War Game\n Historical Game\n Two-Player Game\n\nI will say the mechanics and realistic representation of the subject matter are superb. Perhaps too superb. Everything seemed too fiddly, but for fiddly games, I understand this one is pretty calm. I like the idea of it, but I wouldn't play it without any other wargame experience first.",
    "timestamp": 1759701600
  },
  {
    "username": "DBanks",
    "rating": 5.5,
    "comment": "An almost perfect game except for the supply rules which do not capture the nature of warfare in this period (e.g., blitzkriegs could not and did not happen until near the very end) and are massively punishing at the same time. If there had been a rule that slowed advance (realistic) rathe than punished it if it went too far (different war) then this might be perfect. Some fiddliness too (Dardenelles).\n\nReduced to 5.5. Although the game drips theme, the supply rules become the heart of the game and are utterly ahistorical and distracting. Having actual knowledge of WWI actually hurts you in this game as if you play as you imagine it should work, these rules - beamed in from the late 20th century mechanized era - punish you.",
    "timestamp": 1757628000
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "tts solo",
    "timestamp": 1753999200
  },
  {
    "username": "jager_fury",
    "rating": 6.0,
    "comment": "Looking to try some WWI action!",
    "timestamp": 1751752800
  },
  {
    "username": "speter22",
    "rating": 6.0,
    "comment": "Impossible to rate this one accurately. I've played one round of this game; that round lasted about 1 hr 10 mins (as we came to grips with the systems) and the game is meant to last... 20 rounds. The length of this thing is no joke. It's almost unfathomable to me. I suppose that's a frequent feature of wargames, and probably the main one that keeps me at arm's length from them. That one round was a lot of fun, but I couldn't imagine sitting down for probably 8 hours MINIMUM to push my little chits around. If I take that length at face value, I'd rate this game probably somewhere around a 4/10. Rough, but like, I could play half a dozen other excellent games in the time it'd take me to play this pretty-dang-good one. Just looking at the systems and how fun they are to play with, I'd rate this an 8/10. I dunno man, rating stuff is hard. I'm settling on a 7 since I'll probably never sit down for a full, meaty campaign of this. Maybe I'll do it over a full weekend when I'm old and tired and live with my game buddies in a retirement home.",
    "timestamp": 1746655200
  },
  {
    "username": "Rindu",
    "rating": 6.0,
    "comment": "with mounted map",
    "timestamp": 1736204400
  },
  {
    "username": "mtraadsveld1",
    "rating": 6.0,
    "comment": "Haven't made up my mind yet. I like the choices each card offers. Don't like all the specific, nitty gritty rules. The hideous written rulebook doesn’t help",
    "timestamp": 1727128800
  },
  {
    "username": "chrisgledhill",
    "rating": 6.0,
    "comment": "Strategia ludo simulanta la Unuan Mondmiliton (1914-1918).\n\nLudante je \"Paths of Glory\", oni povas pli detale kompreni la strategiajn kialojn, kiuj instigis la potencojn ade munti senesperajn fronto-asaltojn. Ili ne celis definitive venki la malamikojn, sed malfortigi ilin sufiĉe longe por prokrasti la preskaŭ neeviteblan malvenkon de unu el la nacioj: terura milito de eluziĝo.\n\nKompreni tiun tragedian logikon pere de ludo nepre ne signifas, ke oni konsentas pri ĝi.",
    "timestamp": 1723068000
  },
  {
    "username": "skuby",
    "rating": 6.0,
    "comment": "Beautiful Card game, I think a little bit unhistorical and the first moves are always the same but offer hour and hour of enjoy and fun with addictive and tense play.",
    "timestamp": 1713564000
  },
  {
    "username": "Simwork",
    "rating": 6.0,
    "comment": "Don't tell me I cannot move from Cambrai to Paris - just take the A1.\n\n2023 update: willing to play again, since obtaining the deluxe edition and players guide. Use the optional cards and 8-card hand.",
    "timestamp": 1700002800
  },
  {
    "username": "Sizzy",
    "rating": 6.0,
    "comment": "一战全战场模拟\n思考量爆炸，了解一战用还可以\n致命伤是规则细节过多，写的也不够好\n不但不够精炼，而且容易村，玩的时间很长会头疼",
    "timestamp": 1692741600
  },
  {
    "username": "santino el cato",
    "rating": 6.0,
    "comment": "Played recently the Deluxe Edition, that somehow improved my opinion on the game ! Fun, clever, but still weak as a simulation of the Great War.",
    "timestamp": 1690408800
  },
  {
    "username": "zonk67",
    "rating": 6.0,
    "comment": "So-so after one play. What little history exists is scripted, but that doesn't take away from the fun and tension that you feel as your war effort ramps up and your choices exponentially increase in tandem.\n\nOne quibble: where are the Italian alps?",
    "timestamp": 1686780000
  },
  {
    "username": "stenole",
    "rating": 6.0,
    "comment": "(2P) Wargame set in WW I. Card play dictates your actions, but you will find this wargame to be dominated by attrition and non-progress.",
    "timestamp": 1673478000
  },
  {
    "username": "Pepchris",
    "rating": 6.0,
    "comment": "The supply system makes it so you play more often to exploit the system (threatening OOS so the enemy cannot do replacement, out of any strategical consideration).\n\nI have also found that more often than not the Near East map is a OPs trap for the allied player, the USA rarely enters and Russia rarely collapse.",
    "timestamp": 1668639600
  },
  {
    "username": "Mattias Persson",
    "rating": 6.0,
    "comment": "Sorry, I had to lower my rating. There are just too many exceptions and special rules to make this really fun. Besides, I don´t like the \"dance of death\", the level is a bit too strategic for my taste, and some of the card-driven aspects seem strange.",
    "timestamp": 1660255200
  },
  {
    "username": "nighttrain54",
    "rating": 6.0,
    "comment": "An interesting game that I'm glad I've played. But can be kind of a slog and need the right mindset",
    "timestamp": 1644706800
  },
  {
    "username": "MScrivner",
    "rating": 6.0,
    "comment": "2004 Game of the Year edition, picked up from a local acquaintance who was selling off some games.",
    "timestamp": 1642546800
  },
  {
    "username": "BobbyReichle",
    "rating": 6.0,
    "comment": "The presentation and rulebook hurt this game a lot for me. Information isn’t indexed, over arching rules are left further down lists so that rules referencing them reference rules you haven’t read yet, and crucial information on the board is hidden by placing units on top of them. I understand that this is all fairly standard for war game production, but as board games, UX/UI, graphic design, and illustration advance, there really isn’t any excuse for not hiring people marginally good at this stuff to make your product legible. All of that friction makes the chrome of the game irritating, as finding specific rules and exceptions becomes a hassle each and every time it happens (and it happens a lot). A really good game, but almost everything about it has been improved upon by subsequent games. What you’re left with is a neater artifact than game.",
    "timestamp": 1640818800
  },
  {
    "username": "Pandorzecza",
    "rating": 5.5,
    "comment": "Nie dla mnie",
    "timestamp": 1620424800
  },
  {
    "username": "enavico",
    "rating": 7.0,
    "comment": "+ One of the most influent wargames ever\n\n- Very very long",
    "timestamp": 1757541600
  },
  {
    "username": "TimAllen",
    "rating": 7.0,
    "comment": "After years of play I have reduced the rating from 9 to 7, because after repeated play, it feels more and more like a deck-building card game, and less of a historical wargame.",
    "timestamp": 1748901600
  },
  {
    "username": "Tegarend",
    "rating": 7.0,
    "comment": "Very good game - Ted Raicer's foray into CDG world. I haven't played the more historical scenario yet - the a-historical \"usual\" game (no americans, no russian revolution) is the only minus to this game.",
    "timestamp": 1748815200
  },
  {
    "username": "deformityandnonsense",
    "rating": 7.0,
    "comment": "",
    "timestamp": 1748556000
  },
  {
    "username": "SouthernWargames",
    "rating": 7.0,
    "comment": "Very well done, but very limited in operational and strategic flexibility. A few too many systems are abstracted. On the whole, though, a great game!",
    "timestamp": 1747778400
  },
  {
    "username": "BraindeadRushB",
    "rating": 6.5,
    "comment": "Trenches are overpowered. The only path to victory is to rinse and repeat your attacks until opponent no longer had enough RPs to hold the trench. This game is not worth your time.",
    "timestamp": 1744495200
  },
  {
    "username": "AhabXXX",
    "rating": 7.0,
    "comment": "Wonderful simulation, quite bad and hard to manage.",
    "timestamp": 1743372000
  },
  {
    "username": "jbuse",
    "rating": 7.0,
    "comment": "Good for a tense but enjoyable eight hours of gaming. The likelihood of anything approaching the historical result is slim. But maybe (as Paths of Glory has it) the Central Powers should have concentrated on Italy.",
    "timestamp": 1741561200
  },
  {
    "username": "kefyras",
    "rating": 7.0,
    "comment": "a bit luck dependant and very long, but very engaging with tons of interesting decions",
    "timestamp": 1740870000
  },
  {
    "username": "mmmichiel",
    "rating": 7.0,
    "comment": "Shared custody w/ Kevin",
    "timestamp": 1736636400
  },
  {
    "username": "Horsebanger",
    "rating": 8.0,
    "comment": "Great CDG Wargame.",
    "timestamp": 1760911200
  },
  {
    "username": "Ximo_Valencia",
    "rating": 8.3,
    "comment": "J21",
    "timestamp": 1759960800
  },
  {
    "username": "Bob.Gibson",
    "rating": 7.6,
    "comment": "Excellent game!!!",
    "timestamp": 1758405600
  },
  {
    "username": "chadridgley",
    "rating": 8.0,
    "comment": "despite the flaws it's an innovative game system that has been implemented in other great titles as well.\n\nPROS:\n-fun and competitive style system: great tension, pressure, and decision-making\n-Plays quite well solo\n-Good replay value\n-relatively low counter density with a nice looking board and components\n\nCONS:\n-Overly simplified or abstracted naval and air wars\n-The strange stacking limitations (3 massive armies are ok in a space, but not 4 corps) and the OOS effects in the attrition phase are absolutely punishing. Movement and activation must be carefully considered\n-Usual CDG issues involving some unevenness of historical simulation due to limited card OPS and multiple front concerns, card availability and event prerequisites makes the Russian Revolution very difficult to achieve...",
    "timestamp": 1753826400
  },
  {
    "username": "dosxtres",
    "rating": 8.0,
    "comment": "2",
    "timestamp": 1749592800
  },
  {
    "username": "Marius n Milan",
    "rating": 8.0,
    "comment": "2020 Edmonton\n830\nN",
    "timestamp": 1747951200
  },
  {
    "username": "SJHong",
    "rating": 7.5,
    "comment": "not my type of game but the game itself is just gorgeous.",
    "timestamp": 1747605600
  },
  {
    "username": "PaulusBorgia",
    "rating": 8.0,
    "comment": "Hell yes",
    "timestamp": 1746136800
  },
  {
    "username": "Membrillo",
    "rating": 8.0,
    "comment": "I'm still working around it. Most of my games have ended prematurely because of several grossed strategic and/or tactical mistakes. I think the game needs to be played with less emphasis on moving and attacking on the map to allow rebuilding. But, so far, it’s been hard to get out from the spiraling attacks that sooner or later end with a front blowing up.",
    "timestamp": 1745445600
  },
  {
    "username": "MaxxoBass",
    "rating": 8.0,
    "comment": "Paths of Glory ist ein komplexes Strategiespiel, das den Ersten Weltkrieg thematisiert. Die Entscheidungen, die während des Spiels getroffen werden, sowie die strategischen Überlegungen und unvorhersehbaren Ereignisse sorgen für ein hohes Maß an emergentem Gameplay.",
    "timestamp": 1743631200
  },
  {
    "username": "Tatsu",
    "rating": 9.0,
    "comment": "Point-to-point CDG war-game of WWI. Needs at least 3 plays to really start grok I think. Fun, but there is a good amount to digest.\n\nThe rules aren't bad (there are a lot of weird little one-off things, but the main flow of the game is good). This falls into the Twilight Struggle camp of - there is a learning curve that once you climb, should pay off, but it might take a hot minute before you get there. There is also a level of brutality here - a single bad move will cost you the game and there is no coming back. So much AP inducing thought.\n\nIt won't be for everyone, but it really is a good game.",
    "timestamp": 1761086040
  },
  {
    "username": "lol0",
    "rating": 9.0,
    "comment": "I wish Rally the troops adds it soon!",
    "timestamp": 1761067200
  },
  {
    "username": "maksek",
    "rating": 9.0,
    "comment": "Not For Sale",
    "timestamp": 1760652000
  },
  {
    "username": "Stejeh",
    "rating": 9.0,
    "comment": "Love the logistics/ supply line/ cards and I really story line. Rule heavy though. Only played online and it eases a lot the rules",
    "timestamp": 1760392800
  },
  {
    "username": "svic64",
    "rating": 9.0,
    "comment": "I put off this game for a long time (thinking WW 1 was boring). But recently, found a cheap used copy and re-read John Keegan’s history on the war. After playing several times, I now see what all the buzz is about. What an excellent and FUN game this is! I understand there are some complaints regarding it’s historicity but given its scope and how much repeatability the card play introduces this is well worth it. The card play is especially fun and really good to cover all the major points (the designer must be VERY knowledgeable on the subject). Having previously owned 1914 and Guns of August, this is MUCH better. Also not overly complex. Highly recommended.",
    "timestamp": 1758146400
  },
  {
    "username": "GomJabbar",
    "rating": 8.9,
    "comment": "My Rank: 23",
    "timestamp": 1758146400
  },
  {
    "username": "storeshoes",
    "rating": 9.0,
    "comment": "brilliant WWI game",
    "timestamp": 1756504800
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 8.5,
    "comment": "One of the CDG greats. But with less time to play these days, and being a bit rules heavy, it’ll likely see the table once/year. Great stuff, tho. There are a few other less complex WW1 titles, that might sooner see the table.",
    "timestamp": 1755381600
  },
  {
    "username": "nwinches",
    "rating": 9.0,
    "comment": "Still new to this one, but there's such a good balance of chaos and tension",
    "timestamp": 1754776800
  },
  {
    "username": "Gudenstain",
    "rating": 9.0,
    "comment": "An excellent game. WWI flows extremely well with this card driven game. Exciting, lots of choices, plausible and really well done. Most of card driven games could be unbalanced by an odd hand and sometimes a combination of cards could be too powerful or the game could evolve in a really strange way, but on the other hand they add tension.",
    "timestamp": 1754258400
  },
  {
    "username": "mgmiller",
    "rating": 10.0,
    "comment": "One of my first serious war games that I really studied. Just got the 2022 Deluxe 2nd Printing from GMT. Amazing quality and fantastic product support from them!\n\nNow I am playing on ACTS as PBEM and it is revolutionizing my understanding of strategy and giving me a majorly new appreciation of the brilliance of this game. The history is incredible and I have been reading books and watching Youtube historical videos on WWI (as of end of 2024). The impressive part is how surprisingly accurate Raicer's rendition was from his first design in 1999. The current 5.7 historical/tournament variation is a great refinement of an already excellent system.\n\nMy favorite wargame of all time. Simmons games are the only games that can even try to give this one a run for its money, but they exist in different classes. If I had to pick on last game for the desert island, of course it would depend on my opponent on that island, but this should be it. Napoleon's Triumph and Guns of Gettysburg could win, but only if we take into account the availability of opponents. POG will forever be a master class. I can't get enough of it.",
    "timestamp": 1760652000
  },
  {
    "username": "selwyth",
    "rating": 10.0,
    "comment": "1v1 CDG with 'all-move'. This resembles those videos of historical battles, where one sees pieces hold the front while others attempt to 'turn the corner' and flank. Also resembles football formations. Also resembles Tron: Legacy lightbikes, when counters charge into enemy territory in a blaze of supply-cutting YOLO. I suspect this might be less dynamic once both players are experienced, and it becomes an attritional affair as both players land body blows on each other, but it will still be fun then, and I enjoy the interplay between encircling vs. dominating.\n\nHas a little bit of deck management.\n\n5+5",
    "timestamp": 1758664800
  },
  {
    "username": "lehjoz",
    "rating": 10.0,
    "comment": "#wargame\n25990 Ft.",
    "timestamp": 1757628000
  },
  {
    "username": "ajpyyzajp",
    "rating": 10.0,
    "comment": "Depth and elegance with so many moving wheels. I like thats its covering an under represented conflict in board gaming even though its more of a \"what if\" take on it.",
    "timestamp": 1745186400
  },
  {
    "username": "shakaalie",
    "rating": 10.0,
    "comment": "Working through the rules and the first couple of games was quite tough, but now it's a wonderful gaming experience. Each turn is filled with tension and meaningful decisions.\n\nAddition: After you get the hang of it, 10/10. Plus supportive community in BGG to answer rules questions quickly.",
    "timestamp": 1743202800
  },
  {
    "username": "Ravensburg24",
    "rating": 10.0,
    "comment": "I play the \"historical scenario\" with the beautiful new board.\n\nOnly 2 player\n\nThe absolute longest game I'll play, but also absolutely brilliant. My favorite implementation of the CDG engine.",
    "timestamp": 1743202800
  },
  {
    "username": "Squid In Squid Ink",
    "rating": 10.0,
    "comment": "One of my favorite hex and counter wargames. WWI combat was a fairly static slog and the need to protect your supply lines means wild risky moves are unlikely. So why is every decision, every single card played, such a tough choice?",
    "timestamp": 1740783600
  },
  {
    "username": "Antiochos91",
    "rating": 10.0,
    "comment": "Magnificent game, likely the best CDG thus far. Tough decisions and impressive modeling of the gradual enlargement of the war.",
    "timestamp": 1738882800
  },
  {
    "username": "DocGG",
    "rating": 10.0,
    "comment": "Every game is a nail-biter, and hand card management is very challenging throughout.\n\nWe often played through the night and just couldn't stop...\n\nIn fact, it was this game that really illustrated the military course of the First World War to me - it's just great!",
    "timestamp": 1737241200
  },
  {
    "username": "masterlelik",
    "rating": 10.0,
    "comment": "boardgames\nN",
    "timestamp": 1736895600
  }
]