[
  {
    "username": "SveaRike",
    "rating": 1.0,
    "comment": "Awful third tile laying game designed by Reiner Knizia.",
    "timestamp": 1675465200
  },
  {
    "username": "Honest",
    "rating": 1.0,
    "comment": "Awful Abstract Game",
    "timestamp": 1649541600
  },
  {
    "username": "No_Event_This_Round",
    "rating": 1.0,
    "comment": "Hated this",
    "timestamp": 1635199200
  },
  {
    "username": "Ravensburg24",
    "rating": 1.0,
    "comment": "So dry, it hurts.",
    "timestamp": 1628460000
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating games like KD:M or Hate with a 1, just because of their mature theme.\nI’m offended by how boring the theme of this game is!",
    "timestamp": 1547074800
  },
  {
    "username": "voynitsky",
    "rating": 1.0,
    "comment": "I played this once a few years ago and hated it then, but gave it another chance, still hate it so much.",
    "timestamp": 1542582000
  },
  {
    "username": "wallwaster",
    "rating": 1.0,
    "comment": "I really don't like multiplayer confrontative games where there is no mechanism implemented against kingmaking, but I went into trying this knowing this is that kind of game, but it's made so much worse by the insane luck factor of the draw, which basically decides all your battles that I couldn't believe I hate the game this much. Is this just a classic because people can feel smart when they understand the difference beetween internal and external conflict?",
    "timestamp": 1481756400
  },
  {
    "username": "bmwrider",
    "rating": 1.0,
    "comment": "Look into this more, I may ge good at this",
    "timestamp": 1404424800
  },
  {
    "username": "alexisW",
    "rating": 1.0,
    "comment": "Not very newbie friendly. Complete turn off for me. Confusion gallore. I rather play ASL with all the rules in.",
    "timestamp": 1297810800
  },
  {
    "username": "mahatmamanic",
    "rating": 1.0,
    "comment": "I hate this game. I don't know what it is about it that I can't stand, but something. Every time I play I end up feeling frustrated, angry, and/or bored. It's the antithesis of what I want from a gaming experience.",
    "timestamp": 1230850800
  },
  {
    "username": "helminator666",
    "rating": 1.0,
    "comment": "absolutely not my game",
    "timestamp": 1208469600
  },
  {
    "username": "cadawn",
    "rating": 1.0,
    "comment": "I find this game incredibly dull -- an abstract game with a poorly grafted on theme. I can understand the appeal of Puerto Rico -- don't agree entirely with it -- but I can understand it. But this game is just all that is bad about Eurogames.",
    "timestamp": 1185487200
  },
  {
    "username": "Gothnak",
    "rating": 1.0,
    "comment": "Played four or five times so far really don't like it. Feel heavily penalised for never drawing red tiles, and reach situations where everything i can do will be taken over in the next play by someone else. The highest rated really dull game in my opinion.\n\nDoesn't help that i was playing experts, but in other games i grasp the tactics prety quick. This one tbh i can't be bothered anymore.",
    "timestamp": 1151877600
  },
  {
    "username": "Ghrogh",
    "rating": 1.0,
    "comment": "I didn't like it at all, but it's like the 2nd highest rated game on this site. I don't understand why everyone loves it so much, but my rating accurately reflects how much I loathed playing it.",
    "timestamp": 1139094000
  },
  {
    "username": "Ninja_Squirrel",
    "rating": 1.0,
    "comment": "Horrible game. I hate almost every aspect of its game mechanics. I won the 2nd game I ever played, but I still did not enjoy it. The ownership of \"kingdoms\" and the initiation of conflict/combat is really confusing & annoying. I was confused & frustrated with Puerto Rico when I first played it, but I learned to understand it and like it. I can't imagine ever coming to have fun playing Tigris & Euphrates. Not for me.",
    "timestamp": 1118268000
  },
  {
    "username": "fenix71",
    "rating": 1.0,
    "comment": "awful, boring, graphically horrible!\nA pain :-(",
    "timestamp": 1113861600
  },
  {
    "username": "pluviometer",
    "rating": 2.0,
    "comment": "I recognize that this is a beloved game rich with strategy, but I personally loathe area control, so I do not see myself willingly playing this again.",
    "timestamp": 1733353200
  },
  {
    "username": "quietcorn",
    "rating": 2.0,
    "comment": "My last, and only other play of this game was in 2011, so I didn't really remember anything about it. This time I absolutely hated the experience. It feet wild, chaotic and random, although end game scoring proved that it wasn't, as each of my three opponents had nine points with me sitting at 5.\n\nIn this game, you are laying down tiles in a big grid. There are a few placement rules, but the focus is on the fact that when you put a tile down into a chain of tiles, a player who's marker is a part of that chain, with the matching color, gets a cube in that color. When two cities connect, or when a player puts a marker down in the same city as a matching opponent's marker, then players battle by spending randomly drawn tiles from behind their player screen of the color of the conflict, with the most tiles winning. In some cases you also count tiles around your marker, and in some you don't but I found the combat incredibly frustrating. My opponents might win a combat without spending any tiles behind their screen, and then I lost a combat where I had a +5 advantage to someone revealing 5 matching tiles. The winner of the combat gets some cube payout in the matching color as well.\n\nWhen someone loses a combat, parts of the city flay off, which means your positions can get messed up even through no participation of your own.\n\nI'm sad to say I hated every minute of this game. I know it's one of the big revered games out there, but I found it completely intolerable.",
    "timestamp": 1721685600
  },
  {
    "username": "alpinegamer",
    "rating": 2.0,
    "comment": "Just not my style; I’m terrible at spatial games.",
    "timestamp": 1652565600
  },
  {
    "username": "Ryan Keane",
    "rating": 2.0,
    "comment": "A clear case where I think the pasted-on theme makes it harder to teach and learn. I generally don't like the screening of victory points - it's not too hard to keep track of how many of each color your opponent(s) have collected if you want to, especially with just 2p, but that then takes a lot of the fun out of the game if you're trying that hard. I do see that this game could bog down with a lot of AP for some if victory points were visible. Lastly, using cubes for victory points just feels weird, compared to how they are used in every other Euro I've played. I think I would always recommend Ingenious (no attempt at pasted-on theme, simplified but similar feel, less conflict) over T&E.",
    "timestamp": 1604962800
  },
  {
    "username": "jackbarnard",
    "rating": 2.0,
    "comment": "A game that painfully shows it age. I've seen this game referred to as a masterpiece, I'd say the only masterful thing about it is the astonishing lack of player agency and pace this game presents, all while defiantly occupying your table for 2 hours.\n\nThe worst thing about this experience was the downtime. AP is strong here since the option space is wide and there are any number of different combinations of moves you can make each turn, and since the scoring system is tricky you'll find that players agonise over every single move, dragging the game down to the most glacial of velocities.\n\nSince the tiles you place are directly responsible for your score, it is pretty annoying that you only get to draw them randomly from a bag. You can exchange your hand, sure, but it costs you an action and probably the game if you do this more than once. Every turn consists of you drawing tiles, and realising that you either scored nothing that turn or completely wrecked your opponents that turn. This kind of randomness is fine in most games, I've nothing against it in principle, but this is a strategy game and a pretty long one at that.\n\nI feel that if players had more agency over their hand of tiles then this could be a lot of fun. Playing a huge turn which swings the board in your favour would give you a nice opportunity to pat yourself on the back for being a clever little sausage and would reward delicate planning. As the game comes, though, you have precious few turns in which anything of real consequence happens, and the games drags.",
    "timestamp": 1573772400
  },
  {
    "username": "AVJax",
    "rating": 2.0,
    "comment": "Dry, abstract, theme less and boring. Double Yawn.",
    "timestamp": 1492725600
  },
  {
    "username": "davedanger",
    "rating": 2.0,
    "comment": "Hard to learn and conceptulize, and of course, explain. A brilliant simulation model so condensed it is abstract & broken. No one in our group wants to play this. Open yet secret victory points is stupid (and not required per the designer). A tile- draw- fest. Winning strategy-draw red tiles!. Don't have enough? Quit.",
    "timestamp": 1450393200
  },
  {
    "username": "imoo",
    "rating": 2.0,
    "comment": "邦題：　チグリス＆ユーフラテス",
    "timestamp": 1443996000
  },
  {
    "username": "Gryfon",
    "rating": 2.0,
    "comment": "a perfect example of a euro game that is of no interest to me. the theme really has nothing to do with the game, and while scanning the board for a great move certainly requires skill, I'm not interested in working to gain that skill, and if I did, I suspect the game would then come down to who had the right amount of red tiles at the right moments.",
    "timestamp": 1443909600
  },
  {
    "username": "DrWildcat",
    "rating": 2.0,
    "comment": "Dry as dust puzzle.",
    "timestamp": 1404856800
  },
  {
    "username": "allstar64",
    "rating": 2.0,
    "comment": "Personally do not care for this game. Played it, did not like it.",
    "timestamp": 1353279600
  },
  {
    "username": "Zadok13",
    "rating": 2.0,
    "comment": "One of the dullest board game experiences I have ever had. The game is extremely dry, there are too many odd rules to memorize and it feels like it lasts forever. I will never ever ever ever play this game again. If this game was a sandwich it would be made up of two pieces of white bread with sand in the middle.",
    "timestamp": 1348437600
  },
  {
    "username": "bubblikk",
    "rating": 2.0,
    "comment": "Maybe it's just not my cup of tea, but IMO it's most BORING game I ever play.",
    "timestamp": 1339106400
  },
  {
    "username": "larienna",
    "rating": 2.0,
    "comment": "I knew that this game was not for me, but I happen having no choice to play it. Anyways, since it's a classic, I had at least to play it at least once.\n\nIt's a very abstract game, the theme is very thin, there is a lot of colors, which is bad for me since I am partially color blind, and it's made by knizia. These are all good reasons for me to hate the game.\n\nBecause of the color issues, it's very hard for me to analyze the board. I do not have problem differentiating colors, it's just that it's hard for me to see in a glance which chunk will have a majority in a certain color.\n\nSecond, each leader has special powers, each tile have a different effect in certain circumstance which makes it sometimes confusing making the board even harder to analyze.\n\nSo this game is only made for pure euro style games fanatics. The theme is so thin that you have no feeling of actually building up a civilization.",
    "timestamp": 1338674400
  },
  {
    "username": "kinoke",
    "rating": 2.0,
    "comment": "I found this game to be incredibly slow, clunky and unimaginative. It didn't help that it was me and another new player teaching this to ourselves. I will definitely be giving this a few more shots and will also try it with more people before I give up on it, but non-inspiring first plays.",
    "timestamp": 1317160800
  },
  {
    "username": "sdetoni",
    "rating": 2.0,
    "comment": "Don't get it! Hate it!",
    "timestamp": 1298588400
  },
  {
    "username": "shawnmackay1593",
    "rating": 3.0,
    "comment": "Nothing about this game was fun and it is as ugly as can be. No interest in trying this again.",
    "timestamp": 1748469600
  },
  {
    "username": "andrewsgame12",
    "rating": 3.0,
    "comment": "Really did not like this game no matter how many times I played.",
    "timestamp": 1745186400
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "More than meets the eye. It's deep, very contemplative, and depending on the types of players you play with, impressively cutthroat and aggressive. Nothing quite like forcing the potential leader into a war against their will. Only bugaboo is the randomness of the tile draw. It can (and often will be) infuriating. When you just need one color tile and can't seem to draw it (yet you've got a handful of blue tiles that won't do you any good right now). Not sure how else you'd handle tile distribution, though. But even with that, lovely game.",
    "timestamp": 1735081200
  },
  {
    "username": "grzechoo104",
    "rating": 3.0,
    "comment": "I understand why people love it, but I really hated the first (and only) game so far. Hard to tell what was the most frustrating part - in general I enjoy Knizia's similar games - but I probably won't play it ever again.",
    "timestamp": 1731884400
  },
  {
    "username": "Markies123",
    "rating": 3.0,
    "comment": "Don't like Area Control games and this is very mean.",
    "timestamp": 1707778800
  },
  {
    "username": "uman2631",
    "rating": 3.0,
    "comment": "I never got past the rule book.",
    "timestamp": 1693432800
  },
  {
    "username": "gizmobj",
    "rating": 3.0,
    "comment": "Difficult to grasp. Probably only for experienced gamers.",
    "timestamp": 1690927200
  },
  {
    "username": "shizzane",
    "rating": 3.0,
    "comment": "I've only played this game a handful of times and am not a big fan of the mechanics, which is strange since so many claim this as one of the best games EVER. This game just feels so boring. I like my gaming experiences to be fun with difficult decision making, but this is just BLAH! Where's the fun factor?! It's not horrible, but it's not that fun either.",
    "timestamp": 1676847600
  },
  {
    "username": "FallenCactus",
    "rating": 3.0,
    "comment": "Bon jeu mais juste pas mon genre.",
    "timestamp": 1645138800
  },
  {
    "username": "Agrajag",
    "rating": 3.0,
    "comment": "Way too dry and abstract.",
    "timestamp": 1631052000
  },
  {
    "username": "dodgepong",
    "rating": 3.0,
    "comment": "I'm sure this game is great with repeated plays, but even just thinking about playing this game again hurts my brain. Not my cup of tea.",
    "timestamp": 1611702000
  },
  {
    "username": "gramsdad",
    "rating": 3.0,
    "comment": "Tigris and Euphrates is a problematic game hampered by poorly written unintuitive rules that encumber fairly simple game concepts. Too many times when playing, players are left in ambiguous situations that the rules don't adequately address. As the game progresses, it turns into a dull-as-dirt grind to the finish. Like many eurogames, the winner is unclear until resolving how the resources have been accumulated.\n\nAs a caveat to those with an interest in ancient history or Civilization type games, the ancient civilization shtick is just a veneer, included to add artistic appeal to the game. OTOH the components and art are nice.\n\nI'd recommend this game for folks who like puzzle solving games. I'd warn away folks who intend on playing anything light and fun or social.\n\nI house ruled the game quite a bit and made it a bit more fun. I got rid of the revolt mechanics, and only let one player occupy a particular kingdom. Tiles had to be placed next to other friendly tiles. Catastrophe tiles had to be purchased with victory point tokens (4 of the same or 8 mixed). Attacks take a full player action phase and require a temple tile place between the two kingdoms to initiate. During wars each kingdom tallies the number of temple tiles on the board and can add temple tiles in their hand. The loser must remove their leader as well as all temple tiles from the defeated kingdom (as well as any orphan tiles that are no longer adjacent to friendly tiles). Finally I added a trade phase, where players were free to trade victory point tokens with each other. I found that this added a fun social aspect to the game (faintly similar to Diplomacy).",
    "timestamp": 1609801200
  },
  {
    "username": "Kamaitatchi",
    "rating": 3.0,
    "comment": "Interesting abstract. Curious how it plays with more.\nRules are easy to pick up but new players are guaranteed to forget one or two. Like how scoring works.",
    "timestamp": 1609282800
  },
  {
    "username": "Jamesmcm84",
    "rating": 3.0,
    "comment": "Decent game.",
    "timestamp": 1602108000
  },
  {
    "username": "Virabhadra",
    "rating": 3.0,
    "comment": "I hear that once you have a few plays under your belt you begin to see patterns emerge in the morass of colored tiles on the board. Frankly, there's nothing about T&E that makes me want to scrape through it a few more times.",
    "timestamp": 1594850400
  },
  {
    "username": "saci23",
    "rating": 3.0,
    "comment": "Excellent quality but the rules were complex and hard to decipher. Perhaps this is better with more players as each of the times (about 4) two of us played this game as soon as one player became dominant it became impossible for the other to overtake and the winner was inevitable.",
    "timestamp": 1569621600
  },
  {
    "username": "Jesse Terrell",
    "rating": 4.0,
    "comment": "(bga.)",
    "timestamp": 1757714400
  },
  {
    "username": "Big_barni",
    "rating": 3.5,
    "comment": "To start, I can not say this game is bad, having played it once, what I can say, though is that I did not like it at all. We spent 1 hour saying \"I will put one *blank* tile here, and score one *blank* point.\" Now this was obviously getting pretty boring so I decided to attack my neighbor, and lost horribly. I then had no reason to continue due to the circumstances, and never played again. I do not know if we were doing something wrong, but it wasn't a good experience.",
    "timestamp": 1755727200
  },
  {
    "username": "paulus22",
    "rating": 4.0,
    "comment": "Easy rules, HEAVY gameplay. A Super-Thinker. I can't rate it really high because I don't get it, even though I've played it five times. Very challenging, but as of now, not very fun. I just don't enjoy the game, even though it is a really great game.",
    "timestamp": 1754776800
  },
  {
    "username": "secondofthenew",
    "rating": 4.0,
    "comment": "Knizia's masterpiece. Full of drama as you witness the ebb and flow of civilization as cities grow and shatter.",
    "timestamp": 1752444000
  },
  {
    "username": "Destrio",
    "rating": 4.0,
    "comment": "Highly rated but I have yet to tap into why. Abstract games are a risky proposition for me given that they rarely capture my attention and the oddly unique rules is what prevents me from bringing it out frequently enough to plumb its depths.",
    "timestamp": 1745964000
  },
  {
    "username": "DanKill",
    "rating": 4.0,
    "comment": "Evil little game is evil. Found this quite stressful.",
    "timestamp": 1743372000
  },
  {
    "username": "MarshallStaxx",
    "rating": 4.0,
    "comment": "Brainburning abstract game, kind of like a 4-way free-form chess match. Oddly the theme is gossamer-thin. Seems like the kind of game that reveals infinite strategic depth the deeper you get into, but to enjoy it you must put in a LOT of time, effort, and study, and until you have mastered the game it is completely un-fun and frustrating. Not for me, and certainly nowhere near what i would consider a 'masterpiece'. Hugely overated, in my opinion.",
    "timestamp": 1734476400
  },
  {
    "username": "langen999",
    "rating": 3.5,
    "comment": "Just not my kind of game...",
    "timestamp": 1726178400
  },
  {
    "username": "Freidenker",
    "rating": 4.0,
    "comment": "",
    "timestamp": 1691272800
  },
  {
    "username": "marioaguila",
    "rating": 4.0,
    "comment": "2005: Un juego abstracto, un tanto fome. Las reglas me fueron mal explicadas (espero que sea eso), pero tras la aclaración siento que no es atractivo; veré si en un tiempo más, con una nueva aproximación, mejora mi puntaje.\nAGREGO: pienso que para jugar juegos muy abstractos, me quedo con el ajedrez, y punto.\nLa idea es que tengan estrategia y se usen las capacidades mentales, pero no al punto que parezca un trabajo más que un placer.",
    "timestamp": 1674169200
  },
  {
    "username": "rubendijkstra",
    "rating": 4.0,
    "comment": "Too complex for what it brings to the table.",
    "timestamp": 1666389600
  },
  {
    "username": "wedgeex",
    "rating": 4.0,
    "comment": "I understand it is \"classic\" but the randomness of the tiles alongside the abstract concepts that are both difficult to teach and retain knowledge of (considering the infrequent plays of this one) make this one hard to justify keeping.",
    "timestamp": 1643583600
  },
  {
    "username": "ZeeGarcia",
    "rating": 4.0,
    "comment": "Feels rules-heavy yet fairly lucky. On top of that, it's bone dry. I don't know, maybe it hasn't clicked, but right now the game seems okay at best.",
    "timestamp": 1639090800
  },
  {
    "username": "silentmexx",
    "rating": 4.0,
    "comment": "[2008-03]\nThis game just didn't click with me. It has some ok gameplay, but I wasn't delved into the game.\nRating: 4",
    "timestamp": 1633298400
  },
  {
    "username": "TheLimestoneCowboy",
    "rating": 4.0,
    "comment": "*D",
    "timestamp": 1620252000
  },
  {
    "username": "ryansmum2008",
    "rating": 4.0,
    "comment": "Not for Me",
    "timestamp": 1618956000
  },
  {
    "username": "billpete002",
    "rating": 5.0,
    "comment": "Too much effort to get to the table compared to other similar games.",
    "timestamp": 1758232800
  },
  {
    "username": "garbagefan",
    "rating": 5.0,
    "comment": "Android",
    "timestamp": 1745704800
  },
  {
    "username": "Magneton",
    "rating": 5.0,
    "comment": "It's not that it's bad (given it a 5 before) - it just bores me to bits.",
    "timestamp": 1741734000
  },
  {
    "username": "Ginewra",
    "rating": 5.1,
    "comment": "bga",
    "timestamp": 1739055600
  },
  {
    "username": "qzhdad",
    "rating": 5.0,
    "comment": "Started at a nine, but didn't have legs. Not sure why I don't like this as well, but prefer many others to this one. Still a well crafted game, but doesn't have the spark for me. It's got more luck (or I play really badly) than I like in a game that \"feels\" this serious. I like the card game version better, because it seems to have the right light feel to luck ratio.",
    "timestamp": 1738623600
  },
  {
    "username": "PzVIE",
    "rating": 5.0,
    "comment": "I problably played this one with the wrong people, but after a couple of playings the only thing I remember is waiting until it is my turn again. Boring. Also, it's pure Euro - so not in my comfort zone.",
    "timestamp": 1738105200
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "I think I am missing something. Many people rave about this game, but I just don't get it.\n\nGot in 2007",
    "timestamp": 1731538800
  },
  {
    "username": "den2soo",
    "rating": 5.0,
    "comment": "Str",
    "timestamp": 1730674800
  },
  {
    "username": "azeem",
    "rating": 5.0,
    "comment": "The rules are confusing, and this is by far the heaviest Knizia game I have ever played.\n\nThe greatness of T & E escapes me. I felt like I had very little agency, and was mostly at the mercy of the tiles I drew. I see the potential for more strategy, as the owner explained to me, but I feel it would take me too many plays to experience it for myself. This is far from the \"light rules, deep strategy\" I have come to know of Reiner Knizia.\n\nThe fact that tiles get removed from the board during wars makes T & E fundamentally different than a lot of tile-laying games. However, the point spreads are small, and a player's final score is their lowest of 4 colours. So a big burst of points in one colour seems unnecessary. If you don't hold tiles in your lowest colour, it is hard to score more points for that colour.",
    "timestamp": 1726524000
  },
  {
    "username": "kvarclovag",
    "rating": 5.0,
    "comment": "Talán az állandóan megmaradó emlékmű jobb, mint a megépülő és leomló pagodák a Y&Y-ban, mert fontosabb, élesebb érte a harc. De a körök nagy részében csak készülünk a háborúra, de nem úgy, ahogy akarunk, hanem ahogy a lapkák lehetővé teszik. A győzelmi pontok takarásával játszva végképp nem tudja az ember hol tart, mit érdemes csinálni. Egy háború vagy felkelés elvesztése után már nagyon nehéz visszakapaszkodni, könnyen szenvedős lehet már utána. A nagy csaták sokszor a véletlenen múlnak, ki milyen támogatást tud épp kijátszani kézből. BGA adatok alapján egy bizonyos szint fölött már a véletlen dönt, nincs 500 ELO-pont fölötti játékos. A hasonló játékszámmal futó T&T-nál van 700 ELO-pont fölötti is.",
    "timestamp": 1723327200
  },
  {
    "username": "MissP1ggy",
    "rating": 5.0,
    "comment": "Sold\nDidn’t get played anymore.",
    "timestamp": 1722722400
  },
  {
    "username": "edosan",
    "rating": 5.0,
    "comment": "UPDATE: Maybe I'm just not in the mood for the \"knife fight in a phone booth\" (there's a phrase that doesn't mean anything any more) type of games. I appreciate the design but I don't have the internal fortitude for knock-down, drag-out games like this nowadays.\n\nOne of Knizia's best games. Tile-laying as a metaphor for warfare between civilizations. Heavy-duty confrontation from beginning to end. Lots and lots of direct confrontation.",
    "timestamp": 1721599200
  },
  {
    "username": "Eldard",
    "rating": 5.0,
    "comment": "It's a fine game, but I don't particularly care for it.",
    "timestamp": 1720821600
  },
  {
    "username": "bneffer",
    "rating": 5.0,
    "comment": "A set of mechanisms woven together into a masterful design. I simply do not think it is fun to play. I love the idea of having to pivot and maintain balance between your different 'colors' and would love to see this reimplemented in another game / theme.",
    "timestamp": 1712872800
  },
  {
    "username": "zardon",
    "rating": 5.0,
    "comment": "I played this game about 10 years ago. I didn't like it then, don't like it now. I don't understand how the game works or how battles worked. I am not very good with abstract games. I'm sure its a good game, just not for me.\n\n5/10",
    "timestamp": 1711753200
  },
  {
    "username": "JamieRufe",
    "rating": 5.0,
    "comment": "Rating: Interested\nSOLD\n\nAn iconic game in the hobby that is truly one of the best games of all time. That being said, the gameplay creates so much tension and angst for me that it's not a game I want to play all the time. Furthermore, this game is a pain in the butt to teach and it is not a game that a first-timer can just dive into and play well.",
    "timestamp": 1703890800
  },
  {
    "username": "Epochend",
    "rating": 5.0,
    "comment": "I remember finding it clever and tense, but also unpleasantly brain-draining and often incredibly frustrating (especially when you can't draw the tiles you need).",
    "timestamp": 1690495200
  },
  {
    "username": "lethan",
    "rating": 5.0,
    "comment": "Currently on \"Exit\" list",
    "timestamp": 1683496800
  },
  {
    "username": "CharlieMnemonic",
    "rating": 5.0,
    "comment": "Easy to play, and you can play simply, but there's also some thinky-ness if you want to go there. Not really my cup of tea, because I felt a disconnect between the theme and the mechanics.",
    "timestamp": 1682719200
  },
  {
    "username": "Lamitie",
    "rating": 5.0,
    "comment": "Played on boardgamegeek. Not into area control and war games.",
    "timestamp": 1678834800
  },
  {
    "username": "happypooya",
    "rating": 5.4,
    "comment": "It could have been strategic, tactical, and fun. Yet it's boring, brutal, and random as hell. Each time I tried this game. it was a huge disappointment.",
    "timestamp": 1665612000
  },
  {
    "username": "Dugy",
    "rating": 5.0,
    "comment": "Twists and Turns. Hold you breath and protect \"well\" your leaders. Your civilization may rise...or may fall along the game. Brillant game. Let it shine in your table!",
    "timestamp": 1664488800
  },
  {
    "username": "Prutser77",
    "rating": 5.0,
    "comment": "Sold it a long time ago",
    "timestamp": 1660687200
  },
  {
    "username": "Jewely",
    "rating": 5.0,
    "comment": "I find it annoying. If you are playing with the wrong people it can be frustrating.",
    "timestamp": 1654725600
  },
  {
    "username": "CascadeHush",
    "rating": 5.0,
    "comment": "9",
    "timestamp": 1652306400
  },
  {
    "username": "Ychor",
    "rating": 5.0,
    "comment": "Replaced with iOS version (removed from app store)\n\n2007: 12 plays\n==\nGame of the Month: Jun 2007 (8 plays)",
    "timestamp": 1644447600
  },
  {
    "username": "GeorgW",
    "rating": 5.0,
    "comment": "I should like this game so much more than I do.\n\nPros:\nA lot of people with similar tastes as I consider this game to be amazing, and I can totally see why.\n\nThere are so many great ideas in this game. The point system is brilliant because it's a very simple way to keep you from resting on your laurels. The conflicts are always tense and interesting, it has smartly built-in catch-up mechanisms and the way it forces you to fight and outwit your opponents is wonderful.\n\nFor example, the little trick of giving an opponent a monument to reduce their strength and then immediately take it over is a wonderfully devilish emergent gameplay moment.\n\nThe turn structure is very simple...\n\nCons:\n...but the rules are actually deceptively complicated. The distinction between internal and external conflict may make sense thematically but I always have to look up turn order and how points are awarded and how the board is affected. I also feel like it's harder than it should be to determine strength and the board is just a little hard to read at times. There's also several sources of points and it's not always intuitive how to catch up a color deficiency for newer players.\n\nMy biggest problem is that I don't like the tile drawing. For one it's fiddly to have everyone draw from the same bag after a conflict. I also often feel very limited by my hand, where I want to do a play but my hand doesn't let me. I know that I can play better to manage my hand and e.g. waste tiles in a conflict as a free redraw, and I also know that good players should just play their hand instead of blaming poor draws. Still, I simply don't feel this way in Babylonia or Race for the Galaxy but I do here so obviously there's something to it.\n\nThe player order is also a bit too important for my liking. I don't like how you can be handed \"free\" stuff by simply playing after a big conflict and I don't like how not everyone gets the same number of turns in a way that's not in any way compensated for.\n\nI think the game would feel less random and less fiddly if everyone had their own equally (or perhaps not depending on the player order) distributed bags of tiles like in Babylonia, but who am I to question the great Dr. Knizia?\n\nI can definitely see why people love it and if I had a group dedicated to learning this game properly I'm sure we'd have a lot of fun. As it is now I think it's a fine game, but not one I'd choose to play.",
    "timestamp": 1643583600
  },
  {
    "username": "Wendyjo73",
    "rating": 5.0,
    "comment": "Could this BE any more beige?\nIt’s ok. I could be talked into giving it another go, but with so many modern games with prettier art, I don’t think this will get played again. The thing that annoyed me the most was the fact that internal conflicts used red tiles and 2 of the 3 of us couldn’t draw reds to save our lives and the 3rd guy drew reds all day. The luck factor really hurts in games like this.",
    "timestamp": 1634940000
  },
  {
    "username": "zebracat",
    "rating": 5.0,
    "comment": "Not much connected with theme!",
    "timestamp": 1633730400
  },
  {
    "username": "hobbes_inc",
    "rating": 5.0,
    "comment": "I am still waiting for the moment that everyone talks about when this games clicks and it becomes your new favorite. I understand the strategy I would just rather be playing a whole host of other games.",
    "timestamp": 1632434400
  },
  {
    "username": "ZSoo",
    "rating": 4.5,
    "comment": "I happen to fail to understand the appeal of this game. The base mechanic is promising, but has a very unfinished feel to it.",
    "timestamp": 1626645600
  },
  {
    "username": "SteveTremendous",
    "rating": 5.0,
    "comment": "I have played enough times to know that its not that I just don't \"get\" it. Instead, I just don't \"like\" it all that much.",
    "timestamp": 1616367600
  },
  {
    "username": "wanne",
    "rating": 6.0,
    "comment": "bei Frank gespielt",
    "timestamp": 1759874400
  },
  {
    "username": "harrycalder",
    "rating": 5.8,
    "comment": "Received in a trade on 2/21/15.",
    "timestamp": 1757800800
  },
  {
    "username": "Christianhance",
    "rating": 6.0,
    "comment": "Loft - Box 25/1",
    "timestamp": 1755208800
  },
  {
    "username": "SkyGlad",
    "rating": 6.0,
    "comment": "Feels luckier than Y&Y, and swingier. Would always rather just play Y&Y.",
    "timestamp": 1753135200
  },
  {
    "username": "CotB",
    "rating": 6.0,
    "comment": "Rankings\n45th Best Game 2021\n46th Best Game 2022\n144th Best Game 2023",
    "timestamp": 1750888800
  },
  {
    "username": "darkfinale",
    "rating": 6.0,
    "comment": "end-November '23 Top 60 Games [#44/60]\n\nComplicated, good design, tile placement not my thing. But game is really good.",
    "timestamp": 1744495200
  },
  {
    "username": "javi_cin",
    "rating": 6.0,
    "comment": "A bit too many rules for the usual simplicity of Knizia, with the different colors getting confusing and the difference between internal and external conflicts resolution. It felt a bit too mechanical and not particularly fun to play.",
    "timestamp": 1743890400
  },
  {
    "username": "cubntin",
    "rating": 6.0,
    "comment": "2-4 players",
    "timestamp": 1743458400
  },
  {
    "username": "totero",
    "rating": 6.0,
    "comment": "Long - Abstract - 9 -",
    "timestamp": 1742770800
  },
  {
    "username": "mnemonicuz",
    "rating": 6.0,
    "comment": "Clever and tactical area majority game. Very mean, but a brilliant design.",
    "timestamp": 1741993200
  },
  {
    "username": "mcbs",
    "rating": 6.0,
    "comment": "I love but my problem is most people I play with dont get it.",
    "timestamp": 1740956400
  },
  {
    "username": "g4bor",
    "rating": 6.0,
    "comment": "Cleverly thematic tile layer that I don't really feel like playing anymore. Luck somehow has a strange role in this game, making it stressful without the same level of excitement.",
    "timestamp": 1740438000
  },
  {
    "username": "boredbeyondbelief",
    "rating": 6.0,
    "comment": "I thought there would be camels. I was promised camels. Then someone told me I was thinking of Through the Desert.\n\nIt is really interactive. And getting picked on might not be the worst thing for you or the greatest thing for someone to do. So that is kind of nice. The balanced scoring thing is interesting - and I think it balances the take-that element (because you can't just go for global domination on one dimension). And it probably has great depth. This is the kind of game that most likely you appreciate more with each play. Unfortunately, while this might have made it a great game for me in 1997, right now I just have too many games that I don't play that I LOVE to put in the effort to get up that learning curve where I really appreciate this design. Yes, in many ways, my gaming has become \"shallow\"",
    "timestamp": 1738710000
  },
  {
    "username": "tomdabom98",
    "rating": 6.0,
    "comment": "The depth of strategy and amount of interaction in this game make it an absolute joy to play. I haven't even scratched the surface on the depth of it, but so far I really enjoy the game and look forward to tabling it more in person.\n\nEdit 1/20/24:\nI really want to like this game, but I find myself not enjoying it when I'm playing and the randomness of the tile draw kind of kills it for me. Unfortunately this game has to go.",
    "timestamp": 1737414000
  },
  {
    "username": "Jolman42",
    "rating": 6.0,
    "comment": "Je comprends l'attrait, c'est potentiellement incroyable. Je n'ai cependant pas vraiment l'envie ni le groupe pour s'investir dans ce jeu. Intéressant, mais pas pour moi.",
    "timestamp": 1736463600
  },
  {
    "username": "littlechandler",
    "rating": 6.0,
    "comment": "I had no idea what I was doing in the game I've played, but I can still tell how expertly designed this game is. It's like the modern Go, fairly straightforward rules but incredibly brain burny with a place a piece for area control aspect. The different colors makes you have to consider different modes of play by your opponents, while the scoring of your minimum color score makes it so you can't just spam one color. Like Go where you place your tiles is not immediately apparent all the ramifications it has, which adds layers of strategy, but also potentially AP. The random tile draw while some might not like the randomness adds some hand management aspects to the game while presumably making the start of the game more variable, and there is a mulligan action (which is not a complete wasted turn, you can also use it to stock up on a color you want or rush the end of the game). Overall seamlessly combines all of its mechanisms together (albeit very abstractly) into a game that I can understand why there are many proponents that it should be ranked #1.\n\nI wish the board's size scaled to the number of players, as otherwise it seems too open with less than 4, but it is nice that there are 2 sides to play on.",
    "timestamp": 1734822000
  },
  {
    "username": "Gvconkel",
    "rating": 6.0,
    "comment": "I do not like abstract conflictual games. My only play with this one has a consequence of giving my love a bad feeling and morning since she got beaten by me. Never will play again such games.",
    "timestamp": 1733180400
  },
  {
    "username": "JasonSaastad",
    "rating": 6.0,
    "comment": "intrinsically interactive\n\n hapless HTI\n shitty scalability\n abated agency via communal crap\n tediously tactical",
    "timestamp": 1730934000
  },
  {
    "username": "heatbbx",
    "rating": 6.0,
    "comment": "Mayfair Games Edition",
    "timestamp": 1724104800
  },
  {
    "username": "BradJacobs",
    "rating": 6.0,
    "comment": "I only had one chance to play this game, and I very much enjoyed it, though I performed pretty poorly. This is one of those games that you can really get into and that you must play many times to discover all it can offer. I would gladly have more chances to play this and keep learning. The rating could definitely go up",
    "timestamp": 1719439200
  },
  {
    "username": "Pura_Vida",
    "rating": 6.0,
    "comment": "Classic Knizia: little rules and a lot of game. I don't like the chaos and the long endgame but I'll play along eventually.",
    "timestamp": 1711234800
  },
  {
    "username": "LloydGM",
    "rating": 6.0,
    "comment": "Hard to get new gamers into. Never have tonnes of fun playing it. But appreciate the game design.",
    "timestamp": 1710889200
  },
  {
    "username": "Euroman",
    "rating": 6.0,
    "comment": "Too much of a brain-burner for me. Very prone to analysis paralysis.",
    "timestamp": 1707692400
  },
  {
    "username": "Au79",
    "rating": 6.0,
    "comment": "Too abstract. Reminds of chess, etc.",
    "timestamp": 1707346800
  },
  {
    "username": "bainewedlock",
    "rating": 6.0,
    "comment": "Rating 6 = To someone with a similar taste like me: Try this game once if you get a chance.",
    "timestamp": 1703545200
  },
  {
    "username": "Spike1979",
    "rating": 5.5,
    "comment": "In versione digitale sull'iPad",
    "timestamp": 1702076400
  },
  {
    "username": "Orion4242",
    "rating": 6.0,
    "comment": "50",
    "timestamp": 1700521200
  },
  {
    "username": "adi_venturer",
    "rating": 6.0,
    "comment": "This game is trying to be too many things at once. I feel like they should have done more play testing before publishing this game. The game is supposed to be area control, but your VPs are hidden, so you're just collecting as many cubes as you can and hoping for the best, like a Euro. Very confusing design choices overall\n\n(Plays: 1)",
    "timestamp": 1696370400
  },
  {
    "username": "TeamAbsolute",
    "rating": 6.0,
    "comment": "Knizia’s heaviest (I think) game, so it’s no surprise that it’s his highest ranked and rated here on BGG. But it’s not for me - l like many of Knizia’s games because they’re sharp, streamlined and intuitive, providing intriguing interaction and gameplay from clear and simple rules. This isn’t one of those games.",
    "timestamp": 1696111200
  },
  {
    "username": "Tygrone",
    "rating": 6.0,
    "comment": "Played this one time, a long long time ago. I remember it being a fun game at that time, but rather on the heavy & long side of the games we usually played;",
    "timestamp": 1695074400
  },
  {
    "username": "lushchords",
    "rating": 6.0,
    "comment": "A classic multiplayer abstract game, but it's a quite outdated now and its successors have taken its place for me.",
    "timestamp": 1694815200
  },
  {
    "username": "Bertuccia",
    "rating": 6.0,
    "comment": "A game from more than 25 years ago, which has aged very well. It is simple in the rules, but deep in the strategy. Unfortunately, the very dynamic map and drawing randomness, in addition to absence of catch up mechanisms, makes it a mediocre game for today's standards.",
    "timestamp": 1694296800
  },
  {
    "username": "game_boy",
    "rating": 7.0,
    "comment": "2-4: Playing this game is like listening to the 1812 Overture - a very special event that can't be repeated too often or it loses its specialness.\n\nSold to frn8.",
    "timestamp": 1760652000
  },
  {
    "username": "pibastro28",
    "rating": 7.0,
    "comment": "Astratto da fare ribrezzo.",
    "timestamp": 1760047200
  },
  {
    "username": "gianlucadario87",
    "rating": 7.0,
    "comment": "B_C6",
    "timestamp": 1758751200
  },
  {
    "username": "InterestingTimesGang",
    "rating": 7.0,
    "comment": "What a great game, the tension of creating civilizations at the cost of destroying others is palatable. Like a true Knizia game it is greatly balanced. The game suffers from a high skill ceiling so get ready to be steamrolled or be quarterbacked by other players if you are the only new player. Although new versions of this exists it truly is a shame this version is till not in print, do yourself a favor and order it in Germany or France since the game requires no in-game reading.",
    "timestamp": 1756418400
  },
  {
    "username": "rfeldster",
    "rating": 7.0,
    "comment": "Learning the game isn't too bad, but the strategies might take a while to fully grasp. Lots of potential... I just hope that I can get my family to play it. Also, the game is a bit of a brain burner.\n\nUpdate: after 13 years, I unfortunately wasn’t able to get this game back to the table. Traded for Nemesis as part of U.S. math trade on 8/16/25.",
    "timestamp": 1755640800
  },
  {
    "username": "Vorbis",
    "rating": 7.0,
    "comment": "Used to be \"the game\". Now I wish there was an updated version of it, with a bit faster gameplay.",
    "timestamp": 1755381600
  },
  {
    "username": "ditterio",
    "rating": 7.0,
    "comment": "Solo: https://boardgamegeek.com/thread/1804268/gilgamesh-solo-vari...",
    "timestamp": 1755208800
  },
  {
    "username": "Jestertrek",
    "rating": 7.0,
    "comment": "I played this after backing Huang, and that is the better game in virtually every aspect: it's prettier, tighter, has more interesting rules and more interesting conflicts, and is an easier teach. Still, this one has its charms and I will play it. In both games, I love the fact that conflicts are very localized and once they're over, the loser -- rather than taking offense -- just goes off to get some other color of VP somewhere else having usually already farmed what they wanted. This rating is for the FFG version. Other versions are substantially uglier.",
    "timestamp": 1755122400
  },
  {
    "username": "sykano",
    "rating": 7.4,
    "comment": "abstract classic with Mesopotamian theme from Reiner Knizia\nunusual and elegant design\nnice theme, although abstract game\nthinky\nhard to play ?\n\nREPRINT NEEDED (FFG version)",
    "timestamp": 1754344800
  },
  {
    "username": "BeloW06",
    "rating": 7.0,
    "comment": "Highly group dependent, tense area control game that leaves you at the tip of your toes all the time, if you find the right group.\n\nLuck of the draw can be harsh when you keep losing battles and/or leadership contests and can't bring your leaders back into good positions, which soured many in my group to not want to play again. The wide open play area is also something that many struggle with to make sense of where to invest and where to contest. This leaves T&E at the uncontested top spot of games with the most inconsistent game experiences.\n\nSome sessions are an absolute joy, with different players approaching point acquisitions quite differently, sometimes with more than 5 monuments being build, other times with constant fights. However, other sessions left players hating it so much that it ruined the fun of game night for everyone at the table (and it's not because they don't like neg. interaction in games).",
    "timestamp": 1753653600
  },
  {
    "username": "Bryle",
    "rating": 6.5,
    "comment": "GROUP AVERAGE: 7.45 / 10\nBryle: 6.75\nDewey: 7.3\nFung: 7.5\nSixtus: 8.25",
    "timestamp": 1753480800
  },
  {
    "username": "charmed_0215",
    "rating": 7.0,
    "comment": "Purchased November 2024",
    "timestamp": 1753480800
  },
  {
    "username": "Katabrok",
    "rating": 7.0,
    "comment": "Played on iOS in 2013 and then played the physical version in 2025. The game is good, strategic, but with too many details to remember. The first play is really a \"learning\" experience, at least for the first rounds and interactions. The randomness of the draw can be annoying at sometimes.",
    "timestamp": 1751666400
  },
  {
    "username": "bbkoene",
    "rating": 7.0,
    "comment": "To be a topgame it's just too abstract. Indeed it isn't a bad game, and I will play some more times, but not time after time. I didn't play this game for over more than 20 years because I start recording my games in 2006. And it is one of the most complex games I know. Not because of the difficult rulebook, but because of the way how to find the right strategy. And I didn't find it yet.",
    "timestamp": 1749247200
  },
  {
    "username": "Zephyr_Falcon",
    "rating": 7.0,
    "comment": "7",
    "timestamp": 1749160800
  },
  {
    "username": "Ryucoo",
    "rating": 7.0,
    "comment": "I’m downgrading this to a 5 as recent plays just have not matched the fun and enjoyment of its redesign Yellow & Yangtze, which just feels cleaner, more intuitive and more interesting. Y&Y’s hex board provides more variability for leader strength and gets to the heart of temple construction quicker. Having wars decided only by solider tiles just makes things so much more streamlined and the differentiation between tile colours is more prominent, making choices more meaningful as one plays colours not just for the score but for the powers they provide. T&E will live on in the hearts of the purists - and for good reason - but sometimes classics are redone in the right way and this case is such an example. Though maybe that’s slightly undeserved praise considering I play Y&Y with my variant Pagoda rules, but I don’t think I will play T&E again - it just felt too unintelligible by comparison.",
    "timestamp": 1748988000
  },
  {
    "username": "netfilterz",
    "rating": 7.9,
    "comment": "Waw... I'm deeply impressed with this game. Of all of Knizia's games I have played so far this is the best, and IMO very deservedly in the top 3 here on BBG (bit of a dated comment, but it's still a great game). Forget the (anti)snobbery, and try to at least play this game once. It had me hooked from the go. Great for 2 as well, regardless of what it says on the side of the Mayfair Edition box, where it incorrectly states it as a game for 3-4 players.",
    "timestamp": 1761049860
  },
  {
    "username": "globetrotter",
    "rating": 8.0,
    "comment": "One of my favourites and my friends love it too.\nToo abstract for later taste...",
    "timestamp": 1760911200
  },
  {
    "username": "whitecatplays",
    "rating": 8.0,
    "comment": "I heard someone say it’s both easier and harder than you can imagine. And yes.",
    "timestamp": 1760738400
  },
  {
    "username": "StupidRatCreature",
    "rating": 8.0,
    "comment": "",
    "timestamp": 1760565600
  },
  {
    "username": "igor_f",
    "rating": 8.0,
    "comment": "2-4",
    "timestamp": 1760220000
  },
  {
    "username": "jellyfishjoe",
    "rating": 8.0,
    "comment": "played online",
    "timestamp": 1758751200
  },
  {
    "username": "Astronica",
    "rating": 8.0,
    "comment": "A very good game, it's quite unique and will need a couple of plays to figure it out. But the strategic decisions and opportunities are plentiful and is very interactive. I would really like to try the newer versions as well.",
    "timestamp": 1758578400
  },
  {
    "username": "LittleDuke",
    "rating": 8.0,
    "comment": "Wonderful strategy game that is actually *good* with more than two players! Lots of unique ideas that interact well.",
    "timestamp": 1758492000
  },
  {
    "username": "TheSlushySnake",
    "rating": 8.0,
    "comment": "Mesopotamian-Themed, Tile-Laying Game.\n2-4 Players. (Best With 4 Players).",
    "timestamp": 1758146400
  },
  {
    "username": "Beast_of_Leisure",
    "rating": 8.0,
    "comment": "Played it once. Loved it. Haven't touched it since because every time I bring it along and put it forward people start squirming uncomfortably, seriously people what is wrong with you!?\n\n< UKGE 2018\n> September 2025",
    "timestamp": 1757887200
  },
  {
    "username": "enavico",
    "rating": 7.5,
    "comment": "+ Well conceived old school mechanics, a tactical classic game\n+ Strong interaction\n+ Hidden score reduces the “bash the leader” problem\n+ The game that invented highest-lowest scoring\n+ Elegant ruleset\n\n- High luck-dependance with the tiles’ draw\n- Ziggurat theme? Where? Really?\n- First player advantage",
    "timestamp": 1757800800
  },
  {
    "username": "Krautkopf",
    "rating": 8.0,
    "comment": "2-4[2-4;4]PDF",
    "timestamp": 1757628000
  },
  {
    "username": "Nodens",
    "rating": 8.0,
    "comment": "The Great Wall of Knizia. No matter how much I play it, I really should play it more.",
    "timestamp": 1757282400
  },
  {
    "username": "Juxtatype",
    "rating": 8.0,
    "comment": "There is genius in this game and I just haven't played enough to see it all.\n\nThe game is dry, but doesn't that fit with its location? It's Knizia, so you're not going to get drenched in theme. This game benefits from repeated plays, as understanding its intricacies is key to doing well.",
    "timestamp": 1756245600
  },
  {
    "username": "Termino476",
    "rating": 8.0,
    "comment": "En lo de Azul",
    "timestamp": 1756072800
  },
  {
    "username": "CKaefe",
    "rating": 8.1,
    "comment": "There’s a certain level of unease—complete with wide-eyed surprise and a hint of terror—when someone mentions “take-that” mechanics or direct conflict between players. This reaction likely stems from the fact that many people prefer positive interactions over aggressive stances toward others. Yet, beneath this apprehension lies a benefit: players are incentivized to stay on guard or even adopt a more proactive approach. *Tigris & Euphrates*, for instance, is an intricate puzzle where every move demands careful calculation. While it could arguably be streamlined in parts (conflicts are divided into internal and external types), it’s not a game for those prone to analysis paralysis, nor is it suitable for every mood. Still, it offers a deeply rewarding—if occasionally frustrating—experience, much like life itself.",
    "timestamp": 1755381600
  },
  {
    "username": "thorbot",
    "rating": 8.5,
    "comment": "Solidly engaging tile laying game with lots of depth, does not play well with groups who avoid combat. Hailed by many as \"the best game of all time\" and a \"masterpiece\" but I don't see it as such. While it is excellent, there are many other games with more solid themes and gameplay that I prefer to this one. Still, worth owning.",
    "timestamp": 1760911200
  },
  {
    "username": "ExcellentRaven",
    "rating": 9.0,
    "comment": "best multi-player abstract I've found. Stands the test of time. 4p only. beautiful complex interactions. a true classic, a gem of a boardgame. In the hall of fame.",
    "timestamp": 1760911200
  },
  {
    "username": "bighippo",
    "rating": 9.0,
    "comment": "This game has a lot of thinking of pre-planning on it. Been hitting the APP and BGA on a monthly basis to get plays in. Remains in my top 10 favorite games and staple of my collection (Though I really only play on BGA these days. This rarely hits the table as it's not my groups jam)",
    "timestamp": 1760652000
  },
  {
    "username": "muuntautuja",
    "rating": 9.0,
    "comment": "A classic for a reason.",
    "timestamp": 1760392800
  },
  {
    "username": "fragia",
    "rating": 8.5,
    "comment": "Paride",
    "timestamp": 1759528800
  },
  {
    "username": "wangwei726",
    "rating": 8.5,
    "comment": "最佳4人",
    "timestamp": 1759442400
  },
  {
    "username": "MorelliBuendia",
    "rating": 8.5,
    "comment": "A great classic euro. Confrontational, swingy, and so much fun.\n\nMogul Scale: 3/D. The internal vs external conflict rules push this one up to a 3 instead of a 2. The catastrophe tiles, knowing when to discard, the possibility of getting rid of tiles that you don't want either through discard of by sending more than you need in battles, being able to rush the end-game by discarding tiles or going for treasures, the possibility to cause conflicts between other players... so many subtleties make this a solid D when it comes to strategic depth.",
    "timestamp": 1759442400
  },
  {
    "username": "Ddyraw",
    "rating": 9.0,
    "comment": "Classic, Perfect, one of the all time GOATs.\n\nNeeds another play for a 10",
    "timestamp": 1759356000
  },
  {
    "username": "themisterbutton",
    "rating": 9.0,
    "comment": "El mejor juego de Knizia. Un verdadero juegazo. Me encantan estos juegos de mecánicas sencillas, elegantes, gran profundidad y mucha interacción. En mi top 5.",
    "timestamp": 1759183200
  },
  {
    "username": "bigbarge50",
    "rating": 9.0,
    "comment": "This is a classic for a reason. The game is tight, and every decision really matters. The only complaint is that the game is so unforgiving, and if you mess up early, there is really no coming back. It really snowballs once things start going poorly for you.",
    "timestamp": 1758751200
  },
  {
    "username": "Michiel Bertens",
    "rating": 8.6,
    "comment": "X",
    "timestamp": 1757368800
  },
  {
    "username": "IsolatedPawn",
    "rating": 9.0,
    "comment": "This has a timeless feel to it, almost as if it could’ve been born from the era it depicts. There’s also an epic sense to what’s happening on the board, which unfolds in ways that are fascinating and impossible to predict, telling a story in the process. Every turn is interesting, and things can quickly shift between feeling like you have a little time to advance your long term strategy, and being forced to address an immediate issue. Like other highly interactive games, this is best played between players of equal ability, but it’s especially true here because of how much the game can change from a single conflict, which may have originated from a single tile lay, or lack thereof. The game becomes less opaque with experience, but definitely reaches a plateau, where true understanding remains over the horizon.",
    "timestamp": 1757196000
  },
  {
    "username": "TVParty",
    "rating": 9.0,
    "comment": "A classic. I’ve not even dug that far into the strategic depth of the game but you can see there is a lot to learn regarding when to commit or retreat, or when the odds might favor a little aggression. Main downside is it is pretty easy to miss something and hurt your game quite a bit, but it is generally a pretty quick moving game. I love the ability to accelerate the game end when it makes sense.",
    "timestamp": 1757109600
  },
  {
    "username": "donotadjust",
    "rating": 8.8,
    "comment": "Absolute masterpiece. Can be a little too chaotic for some but I really enjoy this aspect. I guess that is why they made Y&Y/Huang.",
    "timestamp": 1756936800
  },
  {
    "username": "timori",
    "rating": 9.0,
    "comment": "My only gripe is waiting for my turn again. Not because there's a lot of downtime between turns, but because the game is so great that I need to keep playing it.\n\nFor such an abstract game, it really creates a significant amount of drama, tantamount to the big reveal of a traitor in a social deduction game. In a game of Tigris & Euphrates, great things can happen to you, and terrible terrible things can happen to you as well. It'll leave you with games that you want to tell stories about.",
    "timestamp": 1755554400
  },
  {
    "username": "carnodingo",
    "rating": 8.8,
    "comment": "Stratégique\n\nItem de collection\nAu que WOW!\nQuand le déclic c'est fait, tous les joueurs on compris l'ampleur du design. C'est vraiment bon. J'adore créé des conflit qui ne me touche même pas.\nC'est vraiment un classique et un chef-d'oeuvre ce jeu.\nà rejouer rapidement!\n\nDéveloppement de cité le long de l’Euphrates (fleuve), nous incarnons des Leader qui tentent de faire avancer la civilisation sur les 4 fronts simultané :Religieux, agriculture, marché et politique. Tout est rendu sur un ton abstrait qui crée un jeu très compétitif et bien balancé. Il y a 4 type de points dans la partie mais ton score final est celui dont tu en as le moins.\n\nType: Eurotrash\n\nCatégorie: Medium\n\nThème: Civilisation\n\nMécaniques: Positionnement, conflit.\n\nSimilaire dans ma collection: ?\n\nTaille de la boite: Standard carré",
    "timestamp": 1755122400
  },
  {
    "username": "wooloo1",
    "rating": 10.0,
    "comment": "T&E is my Platonic ideal of a board game. The play is with the other players, not the game itself. No min-maxing. No workers to place. Seasoned with a splash of hidden information and a dash of luck, the game is not the dry abstract you might have been led to believe. The theme - rise and fall of kingdoms - comes through with time.\n\nAlmost exclusively played online.",
    "timestamp": 1760824800
  },
  {
    "username": "NOOCX",
    "rating": 10.0,
    "comment": "I've got rather late to this classic and Knizia games in general (I've missed many of them out in the 90s). Then however T&E jumped up into my very top games immediately. I've learned the game via the app, which - despite its mediocrity - managed to get me enthusiastic. The real experience is even more fantastic.\n\nA shame that in my gaming groups T&E's popularity is low, because they prefer to have more theme in their strategy games, more simplicity in their abstract games, more balance in their random tile draws.\n\nThere is luck in tile draws, an ongoing lack of red tiles will only get you that far. Imo the game is less elegant than some Knizia fans claim it to be (in fact I perceive learning and to some degree also playing the game as somewhat unintuitive). But it's also way more thematic than some non-Knizia fans give it credit to. What I love about the game is that T&E tells stories. It's a dynamic ebb and flow of kingdoms and conflicts. Plays are packed with a mixture of strategy, tactics and board changing drama. Things have impact and you can feel that impact.\n\nA stellar game for me, which competes with the more accessible Samurai for the title of my favorite Knizia game.",
    "timestamp": 1760824800
  },
  {
    "username": "unjugon",
    "rating": 9.5,
    "comment": "Wow, feels like a masterclass of game design even on my first play and not fully understanding all the dependencies..",
    "timestamp": 1760565600
  },
  {
    "username": "tommynomad",
    "rating": 10.0,
    "comment": "I find it very difficult to imagine a situation where I will not want to play this gem. Delicious, vicious euro, with a *tiny* bit of luck thrown in for thrills.",
    "timestamp": 1760306400
  },
  {
    "username": "mellow300",
    "rating": 9.8,
    "comment": "LB3-2",
    "timestamp": 1760306400
  },
  {
    "username": "greenlotus284",
    "rating": 9.5,
    "comment": "なんもわからんがクニツィアさんの凄さだけはわかる。",
    "timestamp": 1759442400
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "Not so much a civilization simulation, but more like an abstract representation of a civilization interaction. Fabulous and evocative. I love watching kingdoms rise against each other, and crash and scatter like ocean waves.",
    "timestamp": 1759356000
  },
  {
    "username": "elqueaprende",
    "rating": 9.7,
    "comment": "--------------------------------------\nA unique and unrepeatable game...",
    "timestamp": 1759356000
  },
  {
    "username": "AlPacino11",
    "rating": 9.7,
    "comment": "Knizia's masterpiece! Excellent, deep, interactive, subversive!",
    "timestamp": 1759269600
  },
  {
    "username": "btasam",
    "rating": 9.5,
    "comment": "This game has a certain je ne sais quoi.",
    "timestamp": 1759183200
  },
  {
    "username": "AndiHOhneYpsilon",
    "rating": 9.5,
    "comment": "Best Knizia game in my opinion, though it's a bit to quiet with only 2 players. Think it begins to shine with 3 or 4.",
    "timestamp": 1759010400
  },
  {
    "username": "porcine",
    "rating": 10.0,
    "comment": "Knízia legjobbja. Tökéletes játék mind a mai napig.",
    "timestamp": 1758751200
  },
  {
    "username": "Zorlk",
    "rating": 10.0,
    "comment": "It's an abstracted macro view of civilization's dawn, a very organic and strangely thematic game.\n\nI love the game at all players count, but with two it requires experienced and very aggressive players.\n\nIt's hard to put into words what attracts and fascinates me about this game.\nThe butterfly effect ? Every tile placed on the board potentially resonates for eternity (until the end of the game!), every move is therefore fraught with consequences, and what seemed like just a small green tile placed at the beginning of the game could end up winning the big war at the end.\nThe tension between building eternal monuments and exposing myself to war? Delving into the desert in search of forgotten treasures, but taking the risk of a catastrophe that would easily split the kingdom in two? Where should I place my leaders... Do I try to isolate myself or do I join different kingdoms? Foment a revolt? Prepare for a war whose outcome is more than uncertain? How can I turn the tide in my favor... and achieve the impossible with the tiles granted to me by the ancient Mesopotamian gods?\n\nThe famous final scoring seals the deal; this game is the special one for me.",
    "timestamp": 1758664800
  },
  {
    "username": "YezOz",
    "rating": 10.0,
    "comment": "Finally played again after having played it years ago and it blew my mind. It's a simple game with a very open beginning and if you don't play it often, knowing what to do in the early stages is not immediate. After you fully understand how every rule works (which there aren't that many of tbh) it's such a beautiful thought provoking experience. It's a one of a kind design and it really moved me quite deeply. It amazes me to know that something soo beautiful came out of a human mind. I can't wait to play it more and more so I can understand the layers of depth hidden within it!",
    "timestamp": 1757800800
  },
  {
    "username": "latschediwes",
    "rating": 10.0,
    "comment": "It's what I call an elegant game - Everything is tied to area influence and points. There is very little strategic aspect but a lot of going with your gut feeling. It I especially like openness, the intuitive and bewildering gameplay as well as the hidden information. Players are taking risks and picking conflicts. Ther are incentives for peaceful expansion, alliances and aggression. The way how conflict arises and kingdoms ebb and flow makes for a surprising dynamic game. It may appear dry at first glance, but has a strong conceptual core and much is emerging from play.\n\nIn this video Dr. Rainer Knizia talks about the design and thematic considerations. I would not consider myself the biggest fan of Knizia games, but his design ethos gives me a very good feeling personally.\n\nOn the FFG version: The components are great, as is expected. Points are cardboard chits instead of wooden cubes. Leaders and monuments are made of plastic and they lose their iconic look and feel. Compared to the 1st edition (Hans im Glück) and 2nd edition (Pegasus) FFG provides a nice balance of playability, variability and is graphically effective.",
    "timestamp": 1757714400
  },
  {
    "username": "sculley",
    "rating": 10.0,
    "comment": "Such a great game. A classic.",
    "timestamp": 1757628000
  }
]