[
  {
    "username": "Clockpunk",
    "rating": 1.0,
    "comment": "Just... no. Poor effort all round.",
    "timestamp": 1455058800
  },
  {
    "username": "marshalljansen",
    "rating": 1.0,
    "comment": "Devil Bunny needs a better game mechanic. The game presented with the awesome flavor text is not worthy.",
    "timestamp": 1306360800
  },
  {
    "username": "cadavaca",
    "rating": 2.0,
    "comment": "This is a roll-and-move game with a non sequitir of a theme. Chutes and Ladders is more fun, because at least the before-and-after cartoons are entertaining.",
    "timestamp": 1388185200
  },
  {
    "username": "Ronkkone",
    "rating": 2.0,
    "comment": "http://www.ronkkonen.com/boardgames.html#DBneedsham",
    "timestamp": 1157493600
  },
  {
    "username": "tomgazpacho",
    "rating": 3.0,
    "comment": "Silly fun and cheap.",
    "timestamp": 1534456800
  },
  {
    "username": "khmatthe3",
    "rating": 3.0,
    "comment": "Its a cheap game!",
    "timestamp": 1417388400
  },
  {
    "username": "Unitoch",
    "rating": 4.0,
    "comment": "Decent for its type. There are decisions to be made, but it's still much more random than I really enjoy. As with most Cheapass games, the theme is wonderful. I'm not quite on board with the philosophy that games don't need engaging bits, so the components are adrawback, and the game isn't deep enough to hold me, but it's alright.",
    "timestamp": 1582239600
  },
  {
    "username": "Dragoons_Kane",
    "rating": 4.0,
    "comment": "Cheapass games. Crazy theme which might bring a few laughters, but really not good.",
    "timestamp": 1578438000
  },
  {
    "username": "mi_de",
    "rating": 4.7,
    "comment": "Easy and fast to play. Excellently silly theme. A bit of game for such a tiny package.\n\n10/21: 18 years between plays, this time with my son and wife. Audrey won the top two spots, and the death of Oskar’s last sous chef doomed him to second and me a distant third at best. Brainless game, but does not overstay, and it has a humerous theme.\n\n8/24: A fun round with Audrey wiping us out, Stefan second and me a distant third, although we all got three up.",
    "timestamp": 1725055200
  },
  {
    "username": "nycavri",
    "rating": 5.0,
    "comment": "Cute and claustrophobic. Silly fun. Own both the original paper envelope edition, and the new GTG version.",
    "timestamp": 1670367600
  },
  {
    "username": "jeffwolfe",
    "rating": 5.0,
    "comment": "14 years after my first play, I'm finally adding a comment after the second play. Go up, get knocked back, go up, get knocked back. Eventually someone gets lucky and gets out. There are ways to play poorly, but I'm not sure there are ways to play well.",
    "timestamp": 1529013600
  },
  {
    "username": "Shane Sather",
    "rating": 5.0,
    "comment": "sell",
    "timestamp": 1486162800
  },
  {
    "username": "Legomancer",
    "rating": 5.5,
    "comment": "Played a long while back and don't really remember. Included for completeness.",
    "timestamp": 1759183200
  },
  {
    "username": "glutealgeometry",
    "rating": 6.0,
    "comment": "Weeeird little print&play from back when CheapAss was a minimal mail-order biz in a garage. The scoring is maybe kinda imbalanced but the gameplay is actually kinda fun.",
    "timestamp": 1720130400
  },
  {
    "username": "The Great Sun Jester",
    "rating": 6.0,
    "comment": "1990s purchase",
    "timestamp": 1705791600
  },
  {
    "username": "Blix",
    "rating": 6.0,
    "comment": "Fun simple game.",
    "timestamp": 1623621600
  },
  {
    "username": "TheGameCzar",
    "rating": 7.0,
    "comment": "I have an original signed envelope.",
    "timestamp": 1753653600
  },
  {
    "username": "raiderfan",
    "rating": 7.0,
    "comment": "Quick easy game to fill time.",
    "timestamp": 1749592800
  },
  {
    "username": "nerman8r",
    "rating": 7.5,
    "comment": "2+ players. 30 minutes. I am surprised at how popular this simple little game is with some of my friends. It's a press your luck that sometimes gets people shouting, especially if they've had a drink. Walter`s a big fan.",
    "timestamp": 1574377200
  },
  {
    "username": "strider72",
    "rating": 8.0,
    "comment": "This is a surprisingly good game. If I knew woodworking I would make myself a nice wood set.",
    "timestamp": 1413064800
  },
  {
    "username": "periwinklemoose",
    "rating": 9.0,
    "comment": "Silly game, but a lot of fun!",
    "timestamp": 1416438000
  },
  {
    "username": "maskedllama",
    "rating": 9.0,
    "comment": "Hilarious premise that sets the tone of the game. Its quick, and isn't to be taken seriously. This game is a short filler game to play while waiting for everyone to show up for Arkham Horror.",
    "timestamp": 1289257200
  },
  {
    "username": "Cfranz",
    "rating": 10.0,
    "comment": "Best Game Ever! Best couple of bucks I ever spent. Wasted many hours playing this in the office when I should have been grading papers or reading journals. I'm afraid of Wesley Snipes.",
    "timestamp": 1090274400
  },
  {
    "username": "chrisakavern",
    "rating": 10.0,
    "comment": "Beware of the Line of Death!!!",
    "timestamp": 1042671600
  }
]