[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "A shitty remake of Acquire that came out 30 years later but is 1/30th as good. The one-dimensional board kinda goes nowhere, because it means it's extremely easy for someone to block a merger. It's impossible to move around! But also it means MORE BUSYWORK because you have to count vertical towers for value. Guhhh, they took out the drama for calculations? Sounds just like a modern euro. The game devolves into everyone just piling up these frozen companies after the stock is gone, and it kinda goes nowhere. Eventually there's nothing to DO except predictably buy the same card.\n\nAll the weird things in Acquire that I always wondered about, now they make sense after playing this terrible clone. Like the freeze on mergers after a certain point, Big Boss doesn't have that and it just results in giants gobbling up other giants. But even basic things like the 2D board, it's like some terrible euro designer decided that was too much, so we just need a LINE. After a while you run out of companies (they can't be restarted here) so everyone has unplayable cards until they slowly reach the numbers in hand. And also the values go up linearly, the majority shareholder doesn't matter, everything is just GO UP BY ONE. Just in case you're playing with idiots who can't handle math more advanced than that.",
    "timestamp": 1755900000
  },
  {
    "username": "benshever",
    "rating": 2.0,
    "comment": "Wow I hated this. Very boring, though I don't typically enjoy stock games.",
    "timestamp": 1693692000
  },
  {
    "username": "Fernegul",
    "rating": 3.0,
    "comment": "If your kids aren't bright enough to play acquire, I guess.",
    "timestamp": 1755900000
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 4.0,
    "comment": "Just play Aquire.",
    "timestamp": 1759701600
  },
  {
    "username": "yiechow",
    "rating": 5.0,
    "comment": "This is similar to Acquire, a slice different, so I wonder why these two both got published back in years. And this is NOT a negotiation game like I am the BOSS or Chinatown, I insist every improvise changes should under the original rule book not beyond that.",
    "timestamp": 1757196000
  },
  {
    "username": "jcoopersd",
    "rating": 5.0,
    "comment": "I really don't know what to think of this one. So much of the game seems to be waiting for people to play certain cards so you can play yours. Seems like you very straightforwardly want to have stocks in companies that are about to eat another company, while expanding the biggest companies? Lots of waiting for other people to play cards before you play yours, not much change turn to turn. It ran so long and felt more degenerate as it went on. Idk, I was hoping this would be the more strategic version of Acquire without being as convoluted as Stephenson's Rocket, but it ends up being worse than either I think.",
    "timestamp": 1744927200
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "This was pitched to me as an Acquire variant. I've also had Tigris & Euphrates and Stephenson's Rocket pitched to me in the same way, but Big Boss is probably the one that fills the brief the best. It's a game about buys shares and forcing mergers, which is very much the description of Acquire. However, instead of playing on the wide open grid of Acquire, Big Boss drops a spatial dimension and sequesters itself to a single loop. Possibly as a consequence, the mergers feel less dramatic and are focused less on how to keeping surviving shares. On the other hand, the loop felt like it flattened the luck of the draw versus the grid, especially with the second dimension reintroduced as building height and the added flexibility with building up. It might be a wash which I prefer between the two games, but in a tie, I'd give it to Acquire, with its more pithy rules. Plus, getting there first is worth something.",
    "timestamp": 1759269600
  },
  {
    "username": "qwertymartin",
    "rating": 6.0,
    "comment": "Played with the new edition but original rules, since the new ones sound dumb. Unfortunately that led to me missing a couple of things flicking back and forth between the main rules and the exceptions, but I don't think they affected the game too badly. Hmm... not sure about this one. It's really close to just being one-dimensional Acquire (a line rather than a grid) which radically reduces the possibilities for mergers. And it also lacks Acquire's options for trading shares and re-founding companies. That meant we grabbed cheap shares until they were all gone (before any mergers had happened), and then it seemed like a lot came down to which cards we happened to draw blindly from the deck. One thing it does 'fix' from Acquire is that you earn money outside of mergers so no one gets frozen out in the midgame. But that also makes investment choices less important since you can make a lot of money by just adding tiles to big companies. The production is nice and I'd play again, but I'd be interested to hear from anyone who can tell me what it does better than Acquire.",
    "timestamp": 1754604000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "Turns are swift, developments on the board chug right along. Players have to keep an eye on when the game will end, but need to simultaneously do a few different things.\n\nReminder to self: use the variant where you put up a display of 6-8 cards for purchase. Also, companies that are at 50, still give a 50 payout for additions.\n\nKeep",
    "timestamp": 1757541600
  },
  {
    "username": "realpikkio",
    "rating": 8.0,
    "comment": "this is the game you actually wanted to play whenever you played Monopoly. \nAnd even if it's old, it aged very well!\nThe rules are simple but the decisions are always crunchy, and the gameplay is full of surprises.",
    "timestamp": 1759788000
  },
  {
    "username": "Wilczixx",
    "rating": 9.0,
    "comment": "Great!!!",
    "timestamp": 1742079600
  },
  {
    "username": "JamesT",
    "rating": 10.0,
    "comment": "Kramer's homage to Acquire may be better than the original. Unfortunately this game in incredibly rare and sought-after. Holy-moly thank you Funko Games for bringing back this gem!!\n\nPlay by the old rules in the back of the rulebook.",
    "timestamp": 1748728800
  }
]