[
  {
    "username": "cymric",
    "rating": 1.0,
    "comment": "No. Just no. I'm not interested in running a human Markov chain analysis, let alone that it can be called a 'game'.",
    "timestamp": 1445032800
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1632780000
  },
  {
    "username": "BGGJeffBergziege",
    "rating": 3.0,
    "comment": "Damals fanden wir die Comicgrafik echt gut und witzig.\nLetztens nochmal ausgepackt, und es gefiel uns überhaupt nicht mehr. Kam weg.\nWir haben es auch wenig gespielt.",
    "timestamp": 1608505200
  },
  {
    "username": "bigfranco",
    "rating": 4.0,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "lebryant",
    "rating": 5.0,
    "comment": "A classic bicycle racing game. In essence, it is a roll and move game, but the addition of terrains and movement cards (haven't played with event cards) makes it worthwhile to bring it to the table from time to time. I would only suggest playing a short race and treat it as a light gateway/filler game - it is too dependent on a die roll for the longer races to be enjoyable.\n\n---\nlebryant's TOP games of all time\n---\n[2022]: 168/294 (top 57%) | Rating - 5 | Overall Plays - 1\n[2021]: 162/288 (top 56%) | Rating - 5 | Overall Plays - 1\n[2019]: 148/256 (top 58%) | Rating - 5 | Overall Plays - 1",
    "timestamp": 1672786800
  },
  {
    "username": "samoan_jo",
    "rating": 5.0,
    "comment": "(6)-",
    "timestamp": 1671750000
  },
  {
    "username": "DocCool",
    "rating": 6.0,
    "comment": "I hadn't played this since last millenium, and had some positive memories about it, so I brought it to the table again after more than 25 years. But it seems my taste for games has changed (or, as I like to tell myself, has been upgraded :-), since the two games we played were likely the last ones for me.\n\nIt's all in the dices, and a single 4 or 5 (or a 7 with a crash or stopping event) can completely turn the game against you. I've clearly grown above dice-rolling games of the type \"roll high and win, roll low and lose\".",
    "timestamp": 1750197600
  },
  {
    "username": "Bajord",
    "rating": 6.0,
    "comment": "Spiel Nominee",
    "timestamp": 1738278000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "Um Reifenbreite is best for exactly 4 players. We do not use the event cards, and use a variant rule for how to determine a fall. I especially like the team management aspect of this game. Ultimately this is a game about rolling high numbers, so strategists will dismiss this game. But if you love racing, this game offers positional play, team management, and resource management (with the energy cards). Recommended!\n\nKeep",
    "timestamp": 1757628000
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "Solo: https://boardgamegeek.com/filepage/51327/pro-rules-solo-stag...",
    "timestamp": 1759960800
  },
  {
    "username": "tishdar",
    "rating": 8.5,
    "comment": "First Play was, iirc, BGG Con 2019. Second play 5 years later. i'll leave it at 8.5! we played the simple game, played it WRONG a little bit, but it still shines. why is this not reprinted or reworked??? Thanks to H for this one! if you like Ave Caesar, you should like this one more.",
    "timestamp": 1758751200
  },
  {
    "username": "trodat123",
    "rating": 10.0,
    "comment": "this is an incredible racing game. It simulates a bicycle race pretty accurate with simple rules. Like how you feel like you manage all of your cyclists separately and the race itself really feels like a stage of a grand tour or something like this.\nThroughout the game there will be packs of cyclists racing like their own race or again finding their way to make up a gap and joining the leader group, it is simply fantastic, I love this game somehow!\n\nand it gets better each time",
    "timestamp": 1662242400
  }
]