[
  {
    "username": "Francewhoa",
    "rating": 1.0,
    "comment": "Good:\n• I enjoyed the company of other players \n• Colors of the figurines are easy to tell apart\n• Strategy changes per epoch\n• Text on cards is clear\n\nBad:\n• The game does not allow any cooperation between players\n• The game is focused on one thing. War. Specifically invading other sovereign nations. Then use violence to steal their wealth. A much more accurate name for this game would be “Warmonger”, LOL  For those not familiar with the \"Warmonger\" term, it means someone who cause war.",
    "timestamp": 1546383600
  },
  {
    "username": "Hellbound",
    "rating": 1.0,
    "comment": "Ludo with a theme.",
    "timestamp": 1409781600
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "Sid Meier's \"Civ.\" is bad enough without AH trying to do it....",
    "timestamp": 1286661600
  },
  {
    "username": "Gregory Palmer",
    "rating": 1.1,
    "comment": "Excruciating. For the life of me I don't understand the affinity so many gamers and war-gamers have for this lame excuse for a game. The title belies the gameplay. Each new Epoch produces the (actual) historical empires out of thin air regardless of the effects of the previous epoch's dice driven overlapping massacres which successively leave the map looking nothing like the situation which would have given rise to the new epoch's civilisations. Beyond illogical all the way to insulting. Not a 1 because according to the rating guidelines I don't consider it broken, just a dreadful waste of time.",
    "timestamp": 1116367200
  },
  {
    "username": "gavken",
    "rating": 2.0,
    "comment": "Gone to a charity shop",
    "timestamp": 1596405600
  },
  {
    "username": "Kharn85",
    "rating": 2.0,
    "comment": "Plays: Multiple\n\nI really hate this game. It does make logical sense, it is too random, the player has little actual decisions to make. It is poorly themed, II could go on.",
    "timestamp": 1553036400
  },
  {
    "username": "DaveD",
    "rating": 2.0,
    "comment": "Interesting idea ruined by randomness and lack of continuity from turn to turn.\n\nɅV",
    "timestamp": 1525644000
  },
  {
    "username": "toy_brain",
    "rating": 2.0,
    "comment": "My one and (hopefully) only game of this involved 25 minutes of downtime between each of my turns, during which I had absolutely no decisions to make, or planning to do.\nGetting attacked? Just roll your dice. No, you don't get to try and retreat or anything, just roll the dice. No decisions there at all.\nWant to plan your next turn? Don't bother. The board is going to change so much in the meantime, by the time it is your turn you just have to make the best of the current situation.\n\nIt's an old game (by modern boardgame standards), we have much better now. I see no reason to ever go back to this.",
    "timestamp": 1461621600
  },
  {
    "username": "Samuel Vriezen",
    "rating": 3.0,
    "comment": "Could have been called History of the Totally Random Empires. I don't feel like stuff is happening for much of a reason here. Very thin, a fake epic. Not that it's terrible. Playing it is not the worst, but not playing it is not the worst either.",
    "timestamp": 1745186400
  },
  {
    "username": "Kiyote",
    "rating": 3.0,
    "comment": "Leisure Ways 1992",
    "timestamp": 1739919600
  },
  {
    "username": "OsideP",
    "rating": 3.0,
    "comment": "Am I the only person who is annoyed by the “four-player solitaire” aspect of this game? Yes, there is the interaction at the beginning of an epoch when you are selecting empires but that is a short respite between long turns where you wait around for your turn. Much better multiplayer games available now.",
    "timestamp": 1729288800
  },
  {
    "username": "pdowen3",
    "rating": 3.0,
    "comment": "Really enjoy this game - would like to try the bidding variant that Paul R. wrote and The General published shortly after the original came out, though Paul is reluctant to apply that variant to the new version. Rated lower lately because it just doesn't justify the game length.",
    "timestamp": 1717884000
  },
  {
    "username": "CortexBomb",
    "rating": 4.0,
    "comment": "A sort of ur-Euro take on Risk with added disaster cards, bloodier combat, and more balance potential because of changing control as your nations are regularly wiped off the board. You need to have at least 4 to make this interesting, with the problem being typical for this style of game: you need a lot of players, but each additional player increases the game length substantially. I can see the charm of the sprawling armies, and massive battles, but rarely have the urge to trot it out.\n\nAs others have said, this game (and others like it) simply play too long for what they are. The theme is nice, as is the presentation, but it is slightly boring to play and much too long for what it actually has to offer. Nexus Ops does this type of game better for my tastes, but I can understand why people like this one. I just wince at playing this type of game for as many hours as this one takes.",
    "timestamp": 1745877600
  },
  {
    "username": "fjordi",
    "rating": 4.0,
    "comment": "Funny to play from time to time and better than stuff like Britannia, besides being shorter.",
    "timestamp": 1701817200
  },
  {
    "username": "Pandorzecza",
    "rating": 4.0,
    "comment": "There are better ones",
    "timestamp": 1625781600
  },
  {
    "username": "HiTracey",
    "rating": 4.0,
    "comment": "A superbly conceived and beautifully executed game. So why the mean score? It is too long, with too much down time, and simply isn't ideal in its structure for me or the group of hardened wargamers I play with.\n\nComplexity - 3/10",
    "timestamp": 1574722800
  },
  {
    "username": "Weaks",
    "rating": 5.0,
    "comment": "Muy cansino. Esto es para jugar con gente mayor.",
    "timestamp": 1753567200
  },
  {
    "username": "menalios98",
    "rating": 5.0,
    "comment": "1993 Edition",
    "timestamp": 1719698400
  },
  {
    "username": "B_Moores",
    "rating": 5.0,
    "comment": "Its a poor version of small world with history layered on top.",
    "timestamp": 1706482800
  },
  {
    "username": "Prutser77",
    "rating": 5.0,
    "comment": "Leftover from the time when I bought games based on the art on the box. Sold it.",
    "timestamp": 1660687200
  },
  {
    "username": "Sky Knight X",
    "rating": 5.0,
    "comment": "I'm a sucker for historical civilization games where empires rampage over the land and later decline. This one is too disjointed for me. There really is no long term strategy. The strategy comes in empire selection. The rest is tactical play within each age.",
    "timestamp": 1638918000
  },
  {
    "username": "morteigan",
    "rating": 5.0,
    "comment": "This game gets old very fast, you do the exact same thing 7 turn in a row and for 3 to 4 hours. If you happen to be a little lucky and lead you'll never be knocked out if you use the basic rules, if not maybe not. This game is a random fest of dice chucking that is similar to risk but done better. No way to mitigate the dices, now way to use any strategy and a lot of frustration for unlucky players. I think that this game should always be played at 6 players.",
    "timestamp": 1638399600
  },
  {
    "username": "tawnos76",
    "rating": 5.0,
    "comment": "Great random Game. My first play through was very bad but I am very glad I gave this a second chance as I love it and the game was easy to learn and understand.\n\nIf you do not like total randomness then this is not a game for you as you have no control over where the next team will pop up at and you could be taking over your own areas right from the start.\n\nIt does have some strategy once you get going but each epic starts off with a random hand out.",
    "timestamp": 1622498400
  },
  {
    "username": "Vain_Melody",
    "rating": 5.0,
    "comment": "[one play] Played the newer Hasbro exition with 4 players. It was a little shorter and simpler than I expected, which is good. Unfortunately, there was a massive run away leader issue. Variants have been suggested to alleviate this but none were used in our game. As the owner of the game said, you rarely need to play Epoch VII to determine a winner. He was certainly right in our case.\n\nThe luck/randomness of the Empire draws also baffled me - why give players such limited control over the most critical aspect of the game? That would add complexity and length to the game thus reducing the accessibility of the game - but I think it would be more than worth it.",
    "timestamp": 1612134000
  },
  {
    "username": "adel9591",
    "rating": 6.0,
    "comment": "Sort of risk-y but I think there was though put into balance in this game. The dominance tokens offset the kingmaking. The empire strengths, initiatives, and starting areas are well thought out. A bit too long though, it definitely shows its age in that category.",
    "timestamp": 1760047200
  },
  {
    "username": "DonJunk",
    "rating": 6.0,
    "comment": "Last Verified\nFebruary 8, 2025\n\n~$18 - $80 ($30 - $45 for most)",
    "timestamp": 1739055600
  },
  {
    "username": "William Matijasic",
    "rating": 6.0,
    "comment": "yes, truly \"until the end of the world\". Still fun to have dudes on a map though. But pretty much only in one's imagination now. Best for a group of teenage boys with lots of time on their hands",
    "timestamp": 1733871600
  },
  {
    "username": "rhamsterren",
    "rating": 6.3,
    "comment": "This game felt like fun. There is a lot going on. You have to keep track of what others do, because it might have an effect on you / your plans.",
    "timestamp": 1722981600
  },
  {
    "username": "Yngwie1751",
    "rating": 6.0,
    "comment": "Fun, but gets repetetive fast, unfortunately cause we always play 3 player games.\n\nNice board, cards, miniatures.",
    "timestamp": 1718402400
  },
  {
    "username": "EmeraldYam",
    "rating": 6.0,
    "comment": "10 years on... I have very fond memories of sitting in a cubicle playing this asynchronously online with friends, but other than that no real memory of the gameplay.",
    "timestamp": 1717624800
  },
  {
    "username": "santino el cato",
    "rating": 6.0,
    "comment": "Good game, sometimes too much led by dices.",
    "timestamp": 1715205600
  },
  {
    "username": "gsiegele",
    "rating": 6.0,
    "comment": "donated to charity",
    "timestamp": 1702681200
  },
  {
    "username": "Wyte Cell",
    "rating": 7.0,
    "comment": "I don't really like war games, but keep this in my collection. Very balanced and everyone is \"in it\" until the end. Makes games like Risk look stupid.",
    "timestamp": 1760911200
  },
  {
    "username": "Cheezarino",
    "rating": 7.0,
    "comment": "I adore the historical setting and going through the epochs, seeing all the little references to our human story, civilizations and eras across time. The planning of each subsequent round is rewarding and battles are pretty intense making or breaking your game flow, but there's always room to come back. That can be decisive however, the rubberbanding that occurs can be severe for anyone in the front which very well may leave players demoralized and discouraged to keep going.\n\nMy main problem is the length; I've played History of the World around 4 separate times and only ever got to the last epoch before me and the boys had to say goodnight. Granted, we usually only play board games at night but we love getting in-depth so games can last 5-6 hours, which is kind of absurd for the amount of epochs and players we play with (usually 3). The pacing is way off in my opinion, and there are quite a few lulls throughout that can burn you out. Still the game has my seal of approval for how wonderful the historical peoples and locations intertwine with the strategy of leading and growing an empire. A great, dense experience which I hope to get through one run someday lmao",
    "timestamp": 1757368800
  },
  {
    "username": "GeminiWeb",
    "rating": 7.0,
    "comment": "I know it suffers from a lot of luck, from empires received to dice rolls and event cards and it suffers from a bit of leader bashing, but I just love this game. Lots of fun.",
    "timestamp": 1754863200
  },
  {
    "username": "littleweb",
    "rating": 7.0,
    "comment": "Comments entered on 10 Dec 2009:\n\nThis was one of the first Avalon Hill (Monarch) games that I ever owned. I upgraded to the Hasbro Avalon Hill version in 1999.",
    "timestamp": 1752184800
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "War Game\n Historical Game\n\nA war game with incredibly simple rules but a remarkable amount of depth. The sheer number of civilizations in the game (over fifty) is impressive, even if the practical distinctions are simply size and geographic locations. That said, the combat system is straightforward and does not distract from the game. The turn structure is absurdly simple. Really, the only real complaint might be the abstraction that somehow connects each civilization you play in each epoch to the next for scoring purposes. But this is minor, as we are playing a game and we do need to do game-y things sometimes. A knockout success.",
    "timestamp": 1759701600
  },
  {
    "username": "hannon",
    "rating": 8.0,
    "comment": "Jdp",
    "timestamp": 1752616800
  },
  {
    "username": "theCartoonMrOats",
    "rating": 8.0,
    "comment": "would love to dust this one off; never really got enough players to give it its day in court, but it was fun and whimsical. kind of a family game in tone, not really a wargame.",
    "timestamp": 1752530400
  },
  {
    "username": "waddball",
    "rating": 8.0,
    "comment": "Loads of fun. Can be pretty random, but it makes the oft-annoying leader bashing in games like this into something fun; hanging in second is still best, but there are risks (esp. with the PE markers, which I like, as you need incentives to pull away).\n\nThe card-passing is easily the best part of the game: in an ideal world there would be 14 epochs, and the board play would take a third the time. (I'm obviously out of step here, as none of the reboots/new editions have gone down this path, but instead gone haring after things I had no issue with.)\n\nThe game does a lot of things well, and though I like it as written, it sparks a wishlist of possible improvements/options: better cards (both for balance and interesting effects); a shorter combat system; more epochs and empires; more variance in scoring as epochs cycle (the 3-6-9s are too static, and an occasional 5-10-15 would be fun); Britannia-like incentives to follow a (mild) historical course; easier/faster means of tracking game state and scoring; a much less surreal map; some empire-specific powers; options for cultural achievement (beyond monuments). The designers of this, Vinci, and Britannia should get together and produce HotW Redux; that would rock.",
    "timestamp": 1748556000
  },
  {
    "username": "Ryan Keane",
    "rating": 8.5,
    "comment": "Finally got a chance to try this classic and was very impressed. I love this style of dudes on a map point-gathering games and find the civ theme and real map way more engaging than Small World. It lacks the narrative arc of my favorite Britannia, and plays much more opportunistically, but it seems once you know the civilizations well you could perhaps predict which areas you might be most likely to hold out with a older civ for a while and rack up easy points. That said, with 6 players it is very long, dice can be really swingy, where a civ may just totally fail to expand much due to the bad rolls, and by mid-game a player can be hopelessly lagging behind in points and out of contention. The way civs gets dealt works well as a passive \"bash the leader\" - if you draw a weak civ, you can give it to the leader - but it rarely serves as a catch-up mechanism; I wonder if it would be better if the first player (lowest score) kept drawing and assigning civs until they kept one, and so on. The pre-eminence chips seems unnecessary - I understand the purpose to have a surprise factor at the end if players are in close contention for the lead, but they seem to just make rich richer.",
    "timestamp": 1756159200
  },
  {
    "username": "aristanton",
    "rating": 9.0,
    "comment": "This is a perfect game for casual and avid players to play together. Beside the very interesting 7 turn historical flow of the game which is great on its own it has a very balanced rivalry / camaraderie between the players not at the top score which I find amazing. Visuals are great and replayability is very high (I have had this game for 20 years and it still comes up for play regularly). The only drawback I find it is that very proficient hardcore players might find it a bit simplistic for the 2-4 hours it takes to complete (depending on how many play).",
    "timestamp": 1755468000
  },
  {
    "username": "Thrylos",
    "rating": 9.0,
    "comment": "The greatest game about the history of the world. The latest version by Avalon Hill/Hasbro has great components. The game is simple, intense, and with a lot of changes/balances that makes a great game for both players that like strategy and for families. But it is a long game.",
    "timestamp": 1745964000
  },
  {
    "username": "ChipChuck",
    "rating": 8.5,
    "comment": "My gaming group's favorite.",
    "timestamp": 1741561200
  },
  {
    "username": "glasker",
    "rating": 10.0,
    "comment": "One of my all time favorites that does not get played anymore because of play time length.",
    "timestamp": 1736550000
  },
  {
    "username": "Marius n Milan",
    "rating": 9.5,
    "comment": "Hasbro Avalon Hill ed has all the minis. Described as epic and risk-like, but hoping for a layered strategy experience (layered like Imperial 2030). Very, very, very long game.\nS 700\n2023\nEdit First play: epic confirmed.\n2nd play: love this. Certainly layered. Fun, and awesome components.\n3rd: with Epoch VIII variant - it's long, epic, and highly enjoyable.",
    "timestamp": 1728597600
  },
  {
    "username": "RogerDHyman",
    "rating": 10.0,
    "comment": "Also have the AH 1991 edition. This is an outstanding game; always fun to play. Terrific components.",
    "timestamp": 1720216800
  },
  {
    "username": "Sorcerak",
    "rating": 10.0,
    "comment": "My #1 game.",
    "timestamp": 1703113200
  }
]