[
  {
    "username": "hacksword",
    "rating": 1.0,
    "comment": "(1 play)\n[2006/02/28] A betting game where players back monsters in some sort of gladitorial pit. Monsters combat each other by the players laying cards numbered from 0 to 10 on each monster; high cards for monsters they're backing, low cards for monsters they want to lose. There's nothing really wrong with the game, but it's a little too light for my tastes. Short playing time.",
    "timestamp": 1156888800
  },
  {
    "username": "Wolfshade",
    "rating": 2.0,
    "comment": "Probably the game I loathe the most (besides Monopoly). I don't get the fun of the complete and utter randomness.",
    "timestamp": 1642374000
  },
  {
    "username": "InterestingTimesGang",
    "rating": 3.0,
    "comment": "Falls flat for me, too long for what it is. I have tried Equinox and the same feeling but I appreciate the small box, wish the game was more engaging. The beginning just feels like random bidding and by the end you can't really do much but let it play out.",
    "timestamp": 1755986400
  },
  {
    "username": "Onbase",
    "rating": 4.0,
    "comment": "Wanted to like this one a lot, but it seemed to end too early; perhaps we missed a rule. It felt like there were too many special powers that either didn't come into effect or only used once. Not tense at all.",
    "timestamp": 1758664800
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "Of all the games with similar themes (like Galaxy: Dark Ages) this is the most accessible for me. I highly recommend the game with any number of players.",
    "timestamp": 1745272800
  },
  {
    "username": "thingo",
    "rating": 5.0,
    "comment": "In 27 years, presentation of games has improved in leaps & bounds. This is an interesting game, & presents good dilemmas. However initial plays of the game are somewhat overwhelming. Only in retrospect did the choices gain a context.",
    "timestamp": 1743202800
  },
  {
    "username": "Slimeyselim",
    "rating": 6.0,
    "comment": "Colossal Arena ‐ Fantasy Flight English edition (2004)\n\nLanguages : English\n\nGood Condition",
    "timestamp": 1740351600
  },
  {
    "username": "Pietari",
    "rating": 6.0,
    "comment": "One more nice game from Reiner Knizia I know of. Pretty simple, but it needs some concentration to guess creature falling next round. The more players the more chaos. With two players this remainds me about The Lost Cities.",
    "timestamp": 1739574000
  },
  {
    "username": "byfed",
    "rating": 7.0,
    "comment": "Comprado en pedido conjunto a Ludobay en Marzo de 2017 por 1.50€ (En realidad se pidió en Noviembre de 2016 y llegó a principios de Marzo).\n\nJuego del estilo de Knizia. Sencillo de explicar y de jugar, pero con enjundia suficiente para que resulte entretenido. LA única pega que le veo es que ocupa mucha mesa, a pesar de ser un juego de cartas.\n\nEs un juego de apuestas sobre \"guerreros\" que compiten entre sí. La historia está en apostar por los guerreros adecuados lo antes posible. Cuanto antes apueste, más valor tendrá la apuesta si el guerrero sobrevive.\nAdemás, si eres el jugador que más has apostado por un guerrero, cada vez que juegas una de sus cartas, puedes utilizar un poder especial que hace que el juego tenga variedad.\n\nDura entre media hora y tres cuartos y es perfectamente válido para no iniciados en el mundo de los juegos. Es una buena compra y una relación calidad precio absolutamente bestial (por lo que me costó...).\n\nLo tengo tradumaquetado con pegatinas sobre las cartas.\nDespués de años sin usar y en venta, sin que nadie preguntase por él, está en nuevo Parque desde 18/10/25",
    "timestamp": 1760824800
  },
  {
    "username": "kwalzl",
    "rating": 8.0,
    "comment": "6A\nAKA TITAN THE ARENA",
    "timestamp": 1758492000
  },
  {
    "username": "marlinhart",
    "rating": 9.0,
    "comment": "I've played this at least 100 times. But at the time was not recording on BGG. I love this game. We put in a house rule that aloud you to negate a power.",
    "timestamp": 1758837600
  },
  {
    "username": "Murlock22",
    "rating": 9.5,
    "comment": "Played it for hours.\nCards are well played already.\nNeed a new one.",
    "timestamp": 1694210400
  }
]