[
  {
    "username": "Technon",
    "rating": 1.0,
    "comment": "I really hate this game.",
    "timestamp": 1598738400
  },
  {
    "username": "AgentMeat",
    "rating": 2.0,
    "comment": "As a child I was fascinated by the moving parts and how you had to plan ahead to clear your path, mixed in with some take-that, putting other players into deadends. But the rules where always loosey-goosey It was to simple to ignore the current goal and go for the next, more lucrative one also randomness can really favor one player more than any other. Plus from start to finish it stays the same, no variation at all",
    "timestamp": 1585263600
  },
  {
    "username": "dead_eye_dodo",
    "rating": 3.0,
    "comment": "Great basic idea, boring gameplay.",
    "timestamp": 1696802400
  },
  {
    "username": "SleepyGreenKnight",
    "rating": 4.0,
    "comment": "2-4",
    "timestamp": 1650751200
  },
  {
    "username": "djnesq",
    "rating": 5.0,
    "comment": "This is slightly better with only two players; with four players, you feel as if you're starting over each turn. In regular Labyrinth, you know your immediate target but not your future ones; in Master Labyrinth, future targets are know, but all players are gunning for those. I'm not sure that makes for a better game.",
    "timestamp": 1749679200
  },
  {
    "username": "SeboEla",
    "rating": 5.0,
    "comment": "Wohnzimmer",
    "timestamp": 1728684000
  },
  {
    "username": "gianlucadario87",
    "rating": 6.0,
    "comment": "B_SOPRA",
    "timestamp": 1758751200
  },
  {
    "username": "pavin",
    "rating": 6.0,
    "comment": "Complet et en superbe état pour son âge. Comme celui de chez mes parents sauf l'édition (couvert de la boîte qui diffère). Il y a un pion vert au lieu de bleu (pas grave) et 14 baguettes au lieu des 12 (2 de plus!). Le décompte des points à la fin est fastidieux (ca prend un papier et un crayon pour compter les points). Les trucs que l'on ramasse peuvent être dégueu et que dire des soit disant pouvoir qu'on leur attribuait. Reste un bon jeu dans l'ensemble",
    "timestamp": 1757887200
  },
  {
    "username": "guimel",
    "rating": 7.0,
    "comment": "Traded on BGG October 2025. Very good condition has one replacement card token. Lovely Ravensburger game with great graphics. This is the most complex of the Labyrinth games. No necessary in game text requirement. German edition with the title Das Labyrinth der Meister. English rules in BGG files:\nhttps://boardgamegeek.com/filepage/11819/labyrinth-der-meist...\n\n\nAward winning game:\n1991 Spiel des Jahres \"Beautiful Game\" Winner\n1991 Mensa Select Winner\n1991 Deutscher Spiele Preis Best Family/Adult Game Winner\n1991 Årets Spil Best Family Game Winner\n\n\nSuitable for 2 players. 20-30 mins. Very light game. Age 10+\nMore in depth version from the Labyrinth family of games.",
    "timestamp": 1760392800
  },
  {
    "username": "Drixxel",
    "rating": 8.0,
    "comment": "The tile-shifting mechanic is quite a bit of fun in practice, it's very satisfying to open up a favourable path by sliding an entire row or column of the existing maze. While I wish for at least a smidgeon more depth, what's here in the form of an arcane ingredients hunt is rather enjoyable. Played with a group of 3.",
    "timestamp": 1756936800
  },
  {
    "username": "Knothyelf",
    "rating": 9.0,
    "comment": "BGG average of 6.3 for this gem?\nrofl, this game is so much better than that.\niykyk",
    "timestamp": 1754604000
  },
  {
    "username": "middletonner",
    "rating": 10.0,
    "comment": "Not often do mechanical gimmicks or abilities like visual acuity make good games, but Master Labyrinth is an exception to both. It minimizes any fiddly-ness found in its gimmick establishes good \"take that, maybe?\" player interaction that means seeing a solution doesn't always mean seeing a good solution. Be prepared for a brain-and-eyeball-burner, but a fun one. At the house we enjoy leaving it out on a table and playing asynchronously. It works quite well this way.",
    "timestamp": 1626127200
  }
]