[
  {
    "username": "amon1223",
    "rating": 1.0,
    "comment": "for 5,6-player",
    "timestamp": 1760392800
  },
  {
    "username": "Rolsen128",
    "rating": 1.0,
    "comment": "More of a toy than a game. Dexterity aspect of flicking “cars” (discs) around a track. Flick too hard and you’ll go off the track and lose a turn. That’s about it…",
    "timestamp": 1666562400
  },
  {
    "username": "Winn81",
    "rating": 1.0,
    "comment": "Setup and cleanup are barriers to playing this one. Prefer crokinole and ICECOOL.",
    "timestamp": 1575154800
  },
  {
    "username": "mOCHU035",
    "rating": 1.0,
    "comment": "1 Play",
    "timestamp": 1553468400
  },
  {
    "username": "Rumpy_Pumpy",
    "rating": 1.0,
    "comment": "After a long setup, you end up painfully flicking the car around the track. The bridges are just the worst. It would be more fun to take a bean and flick it round a table... long story short, I flicked one of the pieces when a friend stood facing the car. Hit him right in the d&*k and I lost.",
    "timestamp": 1539381600
  },
  {
    "username": "parp",
    "rating": 1.0,
    "comment": "Hated this with a passion - flicking bottle caps around the kitchen table would have been just as \"satisfying\", but a whole lot cheaper...",
    "timestamp": 1397340000
  },
  {
    "username": "gijoe250",
    "rating": 2.0,
    "comment": "I personally don't like, because my dexterity=zero! ARGH! Plus we play \"mario kart\" style. knocking someone off is no punishment. Everyone else enjoyed it though! give it a shot!",
    "timestamp": 1481670000
  },
  {
    "username": "taragalinas",
    "rating": 2.0,
    "comment": "Not a game.\n\nSport or toy, yes. Game, no.",
    "timestamp": 1426287600
  },
  {
    "username": "jose_luis",
    "rating": 2.0,
    "comment": "For playing this game it's not necessary buy it",
    "timestamp": 1319148000
  },
  {
    "username": "JohnHBiedenkapp",
    "rating": 2.0,
    "comment": "Silly",
    "timestamp": 1268607600
  },
  {
    "username": "Ivan",
    "rating": 2.0,
    "comment": "I'd rather cut my jimmy off than play this again.",
    "timestamp": 1225926000
  },
  {
    "username": "Jammicus",
    "rating": 1.5,
    "comment": "what can I say",
    "timestamp": 1218751200
  },
  {
    "username": "Raskzac",
    "rating": 3.0,
    "comment": "Just not my kind of game. But can understand the appeal to others.",
    "timestamp": 1734217200
  },
  {
    "username": "de_aztec",
    "rating": 3.0,
    "comment": "What a lot of a fun and so accessible to everyone, even my 3 and 7 year old girls play.",
    "timestamp": 1676674800
  },
  {
    "username": "Chuggas",
    "rating": 3.0,
    "comment": "I like that you can build your own race track, it's just not my kind of game.",
    "timestamp": 1671663600
  },
  {
    "username": "Goldp",
    "rating": 3.0,
    "comment": "Ehhh. It's a child game?",
    "timestamp": 1631743200
  },
  {
    "username": "esparver73",
    "rating": 3.0,
    "comment": "Boooring.",
    "timestamp": 1588802400
  },
  {
    "username": "padeha",
    "rating": 3.0,
    "comment": "I bought this for my young family. My low rating reflects the disappointingly flat first play we had with this one. It's expensive for what it is and you also really need a big table to play it comfortably. We had to play it on the floor which is less than ideal.\n\nUpdate - Sold (thank goodness). I can imagine if you had a big table and a group of adults who are 'up' for a flicking game, this might work; but it was sadly not for us.",
    "timestamp": 1533679200
  },
  {
    "username": "Oezz",
    "rating": 4.0,
    "comment": "Dexterity games are not my favourite category, and PitchCar is no exception. It's cool that you can build these awesome elaborate tracks. There is also a large amount of skill with trick shots and the like. But ultimately you're just flicking a wooden disk around a course and for me the novelty wears off quickly. Lastly the game has nice, chunky components, but as a result it's a huge pain to store and transport.",
    "timestamp": 1719180000
  },
  {
    "username": "Euroman",
    "rating": 4.0,
    "comment": "Flick wooden disks. Not good for more than 10 minutes.\nSuitable for kids but you need at least 4 players.\nCan be hard to catch the leader and being last in the pack is painful.",
    "timestamp": 1707433200
  },
  {
    "username": "coxy_fc",
    "rating": 4.0,
    "comment": "May as well play my old car racing sets back when I was 8.",
    "timestamp": 1668121200
  },
  {
    "username": "eddy_sterckx",
    "rating": 4.0,
    "comment": "2014-11-03 : There's some fun to be had with this game, provided you keep it short.\n2022-10-26 : No matter how hard people try, this game plays always too long for what it is.",
    "timestamp": 1666735200
  },
  {
    "username": "bhudson1972",
    "rating": 4.0,
    "comment": "The game is perfect for conventions. I don't see myself ever owning, as it is quite expensive. However, it is fun to play for all ages. I'm terrible at flicking and dexterity games, so not in my wheelhouse.",
    "timestamp": 1653429600
  },
  {
    "username": "Puglord",
    "rating": 4.0,
    "comment": "I just didn’t like it. But if you enjoy flicking games, it might well be your jam.",
    "timestamp": 1642114800
  },
  {
    "username": "wiim",
    "rating": 5.0,
    "comment": "More of an activity or toy than a board game per se. I only played with the base set which was lackluster. Might be way cooler if I could play it with the right group (kids) and some expansions (loops and jumps). Will be too expensive for that though. 3D printing might be a solution.",
    "timestamp": 1749592800
  },
  {
    "username": "TForever",
    "rating": 5.0,
    "comment": "It's a dexterity game, so you are either you are in for that or not. You can cheat your way across the road as long as you only touch the road, so it's like pushing your luck. It's good for what it is.",
    "timestamp": 1744408800
  },
  {
    "username": "h4angel",
    "rating": 5.0,
    "comment": "With 3d printed road expansions",
    "timestamp": 1743890400
  },
  {
    "username": "dosxtres",
    "rating": 4.9,
    "comment": "Party",
    "timestamp": 1741906800
  },
  {
    "username": "MrBigos",
    "rating": 5.0,
    "comment": "Dexternity based game. Not a fan.",
    "timestamp": 1739574000
  },
  {
    "username": "BoardGamingCouple",
    "rating": 5.0,
    "comment": "5/5\n\nPitchcar is a more modern dexterity game that is a lot of fun. Easy simple rules for the whole family to play. The game is expensive, takes time to setup, and is a pain to store. It is wicked fun though. 500+\n\nThe game really shines with 2 base games or 1 base game and some expansions so that you can make longer tracks. Jumps, tunnels, ramps, potholes, narrow lanes, curves, turns, loop de loops, roundabouts, etc...",
    "timestamp": 1735254000
  },
  {
    "username": "Karog",
    "rating": 5.0,
    "comment": "Too Simple",
    "timestamp": 1709074800
  },
  {
    "username": "IllusionKnight",
    "rating": 5.0,
    "comment": "You flick cards, it's a decently fun as it sounds.",
    "timestamp": 1703458800
  },
  {
    "username": "Ninergamer",
    "rating": 5.0,
    "comment": "Overrated. Someday, I hope to play “Crokinole” instead.",
    "timestamp": 1702508400
  },
  {
    "username": "ataniker",
    "rating": 5.0,
    "comment": "3 komplette Spiele + Sprungschanze + Schikanen + viele extra Geraden",
    "timestamp": 1687730400
  },
  {
    "username": "garfieldcut",
    "rating": 5.0,
    "comment": "Fun concept but hard to use because barriers are not well-fixed",
    "timestamp": 1666389600
  },
  {
    "username": "peakhope",
    "rating": 5.0,
    "comment": "What I like:\n- Mechanically simple\n- Reminds me of slot racing cars as a kid\n- Goes pretty quickly, at least with 3 players\n\nWhat I don't like:\n- It is a dexterity activity, so I would put it in the \"party game\" category\n- Takes as long to set up as it does to play. Then takes that long again to tear it down\n\nIt was fun. I would play again. It's just not in the same category as brain-oriented games.",
    "timestamp": 1652565600
  },
  {
    "username": "Adverb",
    "rating": 6.0,
    "comment": "ATTN BUYERS: Local pickup only!",
    "timestamp": 1759096800
  },
  {
    "username": "stofke",
    "rating": 6.0,
    "comment": "R002",
    "timestamp": 1758492000
  },
  {
    "username": "Raoulinho82",
    "rating": 6.0,
    "comment": "P: [4-8] (8) Competitive",
    "timestamp": 1754604000
  },
  {
    "username": "Spatzy",
    "rating": 5.5,
    "comment": "6",
    "timestamp": 1754517600
  },
  {
    "username": "Olafslomp",
    "rating": 6.0,
    "comment": "Played at Spellenspektakel",
    "timestamp": 1749160800
  },
  {
    "username": "Eitetsukb",
    "rating": 6.0,
    "comment": "Played",
    "timestamp": 1740956400
  },
  {
    "username": "Mark of the Beast",
    "rating": 6.0,
    "comment": "2024",
    "timestamp": 1731625200
  },
  {
    "username": "ButtMunch",
    "rating": 6.0,
    "comment": "In theory, a great idea for a game. However the track itself usually is moderately haphazard and I found players, including myself, hitting uneven connections, causing the car to fly off the track which was frustrating.\n\nI'm curious what a static track would play like?",
    "timestamp": 1726956000
  },
  {
    "username": "Crunchystar",
    "rating": 6.0,
    "comment": "Cool huge game which only trigger my desires for further expansions. Anyone who have the luxury to invest in those might have quite fun time. The base game by itself doesn't feels so satisfying to me.",
    "timestamp": 1720303200
  },
  {
    "username": "Lemem",
    "rating": 6.0,
    "comment": "PitchCar is pretty self explanatory, flicking Crockinole discs around a track as if they were race cars; I thought it was fine.",
    "timestamp": 1719525600
  },
  {
    "username": "yiechow",
    "rating": 6.0,
    "comment": "Have to say Sheldon enjoys it.",
    "timestamp": 1715551200
  },
  {
    "username": "Lecaro",
    "rating": 6.0,
    "comment": "\"Carabande\" ist ein altes Schnipp-Rennspiel aus dem Jahre 1995, welches ich leider erst vor kurzem kennenlernen durfte!\n\nZu Spielbeginn werden die Streckenteile nach Belieben zu einem Rundkurs zusammengesteckt und die Spieler erhalten jeweils eine Holzscheibe mit einer Startnummer.\nNach dieser Reihenfolge setzten sie ihre Scheiben auf die Startlinie und schnippen sie der Bahn entlang. Sobald ein Spieler seine eigene Scheibe oder die eines Gegners von der Bahn herunter schnippt, müssen die entsprechenden Scheiben zurückgesetzt werden, wodurch der aktive Spieler seinen Spielzug verliert. Schnippt jemand seinen Stein so heftig, dass er umgedreht zum Liegen kommt, muss dieser seinen nächsten Zug aussetzen.\nGespielt wird, bis es einer schafft, drei komplette Runden zu absolvieren. Dieser Spieler hat dann gewonnen.\nMit den erweiterten Wettkampfregeln kann die Spielreihenfolge gerechter verteilt werden. Außerdem bieten sie eine Punktewertung über drei Partien hinweg an.\n\n\"Carabande\" ist ein sehr lustiges Spiel, bei dem die Teilnehmer nicht am Tisch sitzen, sondern darum herumstehen. Es hat leider einen enormen Startspielervorteil, da dieser den anderen Spielern im Weg steht und natürlich die größten Chancen auf den Sieg hat, gerade weil er vor allen anderen am Zug ist.\nDieser Aspekt könnte etwas ausgeglichen werden, wenn alle Spieler am Ende gleich oft an die Reihe kommen und erst derjenige gewinnt, der dann am weitesten über die Ziellinie hinweggekommen ist.\nIm Grunde kann das Spiel aber auch als reine Gaudi angesehen werden, bei dem sich die Spieler gegenseitig durch die Bahnen schnippen und einfach Spaß mit sehr wenigen Regeln haben. Bedenkt man, aus welchem Jahr das Spiel stammt, ist es sogar ein sehr guter Titel, der sich bis heute gut gehalten hat.\nIch finde es nur schade, dass ich es so spät erst ausprobieren konnte, denn heutzutage sind die ganzen tollen Erweiterungsstrecken kaum bis gar nicht mehr verfügbar. Es gibt einiges, was ich durch den 3D-Drucken jagen kann, aber ob die Oberflächen dann noch so glatt sind, wie beim Original, wage ich zu bezweifeln.\nNichtsdestotrotz empfinde ich \"Carabande\" als ein richtig tolles Spiel.",
    "timestamp": 1714600800
  },
  {
    "username": "Tigrillo",
    "rating": 7.0,
    "comment": "Not my type of game usually but PitchCar is quite fun. The Loop is too pricey and too hard but the rest of the expansions I have, I recommend.\n\nExpansions: #1, #2: More Speed, More Fun, #5: The Cross, #7: The Loop, and #8: The Upsilon.",
    "timestamp": 1760911200
  },
  {
    "username": "Bagherra",
    "rating": 7.0,
    "comment": "a wonderful \"skill and action\" dexterity game. A racing game that should be strongly considered.\n\n(Trades with expansion)",
    "timestamp": 1760133600
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Fun, but I have enough dexterity games, prefer IceCool",
    "timestamp": 1759442400
  },
  {
    "username": "bnordeng",
    "rating": 7.0,
    "comment": "(KIDS) One of the best dexterity games I've played. Very simple and lots of fun.",
    "timestamp": 1758578400
  },
  {
    "username": "gfyb",
    "rating": 7.0,
    "comment": "+ Expansions 1 & 5",
    "timestamp": 1755208800
  },
  {
    "username": "ItsMagic",
    "rating": 6.8,
    "comment": "massive continuously elegant easygoing stimulating positioning confrontative;\nIcecool? favoured",
    "timestamp": 1755208800
  },
  {
    "username": "jarh3ad5",
    "rating": 8.0,
    "comment": "Sealed",
    "timestamp": 1761054360
  },
  {
    "username": "DarthHenryAllen",
    "rating": 8.0,
    "comment": "The rules: On your turn, flick your car. Try to be first around the track 3 times.\n\nThere’s not much more than that yet it’s quite enjoyable for all ages. It’s a great game for getting people involved. The interactive nature tends to draw in onlookers and it’s so easy to understand that those onlookers almost always end up wanting to play.\n\nIf you like the game it’s definitely worth picking up the first extension as well. The additions of the ramps, the tunnel, and the cross-over tracks really allow for some fun tracks that you just can‘t build with the base game.",
    "timestamp": 1760824800
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "PITCHCAR\nEXTENSION 1\nEXTENSION 3\nEXTENSION 5\n\nPitchcar tracks: https://boardgamegeek.com/filepage/27228/pitchcar-tracks\n\nPitchcar variant with two players:\nUse two cars, like a racing team, where you get points for where each car finishes in the race.",
    "timestamp": 1759960800
  },
  {
    "username": "chadjanet",
    "rating": 8.0,
    "comment": "4 extra cars Expansion 1 and 2",
    "timestamp": 1759874400
  },
  {
    "username": "jmangus",
    "rating": 8.0,
    "comment": "$125",
    "timestamp": 1759528800
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Generally, I shy away from flicking games, preferring placement games in the dexterity genre. But this is a pretty neat game, with all of the customization with building tracks. Also, the walls really make the flicking far more manageable for me.",
    "timestamp": 1759356000
  },
  {
    "username": "rigacu",
    "rating": 9.0,
    "comment": "Vienna",
    "timestamp": 1760392800
  },
  {
    "username": "Clejsan",
    "rating": 9.0,
    "comment": "1-8 players",
    "timestamp": 1759960800
  },
  {
    "username": "ultimoratio",
    "rating": 9.0,
    "comment": "including:\nExpansion 1\nExpansion 2\nExpansion 3\nExpansion 8\n\n\n\nSolid dexterity game. No fluffy BS rules. Just flick and see who is the best and fastest. As any race should be.",
    "timestamp": 1758924000
  },
  {
    "username": "nysmoke",
    "rating": 9.0,
    "comment": "Crokinole for the NASCAR crowd.",
    "timestamp": 1755036000
  },
  {
    "username": "keithwalther",
    "rating": 9.0,
    "comment": "$30",
    "timestamp": 1753653600
  },
  {
    "username": "shanev316",
    "rating": 9.0,
    "comment": "+Ext. 1\n+Ext. 2\n+Ext. 3\n+Ext. 4\n+The Cross",
    "timestamp": 1753653600
  },
  {
    "username": "Tupelo",
    "rating": 10.0,
    "comment": "Great fun game for all ages.\nGreat party game",
    "timestamp": 1761136980
  },
  {
    "username": "ohms",
    "rating": 10.0,
    "comment": "Plus:\nExtension 1\nExtension 2\nExtension 4\nExtension 5\nExtension 8 x2",
    "timestamp": 1758837600
  },
  {
    "username": "Larry Chong",
    "rating": 10.0,
    "comment": "A delightful finger-flicking/dexterity racing game that's loads of fun; especially with larger group. (Reminded me of shooting wax-filled bottlecaps as a youth. )",
    "timestamp": 1756936800
  },
  {
    "username": "SecretSquirrel2",
    "rating": 9.5,
    "comment": "The best dexterity game I have ever played! The fact that there are expansions that just make the track better and more challenging increase the playability. This game is a must for every gamer to have as a dexterity game and the amount of fun your group will have will be endless.",
    "timestamp": 1753221600
  },
  {
    "username": "seguleh",
    "rating": 10.0,
    "comment": "2-8",
    "timestamp": 1752876000
  },
  {
    "username": "barnstorm",
    "rating": 9.5,
    "comment": "2-8p",
    "timestamp": 1734822000
  }
]