[
  {
    "username": "TeganAndTheOneRing",
    "rating": 1.0,
    "comment": "It makes me appreciate fury of Dracula that much more.\nThis is one of my least favorite games of all time!",
    "timestamp": 1715292000
  },
  {
    "username": "BGFreakDag2PT",
    "rating": 1.0,
    "comment": "Retail",
    "timestamp": 1679007600
  },
  {
    "username": "LordShaka77",
    "rating": 1.0,
    "comment": "It was very difficult my older cousin gave it to my younger cousin we had 7 years old the instruction were only in english and even when they some one tolds us how to play it was very difficult and we couldn't play it.",
    "timestamp": 1600380000
  },
  {
    "username": "jmhgn",
    "rating": 1.0,
    "comment": "Has missing pieces",
    "timestamp": 1573599600
  },
  {
    "username": "GoodGameGeek",
    "rating": 1.0,
    "comment": "android",
    "timestamp": 1514588400
  },
  {
    "username": "Stewartgraham",
    "rating": 1.0,
    "comment": "Kids enjoy this but you need to have a decent amount of players as well as decent Mr X as well!",
    "timestamp": 1469656800
  },
  {
    "username": "Omertron",
    "rating": 1.0,
    "comment": "I LOATHE hidden movement games.\nThere is nothing more frustrating than \"chasing\" the perpetrator around only for them to escape to the other side of the board.\nThis is not \"tense and thrilling chase\" it is a tedious and frustrating exercise in wasting my time.",
    "timestamp": 1468879200
  },
  {
    "username": "draconiscor",
    "rating": 1.4,
    "comment": "One of the worst games i've ever played. Boring and poor materials.",
    "timestamp": 1456182000
  },
  {
    "username": "bryanious",
    "rating": 1.0,
    "comment": "I would not play SY, because it is not a game. I played with friends, that just marked every spot Mr X could possibly go to with a coin and after each turn just expanded the cloud of possible Mr X locations and removed coins and possibities they could exclude.\n\nAfter this exercise I realized that Scotland Yard isn't actually a game, although it offers some interesting design ideas and innovative game elements.",
    "timestamp": 1442872800
  },
  {
    "username": "cesquintero",
    "rating": 1.0,
    "comment": "Esto es un adefecio! Pero perdono a quien me invitó a jugarlo, fue con las mejores intenciones (espero).",
    "timestamp": 1426201200
  },
  {
    "username": "MystLgnd",
    "rating": 2.0,
    "comment": "Impossible to catch Mister X if they know how to handle it everytime.",
    "timestamp": 1739660400
  },
  {
    "username": "Shazinga186",
    "rating": 2.0,
    "comment": "So,so boring.",
    "timestamp": 1732143600
  },
  {
    "username": "SirYra",
    "rating": 2.0,
    "comment": "@1.95#https://www.ravensburger.org/spielanleitungen/ecm/Spielanlei...",
    "timestamp": 1701471600
  },
  {
    "username": "getoutofmyship",
    "rating": 2.0,
    "comment": "I didn't get the appeal for this game. It seems that the detectives can win this game only by blind guessing. Yes, you will approach where Mr X was seen last time. But what next? You will either know where he will 100% be, or you will just guess from the possible choices. There is nothing else to do in this game. There is no other valuable information, so there is no meaningful choices.",
    "timestamp": 1674342000
  },
  {
    "username": "Rumpy_Pumpy",
    "rating": 2.0,
    "comment": "Either you win as Mr. X. and you are on top of the world or lose and everyone else is happy. Being Mr. X. is the only fun part and if you escape IMO. Not much inbetween... 2 hours of my life gone.",
    "timestamp": 1539381600
  },
  {
    "username": "stevejuggler",
    "rating": 2.0,
    "comment": "£8 UKGE 2018 Bring and Buy - it's a different image to the one shown here.",
    "timestamp": 1538172000
  },
  {
    "username": "Klausi300",
    "rating": 2.0,
    "comment": "2",
    "timestamp": 1483657200
  },
  {
    "username": "Salamon",
    "rating": 2.0,
    "comment": "Acquired because gifted",
    "timestamp": 1459634400
  },
  {
    "username": "NowOrNever88",
    "rating": 2.0,
    "comment": "Not a bad game per se, I just have trouble with games like this and Nuns on The Run where you gotta track without seeing. It also hurt my head calculating the area and movements. Perhaps thats because I over-analyse. I also think there's just a lot of luck if the guy happens to go where you aim next or vice versa.\n\nPlays: 1",
    "timestamp": 1435183200
  },
  {
    "username": "Stevve15",
    "rating": 2.0,
    "comment": "Boring game... Takes too long to play and practically impossible to catch Mr. X",
    "timestamp": 1425337200
  },
  {
    "username": "Benjismama",
    "rating": 3.0,
    "comment": "so frustrating as detectives",
    "timestamp": 1718834400
  },
  {
    "username": "tiagoVIP",
    "rating": 2.5,
    "comment": "Designer: Manfred Burggraf, Dorothy Garrels, Wolf Hoermann, Fritz Ifland, Werner Scheerer, Werner Schlegel\nPlaying time: 45 Min\nWeight: 1.95 / 5\nPublisher: Grow Jogos e Brinquedos\nPlayer count: 2-6 (best with: 2,5)\n\nCOMPLEXITY: Low\nCOMPONENTS: Low\nDOWNTIME: Low to high\nFUN: Low\nINTERACTION: Medium\nPLAYING TIME: Medium\nLUCK: Medium\nREPLAY VALUE: Medium\nSOLITAIRE: Very low\nTHEMATIC: Low\n\nComments: Scotland Yard is a family game about hidden movement and deduction. The ideia is that players will try to find the Mr. X who is moving around London. Players can use Taxi, Bus and Metro, with the Mr. X also having the possibility of doing a double movement and use the boats to move by the river. Mr. X wins if the time ends and he isn't found; the detectives win if they find Mr. X.\n\nScotland Yard is just frustration in game form. With Mr. X being able to move back and forth, giving so little information, and also having special movements, is truly simply a matter of expecting for Mr. X's player doing a mistake, otherwise, there is no amount of deduction that will lead players to the correct spot, as in all times there are so many possibilities, due to how the different movements and the board is set, that while the detectives are deep in ponderation regarding the movements of Mr. X, which can lead to some lenghty matches and a lot of downtime for Mr. X's player, this is truly an empty exercize, as the detectives simply don't have the tools to proper evaluate.\n\nCan't even recommend this for anyone interested in hidden movement, as Scotland Yard is more likely to put this person away from the mechanic than making them more interested. While you can see the DNA of some great hidden movement games here (specially for Letters from Whitechapel), with games like Fury of Dracula (longer, deeper, way more complex), Not Alone (more complex, but quicker), Black Sonata (quite good solo option), Mr. Jack Pocket (smaller, simpler and better), there is no reason to even consider putting Scotland Yard on the table, not unless with a chunk of house rules.",
    "timestamp": 1702681200
  },
  {
    "username": "DanZDK",
    "rating": 3.0,
    "comment": "Played with Annie",
    "timestamp": 1686693600
  },
  {
    "username": "wojtolino",
    "rating": 3.0,
    "comment": "Well, given that is a quite old game, 30 or 40 years ago that may be considered as good, but now we have a lot of better similar games, so I don't want to play it anymore.",
    "timestamp": 1672959600
  },
  {
    "username": "kataclysm",
    "rating": 3.0,
    "comment": "I didn't really see the point. When I was Mr. X, I got caught within the first few turns because of the randomness of the initial card draws. When I was the inspectors, I could tell where Mr. X was at several points during the game, but couldn't reach him. So is it really a deduction game? Is it a race game? Definitely it's not a game for me.",
    "timestamp": 1657317600
  },
  {
    "username": "andrebr",
    "rating": 3.0,
    "comment": "? 45 Min 3-6 Players p3 p4 p5 p6 Weight: 1.96 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "Yttrenolv",
    "rating": 3.0,
    "comment": "I never really liked this game. It's cool to be the thief with all the cool tickets, and super boring to be a police detective with almost no tickets (since police has restricted mobility right?). It is way too hard to catch the thief and I feel this game does not give the police officers anything interesting to do. It's barely a deduction game because your \"deduction work\" doesn't achieve anything unless you are actually able to catch the thief. Once you lose him, you´re back to square 1.",
    "timestamp": 1585519200
  },
  {
    "username": "Kamaitatchi",
    "rating": 3.0,
    "comment": "Classic 1 vs all deduction game. Not my kind of genre but easy and cheap to get a copy off so... might as well keep it on the shelve for those that do want to play it.",
    "timestamp": 1580338800
  },
  {
    "username": "mOCHU035",
    "rating": 3.0,
    "comment": "3 Plays",
    "timestamp": 1565301600
  },
  {
    "username": "Kyur",
    "rating": 3.0,
    "comment": "Outdated game design.\n\nLetters from Whitechapel does a better job.",
    "timestamp": 1532469600
  },
  {
    "username": "jcpmcdonald",
    "rating": 4.0,
    "comment": "If one cop min-maxes, it's quite easy for them to control the entire search squad. This can be fun for a younger audience, but not great otherwise.",
    "timestamp": 1757023200
  },
  {
    "username": "Card",
    "rating": 4.0,
    "comment": "[$] Best with 2,5 (2-6) 45 mins, Age:10, 1.94 [$40]",
    "timestamp": 1756072800
  },
  {
    "username": "raptorello",
    "rating": 4.0,
    "comment": "6",
    "timestamp": 1729288800
  },
  {
    "username": "OthelloKeys",
    "rating": 4.0,
    "comment": "Love the concept. Hate the required honor system.",
    "timestamp": 1728424800
  },
  {
    "username": "candoo",
    "rating": 4.0,
    "comment": "I loved playing hide-and-seek as a child and this game reminds of those endless summer evenings.\n\nUpdate from March 2008 (7) to July 2024 (4)\nRevisited this after many years. It has been so FIRED by Letters from Whitechapel. The routes on the map don't make any sense or theme. And the limitations of the 3 ticket types are artificially limiting factors that don't add anything to this genre. I suppose this might be decent as an introduction for non-gamers to the cat-and-mouse genre. But gamers need not play this when Letters from Whitechapel is the best of this class by far.",
    "timestamp": 1721340000
  },
  {
    "username": "Sethenstien",
    "rating": 4.0,
    "comment": "An early hidden movement game that hasn't aged super well. Recommend Whitehall Mystery or Sniper Elite over this",
    "timestamp": 1710111600
  },
  {
    "username": "mitorious",
    "rating": 4.0,
    "comment": "Doesn’t really work very well. Hard to build tension when you keep losing track of Mister X. More modern versions do this much better.",
    "timestamp": 1704927600
  },
  {
    "username": "Omnisapien",
    "rating": 4.0,
    "comment": "Co-op Conquer",
    "timestamp": 1703458800
  },
  {
    "username": "Keahaw",
    "rating": 4.0,
    "comment": "Picked this one up at a local thrift shop and was really surprised by how much I enjoyed it. Simple rules and tension-filled gameplay, exactly my type of game.\n\nEdit: The good games are great but the bad games just end up feeling like a mess. Other games are just far more consistent.",
    "timestamp": 1669762800
  },
  {
    "username": "Victoria_hermit",
    "rating": 4.0,
    "comment": "Simple chase one player into a corner mechanic (like Mr. Jack, Letters from Whitechapel, Fury of Dracula). Gets a little tedious when you get so close then the spy slips away (but not as bad as Dracula vanishing in Fury of Dracula). The frustration level can be a bit too much for kids.",
    "timestamp": 1667602800
  },
  {
    "username": "Rogue128",
    "rating": 5.0,
    "comment": "Highest Rank: 475 in 2006",
    "timestamp": 1760997840
  },
  {
    "username": "mlm67",
    "rating": 5.0,
    "comment": "S E L L !! . . . . . Butik: 249:- ..... 165:-",
    "timestamp": 1760824800
  },
  {
    "username": "moonerie",
    "rating": 5.0,
    "comment": "2-6 players (rec 2-6; best 2, 4)\n6.5 rating\n1.94 complexity\n45 mins\n\nNotes: I don't remember it being a bad time but I own better so I notice I never want to reach for it anymore. Solid meh. Bought on recommendation of a game shop owner, as a less common game (which is true; I don't think I've met anyone who owns it/has played it unless it was with me, lol). I think I'd be unreasonably in love with the game if I reskinned it as a Detective Conan game though, haha.",
    "timestamp": 1757282400
  },
  {
    "username": "Joka61",
    "rating": 5.0,
    "comment": "BR 1983",
    "timestamp": 1752876000
  },
  {
    "username": "Nicolas Weiss",
    "rating": 5.0,
    "comment": "With the police operating on open shared information, an element of Scotland Yard I'm not too keen about is its ancestry over the quarterbacking issue of most cooperative games. Fortunately the police is only one of the teams here, so Scotland Yard is, in effect, a perfectly functional 2-player game. A nicer spin on the previous statement is that, within the sphere of board gaming (i.e. not RPGs), this is the first prominent example of the kind of teamwork that will eventually birth cooperative games, and you can certainly see a lot Scotland Yard's logistical DNA in, say, Pandemic. On top of which it fathered the niche genre of hidden movement. All of that while quickly becoming a mass market game in many parts of Europe. Quite the pedigree here!\n\nThe main gimmick of the game is the transportation ticket system, which is actually great ludonarrative in that it reminds me of the real-life arcane puzzle that was London prior to route-planning websites and smartphones. I'm unsure how well implemented the system is as far as Mister X is concerned; playing on that side, it feels to me like I spend most of the game never really threatened to run out of any ticket type, because the police simply can't afford to exclusively travel by bus. Still, while it's completely devoid of narrative sense, there is some compelling element of shared physical experience in the act of spending a ticket by handing it to the opposition, then the opposition spending it again by covering a slot with it. From the perspective of the police, these tickets, well, travel, and they come back to bite you in the arse. In two ways actually, since the threat of a ticket type running out is very, very real for the them, and a major source of endgame tension and relief for an increasingly cornered Mister X.\n\nMy relatively rare sessions of Scotland Yard, both during childhood and now with a more modern outlook, have always been above 2 players, which makes me feel like I haven't gotten the full experience of the game, and has maybe tainted my view of it with more indifference than warranted. For now I'm too busy exploring (and getting disappointed by) newer shinier hidden movement games that seem to have more meat to their bones; but I can perfectly see myself come back here at some point, discover that this has been the one all along, and track down a 1980s copy with the vibrant old-school artwork. Wait and see.",
    "timestamp": 1752789600
  },
  {
    "username": "EconSean",
    "rating": 5.0,
    "comment": "Boils down to a bit of a logic puzzle where the whole table can just logic out how to properly zone the hiding player. Ok as a one time experience.",
    "timestamp": 1750111200
  },
  {
    "username": "Sawney",
    "rating": 5.0,
    "comment": "Underrated old game.",
    "timestamp": 1747605600
  },
  {
    "username": "Noe_sonrisa",
    "rating": 5.0,
    "comment": "- language independent",
    "timestamp": 1747605600
  },
  {
    "username": "BitterLemonCurry",
    "rating": 5.0,
    "comment": "the Wicked Stepmother of all cooperative games is basically a 2p game between Mr X and the Alpha Guy of the detectives.",
    "timestamp": 1741561200
  },
  {
    "username": "yiechow",
    "rating": 5.0,
    "comment": "经典兵抓贼游戏。",
    "timestamp": 1740351600
  },
  {
    "username": "Y_OChan",
    "rating": 5.0,
    "comment": "MT",
    "timestamp": 1739746800
  },
  {
    "username": "Troelshadberg",
    "rating": 5.0,
    "comment": "Another childhood favorite. My kids never play it though.",
    "timestamp": 1739574000
  },
  {
    "username": "Nonoku",
    "rating": 5.0,
    "comment": "2-6 B: 2,5\nW: 1.95\n\nPros\n-Simple\n-Easy setup\n\nCons\n-Goofy visor hat that your friends will make fun of you for\n-Frustrating for the people looking for Mr. X, mostly just guessing and checking\n-Boring\n\nScotland Yard is frustrating and boring to play, especially for the ones looking for Mr. X. All you do is guess where they went and hope it's right. The limited transportation pieces doesn't help either. At least Mr. X is kind of fun.",
    "timestamp": 1737414000
  },
  {
    "username": "dshortdesign",
    "rating": 5.0,
    "comment": "Rating History:\n< 1.5.11 = NR",
    "timestamp": 1736290800
  },
  {
    "username": "krit1789",
    "rating": 4.6,
    "comment": "Deduction. Point to point movement. One versus many. It would be slightly better as a two-player game.",
    "timestamp": 1732143600
  },
  {
    "username": "Katabrok",
    "rating": 5.0,
    "comment": "Played more times and played as Mister X. I would say this game has not aged very well. Too much luck involved in the beggining of the game, no mini-map to avoid Mister X glance at the map, confusing numbering and lines for moviment. Also, it takes too long if Mister X plays well and, depending, the players can drop out because it is nearly impossible to catch Mister X if you spent some of the tokens.",
    "timestamp": 1726264800
  },
  {
    "username": "BHunkin",
    "rating": 5.0,
    "comment": "Bought to play with 8yo.",
    "timestamp": 1714082400
  },
  {
    "username": "Rik Thorpe",
    "rating": 5.0,
    "comment": "One player takes on the role of a master criminal who moves around the board in secret. The detectives cooperate to find them. The base game is great, tense fun for the criminal - but random tedium for everyone else. The game is improved with a few house rules. Advanced rules are also available online.",
    "timestamp": 1712872800
  },
  {
    "username": "LadylexUK",
    "rating": 5.0,
    "comment": "Only played so far as a 2 player game. Played on both sides. Did not enjoy playing as the chaser or chased player. My husband on the other hand enjoyed it as he won both times. I think this might be marmite.",
    "timestamp": 1712527200
  },
  {
    "username": "Dj4eN",
    "rating": 5.0,
    "comment": "60 3p 4p 5p",
    "timestamp": 1712181600
  },
  {
    "username": "hall0n",
    "rating": 6.0,
    "comment": "It's not bad, but not that amazing either. Works well for a game of it's age. I might revisit the rating after I get to play it with non-gamers. (12.10.16)\n\nAt some point in history, I sold my 1986 Ravesburger Nordic Edition in what can only be described as a temporary mental disturbance (what was I thinking?). Now I am a proud owner of the 1996 Ravensburger Nordic Edition. Can't wait to play it with my kids! (20.10.2025)",
    "timestamp": 1760911200
  },
  {
    "username": "StupidRatCreature",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1760565600
  },
  {
    "username": "vladdie",
    "rating": 6.0,
    "comment": "It's fun if you are with 4 players chasing after Mr X. Otherwise, it's to difficult to capture Mr X.",
    "timestamp": 1759615200
  },
  {
    "username": "JonasBang",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1759615200
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Cooperative Game / Team Game\n\nMy first Euro, from before I knew what Euros were. A lot of fun then, but not a lot going on beyond deep deductive thought. That's still perfectly alright with me, tho'.",
    "timestamp": 1759442400
  },
  {
    "username": "achkomm",
    "rating": 6.0,
    "comment": "Peter und Monika",
    "timestamp": 1759269600
  },
  {
    "username": "egrek",
    "rating": 6.0,
    "comment": "Wanted a 'letters from whitechapel' without the adult connotations. This is nearly it. Hidden move game with limited resources.",
    "timestamp": 1758319200
  },
  {
    "username": "Alaena",
    "rating": 6.0,
    "comment": "I've only played this on the app. I enjoy it. I would want the physical version for myself, but it's kind of big. Maybe for Peter.",
    "timestamp": 1758232800
  },
  {
    "username": "Khumbanigash",
    "rating": 5.5,
    "comment": "Not a fan, but the kids like it. Although they cheat and I don't want to play with them anymore for this reason... *sigh*",
    "timestamp": 1757023200
  },
  {
    "username": "Kubidi",
    "rating": 6.0,
    "comment": "Players: 02 - 06\nBest: 02 - 05",
    "timestamp": 1756072800
  },
  {
    "username": "Alfasto_Barker",
    "rating": 6.0,
    "comment": "Even an average Mr X can never be caught",
    "timestamp": 1755554400
  },
  {
    "username": "Food_Please",
    "rating": 6.0,
    "comment": "Can be a good tense game, just sometimes you're out of position and can't do much.",
    "timestamp": 1755295200
  },
  {
    "username": "chadgibbons",
    "rating": 6.0,
    "comment": "Walls Storage",
    "timestamp": 1753394400
  },
  {
    "username": "Regai",
    "rating": 6.0,
    "comment": "Best with the maximum number of players and a very cunning Mr. X. Game drops considerably if the player playing Mr. X isn't good or you have only three players.",
    "timestamp": 1749938400
  },
  {
    "username": "Biswut",
    "rating": 6.0,
    "comment": "G103",
    "timestamp": 1748901600
  },
  {
    "username": "Xantiriad",
    "rating": 6.0,
    "comment": "charity shop",
    "timestamp": 1748296800
  },
  {
    "username": "WhiteSeal",
    "rating": 6.0,
    "comment": "2-6 spelers (best 2, 5)\n10+",
    "timestamp": 1746828000
  },
  {
    "username": "Deakin_MacLean",
    "rating": 6.0,
    "comment": "Sold to Brightlight 2024",
    "timestamp": 1746223200
  },
  {
    "username": "MatroidX",
    "rating": 6.0,
    "comment": "Maybe I played with too few players as a kid (or was taught the rules wrong?), but I remember it being far too easy for player X to escape (i.e. game balance fails for low parts of the player range). Maybe I should retry this as an adult...",
    "timestamp": 1746136800
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "With its asymmetrical task, the need for all detectives to cooperate and the intensive communication that comes with it, the high level of tension that arises during game, as well as rules that are very easy to explain and learn and a pleasant playing time of 45 minutes, Scotland Yard has all the right qualities that make it a long-seller.\n\nAnd it absolutely is an evergreen, which can be seen from the fact that it has remained in the program to this day. The rules of the game were never changed, but they didn't need to be. A really good family game, I think.",
    "timestamp": 1745618400
  },
  {
    "username": "Viziviz",
    "rating": 7.0,
    "comment": "Classic in my childhood. Bought it again and tried it with my children 8+ and it still works! Deduction game, cooperative vs Mister x and my kids like it.",
    "timestamp": 1760824800
  },
  {
    "username": "Fiskedrang",
    "rating": 7.0,
    "comment": "180",
    "timestamp": 1760479200
  },
  {
    "username": "Sondari_Wobble",
    "rating": 7.0,
    "comment": "2-6 spillere",
    "timestamp": 1760220000
  },
  {
    "username": "pavin",
    "rating": 7.1,
    "comment": "Version classique de mon enfance. Très bon état, il manque qu'un seul ticket Taxi, mais qui n'empêche vraiment pas d'y jouer. L'édition Sherlock Holmes l'a remplacé",
    "timestamp": 1760133600
  },
  {
    "username": "kapikui",
    "rating": 7.0,
    "comment": "I got rid of this when I was younger because I didn't have anyone to play it with. I should have kept it. It's a fun game.",
    "timestamp": 1759615200
  },
  {
    "username": "Lendengold",
    "rating": 7.0,
    "comment": "Gereon\n(geschenkt von Mama + Papa)",
    "timestamp": 1759528800
  },
  {
    "username": "thepinch",
    "rating": 7.0,
    "comment": "For Kedem",
    "timestamp": 1759356000
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 4005556011582\nGL2",
    "timestamp": 1757368800
  },
  {
    "username": "bnordeng",
    "rating": 7.0,
    "comment": "I have fond memories of playing this game as a kid. And, many years ago, I programmed this game in PASCAL on an old IBM with the entire map in color and a nice interface of selecting tickets. The computer won a good percentage of the time as the detectives, but I never did iron out the AI for the computer as Mr. X.",
    "timestamp": 1755900000
  },
  {
    "username": "Krautkopf",
    "rating": 7.0,
    "comment": "3-6[2-6;...]",
    "timestamp": 1753308000
  },
  {
    "username": "Tob1One",
    "rating": 7.5,
    "comment": "Plusy:\n+ dobrze działająca mechanika 1 vs wszyscy\n+ mapa Londynu\n+ emocje podczas łapania lub ucieczki\n\nMinusy:\n- jeżeli czysto matematycznie podejdziesz do gry, Mister X zawsze ucieknie\n\nPodsumowanie:\n1 vs wszyscy w najprostszym wydaniu. Nie ma wielu zasada, ale dostarcza wiele emocji- zwłaszcza uciekającemu.",
    "timestamp": 1760306400
  },
  {
    "username": "caltexn",
    "rating": 8.0,
    "comment": "No luck in this game! You will sweat it out as the fugitive. Fun with a group, although multi-players are not needed. A little aggravation trying to hide one's designs as the fugitive can be overcome by wearing sunglasses. Does not come out nearly like it used to years ago.",
    "timestamp": 1759096800
  },
  {
    "username": "Board22gamer22",
    "rating": 7.5,
    "comment": "Bought flea Market May 2025",
    "timestamp": 1757800800
  },
  {
    "username": "johnjihoonchang",
    "rating": 8.0,
    "comment": "A classic hidden movement game that does have some creaky joints because of some of the movement limitations, but it's so simple it's easy to figure out how to play and while it's not for everyone, it's going over pretty well so far with a wide variety of players and it's so fast and easy for its genre (and doesn't have real-life murder themes) that it will probably remain in my collection for a while.",
    "timestamp": 1757628000
  },
  {
    "username": "jodokast4",
    "rating": 7.7,
    "comment": "Great deduction/hidden movement game. Very hard to win as Mr X",
    "timestamp": 1755208800
  },
  {
    "username": "Lusorculus",
    "rating": 8.0,
    "comment": "Revisiting SY as an adult for the first time I discovered it's actually a darn good and timeless game that was ahead of its time.\n\nWith its simple and clean rules and decently controlled playtime (60-120 min) the design bears resemblance to nineties' and early noughts' german game design.\n\nIt's a tense game that asks you to make agonizing choices as Mr. X could get slip through and get away if you make the wrong choice.\n\nExcited to play and discover more of the London map but also spinoffs.",
    "timestamp": 1753653600
  },
  {
    "username": "Vivelee",
    "rating": 8.0,
    "comment": "As a small group party game, it's awesome. You divide into 2 teams: 1 theif and policemen (2-5 people). Then the policemen have to find the thief by analyzing the potential paths. There are some hints, so the better the cooperation is (& analyzing) the higher chance to win the game by them.\nI had it from years, and now revisited it to finally notice the potential. Highly recommended",
    "timestamp": 1752962400
  },
  {
    "username": "Twtd",
    "rating": 8.0,
    "comment": "Organisert",
    "timestamp": 1752789600
  },
  {
    "username": "dlinton",
    "rating": 7.5,
    "comment": "1.94 weight",
    "timestamp": 1750629600
  },
  {
    "username": "steinsucherin",
    "rating": 8.0,
    "comment": "Deduktion, Hendrik, 2-6 Personen",
    "timestamp": 1749592800
  },
  {
    "username": "uwe_sauerland",
    "rating": 9.0,
    "comment": "SdJ 1983",
    "timestamp": 1760047200
  },
  {
    "username": "OGRussHood",
    "rating": 9.2,
    "comment": "My 2025 Top 250: #217\nMy 2024 Top 250: #198\nMy 2023 Top 250: #213",
    "timestamp": 1758492000
  },
  {
    "username": "chloropfyl",
    "rating": 8.5,
    "comment": "Box top has wear from age and use, but the components are still very good. Comes with the crappy paper visor and not the cool hat.",
    "timestamp": 1758232800
  },
  {
    "username": "flyingdutchmanz",
    "rating": 8.5,
    "comment": "2020",
    "timestamp": 1748815200
  },
  {
    "username": "BGMarc",
    "rating": 8.5,
    "comment": "It was always funny to see in the detectives faces when Mr. X appaered. A classic everybody should have played.",
    "timestamp": 1745618400
  },
  {
    "username": "downstream",
    "rating": 8.5,
    "comment": "I have had a lot of fun with this game over the years. I've had difficulty capturing my opponent when they play as Mr X, but superior skills at keeping track of game information and reading my facial expressions led them to capture me several times! Considering that it was found for only $2, this is probably the most fun per dollar of any game in my collection!\n\n* J learned this, likes it",
    "timestamp": 1742166000
  },
  {
    "username": "magikoslo",
    "rating": 9.0,
    "comment": "2-6 (2,5)",
    "timestamp": 1741388400
  },
  {
    "username": "PlaysMali",
    "rating": 9.0,
    "comment": "Easy game für große gruppe gedacht in 2.min gelernt",
    "timestamp": 1739228400
  },
  {
    "username": "RaistlinMajere",
    "rating": 9.0,
    "comment": "I remember when I first played it at a school friend's house: it impressed me enormously and we played it for years. Still today, in my opinion, it is a masterpiece of originality and mechanics combined together.\n\nOver time I purchased other titles on the generis, looking for any improvement on this little gem, but to this day it remains unbeatable for me. I own Fury of Dracula (1st & 2nd Editions), Letters from Whitechapel and Whitehall, but none of these reaches in my opinion the finesse of Scotland Yard.\n\nDespite its age and the fact that it was the first, Scotland Yard retains all its charm thanks to a simple, streamlined, fast-paced, never clunky game system that makes it suitable for anyone.",
    "timestamp": 1715896800
  },
  {
    "username": "cidaris",
    "rating": 9.0,
    "comment": "If you like strategies, this game is for you. Its a semi-co op game 1 against all , and it really requires pondering))",
    "timestamp": 1711839600
  },
  {
    "username": "kplayer1177",
    "rating": 10.0,
    "comment": "One of my childhood games :-)\nWe loved to play it back then.",
    "timestamp": 1751407200
  },
  {
    "username": "Polarbjoern",
    "rating": 10.0,
    "comment": "unique game, great design",
    "timestamp": 1748210400
  },
  {
    "username": "kingslayer007",
    "rating": 10.0,
    "comment": "One of my favorites!",
    "timestamp": 1717020000
  },
  {
    "username": "Katanalx",
    "rating": 10.0,
    "comment": "Since I'm a teenager I love this game... And being Mister X is one of the best experiences you can have. Also, it was the first asynchronous game I played.",
    "timestamp": 1712527200
  },
  {
    "username": "DiceEnthusiast",
    "rating": 10.0,
    "comment": "This one has a special place in my heart and I have to personally rate this a 10. Still playing 40 years later. First got this as young kid in the 80's and would beg my family to play with me. My wife got me the new version a few years ago and I got to introduce it to my own family now. Still just as fun with a combo of co-op deductive reasoning and teamwork chasing one player on their own as \"MR X\".\n\nOther families with kids I have introduced this to have also enjoyed it and asked where they can buy it. A not well known but easy-to-teach family game where everyone will be asking if they can be Mr X next.",
    "timestamp": 1704841200
  },
  {
    "username": "captrayneway",
    "rating": 10.0,
    "comment": "It is my Dad's games. I love it and remember playing it as I grew up. I would love to play it again and get ,y own copy of it.",
    "timestamp": 1691791200
  },
  {
    "username": "Rismosch",
    "rating": 10.0,
    "comment": "One hidden player trying to run away while the others try to catch them.\n\nAs the hunter it's great fun to try to piece together the limited information you got, to circle the hidden player.\n\nAs the hunted it's great fun to find the most optimal move, such that you are always one step ahead of the other players.\n\nQuite fun problem solving indeed.",
    "timestamp": 1689804000
  },
  {
    "username": "toomanyminis",
    "rating": 10.0,
    "comment": "THRIFT",
    "timestamp": 1684274400
  },
  {
    "username": "muppetmaster",
    "rating": 10.0,
    "comment": "6 graczy",
    "timestamp": 1676674800
  },
  {
    "username": "me_m",
    "rating": 10.0,
    "comment": "both competition and cooperation experience at the same round. love it.",
    "timestamp": 1654466400
  }
]