[
  {
    "username": "dwelch",
    "rating": 1.0,
    "comment": "The rules to this game are pretty bad. I do not recommend it.",
    "timestamp": 1177711200
  },
  {
    "username": "Bluestew0",
    "rating": 1.0,
    "comment": "I found this game to be horribly broken. I understand that post published rules errata has been released but as published, this is a terrible game. The rules are horrendously written for as few as there are. You'd have to play it to see all the strategies that one can use to break the game. There are too many for me to list.",
    "timestamp": 1177711200
  },
  {
    "username": "ExcitingJeff",
    "rating": 2.0,
    "comment": "One of the worst games I've played in a while, by far. I can't remember the last time I just wanted to shout \"WHY IS THIS GAME SO BORNING?\" This game made me want to do it every 30 seconds or so.\n\nThe first big problem is the downtime. I lost track of time and space while playing, but I have to assume it's about 4 hours between each of your turns.\n\nThere's only one \"currency\" in the game, spaces, and it's the only thing that matters. It determines VPs, money, and simple board control, so the rich constantly get richer.\n\nThe placement mechanic can easily leave one player just limping along for hours.\n\nThe castles are pretty, but why they are limited is a complete mystery to me.\n\nHave I mentioned this game is long? Holy shit, the \"2 hour short game\" took at least 5 hours, and we had to call it after turn 6.\n\nThis game is absolutely the worst thing since 1870. And it's worse than that, because there's a clever, if overlong, design under 1870.",
    "timestamp": 1399154400
  },
  {
    "username": "paulclarke339",
    "rating": 2.0,
    "comment": "Basically another Risk like game, only longer and with a few bells and whistles.",
    "timestamp": 1304805600
  },
  {
    "username": "Stormparkiet",
    "rating": 3.0,
    "comment": "I think this game is if not broken, at least flawed. Too luck-dependant.",
    "timestamp": 1217887200
  },
  {
    "username": "nicola74",
    "rating": 4.0,
    "comment": "Italian version",
    "timestamp": 1619733600
  },
  {
    "username": "f_campeau",
    "rating": 4.0,
    "comment": "A bit deceiving...",
    "timestamp": 1332630000
  },
  {
    "username": "Yttrenolv",
    "rating": 4.5,
    "comment": "Not terribly bad but nothing too fancy either. Old fashioned game, feels unfinished.",
    "timestamp": 1585519200
  },
  {
    "username": "Demetrius the First",
    "rating": 5.0,
    "comment": "Decent light wargame with some basic historical feel to it (almost exclusively stemming from the events). The weakest part is the battle system based on a six-sided dice and randomly purchased battle cards, which naturally produces extremely random results. Using a four-sided dice and house rules limiting the number of cards available for purchase each turn markedly improve the game.",
    "timestamp": 1580338800
  },
  {
    "username": "Drakonio",
    "rating": 5.0,
    "comment": "25",
    "timestamp": 1512428400
  },
  {
    "username": "dancingdanslc",
    "rating": 5.0,
    "comment": "DIGITAL PLAY:\n\niPad Air\nFun game, cards, dice and a spinner. Light war game.\nI had the digital version and stopped working.\nI don't think it is a good enough game to acquire a physical version.",
    "timestamp": 1490482800
  },
  {
    "username": "rozmiarek",
    "rating": 6.0,
    "comment": "Extremely random game where your victory or loss is determined by the sheer luck. You have no idea what kind of cards you will draw this round, you can't predict the result of dice roll, you never know what events will occur and where you will be placed in a turn order (which by the way is the greatest flaw of the game IMHO). It's okay with a right group, it can be played in 3h (shorter scenario) and comes with quite cool components and insert that do not feel like they were designed almost 30 years ago. Overall very chaotic but also moderately fun boardgame that reminds me of Boże Igrzysko, Sitch Revolution and La Belle Epoque.",
    "timestamp": 1749247200
  },
  {
    "username": "SpoolerMonkey",
    "rating": 6.0,
    "comment": "Decent multi player light wargame/euro mix with more players improving the game rather than using the non player sides. Fantastic pieces for the castles, cards and map artwork also good. Rules need a bit of study and a bit of reading up on FAQ is required. Lots of bash the leader fun.",
    "timestamp": 1713477600
  },
  {
    "username": "szurla",
    "rating": 6.0,
    "comment": "A3",
    "timestamp": 1663797600
  },
  {
    "username": "djsanz",
    "rating": 6.0,
    "comment": "Ameritrash 4-5. Guerra 100 años. Desarrollo.",
    "timestamp": 1589493600
  },
  {
    "username": "Harae",
    "rating": 7.0,
    "comment": "Good: 100 years war - Strategic - Easy\n\nA very decent try on an incredibly interesting topic. There are virtually no other games on this topic.\nGood alternative to risk or similar games.",
    "timestamp": 1689544800
  },
  {
    "username": "sbconstant",
    "rating": 7.0,
    "comment": "Apart from Joan of Arc unlikely to have an impact on the game, especially in her inimitable way, a fine light multiplayer wargame.\n\nThe diplomatic rules are vague, presenting some limits (or no limits) depending on how you read them, but otherwise the rules were clear to us.\n\nI might tinker with some things--like the maximum cards someone can buy/have in their hand, the income generated by fortresses, and the lack of color and prominence in each faction's heroes, but still a fine, abstract look at the time with lots of fun events and chances for war and diplomacy.",
    "timestamp": 1686261600
  },
  {
    "username": "Thasaidon",
    "rating": 8.0,
    "comment": "3-6p 150' - Rather simple game (not really wargame) on the hundred's year war, with nice map and simply gorgeous components.\nReally playable.",
    "timestamp": 1680732000
  },
  {
    "username": "Piper 2009",
    "rating": 8.0,
    "comment": "Great game, the cards are awesome. It's fun, exciting and cool.",
    "timestamp": 1387062000
  },
  {
    "username": "zambodam",
    "rating": 9.0,
    "comment": "Very good multi-player game. The cards make you strong or weak.",
    "timestamp": 1210543200
  },
  {
    "username": "pmboos",
    "rating": 9.0,
    "comment": "After several plays, I still feel this is an outstanding game representing the 100 years war.. All of the important types of factors of the period are introduced via some luck elements. I find the artwork and bits fantastic... A fairly meaty wargame/eurogame cross. Vivre la France!",
    "timestamp": 1209333600
  },
  {
    "username": "CalmDragon",
    "rating": 10.0,
    "comment": "Groups favorite game. After twenty years, still argue about the rules. Seems different english boxed versions have slightly different rules in them. Optional rules add to the fun. Six players most fun. Eliminated players come back next turn. Consider bidding for turn order with left over prestige.",
    "timestamp": 1631224800
  },
  {
    "username": "Crockerdile",
    "rating": 10.0,
    "comment": "Somebody has to give this a 10. What can I say...I love French designed games (because there is always a chaos element, seemingly). Sure there are some rule vagueries, but you settle them before the game. I \"pimped up\" my copy by mounting the thin counters to plastic tokens. The rest of the game needed no sprucing up...it's gorgeous. Have played twice with 4 players and once with five. No one was dissapointed. I highly recomend picking this one up while the price is still reasonable.",
    "timestamp": 1193090400
  }
]