[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "A decent game, reminds me a lot of Knizia's Gold Rush, just more control. Not sure if that's a good thing though. It's a similar choice of declaring your scoring too early or too late, but it's way more complex with adding rows and columns, so even if one sum sucks you could get paid by the other. The negative points are very funny, but soon that laughter fades away to pure logic as you count up the totals. And multiply them! It feels like the opposite of some of Knizia's games where the player-driven situation turns out to be funny, but here it's merely the presence of negative VPs which gets old super fast.\n\nThat's not entirely a bad thing, but less exciting (more euro) than the pure speculation of Gold Rush. And the payouts don't divide in this game, so it's much less dramatic, more static, more friendly. I guess this one is more controlled, you can choose exactly when you want to score, gotta make sure the left-hand opponent doesn't take advantage of that... but I liked the uncertainty of the older game more. So this one is a stiff VP salad, but I can (barely) appreciate it because it allows players to actually be mean to each other. As long as they don't have too much fun, there's calculations waiting at home!",
    "timestamp": 1739142000
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Słabe",
    "timestamp": 1628373600
  },
  {
    "username": "WinMem",
    "rating": 3.0,
    "comment": "Earlier \"Kingdoms\"",
    "timestamp": 1729720800
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "This proofs that Dr. Knizia has also developed less good games. It's a nice low stress competition where everything revolves around scoring points. The theme is extremely weak even by the standards of Euro-games and it's excessively tedious to calculate points.",
    "timestamp": 1752530400
  },
  {
    "username": "Plargyplop",
    "rating": 5.0,
    "comment": "Dull.",
    "timestamp": 1744408800
  },
  {
    "username": "edosan",
    "rating": 5.0,
    "comment": "An interesting light yet \"math-y\" game. For me this is the best example of a Knizia style of game -- it's a very simple concept that is on the surface so simple that you wonder if you're missing something but after a few plays makes you appreciate it more and more.",
    "timestamp": 1721599200
  },
  {
    "username": "spelledaren",
    "rating": 6.0,
    "comment": "20ish plays. Kingdoms.",
    "timestamp": 1759874400
  },
  {
    "username": "Bragallot",
    "rating": 6.0,
    "comment": "This is a decent game for a quick teach and play. Not a huge fan of the counting but it is what it is. Definitely creates some tension about when that dragon is gonna come out. Also it's called KINGDOMS!",
    "timestamp": 1754517600
  },
  {
    "username": "Table43",
    "rating": 7.0,
    "comment": "It's back because I prefer this theme to space whales. This is fantasy tile placement accounting with a good dose of blocking and interaction, and I love it.",
    "timestamp": 1758405600
  },
  {
    "username": "dusteppe",
    "rating": 8.0,
    "comment": "A very simple tile laying came that can be explained in 5 minutes and played in half an hour, with agonising decisions from the get go and good tension throughou. The new Avalon Hill edition is fantastic and makes this game a pleasure to handle. I would have loved slightly thicker tiles and point tokens but I am quite happy that this game has now a cool psychedelic theme. Keeper.",
    "timestamp": 1760911200
  },
  {
    "username": "fourquartets",
    "rating": 9.0,
    "comment": "Auf Heller und Pfennig is in my top 10 games of all time. It's become my go to gateway game for new gamers. I love it so much that I bought myself this extra copy just to see what space whales might add to mix.",
    "timestamp": 1761030720
  },
  {
    "username": "fourquartets",
    "rating": 10.0,
    "comment": "Notes:\nSimply brilliant. One of my all time hidden gem finds. I love this original edition, I just wish the box wasn't so massive! May be surpassing Battle Line as my all time fav Knizia. So, so good for new board gamers. I've not had this one not hit. Tense, mean, brutal, wonderful...[SF]",
    "timestamp": 1758924000
  }
]