[
  {
    "username": "Michael Ward",
    "rating": 1.0,
    "comment": "07/29/03 Played one (thankfully) partial game. Overly complex for a supposed light card game. Hated it. Hope to never see it again. In general I dislike anything I've ever played by Alan Moon.",
    "timestamp": 1255557600
  },
  {
    "username": "Euroman",
    "rating": 2.0,
    "comment": "Disappointing as to how little you can actually do in this card game version of Elfenland. Probably the only game from Alan Moon I do not like. Play Elfenland instead!\nEdit: Played Mush - hated it.\nEven worse than this.",
    "timestamp": 1711234800
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "Do you want Elfenland without a board, where you restart from home every round and travel clockwise through opponents’ kingdoms? Do you like the idea of removing the planning/token phase (and have a free choice of movement cards) but being able to modify the contents of your bits of the conveyor belt’s rondelle and do a bit of take that on the opponent's bits? For a reasonable chunk of people, the answer will be \"yes\". For me, the planning phase of Elfenland was *the point* (the rest is optimisation), so a lot of the interest is lost. I also generally feel like Elfenland drew a lot of its drive from the artwork of Doris Matthaüs’, which there is simply less of here.",
    "timestamp": 1759528800
  },
  {
    "username": "flapjackmachine",
    "rating": 4.0,
    "comment": "Great components. Although game was published when development wasn't completed. Serious problems with the mechanics and not corrected in the rulebook (ie. running out of hand cards and no village in realm, etc..).",
    "timestamp": 1724191200
  },
  {
    "username": "vacuumdude",
    "rating": 5.0,
    "comment": "Before he designed the ubiquitous Ticket to Ride, Alan Moon's biggest hit was Elfenland, itself a streamlined version of his earlier Elfenroads. I've never played either of these games, but I do own King of the Elves, Elfenland's nearly forgotten card game adaptation.\n\nIt's kind of a route planning game, but with cards. Players are trying to travel to as many villages (both in their own and other players' \"realms\") as possible using various means of transportation while they try to slow down or stop each other using cleverly placed obstacles. Since most of the obstacles affect everyone, including the player who played them, there's quite a lot of mindgames and lateral thinking involved.\n\nThis is pretty cool, but the game has one fatal flaw: All of the villages, transportation means, obstacles and etc are represented by cards and all of those cards are shuffled into 1 big common deck that everyone draws from. Combined with \"mitigation\" mechanics that are perfunctory at best, that means it's ridiculously easy to get completely screwed by a useless hand, making it more of an exercise in frustration than anything. Goes to show that \"streamlining\" can backfire really hard if approached wrongly.",
    "timestamp": 1741820400
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "A rather overly complicated and poor re-hash of Elfenland in card form.",
    "timestamp": 1731366000
  },
  {
    "username": "stofke",
    "rating": 6.0,
    "comment": "R019",
    "timestamp": 1758492000
  },
  {
    "username": "NormandyWept",
    "rating": 6.0,
    "comment": "I like what KotE does with remixing the original Elfenland: simplifying the terrain types into the locations really did make it feel more focused on journey planning, and I also liked how much attention you're constantly paying to what is in front of other players.\n\nAs with Elfenland, the game is fully illustrated by the brilliant Doris Matthaus, a major draw of the game.\n\nThe game is probably a bit long with 5 or 6 players (as the rulebook gets close to admitting when it makes 6 players the only count where you don't play one round per player), but that's easily house ruled.",
    "timestamp": 1757800800
  },
  {
    "username": "guimel",
    "rating": 7.0,
    "comment": "Not for trade currently. Suitable for 2 players. 60 mins play. Light game. Stand alone card game in Elves theme. Lovely Alan Moon game. 2000 Fairplay À la carte Runner-up. Fab artwork. Not played for a some time. Need to play again.",
    "timestamp": 1753740000
  },
  {
    "username": "midnightfaerie",
    "rating": 8.0,
    "comment": "2025",
    "timestamp": 1752962400
  },
  {
    "username": "D0NK1J0T3",
    "rating": 9.0,
    "comment": "Play with my tested optionals rules http://tinyurl.com/ov5be\n\n\n**[Español** Juega con mis reglas opcionales testeadas http://tinyurl.com/qykv7",
    "timestamp": 1351897200
  },
  {
    "username": "gkdrone",
    "rating": 10.0,
    "comment": "King of the Elves is an excellent example of how a card game can be just as satisfying as a boardgame. It's has light mechanics, but meaty strategy. Good girlfriend/wife game. Beautiful art and production.",
    "timestamp": 1024437600
  }
]