[
  {
    "username": "whac3",
    "rating": 1.0,
    "comment": "If you like \"Please, please, shoot me\" moments, this is the game for you!",
    "timestamp": 1195599600
  },
  {
    "username": "dogzard",
    "rating": 2.0,
    "comment": "Probably the weakest of any of Mr Knizia's offerings. The theme is not pasted on, but held in place by scotch tape. All math, no relationship. Given away due to an unexpected move.\nGood riddance.",
    "timestamp": 1541372400
  },
  {
    "username": "lmnop",
    "rating": 3.0,
    "comment": "You know all of the complaints about Knizia games and pasted-on themes? Well this is the worst offender right here. It's okay, but I'd rather play something else.",
    "timestamp": 1313877600
  },
  {
    "username": "maddiedogson",
    "rating": 4.0,
    "comment": "3000",
    "timestamp": 1662588000
  },
  {
    "username": "zackdale",
    "rating": 5.0,
    "comment": "Horrible theme, fun little bidding game. If you can pick it up cheap do so!",
    "timestamp": 1709506800
  },
  {
    "username": "Staban Tuek",
    "rating": 5.0,
    "comment": "THRIFT",
    "timestamp": 1666476000
  },
  {
    "username": "Rygel",
    "rating": 6.0,
    "comment": "Fun little bidding game for weird set collection.\n\nGot in 2007",
    "timestamp": 1731452400
  },
  {
    "username": "vejrum",
    "rating": 6.0,
    "comment": "Good, Reiner Knizia trick-taking card game where you try to balance \"winning\" blue and \"loosing\" red tokens which cancels each other out. Fun theme and artwork - the old Relationship Tightrope version is much more fun than the new boring Yin Yang version.",
    "timestamp": 1724450400
  },
  {
    "username": "silenceisgolder",
    "rating": 7.0,
    "comment": "This was fun, but maybe a bit long for the randomness. 5 player worked great except for the extra round it added! I like this kind of game...a little bit of hand management, you can concoct some schemes and try to execute them. It feels good when it's going well and doesn't feel too bad when it's falling apart. The art is bad enough though that I wouldn't want to play it with most groups, which knocks the whole package down a peg.",
    "timestamp": 1757887200
  },
  {
    "username": "HolographicZoo",
    "rating": 7.5,
    "comment": "The good doctor with his devious card game ways. Very clever and very simple with lots to think about.",
    "timestamp": 1760479200
  },
  {
    "username": "chiefsachem",
    "rating": 9.0,
    "comment": "This was a lovely game once you caught the rhythm of picking and discarding the colored sticks to your advantage. It's all about hand management and knowing when to play you best cards (the lowest and the highest) in minimizing the penalties of winning tricks. The simultaneous revealing of cards variant plays incredibly fast and is more fun IMO.",
    "timestamp": 1473631200
  },
  {
    "username": "RobW5",
    "rating": 10.0,
    "comment": "No Thanks\nIto\nThe Mind Soulmates\nFTW\nKobayakawa",
    "timestamp": 1735167600
  }
]