[
  {
    "username": "MN7z",
    "rating": 1.0,
    "comment": "This game is straight up garbage.\nChess is garbage. It has no real theme, no depth of story, nothing that's visually pleasing to look at, it's limited to exactly two players, it feels really slow and can end up in a pointless dead-end where none of the players can win, and it's designed in a way where the most experienced player will win more or less Every. Single. Time. It's a game of experience and pattern recognition that strongly benefits those who've spent the most time learning every move. If you've played it more than your opponent has, you probably win, and losing in a game of chess feels painfully boring. That's a reeeeally poor concept of a game!\n\nThere's no reason for anyone to play chess still in this day and age where there's literally THOUSANDS of better games, the only ones who actually finds chess interesting to play are:\n\nA. Those playing chess for nostalgic reasons. They played it as a kid because our parents and grandparents tricked us in to playing it.\n\nB. Those who are desperate to join the large chess community for their own social needs. Chess have fooled millions and millions of ordinary people to play the game, making it a massive community that's quite appealing to become a part of. You wouldn't ever even consider playing chess if there were eight active players worldwide and if chess had the same level of publicity as my grandmas interest in sudoku, let's be honest.\n\nC. It's one of the only board games you've heard of. You've heard of it a billion times with a million different references, because it has existed since the 1400's when they had no inspiration and no creativity in terms of creating a fun activity to enjoy in their spare time. This abomination was the result of that. And you fell in the trap of becoming invested in chess because of its undeserved status. It's an iconic board game for the sole reason that we had nothing to compete with it for a thousand terrible years.\n\nD. You (wrongfully) believe that playing and understanding chess is a sign of intelligence. This has been disproven countless of times and we now know that a person's intellectual level has little to barely any impact on your ability to play- and win a game of chess. A low intellectual with years of experience and who've learned most of the patterns and moves in chess will defeat an ultra-intellectual genius more or less every time in chess, if the genius have only played chess a few times. Chess is a sign of lacking character and not a sign of intelligence.\n\nE. You are generally fascinated by boring/uninteresting activities and your personality fits perfectly for a game of chess.\n\nF. All of the above.\n\nI want us all to join up and turn against this dreadfully dreary piece of trash and move on. We have over these last 20 years entered a revolutionary era of genuinely fun, interesting, well-made and meaningful board games that are brilliantly designed both thematically and in terms of gameplay, and these modern games needs to take over the spotlight from the old boring relics such as chess.",
    "timestamp": 1755468000
  },
  {
    "username": "darkfinale",
    "rating": 1.0,
    "comment": "Abstract strategy, not my type.",
    "timestamp": 1744495200
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I remember the moment I lost interest in this: me and a friend were playing it for fun, and then neither of us could move. We asked his dad, and he said it was a stalemate, nobody won. Well, never playing that again!\n\nIn hindsight, the pieces are made way too strong in this version, which ironically makes moving around the board difficult (because it's easy to defend and turtle). So there's more stalemates and standoffs compared to eastern versions of Chess. Not to mention the cultural heritage where it's THINKY AND QUIET instead of a rowdy street game, hrmm.",
    "timestamp": 1719698400
  },
  {
    "username": "TheGamersCollective",
    "rating": 1.0,
    "comment": "dont even!",
    "timestamp": 1706914800
  },
  {
    "username": "BrendansBoat",
    "rating": 1.0,
    "comment": "I hate chess. I have bad, bad memories of hours-long games with either a) sore losers who flipped the board or b) smug enthusiasts who destroyed me and made me feel stupid.\n\nI think it's because I'm a linear thinker, and after only a few moves the array of choices becomes overwhelming. Talk about analysis paralysis...but then I would always miss something screamingly obvious.\n\nUgh. I wish I could get back those wasted hours of tedium and frustration.",
    "timestamp": 1695592800
  },
  {
    "username": "lynx1998",
    "rating": 1.0,
    "comment": "Too boring for my Ameritrash tastes. I loathe 2-player abstracts. Chess has been solved by computers.",
    "timestamp": 1686348000
  },
  {
    "username": "andyofsweden",
    "rating": 1.0,
    "comment": "Fundamentally flawed from a game design perspective.",
    "timestamp": 1677538800
  },
  {
    "username": "janus23",
    "rating": 1.0,
    "comment": "Super boring, most overrated game of mankind.",
    "timestamp": 1676934000
  },
  {
    "username": "catosulla",
    "rating": 1.0,
    "comment": "I am finished with chess. The game is no longer the one I knew in my youth.\n\nI have a love/hate relationship with chess and right now:\n\nEnjoying it for the first time in 6 years. Plan to play at least one tournament this year.\n\nI used to play tournaments years ago, but have not done so since 1998. From about 1988-98 I played a lot of chess  Now, I'm on to other games, but I still play a game or two (mostly blitz) from time to time. Classic game which teaches so much in so little time. Since I've started recording games on the geek: 1660-1088=102.\n\n\nUpdate: finally played a tournament for the first time this year (2011) since 1998. Looking forward to getting back into competition. \n\nReturn to tournament play has been good although I did sink down in rating  but broke even for 2011 going +4-4=1 for the year. \n\n2012 has started out well but had a weak finish. So the year ended with me going +12-11=4 in tournament play. Cracked 1500 level for the first time rating wise!!!   Very happy about that! The year ended badly with two disastrous tournaments. I won only 1 game in my last 9   Hopefully 2013 will be better. \n\n2013 is off to a terrific start! I finished second in the 1400-1499 group in the U1700 section of the Land of the Sky XXVI tournament in Asheville, NC. I also finished second in the U1800 section for the Saturday morning blitz tournament. As a result, I now have my highest rating ever at 1516!  Finished the Pittsburgh Open with my new highest rating ever of 1589 and another tie for 2nd in my class. I didn't play another tournament this year but I did well and hope for some tournaments in 2014. So I finished 2013 +9-7=3.\n\nFirst tournament of 2016 was blitz tournament at the VA Closed. First play since 2013 resulted in a bad showing of 3/8.\nSo far for 2016 +3-5.",
    "timestamp": 1668898800
  },
  {
    "username": "molpau16",
    "rating": 1.0,
    "comment": "Nerd game, play it if you want to be called a dweeb.",
    "timestamp": 1656280800
  },
  {
    "username": "Jake4Prezident",
    "rating": 1.0,
    "comment": "No",
    "timestamp": 1654984800
  },
  {
    "username": "Pandorzecza",
    "rating": 1.0,
    "comment": "I po co to tu?",
    "timestamp": 1621893600
  },
  {
    "username": "Nenananas",
    "rating": 1.0,
    "comment": "Like:\n-Looks pretty cool, and is well known\n\nDislike:\n-The need to learn from others to become better at it\n-There are simpler abstract games (like Hive, which is also more portable)\n-You don't know if you made a good move or not, especially early in the game\n\nI never know what I'm doing when playing this game, but I also don't want to learn all the opening moves and counter moves. I hate when games do that. However, I don't think I would deny a game if someone wants to play it. They should know though they are going to win.\n\nIf chess would be released today, it would never have been as popular as it is today.",
    "timestamp": 1617660000
  },
  {
    "username": "DSAdixits",
    "rating": 1.0,
    "comment": "It's very clear this game was invented during a time in which recreational options were limited.",
    "timestamp": 1614034800
  },
  {
    "username": "DSAdigits",
    "rating": 1.0,
    "comment": "It's very clear this game was invented during a time in which recreational options were limited.",
    "timestamp": 1612738800
  },
  {
    "username": "Blacks85",
    "rating": 1.0,
    "comment": "Too many draws..",
    "timestamp": 1605999600
  },
  {
    "username": "GabrielHansberry",
    "rating": 1.0,
    "comment": "Defies description of a game! If you play this, you are definitely a filthy cylon and should be eliminated from society immediately!",
    "timestamp": 1572822000
  },
  {
    "username": "PYR8",
    "rating": 1.0,
    "comment": "So I finally agree to play your stupid abstract game and I battle and struggle and fight and I lose many playing pieces through the war but now I've wiped out your entire forces and household and only your king remains alive - and I have him surrounded by plenty of my remaining forces and household...and...and...and somehow you f###ing win because of some rule that lets you win if you can't move???? OF COURSE YOU CAN'T MOVE - I'VE JUST WIPED OUT EVERYONE BUT YOUR KING AND HAVE HIM SURROUNDED AND HE'S FINISHED...But nope.. you win...\n\nWTF???!!\n\nGTFO!!!!!!!!!!!!!!! and take your stupid game with you.\n\nAbstract = bullshit.",
    "timestamp": 1514329200
  },
  {
    "username": "dabneyhovse",
    "rating": 1.0,
    "comment": "One box, one bag",
    "timestamp": 1508536800
  },
  {
    "username": "critchjj",
    "rating": 1.0,
    "comment": "I just don't have the patience for this",
    "timestamp": 1486162800
  },
  {
    "username": "pablito76",
    "rating": 1.0,
    "comment": "Abstract, eternal, boring and computationally almost predictable. Its only positive feature is a set of rules which works well (not true for many modern boardgames...), but in 500 years you can do better.",
    "timestamp": 1415055600
  },
  {
    "username": "SilverDrake",
    "rating": 1.0,
    "comment": "never liked it. Boring game for boring people. lives in my basement.",
    "timestamp": 1353798000
  },
  {
    "username": "TheBigH",
    "rating": 1.0,
    "comment": "A game without a single redeeming feature.",
    "timestamp": 1347660000
  },
  {
    "username": "alfonzo54",
    "rating": 1.0,
    "comment": "I absolutely despise this game. I mean, mechanically there doesn't seem to be anything wrong with it (although I suppose it's potentially solvable with hypothetical computing breakthroughs) but I never get an ounce of enjoyment out of it. For me it's just an exercise in paranoia.",
    "timestamp": 1343253600
  },
  {
    "username": "gittes",
    "rating": 1.0,
    "comment": "I hate this game. There is no chance. It is often touted as the basis for strategy, like if you can't win this one then you're a bad strategist. I can win other games but not this one. I never win. I am the worst chess player I know. Objectively, it is a good game but I must give it a one on the principal that this game always pisses me off.",
    "timestamp": 1325718000
  },
  {
    "username": "avaia",
    "rating": 1.0,
    "comment": "The game I should love, but I have nothing good to say about. I don't want to put in the effort to play this well when I do. Unexplained hatred.",
    "timestamp": 1166482800
  },
  {
    "username": "Skeletor",
    "rating": 1.0,
    "comment": "I don't like thinking while playing, I like to talk. This really ruins the whole chess thing for me, besides I don't find thinking all that fun or I'd go to school more",
    "timestamp": 1110409200
  },
  {
    "username": "Jokin",
    "rating": 1.0,
    "comment": "The most boring and overrated game of mankind",
    "timestamp": 1108335600
  },
  {
    "username": "AmunPtah",
    "rating": 1.0,
    "comment": "Awful, boring, utter waste of time.",
    "timestamp": 1094680800
  },
  {
    "username": "Perdurab00",
    "rating": 1.0,
    "comment": "[Everyday fellow]: 'Hello. I love games, strategy games'\n\n[Cretin]: 'Oh, me too. Let's play chess. I'm in the local club, and normally play for money. My ranking is.. blah blah.. and my favourite opening is the Modified Schlapper-Kipper.. blah blah..'\n\n[Fellow]: 'Wait a mo... just loading my shotgun... now.. let me put this in yer mouth'\n\nChess is vaguely sinister - the black and white board and the ability to mate with horses reminds me of twisted masonic ceremonies. Yeah.. ask any Grandmaster....",
    "timestamp": 1078268400
  },
  {
    "username": "Hjallti",
    "rating": 1.0,
    "comment": "This game would be fine if there weren't done studies on opening, which people just try to know by heart.",
    "timestamp": 1078268400
  },
  {
    "username": "dean",
    "rating": 1.0,
    "comment": "Chess would be a good game if there wasn't so many bloody books and articles written about how to play! You can't just sit down with someone and play chess, 'cos chances are that they know a pile of 'opening gambits' and just thrash you at it. You can't beat them by being clever or witty, you need to read books about chess! Chess has ceased to be a game, it's just a contest about how much stuff you can remember about how to counter opening moves etc. If only none of the literature about chess exested, I would probably feel inclinded to rate is 7 or 8 out of 10.",
    "timestamp": 1074726000
  },
  {
    "username": "Kazoo412",
    "rating": 2.0,
    "comment": "This is very good games. If you have some practice, you can win the games.",
    "timestamp": 1744927200
  },
  {
    "username": "psrx",
    "rating": 2.0,
    "comment": "Not a fan of vanilla. Rule variants are playable as an amusing novelty.\nKeeping a set in the collection for historic value.\n\nStudying it has been a pastime of idle elites for centuries, but putting its historic clout aside, as a game, it's just horribly boring. Those who've spent time studying it tend to enjoy it, though this is primarily by trampling those who haven't.",
    "timestamp": 1737586800
  },
  {
    "username": "SeboEla",
    "rating": 2.0,
    "comment": "DB 2",
    "timestamp": 1729116000
  },
  {
    "username": "Quantum Djinn",
    "rating": 2.0,
    "comment": "I has a chess computer when I was little with 100 levels on it. I could not beat the machine on level 1",
    "timestamp": 1728338400
  },
  {
    "username": "gramsdad",
    "rating": 2.0,
    "comment": "I was playing chess with my friend and he said, \"lets make this interesting.\" So we stopped playing chess.",
    "timestamp": 1687903200
  },
  {
    "username": "Yokiboy",
    "rating": 2.0,
    "comment": "I find games where you can just move a piece back and forth over and over in order not to break up your perfect defensive position to be rather dull. Chess is a great game played against people of the same skill level, but it requires a lot of effort to become skilled at. It's just not for me.",
    "timestamp": 1678230000
  },
  {
    "username": "B_Moores",
    "rating": 2.0,
    "comment": "its a memory game, like snap",
    "timestamp": 1678057200
  },
  {
    "username": "AnJon",
    "rating": 2.0,
    "comment": "I tried to get into Chess very hard for years of my life, and I can only say I hate it. Moment to moment, chess is a dry husk of drawn-out movement or instant failure. It's a calculation slowly resolving down to a singular endpoint after discarding all the many used and useless variables irrelevant to victory across a barren wasteland devoid of passion or hope. You either lost before you started playing, or you won. Might as well not even play.",
    "timestamp": 1641164400
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "60 Min 2 Players p2 Weight: 3.69 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "cewbacca",
    "rating": 2.0,
    "comment": "There's no mitigation for skill in this, it's a game of pure skill which is awful. If I wanted a battle of skill in a game I would play a sport, this is not a sport. 2/10 I do not see the infatuation with this game at all.\n- No theme\n- Minis are mostly the same and all come painted anyway\n- No random events to make things exciting on future turns\n- Pieces are unbalanced\n- No catchup mechanic for losing",
    "timestamp": 1626386400
  },
  {
    "username": "Board_Silly",
    "rating": 2.0,
    "comment": "2",
    "timestamp": 1623016800
  },
  {
    "username": "Phenomona_Obscura",
    "rating": 2.0,
    "comment": "Trust me. You don't want to hear why I hate chess.",
    "timestamp": 1615071600
  },
  {
    "username": "FrogandGames",
    "rating": 2.0,
    "comment": "All my life I have been told I should like Chess. I have tried really hard to do so. I just hate it.\n\nTo be good you have to memorize stock moves from famous games and specific strategies. It just never appealed to me at all. Too static",
    "timestamp": 1607554800
  },
  {
    "username": "tinyclanger",
    "rating": 2.0,
    "comment": "It was entertaining enough as child, a puzzly game of tactical movement whilst occasionally trying to setup bluffs and counter assaults. Then my friends and I learnt about opening theory and canned responses. It took all the fun out of the game and turned it into an entirely different game of who could memorise the most board states. So chess is a game you can read books about instead of playing something that's genuinely entertaining. Boooooring.",
    "timestamp": 1596060000
  },
  {
    "username": "TrekScout",
    "rating": 2.0,
    "comment": "Physical, TTS",
    "timestamp": 1589493600
  },
  {
    "username": "ubirata",
    "rating": 2.0,
    "comment": "classic abstract game",
    "timestamp": 1587160800
  },
  {
    "username": "jasonlyle",
    "rating": 2.0,
    "comment": "Bad childhood memories.",
    "timestamp": 1583535600
  },
  {
    "username": "Drausqo",
    "rating": 2.0,
    "comment": "Robin’s Game",
    "timestamp": 1574377200
  },
  {
    "username": "Diabolik771",
    "rating": 2.0,
    "comment": "I suck at it. Too abstract for me. Give me tanks!",
    "timestamp": 1534111200
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "1\n\nMaybe I will teach it to my kids, but playing with an adult? No way. Sitting there and watch the other thinking about 5min for one move? No thanks.",
    "timestamp": 1532124000
  },
  {
    "username": "sigtaulefty",
    "rating": 2.4,
    "comment": "I appreciate the fact that it is a gaming masterpiece ... it's just an overall awful experience for me personally, probably because of who I play against. Wouldn't want to play a lower level player like myself - would rather play something else with that lower level player.\n\nBarely outrates Killer Bunnies.\n\nCongrats Chess. That's the equivalent of being more appealing to eat than a pile of 25 year old cottage cheese.",
    "timestamp": 1504044000
  },
  {
    "username": "StephenV",
    "rating": 2.0,
    "comment": "A classic. Which I find boring.",
    "timestamp": 1485471600
  },
  {
    "username": "Pixelman",
    "rating": 2.0,
    "comment": "My main reason for the hate is I don't really know how to play besides knowing how the pieces move. I don't even remember the notations I used to know. If I ever took the time to study I may just like it - but it is doubtful. Never been much of a fan of abstracts. Not saying the game itself is bad - just that I don't like it and it's bad for and to me.",
    "timestamp": 1451170800
  },
  {
    "username": "nexttothemoon",
    "rating": 2.0,
    "comment": "Rating this according to the BGG rating guide:\nThis game is very annoying and I have no inclination to actually sit down and play this. I actually don't mind abstracts. I think games like YINSH and some of the \"semi-abstract\" Euros like T&E or El Grande are excellent games...but Chess just leaves me worse than cold...I really don't have any inclination to study the game or even casually sit down and push the pieces around. The game just has no draw for me although it is obviously one of the deepest and most thoughtful games around.",
    "timestamp": 1433887200
  },
  {
    "username": "mudhoney",
    "rating": 2.0,
    "comment": "More sport than game. Taken too seriously by many. Chess is so deep, the permutations so many, that beginners have no realistic chance of victory against players with any sort of experience or learning.",
    "timestamp": 1430431200
  },
  {
    "username": "bwolfheart",
    "rating": 2.0,
    "comment": "Broken game. Stale dull frustrating boring stressful and this game has ran its gamut. Go play Arimaa. Arimaa is leagues greater in depth and strategy, elegance and FAR more engaging and fun.",
    "timestamp": 1420671600
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "Better than checkers, but still feels very dry to me. Prefer to play German style games.",
    "timestamp": 1416697200
  },
  {
    "username": "Zaki",
    "rating": 2.0,
    "comment": "BOOOOOORING!!!",
    "timestamp": 1408399200
  },
  {
    "username": "fredact",
    "rating": 2.0,
    "comment": "Kids game whose only appeal is that it was invented long ago before there were better (or pretty much any other) games. As such it was studied to death and people think it is somehow deeper than modern games. Had Puerto Rico or Settlers of Cataan been invented in 100AD no one would ever have heard of Chess. Game is a brain locker, takes too long, provides no chance for beginners to win, has no theme. Only reason this is not a 1 is since everyone knows how to play it, you can always play a game. The winner is usually determined before the game starts, based on the players skill (and this from someone that would probably beat 95% of the people in the world if I played them).",
    "timestamp": 1404943200
  },
  {
    "username": "tico",
    "rating": 2.0,
    "comment": "For the game, I'd give 5. Fact is that chess outcome is always draw (if players are equal). The winning - losing difference comes from the fact that one side, or other did not scan through (or forgot, while dying in boredom) all information about established moves/counter moves.\n\nEvery once and a while, one manages to beat decent chess player by doing something unexpected and borderline ridiculous. In these occasions game can momentarily be fun before player who deviated from The True Way(tm) is quickly beaten to death by community that does not allow anyone to deviate from the Established Truth and Scripture(tm). Hence, due to players being what they are, rating is 2.\n\nIn any case, Shogi is much, much better game of this genre.",
    "timestamp": 1401832800
  },
  {
    "username": "dannydeuce",
    "rating": 2.0,
    "comment": "I am a checkers type of guy.",
    "timestamp": 1396476000
  },
  {
    "username": "gradman2k3",
    "rating": 2.0,
    "comment": "Let the chess geek outrage begin!\n\n\"You don't like it because you don't understand it\" or \"it's a classic game\" blah blah blah.\n\nI don't like because it sucks and there are better games to play. It's a classic... Like a model T or a first gen Apple PC. I can appreciate them but I don't want one.",
    "timestamp": 1390086000
  },
  {
    "username": "UnluckiestCat",
    "rating": 3.0,
    "comment": "Rating speaks for itself.",
    "timestamp": 1758492000
  },
  {
    "username": "Cthonctic",
    "rating": 3.0,
    "comment": "Exceedingly bland.",
    "timestamp": 1758405600
  },
  {
    "username": "billpete002",
    "rating": 3.0,
    "comment": "Finding someone your skills level is difficult and if it's lopsided you either get slaughtered or slaughter the opponent. Some variants of chess make this higher (atomic chess)",
    "timestamp": 1758232800
  },
  {
    "username": "greatredwarrior",
    "rating": 3.0,
    "comment": "I really don't like Chess",
    "timestamp": 1756936800
  },
  {
    "username": "Mimsbee",
    "rating": 3.0,
    "comment": "2 players",
    "timestamp": 1749160800
  },
  {
    "username": "isiss",
    "rating": 3.0,
    "comment": "I find no beauty in this game. It is clunky and ugly.",
    "timestamp": 1745877600
  },
  {
    "username": "Jayglow",
    "rating": 3.0,
    "comment": "I'm not very good. I always lose so I don't really bother playing",
    "timestamp": 1742943600
  },
  {
    "username": "Kyouja",
    "rating": 2.5,
    "comment": "THEORETICAL PERCENTILE: 16.18% || WINS AGAINST OTHER GAMES: 9.91%\nSystems 1.5\nEvocative 3\nInteraction 8.5\nBreadth 6\nDepth 9\nArc 6.5\nRandomness 1\nReplayability 2.5\nAesthetic 1.5\n\nPros: Rewards player who can read the board well. If played with a timer, players can use weird openings to confuse their opponent.\n\nCons: Game relies on too much memorization and heuristics outside the game to be good at. No robust handicap system.",
    "timestamp": 1739833200
  },
  {
    "username": "asfhgwt",
    "rating": 3.0,
    "comment": "1. Chess is mental torture. [Gary Kasparov]\n2. The first 10-12 moves have been played out over 1000's of games.\n3. The better player almost always wins.\n4. No luck = no fun.",
    "timestamp": 1737414000
  },
  {
    "username": "Jiefu",
    "rating": 3.0,
    "comment": "Game suffers from analysis paralysis.",
    "timestamp": 1737068400
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "A legendary game, no doubt, but one whose level of foresight and prior knowledge to be even remotely competent against good players is far beyond my grasp which prohibits enjoyment.",
    "timestamp": 1733785200
  },
  {
    "username": "sunflowercari",
    "rating": 3.0,
    "comment": "155 minutes\n2\nMedium heavy\n6+",
    "timestamp": 1730934000
  },
  {
    "username": "OthelloKeys",
    "rating": 3.0,
    "comment": "Not my cup o'tea.",
    "timestamp": 1728424800
  },
  {
    "username": "VariousArtist",
    "rating": 3.0,
    "comment": "Wont play it again.\nWay too much randomness...",
    "timestamp": 1725400800
  },
  {
    "username": "EllenCaroline",
    "rating": 3.0,
    "comment": "171\n\n3.8 game weight",
    "timestamp": 1722981600
  },
  {
    "username": "edosan",
    "rating": 3.0,
    "comment": "It's chess - everyone knows it. I rate it so low not because it's bad (it's not) but because two player abstracts aren't necessarily my thing.",
    "timestamp": 1721599200
  },
  {
    "username": "Samuel Vriezen",
    "rating": 3.0,
    "comment": "Chess is the ultimate game of skill. But skill at what? At playing Chess, of course! But really, what is it more than the universe’s biggest sudoku puzzle? One day it might well be solved, and then what? Maybe I just dislike problems that have solutions.\n\nAlso, no co-op mode.",
    "timestamp": 1720476000
  },
  {
    "username": "atomiczap",
    "rating": 3.0,
    "comment": "Haven't played much in a long time, there are so many better abstract strategy games.",
    "timestamp": 1709506800
  },
  {
    "username": "Elvatuar",
    "rating": 3.0,
    "comment": "It is not a sport, as some would have it, but it has a lot more in common with professional sports than with boardgames. Either you go down the rabbit hole and try to become a chess pro, spending years learning this game, or you give up after a few rounds out of boredom. I'm in the latter category. This game is only fun if you're beating the other person and can feel good about yourself. The main problem with chess is that society sees it as an indicator of your intelligence. Which is only the case if you have a very, very narrow definition of intelligence, and thus an outdated one. If you're not good at it, you feel stupid or other people think you're stupid. Which other game does that? Oh, that's right: Monopoly!",
    "timestamp": 1709420400
  },
  {
    "username": "EliasDKehr",
    "rating": 3.0,
    "comment": "Personal rating b/c I don't enjoy it.",
    "timestamp": 1706655600
  },
  {
    "username": "AucaCoyan",
    "rating": 3.0,
    "comment": "Not bad but... hay cosas mejores",
    "timestamp": 1704150000
  },
  {
    "username": "rwi_",
    "rating": 3.0,
    "comment": "Not a fan of competitive games, so that plays a huge part on my rating of games.",
    "timestamp": 1703890800
  },
  {
    "username": "Finn Krogstad",
    "rating": 3.4,
    "comment": "We can't pretend that it actually simulates medieval combat, but as an abstract game, it is pretty limited.",
    "timestamp": 1702249200
  },
  {
    "username": "414448",
    "rating": 3.0,
    "comment": "All the open information paralyzes my brain. The complete lack of random elements makes this game pretty hard to enjoy unless you play against somebody equally good/bad - you just don't ever seem to enjoy a lucky win against a stronger opponent. The complete lack of theme makes it unengaging. Abstract games are not interesting to me, and this games never tells a story.\n\nThese sentiments probably say more about me than they do about chess .",
    "timestamp": 1700002800
  },
  {
    "username": "Citery",
    "rating": 3.0,
    "comment": "I can't not respect it, but after a lifetime of casual play and thousands of semi-serious games online, I simply have no desire to pick this up ever again.\n\nChess is really three disparate games in one: a repetitive early game that has been studied and scripted to death, a fascinating and hugely variable middle game with beautiful tactics, and a degenerate and unsatisfying late game that consistently devolves into obsessive, finicky patterns of goading/avoiding a drawn game.\n\nThe main issue is that in Chess, the difference between an overwhelming advantage and a hopeless, insulting loss can be a single square of a single move by a single piece. Looks like you’ve been checked! You’ve got three options here: King to G8, you’re maintaining your over-200 centipawn advantage, nice work! King on G7, it’s a perfect draw somehow (trust me on this). King to G6, that’s a mate in eight you idiot! Tread lightly, and remember, have fun!\n\nBlunders in Chess are just punished with such ruthless, binary decisiveness that a good game is measured far more by the absence of mistakes than the presence of skill, and my mind simply doesn't enjoy that type of play environment. I need my board games (even my combinatorial abstracts) to provide me interesting lines of play that are wider than a razor’s edge.\n\nThere is something to be said for a board game having such a monumental cultural influence, but I dislike a lot of the surrounding “mythology” that comes with that: the idea that Chess is some final frontier of intellectualism, a hallowed, even ground where great minds come to test and wrestle one another as equals. But if you step back and really look at Chess the game and not Chess the cultural concept, it reveals itself to be a fairly inelegant, even downright silly abstract game:\n\nThese pieces move one space forward. Except on their first move of the game, then it can be two. And also they only capture diagonally. What’s that? No there’s no other piece that has different movement and capture rules, why would there be? Oh and also don’t forget that if your opponent tries to pull that “two-spaces-on-the-first-move” trick and your piece is in this one specific spot next to it, you’re allowed to just go ahead and capture it retroactively as it “passed through” the space. No of course you can’t do that with other pieces that could have captured something “during” a move, why would you?\n\nOh and also remember that sort of important king piece? Well checking him early was too good and made our games boring, so we invented this zany little house rule where you can tuck him away in a corner of the board by moving him exactly two spaces horizontally in either direction and putting the rook that’s on the side he moved towards on the space directly opposite of where he ends up! No, you can’t ever move two pieces at once except for this…why do you keep asking questions like that? But there can’t be anything in the way when you do the flip and you can’t do it if he’s in check or would retroactively be in check during any part of the “move” and you can’t do it if the king has moved already this game, which you’ll just have to remember manually, which sort of goes against the complete-information core of Chess but you'll figure it out!\n\nNow that we’re talking about it, the end of our games were pretty boring too, we just ended up having our dinky little pawns on the board and our king. How is anyone supposed to win with just that? So we made it so those puny pawns upgrade into mega-badass queens when they get to the end of the board for some reason. No of course we’re not gonna provide the components to accommodate the possibility of having duplicate queens on the board in your color, if you manage to get another queen the game is basically over, there’s no need. Unless of course you foolishly place your queen on C3 instead of C4, collapsing a hundred moves of perfect play into a devastating stalemate instead of a win, but simply don’t do that you imbecile!\n\nDoes it sound like I’m bitter? Maybe I am a little. Chess just has such a monolithic place in the western canon, and I was raised to believe that this was a pure, elegant, ancient test of skill, something that clever people flock to and are good at. But it’s just a fiddly, only kind-of-old abstract game that is a Frankenstein of mechanics and gotchas accumulated over the centuries to make it not completely rote. Even then, white still has a non-negligible advantage, a huge chunk of high-level games end in draws (yuck), and the number one indicator of success in Chess isn't your tenacity or your experience playing games in general, it's how much you've studied Chess. With all that’s been done in the abstract genre in the last few decades alone, I see little reason to keep throwing myself against this particular, much-loved wall.",
    "timestamp": 1697061600
  },
  {
    "username": "Windmillfighter",
    "rating": 3.3,
    "comment": "Boring! Played a lot as a kid but then got burned out on it. So many better games out there but still keep a copy to display because it was a gift from family.",
    "timestamp": 1696716000
  },
  {
    "username": "AgentSkipGranger",
    "rating": 3.0,
    "comment": "Trash game. Repetitive, encourages grinding, has some stupid hidden rule called one croissant or something, and stalemates should not be a draw because that makes no sense",
    "timestamp": 1693605600
  },
  {
    "username": "DivineHoboofDivinity",
    "rating": 3.0,
    "comment": "The big problem with chess is that there are all those pieces, each with their own move-set, attacking at least 4 different directions, able to move any number of spaces along those directions, all jammed and twisted together in the center of the board. The human mind (without extensive training) can't comprehend it all. Chess games are filled with lamentations of \"OHHHH you can hit that piece?!\" \"OHH I didn't see that!\" \"OHH I forgot you could attack there!\" That is bad game design. If it was made today, publishers would turn it down.\n\n\"Instead of forcing players to announce to their opponent that the king is in check, design a game where they can tell what is going on.\"",
    "timestamp": 1692655200
  },
  {
    "username": "Blubberblase1984",
    "rating": 3.0,
    "comment": "Its a piece of history. I dont like it for two reasons:\n\n1. There is no decent way to adjust the skill gap between players. A veteran will always win against a newcomer. Other games mitigate this.\n2. Its easier to program a chess computer program which plays better than you do than to master the game.\n\nI like abstracts but this one wont hit my table again!",
    "timestamp": 1685656800
  },
  {
    "username": "ironlegacy977",
    "rating": 3.0,
    "comment": "I really dislike chess. I'm not a person who strategizes turns in advance, I play in the now, and chess does not play into my playstyle.",
    "timestamp": 1668639600
  },
  {
    "username": "Odesseiron",
    "rating": 3.0,
    "comment": "This decent game has been ruined for me by the pop culture and the following that it has. I hate it.",
    "timestamp": 1667862000
  },
  {
    "username": "Vlaralorn",
    "rating": 3.0,
    "comment": "Any game that has been studied to the amount chess has just isn't fun anymore in my opinion.",
    "timestamp": 1665093600
  },
  {
    "username": "4McTavish",
    "rating": 4.0,
    "comment": "F0",
    "timestamp": 1759528800
  },
  {
    "username": "Legomancer",
    "rating": 4.0,
    "comment": "Played in childhood. Included for completeness.",
    "timestamp": 1759183200
  },
  {
    "username": "Marthinoth",
    "rating": 4.0,
    "comment": "Fisico\nBGA",
    "timestamp": 1758060000
  },
  {
    "username": "Auroric",
    "rating": 4.0,
    "comment": "The OG lifestyle game that I'm not interested in. On one hand, I love that chess is open information, and the better player should always win. That's also why I quit playing it, to play games that are fun.\n\nI respect chess and acknowledge that it's one of the best competitive abstracts ever made, but these days it aint for me. I prefer Go anyway.",
    "timestamp": 1754172000
  },
  {
    "username": "infeneris",
    "rating": 4.0,
    "comment": "Great memories of this growing up but after discovering Janggi, Shogi, and Chess 2:The sequel, I just have no desire to play Chess anymore.",
    "timestamp": 1753653600
  },
  {
    "username": "Weirdsalmon",
    "rating": 4.0,
    "comment": "4/10: THE abstract, I used to like it but it’s simply not fun, because it’s an abstract! Too tight.",
    "timestamp": 1752444000
  },
  {
    "username": "emptyset",
    "rating": 4.0,
    "comment": "A classic. Still okay, but I'm generally not too keen on abstract games.\n\nIf I'm up for an abstract game, I'd rather play something shorter and more modern, like Santorini or Onitama",
    "timestamp": 1751580000
  },
  {
    "username": "Vaele",
    "rating": 4.0,
    "comment": "Historic and classic game which I play from time to time, but only as a last resort. There are other perfection-information abstract titles that I find more engaging and fun.",
    "timestamp": 1751320800
  },
  {
    "username": "Guthwine3",
    "rating": 4.0,
    "comment": "This is a nicely fashioned wooden version of the game that was purchased (I think) from a Hamley's toy store near Dublin, Ireland.",
    "timestamp": 1748728800
  },
  {
    "username": "UanarchyK",
    "rating": 4.0,
    "comment": "I believe that Chess's continued success is largely a result of historical accident. It was the one that happened to be, so it was the one that got played and the play got refined. I remain unconvinced of its merit in a vacuum. If Chess were released today, I do not think it would make a splash.",
    "timestamp": 1747951200
  },
  {
    "username": "Rudybrisker",
    "rating": 4.0,
    "comment": "There is little to be said about chess. It's a good sport, but not a good casual game, unless you want to be beaten continuously / beat people continuously. The skill level gap is the main problem about this one, you need to read a lot of books to maintain a normal elo. Reading about Bobby Fischer also makes you think about how some people obsess over chess.",
    "timestamp": 1745704800
  },
  {
    "username": "Captain Quirk",
    "rating": 4.0,
    "comment": "We own a glass set but it's mostly for show. After all, it's not 1475 anymore, so there's lots more other games to play, thankfully!",
    "timestamp": 1743976800
  },
  {
    "username": "RedwoodCroft",
    "rating": 4.0,
    "comment": "I fail to understand people's fixation with this game. It is ust another hum-drum abstract.",
    "timestamp": 1741474800
  },
  {
    "username": "bankrupt",
    "rating": 4.0,
    "comment": "nfs",
    "timestamp": 1740610800
  },
  {
    "username": "tommynomad",
    "rating": 4.0,
    "comment": "I play live, online, by email, and by snail mail. And I suck at all of them.",
    "timestamp": 1739919600
  },
  {
    "username": "BRAUNFELS",
    "rating": 4.0,
    "comment": "Chess is a game, where you need a partner on your level. Otherwise it is only winning or only losing. Rarely i play more than five times in a row. The ever same placenent and start moves gets boring. So, it is not a bad game, but i can't play it regulary.",
    "timestamp": 1739487600
  },
  {
    "username": "dr glaze et al",
    "rating": 4.0,
    "comment": "It's the ultimate logic-memorization game, without the fluid intition of Go. A lifestyle game if there ever was one, moreso than the huge binder games even.",
    "timestamp": 1736550000
  },
  {
    "username": "lil_canuck",
    "rating": 4.0,
    "comment": "I actually kind of hate chess. There's no appeal to it for a casual player, because the person who wants to play you is far from casual and will destroy you every time. That person is my husband, who watches chess match analysis videos in his leisure time.",
    "timestamp": 1736463600
  },
  {
    "username": "Mathy",
    "rating": 3.5,
    "comment": "If someone asks me to play chess, it's probably because they like Chess, which means they're probably an experienced player, which means I'll most likely lose. Pass.\n\nThe 0% variance in Chess makes the game too dependent on rote learning. A competitive game is entertaining, because it expects of you to adapt to your opponent's play. That's where Chess shines - if you play with someone at your level, that is. If not, one of you will simply have memorized more situations than the other, and they lose out of pure inexperience. Chess is the definition of git-gud mentality, and I don't play to get good at something - I just play to have fun with friends and family. If I get good at a game, it's an unfortunate side effect which narrows how many people I can have a fun, balanced game with.",
    "timestamp": 1736290800
  },
  {
    "username": "CoreyClark",
    "rating": 4.0,
    "comment": "I feel it is simply my responsibility as a legitimate game designer and someone who understands and appreciates games on a higher level than the swaths of people who have haphazardly rated it a ten despite having little to no familiarity with other games. I could go on a lengthy diatribe about its various shortcomings but I wont. New games are better. Game design is a science and like any science it become more refined over time. If the current market doesn't reflect this then it reflects only on the lack of refinement of popular designers. Oh and Chess is a game from the dark ages. Its time to move on.",
    "timestamp": 1732662000
  },
  {
    "username": "cbazler",
    "rating": 4.0,
    "comment": "Pretty much every mechanic I hate in a game: pure information, direct conflict, no theme, no variability in set-up, and a large learning curve to play well. No thanks.",
    "timestamp": 1726869600
  },
  {
    "username": "cymric",
    "rating": 4.0,
    "comment": "I played chess in primary school because that's what smart kids did. However, I liked the puzzle aspect of chess more than I did the game itself. I was never able to fathom nor appreciate the finer points of chess strategy (strength of 2 bisshops are stronger than one bisshop and a knight, or that a rook and a bishop are more powerful than a queen) and so abandoned the game when there were no more puzzles left for me to solve.\n\nThere are more modern variants of the game which tone down its depth, and align more with the amount of time I have at my disposal, as well as the interest level of my opponents. Hive comes to mind, for example. But also a completely different abstract game altogether, like for example Backgammon.",
    "timestamp": 1726696800
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "I admire the game from a distance, but Chess is kind of impenetrable and not exactly enjoyable. I have played a game here and there over the deacades but I have little interest in memorizing patterns and missed the window for becoming some brainiac Chess Grandmaster.",
    "timestamp": 1725573600
  },
  {
    "username": "antiussentiment",
    "rating": 4.0,
    "comment": "the grand daddy of dry..\nIt is actually a great game. Just not one I'd often choose to play.",
    "timestamp": 1725055200
  },
  {
    "username": "Noogs",
    "rating": 4.0,
    "comment": "I’ve always found chess to be un-fun. Went through a phase in graduate school of reading about opening moves, practicing with different combos, etc. So I tried to get into it. Just not my kind of game. And it is just a game.",
    "timestamp": 1723500000
  },
  {
    "username": "drmark64",
    "rating": 4.0,
    "comment": "Wooden Pieces & Box, Probably a 2nd copy of Cardinal 7 in 1. Copy #2",
    "timestamp": 1722808800
  },
  {
    "username": "CannonFodderTed",
    "rating": 4.0,
    "comment": "The classic game of chess. If you like the game, find one of the million versions that will display nice in your game room....So check this out...Can you believe my wife doesn't know how to play chess? She never learned as a kid. I thought everyone just knew this! If you are reading this and you don't know how to play chess, turn off your computer, go to the thrift store and grab the best looking copy of chess they have there, from the 5 to 10 copies they will most certainly have on the shelf, bring it home and learn it. It's not a great game by any means but just like learning how to swim, knowing how to play chess is kind of a life essential skill.....seriously, why are you still reading this? You either know about this game already or you should be on your way to the thrift store. It's chess. What more do you want me to tell you?...actually, don't buy it, just go find an online version of it to play on your computer or something. I am sure there are hundreds out there.",
    "timestamp": 1722549600
  },
  {
    "username": "quietcorn",
    "rating": 4.0,
    "comment": "I don't like the feeling of missing the obvious, nor the feeling of sacrificing pieces for the greater good. I don't want to read books about different strategies or ways to play. I don't feel that the gamespace is fun to explore on my own. This is not for me.",
    "timestamp": 1722031200
  },
  {
    "username": "parpari",
    "rating": 4.0,
    "comment": "Back in old days, there was no variety of entertainment; so nerds stuck with this game and played it so much which suck any soul, enjoyment and creativity from it. Therefore, Chess becomes a game of restriction and Stalemate which makes it the best move is no move )).",
    "timestamp": 1722031200
  },
  {
    "username": "pentadactyl",
    "rating": 4.0,
    "comment": "The only good thing about chess is that everyone knows the rules.\n\nArtificially difficult game with boring stale meta.",
    "timestamp": 1721772000
  },
  {
    "username": "PookaPuck",
    "rating": 4.0,
    "comment": "I would rather play so many other things",
    "timestamp": 1717106400
  },
  {
    "username": "HumbleS",
    "rating": 4.0,
    "comment": "I've tried to like chess many times, but I just can't. The esoteric rules with their bizarre edge-cases make for a game that feels inelegant, unintuitive, and sometimes downright ugly. I can't deny that I have found myself captivated in the tactical reasoning, and there's a certain thrill to be found in carrying out an exchange well planned, but this just doesn't do enough to counterbalance the gross feeling I get whenever I run into one of the aforementioned edge-cases.\n\nAlso, most sets don't come with enough pieces to use the promotion system properly, and, even though that rarely comes up, it still kinda bugs me.",
    "timestamp": 1712527200
  },
  {
    "username": "whitecatplays",
    "rating": 5.0,
    "comment": "Castles and knights! Queen gambits and sicilian defenses! Enfilades and pincers! Blitzes! Honestly chess has too much going on.",
    "timestamp": 1760738400
  },
  {
    "username": "Nonoku",
    "rating": 5.0,
    "comment": "2\nW: 3.66\n\nPros\n-Lots of thinking/strategy\n-Known for being old\n\nCons\n-Repetitive\n-Need to memorize a bunch of openings\n-Difficult\n\nChess is a game that is easy to learn but hard to master. The learning curve is significant.",
    "timestamp": 1760047200
  },
  {
    "username": "Rusty Diodes",
    "rating": 5.0,
    "comment": "I have 3 different travel versions:\nMagnetic (small)\nMagnetic (very small)\nPeg (tiny)",
    "timestamp": 1759701600
  },
  {
    "username": "Subaru77",
    "rating": 5.0,
    "comment": "A gyalázatosan alacsony pontszám csak annak szól, hogy engem halálosan fáraszt és untat, de elismerem, hogy minden idők legjobban kitalált absztrakt játéka. Vagy kitanulod és folyamatosan ezt játszod, hogy értsél hozzá vagy le se ülj mellé. Én ez utóbbi.",
    "timestamp": 1759269600
  },
  {
    "username": "akinfantryman",
    "rating": 4.9,
    "comment": "23Sept2025 When I was first on BGG I rated chess a 9.\nI still quite like the idea of chess. I just would rather play other games.\n\nI also still really enjoy thinking about, designing, and trying chess variants.",
    "timestamp": 1758578400
  },
  {
    "username": "Game_Greg",
    "rating": 5.0,
    "comment": "Great design, but I find it’s really not much of a fun game overall. It can be interesting, but almost never fun unless you’re winning - and therefore half of the participants are not enjoying playing. I’d choose most other games over it. Mainly only play if my son asks.",
    "timestamp": 1758232800
  },
  {
    "username": "Gendalm",
    "rating": 5.0,
    "comment": "Very deterministic (the more expert player will usually win) and vulnerable to analysis paralysis, but I rediscovered it while teaching the basis to my young son. While abstract, it still reminds me of war games and it is rewarding to find smart moves you couldn’t think of just before. The main issue for me is still the playing time (although the setup is fast) and the fact the game does not provide me enough fun to compensate that.\n\nUPDATED 8/25: from 4 to 6",
    "timestamp": 1757800800
  },
  {
    "username": "Nugatra",
    "rating": 5.0,
    "comment": "Rank: 452 Abstract: 46\nReplay Rank: 15(core), 46(overall)\n\nPlayer: 2\nCommunity: 2\nBest: 2\nDual: 78(‘24),98(‘23),58(‘22)",
    "timestamp": 1755986400
  },
  {
    "username": "hylian_marq",
    "rating": 5.0,
    "comment": "Deserves a higher rating - but my ratings are my own preference, not how good the game is",
    "timestamp": 1754604000
  },
  {
    "username": "DaSnow",
    "rating": 5.0,
    "comment": "I am not good at chess.\n\nAnd I always lose.\n\nAnd I don't want to improve.",
    "timestamp": 1752962400
  },
  {
    "username": "saabee",
    "rating": 5.0,
    "comment": "Nem szeretem. Értékelem benne az okosságot, de nagyon száraz.",
    "timestamp": 1752876000
  },
  {
    "username": "Shrewmaster",
    "rating": 5.0,
    "comment": "Various sets last of which was a wooden clamshell box chess, draughts, backgammon combo. I know chess is arguably the greatest game of all time but I never got into it or liked it much. Sacrilege I know.",
    "timestamp": 1752012000
  },
  {
    "username": "exarus",
    "rating": 5.0,
    "comment": "Played in childhood",
    "timestamp": 1751148000
  },
  {
    "username": "muchiflapopo",
    "rating": 5.0,
    "comment": "creo que no voy a explicar en qué consiste este juego, generalmente cuando tienes entre 5 y 6 años alguien te enseña como se mueven las piezas y ala a jugar\n\nEn mi casa les gusta a todos, mi pareja juega online a diario, entre otros con mi hermano que llego a tener un elo alto cuando participaba en torneos, a mi suegro le gusta tanto que en verano en el pueblo monta simultáneas, todo el que sepa mover piezas es reclutado. Los primos también lo juegan con entusiasmo.... todos menos yo.\n\n¿que no me gusta de él? pues este punto de que te empiezas a conocer estrategias, tienes tus movimientos de siempre, sabes de memoria los próximos 10 movimientos que vas a hacer. Soy una persona que disfruta mucho de explorar diferentes vias, pero al final en el ajedrez te ves enfrentandote a otra persona y en vez de explorar solo analizas que estrategia está siguiendo para contra atacarla casi como siguiendo \"un manual\"\n\nEs por ello que me gustan más el ajedrez 960 donde cambia por completo el paradigma. He descubierto que gente que juega mucho al ajedrez se siente muy inseguro con esta nueva forma de jugar, y es por esa forma de jugar seguiendo estrategias de manual.",
    "timestamp": 1750975200
  },
  {
    "username": "ourmove123",
    "rating": 5.0,
    "comment": "Balanced and strategic, yet can be tedious and stressful.\n\nEasy to see why this is one of the most popular board games of all time. People have huge tournaments for chess and many people treat it very seriously. That seems like a sign of an enduring board game.\n\nThe game is enjoyable for those who understand the basic rules. I find the problem is, I only truly enjoy this game when I play a ton of it and I'm performing at my best. This is easily overlooked as a life-style game, but I think it is one of the most popular life-style games.",
    "timestamp": 1750543200
  },
  {
    "username": "Napattack",
    "rating": 4.8,
    "comment": "3.65\n2\n- (40)",
    "timestamp": 1750284000
  },
  {
    "username": "mrdollar11",
    "rating": 5.0,
    "comment": "The OG, but honestly not really that fun. Feels more like taking a test against a friend competitively.",
    "timestamp": 1750197600
  },
  {
    "username": "lexen",
    "rating": 5.0,
    "comment": "I grew up playing this one, collecting all kinds of this one (owns african/asian/indian and common types)",
    "timestamp": 1749506400
  },
  {
    "username": "CritGoth",
    "rating": 5.0,
    "comment": "i dont want to be that guy, but over rates, overhyped, anf over represented. a classic? sure, but im just so tired of it. i feel like seeing it used as a symbol in media my entire life has desensitized me from any joy i would get from actually playing it.\nAnd despite that i cant help but watch videos about chess ai, openings, and drama. i guess that is to say i have mixed feelings. 5/10?",
    "timestamp": 1748988000
  },
  {
    "username": "AetasAaM",
    "rating": 5.0,
    "comment": "I'm just not that smart. I'm not usually an abstract game type of person. I can totally see the depth and why some people would like it (and be extremely into it) though.",
    "timestamp": 1745791200
  },
  {
    "username": "DaSpottishKing",
    "rating": 5.0,
    "comment": "It's a classic, just takes a lot of life to be good at it. Kind of crazy.",
    "timestamp": 1743202800
  },
  {
    "username": "Aleogod",
    "rating": 5.0,
    "comment": "Digital Version is also great!",
    "timestamp": 1743202800
  },
  {
    "username": "LepcisMagna",
    "rating": 5.0,
    "comment": "I appreciate Chess, but I do not like chess.",
    "timestamp": 1742338800
  },
  {
    "username": "4characters",
    "rating": 5.0,
    "comment": "I enjoy chess quite a bit, but it is hard to play a casual game, it seems most people are not interested at all or they are some hypercompetitive chess nerd, either type of opponent takes the fun out of the game. The best thing about chess is the sense of scholarship -- it has been in play in the West for centuries and generations have devoted significant time to studying it and perfecting its play, fueling its growth into a full-blown sport where the top tier players retain celebrity status.\n\nThe interesting dynamic about chess is that it builds up to a crescendo with the initial opening maneuvers giving way to a blood bath which seems to indeed evoke the feeling of a climactic battle.\n\nUnfortunately chess is a deeply unforgiving game, and all the fancy maneuvering to assure interlocking defenses and mutually supporting units falls apart with a single blunder, which is almost always the way someone loses in the game at the amateur levels, as opposed to being defeated by superior strategy. To get the most enjoyment out of the game, your opponent needs to play their best without inadvertently triggering these blunders, but it rarely happens.",
    "timestamp": 1740006000
  },
  {
    "username": "aronske417",
    "rating": 5.0,
    "comment": "Nothing to say about Chess that hasn't been said. Not my style of game.",
    "timestamp": 1738105200
  },
  {
    "username": "BoardGamingCouple",
    "rating": 5.0,
    "comment": "5/5\ngreat classic game with tons of history. there are a few different versions, but mad queen's game is the most common worldwide. pieces with animals are more interesting (horse, camel, elephant, tiger, lion, giraffe, etc..) 10,000+ plays\n\nMad Queen's Game / Shogi / Mad Queen's Gambit / Queen's Gambit / Chess / Gentlemen's Game / Game of Kings / Royal Game / Chaturanga",
    "timestamp": 1737414000
  },
  {
    "username": "KaNife073",
    "rating": 5.0,
    "comment": "“You've lost, you just don't know it yet.”",
    "timestamp": 1737241200
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "It's good. You are either really into Chess, know the rules and played a handful of times, or have never played. If you are in the latter camp - sure, give it a play. If you are in the middle camp (like I am), I think there are other games worth investing in (Go, Shogi). I don't like how standoff-ish it gets as players build chain reactions which will eventually fire off like a row of dominoes. It's at least unique in this regard\n\nEDIT: learning that I should usually move pieces into defended really improved my Chess game and helped me to enjoy it more.",
    "timestamp": 1737068400
  },
  {
    "username": "hungryhomer",
    "rating": 5.0,
    "comment": "Elaborate chesspieces enhance game experience.",
    "timestamp": 1736463600
  },
  {
    "username": "udance4ever",
    "rating": 5.0,
    "comment": "dunno if I’m just biased by my inability to completely master the game. I’m just drawn to other types of games!",
    "timestamp": 1736118000
  },
  {
    "username": "JadedAria",
    "rating": 5.0,
    "comment": "Disney's Haunted Mansion Light Up Edition",
    "timestamp": 1735340400
  },
  {
    "username": "bobondi",
    "rating": 5.0,
    "comment": "I don't have a chess set. I'm not a big fan of chess, but that's just because I'm not very good at it. I like to play an occational game, and a nice set is always good to have sitting on the living roo table.",
    "timestamp": 1734822000
  },
  {
    "username": "Jondalf",
    "rating": 5.0,
    "comment": "Probably the most famous and historically influental board game in the world. But too abstract for me. Where's the fun if the set-up is always exactly the same? Hard to learn, even harder to master. A very concentrated, silent game. You have to play it a lot to start recognizing patterns.\n\nIt's like the opposite of Snakes and Ladders: 0 % chance, 100 % tactical.",
    "timestamp": 1734130800
  },
  {
    "username": "BryanTico",
    "rating": 5.0,
    "comment": "lo tengo de adorno .",
    "timestamp": 1733439600
  },
  {
    "username": "teeheehee",
    "rating": 5.0,
    "comment": "genuinely mid game design",
    "timestamp": 1733007600
  },
  {
    "username": "Rhythm_and_Blues",
    "rating": 5.0,
    "comment": "You will never catch me being excited to play a game of chess. Maybe it's because I played it so extensively when I was younger, but I'm so tired of it. I just get this feeling, almost like a reminder, that I should be playing something else; that I've moved on from Chess and onto better things. I know that Chess slander is very common in this hobby, but I kind of get it. My biggest problem with Chess is that it is too hard to see where you are in the game (if you have not studied Chess). Without studying the game, it's nearly impossible to know what a winning position looks like, or how to get there. So most of the game, you are constantly stuck making choices that have no weight or feel very unsatisfying, because your goals and personal ambitions don't exist.\n\nAfter getting in this hobby, there's just so many other games that give me a lot more joy. And I truly don't believe that it's this perfect game that a lot people seem to claim it as. There's better strategy games than Chess now. It's over 500 years old for gods sake.",
    "timestamp": 1732662000
  },
  {
    "username": "TheBrainlessdude",
    "rating": 5.0,
    "comment": "I stand by Luigi being the queen",
    "timestamp": 1732662000
  },
  {
    "username": "PHIL4477",
    "rating": 5.0,
    "comment": "I've never really liked this game, I don't like abstract games, and I'm not very good at it, so that's not too surprising.",
    "timestamp": 1732402800
  },
  {
    "username": "Dycast",
    "rating": 5.0,
    "comment": "Can never beat a classic",
    "timestamp": 1732230000
  },
  {
    "username": "Jemaima",
    "rating": 5.0,
    "comment": "Я удивлена, что шахматы не на первом месте. Это же идеальная игра, без воли случайности. Ты буквально управляешь всем на доске.\nИменно то за что ругают почти все другие игры.\n\nШахматы это хорошая абстрактная стратегия, просто мне не нравится в неё играть. Это обычно долго и скучно. И ещё и некрасиво.",
    "timestamp": 1729807200
  },
  {
    "username": "Welcheren",
    "rating": 5.0,
    "comment": "Fine game. Just not for me.",
    "timestamp": 1729461600
  },
  {
    "username": "rytwin",
    "rating": 5.0,
    "comment": "I just feel silly playing this casually when I know how sub-optimally I'm playing a game that's been so publicly played and solved by computers. I'd rather play Hive -- I'm probably equally bad but at least it's not as obvious to me.",
    "timestamp": 1727301600
  },
  {
    "username": "DuppsQC",
    "rating": 5.0,
    "comment": "how to rate the weight of this game? It's a 1 and also a 5",
    "timestamp": 1727215200
  },
  {
    "username": "gabese",
    "rating": 5.0,
    "comment": "Most of the game is just a thought challenge - outplaying your opponent or getting outplayed. There is a good amount of replayability since there are endless combinations of moves that can be made in a game, however the aesthetics and the theme are a bore. There was a decent amount of strategy involved in the game making it slightly interesting, but typically two players are needed to play.",
    "timestamp": 1727128800
  },
  {
    "username": "mikesanerd",
    "rating": 5.2,
    "comment": "Fun to try to master, but the lack of any variability or randomness means that experience and the use of scripted plays and moves eventually squeezed out the fun for me. Too dry, stressful, and abstract to enjoy much compared to modern board games, but obviously the bones are very solid for those looking for a well balanced, deep game.",
    "timestamp": 1726610400
  },
  {
    "username": "janglemangle",
    "rating": 5.0,
    "comment": "a classic\n\nplayed before i got into the hobby, so I won't be logging my plays",
    "timestamp": 1726351200
  },
  {
    "username": "alcofa",
    "rating": 5.0,
    "comment": "This is THE game!",
    "timestamp": 1725141600
  },
  {
    "username": "graybeard76",
    "rating": 5.0,
    "comment": "Used to love it, now don't have the patience for it anymore.",
    "timestamp": 1724709600
  },
  {
    "username": "viperking",
    "rating": 5.0,
    "comment": "2",
    "timestamp": 1724536800
  },
  {
    "username": "drmark64",
    "rating": 5.0,
    "comment": "7 in 1 Game version. Copy #1.",
    "timestamp": 1722808800
  },
  {
    "username": "USSAwesome",
    "rating": 5.0,
    "comment": "I often find myself criticizing abstract strategy games by comparing them to chess. It’s too much of a rigid monolith for me to enjoy. Too many people take the game far too seriously, and it feels like there’s always intellectual pride on the line every time it’s played. To have any fun, you must be evenly matched with your opponent. Any disparity in skill level makes for a miserable experience. The barrier to entry is insufferably high.\n\nUpdate: Donated to Volunteers of America on July 29, 2024. I also got rid of my poker chips because I don’t feel obligated to own ubiquitous but useless household items anymore.",
    "timestamp": 1722463200
  },
  {
    "username": "RikkenHikken",
    "rating": 4.5,
    "comment": "Not very funny.",
    "timestamp": 1721340000
  },
  {
    "username": "Mykohl1",
    "rating": 5.0,
    "comment": "10 - I will ask people to play this every time I can\n9 - I am always down to play, I will ask, but I will almost always say yes if someone else asks\n8 - I will actively seek out playing\n7 - I will recommend playing\n6 - I will recommend playing in specific situations\n5 - I would never recommend, but if someone else wants to play I will\n4 - If given a choice between this and most other games I’d pick the others, but I won’t be the most upset playing this game\n3 - I would prefer not to play but will eventually be broken down to play\n2 - I will play as a favor to someone else that really wants to\n1 - Under no circumstance will I play this game",
    "timestamp": 1719612000
  },
  {
    "username": "WillBePlayin",
    "rating": 5.0,
    "comment": "I've never really cared for Chess, but I can respect the history and legacy of it all.",
    "timestamp": 1719525600
  },
  {
    "username": "Sportomax",
    "rating": 5.0,
    "comment": "Abstract Strategy",
    "timestamp": 1716328800
  },
  {
    "username": "jpbookworm",
    "rating": 5.0,
    "comment": "Table",
    "timestamp": 1716156000
  },
  {
    "username": "YukiHaze",
    "rating": 5.0,
    "comment": "Já Joguei",
    "timestamp": 1715378400
  },
  {
    "username": "LuckyStrike",
    "rating": 5.0,
    "comment": "Abandoned by the developers; no updates or expansions since 1851. Fiddly rules. Hard to remember how to set up the board without a guide. Takes too much time to play. Many players suffer from \"analysis paralysis\". Difficult to make a late-game comeback if you lose material. Many, many books and videos available, but all are by third parties and not the development team -- in fact, there are so many thousands of companies selling \"knockoffs\" and weird designs that it's hard to find genuine original game equipment (see photos) -- people can't even agree on what color the pieces should be. There are many more contemporary and far better abstract strategy games available. Time has passed this one by.",
    "timestamp": 1711839600
  },
  {
    "username": "Nexoult",
    "rating": 5.0,
    "comment": "Me da pereza pero si no hay nada mas que hacer le damos",
    "timestamp": 1705791600
  },
  {
    "username": "Zengoeroe",
    "rating": 5.0,
    "comment": "Why a 5? The fun of this game stands and falls based on the level of competence of both players. It is at its best a memorization of sequential potential moves, the better your memory, the better you will play. To put it in other words, you will have no fun as this game is all about studying and putting lots of hours of practice into it.",
    "timestamp": 1705705200
  },
  {
    "username": "ngoomie",
    "rating": 5.0,
    "comment": "I dunno what it is but I just don't really like chess. Could admittedly be that I have a hard time memorizing the actual strategies.",
    "timestamp": 1705618800
  },
  {
    "username": "arnaut67",
    "rating": 5.0,
    "comment": "A disaster from the point of view of game design that became almost a synonymous of intelligence. Loads of AP, no catchup mechanism, significant first player advantage, lots of inelegant rules (castling, en passant, perpetual checking) and the worst: highly scriptable. Take away from it all its spread out culture and tons of resources, and it will just vanish in a sea of much better games.",
    "timestamp": 1705359600
  },
  {
    "username": "StevenKiel",
    "rating": 5.0,
    "comment": "Cool game as a novice while watching, but the skill here is equivalent to being a pro for a spelling bee. Memorization and time. I will always appreciate this game and admire the best but there are only so many hobbies I can have where you have to memorize everything to get good.",
    "timestamp": 1705100400
  },
  {
    "username": "ironvulture",
    "rating": 5.0,
    "comment": "I just don't like chess. I know it is a classic but there are so many abstract games that offer a similar challenge with much more variety.",
    "timestamp": 1704322800
  },
  {
    "username": "smithbc19",
    "rating": 6.0,
    "comment": "Deepest game I own. My son enjoys abstarcts and I get to play this with him. I enjoy any game that my boys request. I enjoy the strategy but don't enjoy it enough to get any better. I wonder at what age he'll start beating me?",
    "timestamp": 1760565600
  },
  {
    "username": "black_daveth",
    "rating": 6.0,
    "comment": "I kind of wish that I enjoyed this more just because it's so ubiquitous, but Go is an order of magnitude more interesting.",
    "timestamp": 1759788000
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Two-Player Game\n\nPlayed a lot as a kid. What else is there to say?",
    "timestamp": 1759356000
  },
  {
    "username": "AwemanTheFirst",
    "rating": 6.0,
    "comment": "Such a long game for something that usually boils down to a single mistake, but interesting conceptually. I'll chalk it up to the fighting game effect. I don't really like games that are played better, slower.",
    "timestamp": 1759269600
  },
  {
    "username": "snth",
    "rating": 6.0,
    "comment": "Wonderful game, but the most toxic community of any board game by a huge margin. Makes League of Legends look like a petting zoo.",
    "timestamp": 1758837600
  },
  {
    "username": "Ryalyn",
    "rating": 6.0,
    "comment": "No theme and requires lots of forward thinking strategy. Kinda blah in my book. Aaannnd I kinda suck at this game which is not terribly compelling for replay. If I win, it tends to be because of my lack of a clear strategy. If it had significantly more personality and theme I would probably like it a little better because it wouldn't feel like it is only about skill for skill sake.",
    "timestamp": 1758492000
  },
  {
    "username": "J_Clay",
    "rating": 6.0,
    "comment": "2025",
    "timestamp": 1758405600
  },
  {
    "username": "GarcianIII",
    "rating": 6.0,
    "comment": "Braille edition",
    "timestamp": 1757973600
  },
  {
    "username": "Laiheuhsa",
    "rating": 6.0,
    "comment": "classic, but not one I look forward to playing",
    "timestamp": 1756245600
  },
  {
    "username": "tdhsmith",
    "rating": 5.9,
    "comment": "Something about rating this feels wrong no matter what. I don't know if I actually \"would suggest [playing]\" these days, but also I can't really give it a lower rating, can I?",
    "timestamp": 1755900000
  },
  {
    "username": "adamolanna",
    "rating": 6.0,
    "comment": "ci giocavo da piccolo ma non ero bravissimo",
    "timestamp": 1754776800
  },
  {
    "username": "TeslaGauss1884",
    "rating": 6.0,
    "comment": "it is just i am bad at this game. It is a classic from centuries but it is not my type of game.",
    "timestamp": 1754604000
  },
  {
    "username": "skipboris",
    "rating": 6.0,
    "comment": "People play this because its old and famous and easy to find, but there are far better abstract 2 player games out there. There are better old abstracts out there, like Go.",
    "timestamp": 1754517600
  },
  {
    "username": "Jessfrogger88",
    "rating": 6.0,
    "comment": "It's chess... I don't love it.",
    "timestamp": 1753826400
  },
  {
    "username": "Food_Please",
    "rating": 6.0,
    "comment": "Very exhausting strategy game due to the amount of open information, only exciting when evenly matched. Can be enjoyable in the right mood and with the right opponent; once per year is enough for me.",
    "timestamp": 1751839200
  },
  {
    "username": "Ostropol",
    "rating": 6.0,
    "comment": "Max",
    "timestamp": 1750629600
  },
  {
    "username": "Darth_Revanant",
    "rating": 6.0,
    "comment": "Crownes Chess portable version",
    "timestamp": 1750543200
  },
  {
    "username": "C Thompson",
    "rating": 6.0,
    "comment": "Skill gaps may never be more apparent than in Chess, and winning will always feel mean-spirited while losing will always feel disheartening. At the end of the game, neither player will likely feel like they learned that much from the experience. This game is only great if those playing are of the same skill level, a severe limitation by today’s gaming standards.",
    "timestamp": 1748728800
  },
  {
    "username": "LambofWar",
    "rating": 6.0,
    "comment": "I loathe this game, for i am terrible at it. Still, its the og game.",
    "timestamp": 1748383200
  },
  {
    "username": "Spada_",
    "rating": 6.0,
    "comment": "6+. Abstract. 2 players",
    "timestamp": 1747605600
  },
  {
    "username": "Frog0fWar",
    "rating": 6.0,
    "comment": "2",
    "timestamp": 1747432800
  },
  {
    "username": "tento4pm",
    "rating": 6.0,
    "comment": "Complex. Best to play with players of similar skill ranges.",
    "timestamp": 1746568800
  },
  {
    "username": "AudunAgnar",
    "rating": 6.0,
    "comment": "If you dive into chess and actually practice openings and stuff like that, I can see this be very interesting, as the skill cealing is basically endless. But I never did that, and I’m more interested in playing other games.\n\nFun to watch tourneys every now and then, but I’m not that interested in playing myself.\n\nI like to do some chess puzzles on my phone while sitting on the toilet tho. That’s very fun!",
    "timestamp": 1746223200
  },
  {
    "username": "Nemesis_Rex",
    "rating": 6.0,
    "comment": "Estimado",
    "timestamp": 1745100000
  },
  {
    "username": "Odei1987",
    "rating": 6.0,
    "comment": "Mítico clásico 1 vs 1 de toda la vida, personalmente prefiero las damas debido a la complejidad y duración del ajedrez, existen tantas versiones como estrellas en el universo, las mejores versiones para evitar \"accidentes\" son las imantadas.",
    "timestamp": 1744840800
  },
  {
    "username": "Plargyplop",
    "rating": 6.0,
    "comment": "Not my favourite.",
    "timestamp": 1744408800
  },
  {
    "username": "Iron_Salamander",
    "rating": 6.0,
    "comment": "I was eager to play this a kid when the adults would let me get past Checkers. I'm not particularly good at the game, I tend to be much more tactically focused and this game requires a lot of forward-thinking, but it's an important staple of the hobby.",
    "timestamp": 1743544800
  },
  {
    "username": "bm6262",
    "rating": 6.0,
    "comment": "There are so many other games that could have been competitive as Chess. Solid abstract game regardless.",
    "timestamp": 1743202800
  },
  {
    "username": "Astronica",
    "rating": 6.0,
    "comment": "This is perhaps an unfair rating, but I'm coming from a perspective of hobby board games and it's quite hard to get into and there is a lot of meta for casual players. You either know how to play chess and are good, or you're just messing around. But no one can deny the influence it's had as a game and that it's really interesting once you get into it.",
    "timestamp": 1743202800
  },
  {
    "username": "sharkker",
    "rating": 6.0,
    "comment": "Nope",
    "timestamp": 1742770800
  },
  {
    "username": "Xyt4n",
    "rating": 6.3,
    "comment": "+ learning curve\n- - - - I hate games where you need to check every possible move. It feels more like stressfull work and not like fun or intelligent play",
    "timestamp": 1741906800
  },
  {
    "username": "wagu_fann",
    "rating": 6.0,
    "comment": "It's okay, but yet again, it's one of those board games with a DnD esque community (or at least from my experience), unwilling to play the millions of other games in the world and sticking to those thousand year old rules, studying this game like there is no other. IDK, it just rubs me off for the most popular game in the world",
    "timestamp": 1740351600
  },
  {
    "username": "ncc1701jv",
    "rating": 6.0,
    "comment": "I'd love to own a really nicely crafted version of this some day, or even cooler, that 3d Star Trek version.",
    "timestamp": 1738450800
  },
  {
    "username": "discountjeans37",
    "rating": 6.0,
    "comment": "No matter how hard i try i can't really get a grasp on the strategy. Partly i just find myself impatient as the game starts rather slow and i dont like the restrictive feel of the set up.",
    "timestamp": 1737154800
  },
  {
    "username": "Yurienu",
    "rating": 6.0,
    "comment": "1-2 joueurs",
    "timestamp": 1736636400
  },
  {
    "username": "devuna",
    "rating": 6.0,
    "comment": "I want to be a completionist and I saw it on my shelf so I put chess here. Awesome game but I'm bad",
    "timestamp": 1736377200
  },
  {
    "username": "CharlieMnemonic",
    "rating": 6.0,
    "comment": "Never got into Chess, but it’s a classic so I feel everyone should own a copy. Also, it looks nice with the rest of my 3M games.",
    "timestamp": 1736290800
  },
  {
    "username": "adamscottstewart",
    "rating": 6.0,
    "comment": "Xavier likes to play this.",
    "timestamp": 1736031600
  },
  {
    "username": "Namenotfound999",
    "rating": 6.0,
    "comment": "This game is big but I'm terrible at strategy, it's fun if you have a brain the size of a walnut.",
    "timestamp": 1736031600
  },
  {
    "username": "Misiek14",
    "rating": 5.5,
    "comment": "Am not a good player and I prefer to play with more random games",
    "timestamp": 1735686000
  },
  {
    "username": "pauloantunes",
    "rating": 6.2,
    "comment": "(in the Kids collection.)\n\nIt's from my childhood. We have 3 sets in one box.",
    "timestamp": 1734822000
  },
  {
    "username": "melanie_remi",
    "rating": 6.0,
    "comment": "Asterix",
    "timestamp": 1733785200
  },
  {
    "username": "Sanderus_2008",
    "rating": 6.0,
    "comment": "Chess at a good level is work. Very hard work. It is not fun and entertainment.",
    "timestamp": 1733612400
  },
  {
    "username": "drmark64",
    "rating": 6.0,
    "comment": "Pressman 3 in 1 version.",
    "timestamp": 1732316400
  },
  {
    "username": "pezboy",
    "rating": 6.0,
    "comment": "KEEP",
    "timestamp": 1732230000
  },
  {
    "username": "bbolch",
    "rating": 6.0,
    "comment": "Maybe the most well known game world wide. Chess is a classic and there are people who dedicate there lives to learning the game. I enjoy chess on a very casual level.",
    "timestamp": 1731366000
  },
  {
    "username": "Redweek",
    "rating": 6.0,
    "comment": "Classic\n100% Strategy & technique",
    "timestamp": 1729461600
  },
  {
    "username": "Spengliosis",
    "rating": 6.0,
    "comment": "strategy; 2-player",
    "timestamp": 1728943200
  },
  {
    "username": "tphon",
    "rating": 6.0,
    "comment": "No Cards",
    "timestamp": 1728511200
  },
  {
    "username": "Kazz711",
    "rating": 5.5,
    "comment": "(Rated but 0 logged plays as I do not log online plays and have not played in person since i started logging plays but have played online plenty)",
    "timestamp": 1727215200
  },
  {
    "username": "Telaz",
    "rating": 6.0,
    "comment": "My rating(50%): 7\nMy “want to play-again” rating(50%): 5\nMy overall rating: 6\nPlays: 100+",
    "timestamp": 1727128800
  },
  {
    "username": "DannyDoo",
    "rating": 6.0,
    "comment": "1 Sell",
    "timestamp": 1726264800
  },
  {
    "username": "aquinha",
    "rating": 6.0,
    "comment": "Já Joguei",
    "timestamp": 1725314400
  },
  {
    "username": "Smagi",
    "rating": 6.0,
    "comment": "Liczba graczy: 2\nCzas gry: 60 minut",
    "timestamp": 1724709600
  },
  {
    "username": "Racelympics",
    "rating": 6.0,
    "comment": "Checkmate, this game still remains a classic. Would play if it springs up to mind.",
    "timestamp": 1722290400
  },
  {
    "username": "mudville9",
    "rating": 6.0,
    "comment": "A classic but 2P perfect information abstracts are not usually my jam.",
    "timestamp": 1720044000
  },
  {
    "username": "Tommyblockhead20",
    "rating": 6.0,
    "comment": "It's ok",
    "timestamp": 1719698400
  },
  {
    "username": "Rasdel",
    "rating": 6.0,
    "comment": "A classic. Though I don't play it as much as I used to, it's probably the best classic game ever made.",
    "timestamp": 1719698400
  },
  {
    "username": "axsk",
    "rating": 6.0,
    "comment": "a classic. but more of a study then a game since the internet.",
    "timestamp": 1717884000
  },
  {
    "username": "LiatKolink",
    "rating": 6.0,
    "comment": "A classic game that IMO doesn't stand the test of time compared to modern abstract board games. More fun with variants though.",
    "timestamp": 1717192800
  },
  {
    "username": "Raskzac",
    "rating": 6.0,
    "comment": "It is a classic for some reason, and incredibly hard to master.",
    "timestamp": 1717192800
  },
  {
    "username": "VikingBurger",
    "rating": 6.0,
    "comment": "Nagyon jó játék, de tipikusan olyan, hogy rá kell szánni az életed, annyit lehet tanulni belőle.\nEngem meg nem vonzanak az absztraktok, hogy ennyit beleöljek. Évekig jártam szakkörre is, most is játszok szívesen, de a modern játékok mellett nem rúg labdába számomra.",
    "timestamp": 1716242400
  },
  {
    "username": "Flummoxa",
    "rating": 6.0,
    "comment": "begrudgingly enjoyed despite pretentious dryness.",
    "timestamp": 1715032800
  },
  {
    "username": "Halmarsta",
    "rating": 6.0,
    "comment": "Folded into collection from s.o.'s collection",
    "timestamp": 1713909600
  },
  {
    "username": "PBandJellyfish",
    "rating": 7.0,
    "comment": "@SC & @TX",
    "timestamp": 1760824800
  },
  {
    "username": "ethanbg20",
    "rating": 6.5,
    "comment": "My chess.com profile:\nhttps://www.chess.com/member/demoreo21",
    "timestamp": 1760306400
  },
  {
    "username": "Togii",
    "rating": 6.6,
    "comment": "Strategic Depth: 10/10\nRNG Mitigation: 10/10\nGoofiness Potential: 1/10\nSimplicity: 9/10\nArtistic Direction: 4/10\n\nTime Commitment: 30 min",
    "timestamp": 1760306400
  },
  {
    "username": "Drez",
    "rating": 7.0,
    "comment": "Classic from childhood that I still occasionally enjoy.",
    "timestamp": 1760133600
  },
  {
    "username": "ValerianofEternia",
    "rating": 7.0,
    "comment": "Pros :\n• Simple rules with deep strategic complexity\n• Large global community for social interaction\n• Plenty of resources available to improve at all skill levels\n\nCons :\n• Rewards pattern knowledge and experience more than creativity\n• Games can end in deadlocked situations where no player can win\n• Visually dull and unappealing\n\nConclusion :\nA timeless classic suited for enthusiasts willing to invest time in deep learning.",
    "timestamp": 1759615200
  },
  {
    "username": "MorelliBuendia",
    "rating": 7.0,
    "comment": "I hate that at a certain point it becomes a matter of studying and memorizing openings, traps, etc. However, gotta respect a solid design and it has given me many hours of fun, both in person and online. I have no interest in studying Chess, though.\n\nMogul Scale: 1/E (duh).",
    "timestamp": 1759528800
  },
  {
    "username": "Robscot75",
    "rating": 6.6,
    "comment": "2 P\nW 3.7\n60 M",
    "timestamp": 1759010400
  },
  {
    "username": "hayhoenstuff",
    "rating": 7.0,
    "comment": "I mean yeah it's literally chess, hard to mess up. Some of the models in this specific Buffy set are ugly as sin but it plays as chess and chess is great.",
    "timestamp": 1758837600
  },
  {
    "username": "Kroomiester",
    "rating": 7.0,
    "comment": "Chess is a game I long avoided as I viewed it as inaccessible and filled with pretentious and condescending players. It is all of those things, but the game itself is a lot of fun to learn, and not many other games have a wealth of knowledge and research devoted to optimizing and teaching the game to new players. I am rated 600 playing occasionally online, but I most enjoy chess over the board, casually with someone I know or would like to get to know",
    "timestamp": 1758578400
  },
  {
    "username": "rongbeo93",
    "rating": 7.0,
    "comment": "What more can I say about chess? It’s a timeless design—simple rules yet incredibly deep strategy. It’s one of the most celebrated board games in the world, with a competitive scene that almost everyone knows about. I enjoy it and still play from time to time on chess.com, but the truth is I’m just not good enough. I don’t really have the git gud mentality, and no matter how much I try, I’m stuck around the 1200 ELO range. Because of that, I don’t think it will ever be one of my personal favorites, even if I respect it immensely.",
    "timestamp": 1757023200
  },
  {
    "username": "sarahrob",
    "rating": 7.0,
    "comment": "You should really try this new game. Lots of replayability.",
    "timestamp": 1756850400
  },
  {
    "username": "CKaefe",
    "rating": 6.5,
    "comment": "I like the abstract puzzle. But I do have some resistance in playing it for the fact that in the past it was a game I played a lot and also the theme just doesn't flow with me.",
    "timestamp": 1756764000
  },
  {
    "username": "Dasoogle",
    "rating": 7.0,
    "comment": "I've always enjoyed my few plays of Chess. It's hard to find people who want to play this kind of game.",
    "timestamp": 1756677600
  },
  {
    "username": "Bozok",
    "rating": 7.0,
    "comment": "The strategic and tactical depth is clear. I'd probably want to play it more if there weren't such amazing modern games. And if I'm going for a game hundreds of years old, I'd rather play Go.",
    "timestamp": 1756159200
  },
  {
    "username": "espoon82",
    "rating": 7.3,
    "comment": "A classic when you're looking for a thoughtful, abstract zen experience. I used to be an avid player, but one day I just was chessed out. Still have a healthy respect for chess and its advocates, though. It's one of the grand-parents of board games!",
    "timestamp": 1755813600
  },
  {
    "username": "Predicador",
    "rating": 7.0,
    "comment": "El clásico juego de mesa del Ajedrez",
    "timestamp": 1755468000
  },
  {
    "username": "ItsMagic",
    "rating": 7.2,
    "comment": "mastering spreading ready game-like deductive banishing tactile offering",
    "timestamp": 1755208800
  },
  {
    "username": "GeminiWeb",
    "rating": 7.0,
    "comment": "I definitely go through my 'chess phases' as I tended to play alot when I was younger. Now I just tend to occassionally skim through one of my old chess books ...",
    "timestamp": 1754863200
  },
  {
    "username": "Hoodie_Wearing_Idiot",
    "rating": 7.0,
    "comment": "Bro 1474 had to have been boring as heck",
    "timestamp": 1754344800
  },
  {
    "username": "cicerunner",
    "rating": 7.0,
    "comment": "Estimated 400 unlogged plays pre 2020, in the preceding 40+ years ... )",
    "timestamp": 1754258400
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 7.0,
    "comment": "Where it all begins- usually as a kid. Chess (or 'Stress') is strategy stripped down to bare essentials- an arena where 2 minds can clash. I played since the age of 8 and slowed down in my late teens. It will always be a classic destined to outlast almost any game, much like 'Go'. Like most abstracts, it shines when played by two of relatively equal ability.",
    "timestamp": 1753740000
  },
  {
    "username": "Raul Catalano",
    "rating": 7.0,
    "comment": "Old classic never dies ...",
    "timestamp": 1753653600
  },
  {
    "username": "rws2029",
    "rating": 6.8,
    "comment": "Played a lot in my youth but I lost interest in the abstract strategy genre after I discovered games rooted in history. A game’s theme, or story, has become a deciding factor in my enjoyment.\n\nReasons to love chess:\n• a centuries long tradition and tournament history;\n• cross-cultural and international appeal;\n• nostalgia (many happy childhood memories associated with this game);\n• appeals to a certain ultra competitive cerebral personality type;\n• a solid abstract design for puzzle aficionados;\n• simple rules;\n• low cost of entry;\n• the physical components are pleasant to handle, and can be made into art in and of themselves.",
    "timestamp": 1753308000
  },
  {
    "username": "zeal",
    "rating": 7.1,
    "comment": "Classic, good game sets the standard in 2 player abstract.",
    "timestamp": 1752703200
  },
  {
    "username": "Momo_Train",
    "rating": 7.0,
    "comment": "Fun Fun",
    "timestamp": 1752271200
  },
  {
    "username": "SaltedPork",
    "rating": 7.4,
    "comment": "Still waiting for the expansion to come out!",
    "timestamp": 1752184800
  },
  {
    "username": "Cerberus777",
    "rating": 7.0,
    "comment": "----------------------------------------------------------------------------------------------------\nI use this space only to space keep my default rating template\n----------------------------------------------------------------------------------------------------\n\n (FK)(FLC & LV)\n\n(App owned)\n\n Important Award!\n My Best (type) Game!\n My Best (mechanism) Game!\n My Best (mechanism) Filler Game!\n\n\n IMPORTANT NOTE: TEMPORARY RATING\n\n\nDigital Games Played = 0 times\n\n**********\n\nBase Game: Games Played = 0 times\n\nWith Expansions: Games Played = 0 times\n\n\n\n COMPLETE RATING:\n\n\nSCORE  CRITERIA       WEIGHTING       ------- STAR RATING SCALE -------\n\n(7.0) FUN             (x15):         BORING  REALLY FUN\n\n(7.0) GAMEPLAY         (x5):       NO DEPTH  LOT OF DEPTH (FOR THE WEIGHT)\n(7.0) GAME FLOW        (x5):         FIDDLY  SILKY SMOOTH\n(7.0) DOWNTIMES        (x2):         LOT OF  ZERO\n(7.0) RANDOMNESS       (x2):      PURE LUCK  PURE SKILLS\n(7.0) MECHANICS        (x2):         BORING  INTERESTING / INNOVATIVE\n\n(7.0) REPLAYABILITY    (x5):           ZERO  INFINITE\n(7.0) SCALABILITY      (x3):           POOR  GREAT AT ALL PLAYER COUNTS\n(7.0) PORTABILITY      (x1):          BULKY  SUPER EASY TO PLAY ANYWHERE\n\n(7.0) THEME            (x1):   UNATTRACTIVE  ATTRACTIVE\n(7.0) AESTHETICS       (x1):           UGLY  GORGEOUS\n(7.0) COMPONENTS       (x1):    LOW QUALITY  HIGH QUALITY\n(7.0) VALUE            (x2):  TOO EXPENSIVE  REALLY CHEAP(LOW COST FOR WHAT WE GET)\n\n(7.0) SETUP TIME       (x2):           LONG  ZERO\n(7.0) GAME LENGTH      (x2): TOO SHORT/LONG  JUST PERFECT\n(7.0) RULES COMPLEXITY (x1):        COMPLEX  SIMPLE\n\n\nTOTAL = 350.0/50 = 7.00\n\n\n POSITIVE POINTS:\n\n++ ABC\n\n\n NEGATIVE POINTS:\n\n-- ABC\n\n\n OTHER GAME INFO:\n\nGame Weight = X.X/5\nRelease Date = YYYY\nNumber of Player = X-X\nApp game length = XX-XX min.\n1-player length = XX-XX min.\n2-player length = XX-XX min.\nX-player length = XX-XX min.\nPlayer Count Preference = Best at x, great at x, recommended at x! \n\n\n\n\n----------------------------------------------------------------------------------------------------\nI use this space to gather my Awards that are not given to any games yet\n----------------------------------------------------------------------------------------------------\n\n\n My 3rd Best Outdoor Game!\n My 4th Best Outdoor Game!\n My 5th Best Outdoor Game!\n\n My 4th Best IP-Based Game!\n My 5th Best IP-Based Game!\n\n My 2nd Best Economic Game!\n My 3rd Best Economic Game!\n My 4th Best Economic Game!\n My 5th Best Economic Game!\n\n My 5th Best Combo-Chaining Game!\n\n----------------------------------------------------------------------------------------------------\n\n\n My 3rd Best Deduction Game!\n My 4th Best Deduction Game!\n My 5th Best Deduction Game!\n\n My 3rd Best Time Track Game!\n My 4th Best Time Track Game!\n My 5th Best Time Track Game!\n\n My 3rd Best Storytelling Game!\n My 4th Best Storytelling Game!\n My 5th Best Storytelling Game!\n\n My 4th Best Deckbuilding Game!\n My 5th Best Deckbuilding Game!\n\n My 3rd Best Trick-Taking Game!\n My 4th Best Trick-Taking Game!\n My 5th Best Trick-Taking Game!\n\n My 5th Best Card-Drafting Game!\n\n My 5th Best Modular Board Game!\n\n My 4th Best Card Layering Game!\n My 5th Best Card Layering Game!\n\n My 4th Best Dice-Drafting Game!\n My 5th Best Dice-Drafting Game!\n\n My 4th Best Set-Collection Game!\n My 5th Best Set-Collection Game!\n\n My Best Roll and Write Game!\n My 2nd Best Roll and Write Game!\n My 3rd Best Roll and Write Game!\n My 4th Best Roll and Write Game!\n My 5th Best Roll and Write Game!\n\n My 3rd Best Press Your Luck Game!\n My 4th Best Press Your Luck Game!\n My 5th Best Press Your Luck Game!\n\n My 5th Best Auction/Bidding Game!\n\n My 3rd Best Pattern Building Game!\n My 4th Best Pattern Building Game!\n My 5th Best Pattern Building Game!\n\n My 5th Best Variable Scoring Game!\n\n My 3rd Best Pick-up and Deliver Game!\n My 4th Best Pick-up and Deliver Game!\n My 5th Best Pick-up and Deliver Game!\n\n My 3rd Best Commodity Speculation Game!\n My 4th Best Commodity Speculation Game!\n My 5th Best Commodity Speculation Game!\n\n My 3rd Best Point to Point Movement Game!\n My 4th Best Point to Point Movement Game!\n My 5th Best Point to Point Movement Game!\n\n My 4th Best Network and Route Building Game!\n My 5th Best Network and Route Building Game!\n\n My 5th Best Simultaneous Action Selection Game!\n\n My 4th Best Multiple or Variable End-Game Conditions Game!\n My 5th Best Multiple or Variable End-Game Conditions Game!",
    "timestamp": 1752098400
  },
  {
    "username": "NikolasGimli",
    "rating": 7.0,
    "comment": "Good but hard to find even matches",
    "timestamp": 1751752800
  },
  {
    "username": "Infernotitan2",
    "rating": 7.0,
    "comment": "117",
    "timestamp": 1751234400
  },
  {
    "username": "seb_48784",
    "rating": 7.0,
    "comment": "Hundreds of games since my childhood. Due to the lack of a luck factor, it has little in common with what we usually think of as a “game”—it’s more of a battle of wits.\nPrecisely because of that, I rarely play it these days. There are already enough things in everyday life that require intense thinking.\nStill, I have the utmost respect for this timeless cultural achievement.",
    "timestamp": 1750888800
  },
  {
    "username": "RodRahmati",
    "rating": 7.0,
    "comment": "▲ Bom quando jogado com alguém do seu nível\n▲ Altamente tático & estratégico\n\n▼ Jogadores esnobes\n▼ Difícil achar quem queira aprender\n▼ Ficar decorando jogadas",
    "timestamp": 1750111200
  },
  {
    "username": "Silberback",
    "rating": 7.0,
    "comment": "I used to own the Gary Kasparov youth edition.",
    "timestamp": 1750024800
  },
  {
    "username": "Alex_P_",
    "rating": 8.0,
    "comment": "Can't beat a classic.",
    "timestamp": 1760911200
  },
  {
    "username": "defexx",
    "rating": 8.0,
    "comment": "high skill ceiling, difficult to get into, playing with a clock makes it a different game - much recommended",
    "timestamp": 1760738400
  },
  {
    "username": "GomJabbar",
    "rating": 8.1,
    "comment": "My Rank: 49",
    "timestamp": 1758146400
  },
  {
    "username": "TowersAlez",
    "rating": 8.0,
    "comment": "Casa",
    "timestamp": 1758060000
  },
  {
    "username": "ll_cool_aid1",
    "rating": 8.0,
    "comment": "have a classic chess set (glass) and the OP games Super Mario themed set from 2009",
    "timestamp": 1757973600
  },
  {
    "username": "alialkabah",
    "rating": 8.0,
    "comment": "such a frustrating game",
    "timestamp": 1757973600
  },
  {
    "username": "expliquemoica",
    "rating": 8.0,
    "comment": "Bonjour,\nje vous présente : ♟️ÉCHECS♟️\n\nLa présentation et la règle du jeu sur la chaîne YouTube expliquemoica\n\n⌛la présentation rapide:\nhttps://youtu.be/OEjXJNWs4Is\n\n? les règles complètes:\nhttps://youtu.be/XF750qmnyRY\n\n?‍?‍? 2 joueurs\n? 8 ans\n⏱ 20 min\n⚙️ stratégie, placement\n\n? Les échecs sont un grand classique : stratégie, anticipation et réflexion sont au cœur de chaque partie.\nAffrontez vos adversaires et tentez de devenir maître de l’échiquier !\nDans cette vidéo je vous donne les bases et des astuces pour bien débuter.\n\nBonne journée ludique !\n\n1:21 Mise en place de l’échiquier\n2:00 Déplacement de chaque pièce\n7:30 Échec, Échec & Mat : la différence\n9:00 Mat du fou (victoire en 2 coups)\n10:25 Coup du berger (victoire en 4 coups)\n12:29 Pat (match nul aux échecs)\n13:30 Petit et grand roc (la défense du roi)\n15:44 La prise en passant (coup spécial du pion)\n16:31 Comment transformer un pion en dame\n17:34 Conclusion\n\n---------------------------------------------------------\n?Soutenir la chaine ?\n?un follow, un pouce bleu, un partage\nhttps://youtube.com/expliquemoica/?sub_confirmation=1\n\n?un petit don sur https://fr.tipeee.com/expliquemoica\n\n?en utilisant un lien de mes liens affiliés et tous mes réseaux ici:\nhttps://linktr.ee/expliquemoica\n?merci?\n\nVidéos règles, gyroroues, Lives , des promos, des codes de réduction, geek et high tech etc....\n----------------------------------------------------------\n\n#échecs #j2s #jds #boardgame #ambiance #fun #coop #jeuxdesociete #jeuxfamille #jeufamilial #jeu #expliquemoica",
    "timestamp": 1757628000
  },
  {
    "username": "PaladinX13",
    "rating": 7.8,
    "comment": "Initial score was 6.5, but Summer 2025 upgraded to 7.8 after many plays with the kids and trying many variants which lighten the game. Dice, Atomic, Monster (Super King), Crazyhouse, and Duck chess were favorites.",
    "timestamp": 1757109600
  },
  {
    "username": "Avid_Equinox",
    "rating": 8.0,
    "comment": "Not the most thrilling game but due to many active players and a viable competitive scene, is a top tier game if you want to get into a lifestyle game as there are people actually playing it at a high level (unlike most modern board games).",
    "timestamp": 1756159200
  },
  {
    "username": "surrutia",
    "rating": 8.0,
    "comment": "2",
    "timestamp": 1755295200
  },
  {
    "username": "c0sMyc",
    "rating": 8.0,
    "comment": "I don't have a play count, and haven't played in a decade. Influential, simple yet complex, prone to giving players inflated sense of self worth and elitism. Worth learning and then maybe moving on from.",
    "timestamp": 1755208800
  },
  {
    "username": "chickenwang",
    "rating": 8.0,
    "comment": "print, online",
    "timestamp": 1755208800
  },
  {
    "username": "rolle",
    "rating": 8.0,
    "comment": "-",
    "timestamp": 1755122400
  },
  {
    "username": "guice",
    "rating": 8.0,
    "comment": "Mobile",
    "timestamp": 1753480800
  },
  {
    "username": "Thorigor",
    "rating": 8.0,
    "comment": "The king (pun intended) of all abstract strategy games. Chess is a fully tactical brain-burner with zero luck in its gameplay. That may be great or terrible, depending on your preferences. Having an opponent of similar skill is recommended, in order to have balanced matches.",
    "timestamp": 1753308000
  },
  {
    "username": "GMITASSO",
    "rating": 8.0,
    "comment": "It's chess.",
    "timestamp": 1753135200
  },
  {
    "username": "mikhail_wind_rises",
    "rating": 8.0,
    "comment": "Эталон абстрактных игр. Глубина и лаконичность",
    "timestamp": 1753048800
  },
  {
    "username": "papa_bear_is_asleep",
    "rating": 8.0,
    "comment": "I have a hard time rating this. I used to play a lot of correspondence chess, and a little OTB. I even spent a few years teaching chess to school-age kids. I've figured out that, as much as I love abstract, perfect information games in theory, my personality flaws of perfectionism and obsessiveness result in near total analysis paralysis when I play them.",
    "timestamp": 1752962400
  },
  {
    "username": "irie_pepe",
    "rating": 8.0,
    "comment": "The king of all board games, around since centuries and still fascinating the people (and me).",
    "timestamp": 1752271200
  },
  {
    "username": "ker42",
    "rating": 8.0,
    "comment": "An all-time classic and one of the best pure strategy games",
    "timestamp": 1752012000
  },
  {
    "username": "NerdWithaBow",
    "rating": 8.0,
    "comment": "8 for the components, because of the board which is cardboard and slightly smaller than the pieces.\n\nOfc chess is always a 10/10.",
    "timestamp": 1751580000
  },
  {
    "username": "Jobe_gamer",
    "rating": 8.3,
    "comment": "I am very bad at chess. I get destroyed pretty much every single time I play. I love playing it. I always have fun.",
    "timestamp": 1751493600
  },
  {
    "username": "ponchera69",
    "rating": 7.5,
    "comment": "2",
    "timestamp": 1750284000
  },
  {
    "username": "Aurion254",
    "rating": 8.0,
    "comment": "I heard that you should always play someone that is better than you if you want to improve. If you haven't played chess, you should. There's a reason it has existed for centuries. Once you get your head around the movement of the various pieces, the mechanics of the game are very simple, but it takes years to master.",
    "timestamp": 1750024800
  },
  {
    "username": "Jessdragoon",
    "rating": 8.0,
    "comment": "2 joueurs\nStratégie",
    "timestamp": 1748815200
  },
  {
    "username": "DoctorPhil",
    "rating": 7.6,
    "comment": "Criteria (out of 5)\nRules complexity 5\nPlaytime/complexity ratio 5\nStrategic avenues 5\nMechanism strength 2\nThematic integration 1\nVariability 2\nReplayability 5\nFun factor 3\nPlayer interaction 5\nElement of mastery 5\n\nOverall 7.6 out of 10",
    "timestamp": 1747778400
  },
  {
    "username": "YFlyer",
    "rating": 8.0,
    "comment": "Love playing chess but I hate the amount of time it takes to study chess openings and strategy so I don't. That's why I'm a bad chess player that loves to play.",
    "timestamp": 1747173600
  },
  {
    "username": "Haaska",
    "rating": 8.0,
    "comment": "2025",
    "timestamp": 1747000800
  },
  {
    "username": "RudyPriego",
    "rating": 7.5,
    "comment": "Un clasico de mi infancia",
    "timestamp": 1746655200
  },
  {
    "username": "javi_cin",
    "rating": 7.5,
    "comment": "2\n\n***TRAVEL***",
    "timestamp": 1746223200
  },
  {
    "username": "ur_brother",
    "rating": 8.0,
    "comment": "There's a reason this game has stood the test of time. It's one of the best games to play, so long as both players have similar skill levels, which is unfortunately relatively rare.",
    "timestamp": 1746136800
  },
  {
    "username": "curly3stgs",
    "rating": 8.0,
    "comment": "Old",
    "timestamp": 1746050400
  },
  {
    "username": "Hymn_of_Limbo",
    "rating": 8.5,
    "comment": "The fact that I can watch videos of games, puzzle along with and be wowed by moves is incredible. Few games even attempt to have that level of gameplay.\n\nChess suffers from rote openings, memorization and is probably the poster child for AP (aside from Go I guess). You really need to have someone with a similar skill level to enjoy it.\n\nPS who the heck is reading comments of chess on BGG? Godspeed you great weirdo!\n\n(50+ Plays)",
    "timestamp": 1761069240
  },
  {
    "username": "Gwen_stuffs",
    "rating": 9.0,
    "comment": "I have a sushi chessboard; it is very cute.",
    "timestamp": 1760479200
  },
  {
    "username": "ILoveMyCats",
    "rating": 8.5,
    "comment": "if it wasn't good, it wouldn't still be around after over 500 years.",
    "timestamp": 1760047200
  },
  {
    "username": "bwridge",
    "rating": 9.0,
    "comment": "A classic. Need I say more?",
    "timestamp": 1759442400
  },
  {
    "username": "GrandPseudonym",
    "rating": 9.0,
    "comment": "1v1\nBest with 2\n~30 Minutes\nMediumweight\nCompetitive\nAbstract\nStrategy",
    "timestamp": 1759183200
  },
  {
    "username": "Pasigraphy",
    "rating": 9.0,
    "comment": "The grand daddy of strategy games. Who am I to criticize it, but I didn't give it a 10. Why? I'm taking 1 point away because a true strategy game should have at least a sliver of luck or bluff involved, because on the battlefield or in real life, luck and deception both play a part in outcomes and the true strategist has to be able to deal with that too, life isn't a mathematical problem.\nOpenings, middle game, endings, time pressure, the contest, these are all worth the 9 points.\nOver the board is still the best way to play too, the online versions are too infected with cheaters, this is a case of the board very much remains superior.",
    "timestamp": 1759096800
  },
  {
    "username": "O_Gama",
    "rating": 9.0,
    "comment": "Chess is a classic game that's easy to pick up but Impossible to master. It's a perfect mix of simplicity and challenge. In chess, everyone starts with an equal chance, and winning is all about skill. This game stands as the epitome of meritocracy.",
    "timestamp": 1758060000
  },
  {
    "username": "TeamSOLUNE",
    "rating": 9.0,
    "comment": "Strategy at its finest barely even shows its age (1475!!!???)",
    "timestamp": 1757887200
  },
  {
    "username": "Aonir79",
    "rating": 9.1,
    "comment": "Check.",
    "timestamp": 1757455200
  },
  {
    "username": "TimDMighty",
    "rating": 9.0,
    "comment": "My daughter finally beat me at chess after nearly 10 years of trying. So, proud of her!",
    "timestamp": 1756245600
  },
  {
    "username": "Kaiho",
    "rating": 9.0,
    "comment": "En passant is such a fine detail in this game.\n\nBeauty of chess for me is that it teaches humility, which on wrong hands will be humilating, but with right approach is about self improvement (and constant failure). It is also a good study in how much strategic opportunities 8x8 grid can contain for an area control game and how important controlling tempo is.\n\nChess does suffer little bit from how restricted it can become when you know the game more and know what the best moves are in a given situation. It perhaps does not have strategic freedom that Go can have in that respect.",
    "timestamp": 1756159200
  },
  {
    "username": "GusiX",
    "rating": 9.0,
    "comment": "- Base -",
    "timestamp": 1755295200
  },
  {
    "username": "PCSADavis",
    "rating": 9.0,
    "comment": "The \"King\" of all two-player games.",
    "timestamp": 1755208800
  },
  {
    "username": "JacobRudd",
    "rating": 9.0,
    "comment": "Classic.",
    "timestamp": 1754517600
  },
  {
    "username": "nathanwailes",
    "rating": 9.0,
    "comment": "Great gameplay-to-rules ratio. I just think Chess960 beats it out because of the random setups eliminating the memorization of openings.",
    "timestamp": 1754431200
  },
  {
    "username": "kowalskie",
    "rating": 9.0,
    "comment": "I play online at lichess - say 'hi' some time.\n\n- i would think i must have played 100s of games of this over the years...\n\nIt's the greatest game of all time isn't it?",
    "timestamp": 1753999200
  },
  {
    "username": "macUladh",
    "rating": 9.0,
    "comment": "Superb. Simple rules, perfect information and yet impossible to master. Sadly, mismatches are common outside of ranked play, so I seldom get the chance to contest the field across a table.",
    "timestamp": 1753221600
  },
  {
    "username": "Adlerzando",
    "rating": 9.0,
    "comment": "Não jogo bem, mas é com certeza um dos jogos mais perfeitos que já existiu!",
    "timestamp": 1752616800
  },
  {
    "username": "Zenji",
    "rating": 9.0,
    "comment": "Storage Location: Pune",
    "timestamp": 1750111200
  },
  {
    "username": "shawnmackay1593",
    "rating": 9.0,
    "comment": "I don't play it often anymore but this is as good as it gets as a design. Of course, good players will always beat average players and I have no interest in learning all of the strategies so I prefer players against opponents who are around my level.",
    "timestamp": 1749679200
  },
  {
    "username": "Minh_Nguyen",
    "rating": 9.0,
    "comment": "Black Matt rekindled my love of chess so I bought a set so I could play with people occasionally. Haven't played with anyone yet. One of the few games that I've played so much that I can just about play on autopilot, using just instincts and heuristics (Carcassonne Hunters & Gatherers, Photosynthesis, and Puerto Rico probably in that category as well).",
    "timestamp": 1748901600
  },
  {
    "username": "Flateric06",
    "rating": 8.6,
    "comment": "Muss man haben. 01/22 angefangen mit Johanna zu trainieren.",
    "timestamp": 1748296800
  },
  {
    "username": "cherdan",
    "rating": 9.0,
    "comment": "For Trade:\nUmbra Wobble Chess Set\n\nStriped Ebony and Bird's Eye Maple Standard Traditional Chess Board\n\n—————\nFantastic game to watch and play. Chess has a depth that takes study to understand but reveals its beautiful depth to those who take the plunge. No other game has brought me to such intoxicating highs and devastating lows.\n\nAfter getting into Go, this one has started to lose some luster. I’ll still happily play anytime but I think Go might be taking my heart.",
    "timestamp": 1748124000
  },
  {
    "username": "VibroChimp",
    "rating": 9.0,
    "comment": "Chess gets taken for granted by a lot of modern gamers, partly due to over-familiarity and also due to the fact that it has a high skill ceiling. But if you can ignore all of that baggage and just play casually, it is an incredibly fun and engrossing experience. It’s interesting that such a large percentage of the general population knows how to play (albeit not necessarily well) a game that is deeper than most hobby board games.",
    "timestamp": 1747432800
  },
  {
    "username": "Inforllos",
    "rating": 8.9,
    "comment": "Chess.",
    "timestamp": 1747260000
  },
  {
    "username": "hououinKyoumaa",
    "rating": 9.0,
    "comment": "Its a war game, but all your opponents moves are right infront of you. You know exactly what they will do except they make a move that you were not expecting. It takes hundreds and thousands of games to master and even then there is more to learn",
    "timestamp": 1746914400
  },
  {
    "username": "Ephorus",
    "rating": 9.0,
    "comment": "What I like:\n- The ultimate \"forever\" game. Played over 1.5k games so far.\n- No luck, only skill.\n- Can be a quick blitz game for the dopamine hit or a slow burn depending on mood and preferences.\n\nWhat I dislike:\n- In person, the skill gap is often to high between players.\n- Beginning of game is too scripted due to optimal opening actions and reactions. Comes down to experience and learning the moves by heart.",
    "timestamp": 1746655200
  },
  {
    "username": "Unanan",
    "rating": 9.0,
    "comment": "Check out Fischer random or Chess960 for a better more skill intensive game.",
    "timestamp": 1746396000
  },
  {
    "username": "RangerFox",
    "rating": 9.0,
    "comment": "It is the most brilliant game ever created. The only criticism is that it only provides good experience if your opponent is on the same level as you.",
    "timestamp": 1745618400
  },
  {
    "username": "thespaniardsteve",
    "rating": 9.0,
    "comment": "2, 2",
    "timestamp": 1745445600
  },
  {
    "username": "Pelijussi",
    "rating": 9.0,
    "comment": "Still the king of 2-player games",
    "timestamp": 1744668000
  },
  {
    "username": "yoyomanhihi",
    "rating": 9.0,
    "comment": "I am fascinated by this game. Simple rules, but the most replayable of them all, and you can always become better. Even a computer does not play perfectly. However, can't rate it higher, since it's try hard more than fun.",
    "timestamp": 1744408800
  },
  {
    "username": "darkk_",
    "rating": 10.0,
    "comment": "Every game piece is important.\n\nCaptivating ✅\nEngaging ✅\nReplayability ✅\nRules ✅\nQuality ✅\n\nMy BGG Perfect 10?\nAcquired 2+ ✅",
    "timestamp": 1760824800
  },
  {
    "username": "Sketcherrrr",
    "rating": 10.0,
    "comment": "I used to play chess once or twice a year when the family got together for Christmas. Then my brother watched The Queen's Dilemma and started playing.\n\nHe crushed me one year at Christmas, which led try and get better. 1500+ games later and he still wins more than half the time haha.",
    "timestamp": 1759960800
  },
  {
    "username": "ArkhamHorrorFan",
    "rating": 10.0,
    "comment": "Beautifully crafted game with the awesome figures from the film. And with the solitaire variant I finally can get em into play!\n// prepainted",
    "timestamp": 1759874400
  },
  {
    "username": "chrisrowe1989",
    "rating": 10.0,
    "comment": "This is THE board game.",
    "timestamp": 1759356000
  },
  {
    "username": "Ddyraw",
    "rating": 10.0,
    "comment": "It's Chess, there is a reason it has been around for so long.",
    "timestamp": 1759356000
  },
  {
    "username": "Cocoabine",
    "rating": 10.0,
    "comment": "10/10: The game of kings, and the go-to game I like to play with my 5 year old.",
    "timestamp": 1758837600
  },
  {
    "username": "peterlevi",
    "rating": 10.0,
    "comment": "2\n(open)\n\nIt's such a classic for a reason. Simply a beautiful game. Utter simplicity in rules, yet so often one ends up in a uniquely-feeling game. Amazing \"Wow!\" moments. I'm not a super strong player and don't play too often, but one cannot help but appreciate the genius design and balance of the game. One of the very few games where I'd gladly enjoy watching others play.\n\nAlso, with the proper wooden pieces, chess beats almost any other game in terms of beauty and tactility.",
    "timestamp": 1758060000
  },
  {
    "username": "dabdip",
    "rating": 10.0,
    "comment": "Sync",
    "timestamp": 1757368800
  },
  {
    "username": "Vase",
    "rating": 10.0,
    "comment": "More than just a game, IMO. I have been playing regularly since I was about 8 years old and find that it gets more interesting, exciting, and beautiful the more I play, learn, and study. Certainly not for everyone, but I love chess.",
    "timestamp": 1757196000
  },
  {
    "username": "strider88",
    "rating": 10.0,
    "comment": "NM, played in tournaments since Gr. 7  Would love to be FM one day. Played roughly 100K games in my lifetime through tourneys and online sites.",
    "timestamp": 1756418400
  },
  {
    "username": "RussPSmith",
    "rating": 10.0,
    "comment": "Chess would be a perfect 10 if only it didn't need the expansion for perfection (time clock)",
    "timestamp": 1756332000
  },
  {
    "username": "Rubeus",
    "rating": 10.0,
    "comment": "El ajedrez es el juego más bello que existe, una obra maestra clásica que va más allá del propio juego: hay mucha literatura y mucho cine basado en esta obra de arte. Tiene unas reglas muy sencillas de aprender, pero su profundidad estratégica y táctica es inmensa. Un juego abstracto fascinante, el cual he jugado miles de veces a lo largo de mi vida (soy viejo ya).",
    "timestamp": 1756245600
  },
  {
    "username": "BlurryBishop",
    "rating": 10.0,
    "comment": "\"There are more adventures on a chessboard than on all the seas of the world\"\n-- Pierre Mac Orlan",
    "timestamp": 1756072800
  },
  {
    "username": "Dragonmaster256",
    "rating": 10.0,
    "comment": "Love it or hate it, it's a classic with a ton of depth. It's probably more about the opponent than the game to get the most out of it.\n\n15000 plus games and there will still always be someone better.",
    "timestamp": 1755986400
  },
  {
    "username": "Thegooddoc_help",
    "rating": 10.0,
    "comment": "Ummm it's chess?",
    "timestamp": 1755900000
  },
  {
    "username": "KoehnJ",
    "rating": 10.0,
    "comment": "The Kings' game simply deserves a 10",
    "timestamp": 1755727200
  },
  {
    "username": "YlumsGuardian",
    "rating": 10.0,
    "comment": "Still the ultimate strategy game\n\nI’m terrible at it.",
    "timestamp": 1755640800
  },
  {
    "username": "Alfasto_Barker",
    "rating": 10.0,
    "comment": "This game speaks for itself",
    "timestamp": 1755554400
  },
  {
    "username": "we3die",
    "rating": 10.0,
    "comment": "Klokke. Må ha klokke.",
    "timestamp": 1755295200
  },
  {
    "username": "Ebate",
    "rating": 10.0,
    "comment": "history has proveen why this is the Best board game ever, (and one wich is 100% skill no luck)",
    "timestamp": 1755208800
  },
  {
    "username": "Alnav1",
    "rating": 9.9,
    "comment": "Un juego que no necesita que le cambien ni una coma, que lleva jugandose siglos, con reglas sencillas pero una profundidad que posibilita la dedicación completa de una vida para dominar, con torneos federaciones y movimiento por todo el mundo y cientos de miles de jugadores diarios. Conozco a muchas personas que nunca le concederán el crédito a semejante currículum, argumentarán que es un juego donde conocer las aperturas te da una superioridad insalvable, que no merece gastar el tiempo solamente para igualar esa desventaja. Desconocen que en el ajedrez lo más importante es la táctica, el juego medio, el desarrollo de las piezas, elaborar una estrategia que permita a cada movimiento contrarestar el del contrario, permitiendo un enorme margen a la creatividad. Todo esto deja las aperturas y finales de partida como un trámite técnico importante, pero no imprescindible.\nAdemás hay un concepto que no quisiera dejar de destacar. La belleza en el ajedrez es algo que solo he podido disfrutar en su máximo esplendor en este juego. Y no me refiero solo a la partida casera aficionada donde consigues una buena combinación, sino a los miles de partidas que ha dejado la historia, que están convenientemente registradas y analizadas y que han tenido momentos de genialidad a la altura de los más grandes logros de la creatividad humana.\n\nSigo buscando dentro de los juegos de mesa modernos un juego que si quiera pueda acercarse al ajedrez",
    "timestamp": 1755036000
  },
  {
    "username": "MiniaturizedKebab",
    "rating": 10.0,
    "comment": "tf is en pessant?",
    "timestamp": 1754949600
  },
  {
    "username": "Gernial",
    "rating": 9.7,
    "comment": "I made a variant \"Pegasus chess\" where you play on two boards with 1 turn on each board/level. The 'king' above is a 'Pegasus' (can change the level AND move like a king - normally changing the level is an extra move). Anybody interested in publishing it?\nAn ultimate chess big box with a book of hundreds of variants would be great, including Chinese, Indian, Japanese and Korean chess. I have all the needed infos and ideas :-)",
    "timestamp": 1754690400
  },
  {
    "username": "Pandante",
    "rating": 10.0,
    "comment": "I grew up with chess, playing on some of the first chess machines, and occasionally with friends. I'm glad my kids have taken a liking to it too. Alternating between chess, Shogi, and Xiangqi, I've developed a love for all three, and my son will happily play any of them with me any night. I'm really lucky. My daughter fancies a game too, sometimes, and, strangely, doesn't get too upset about losing. With her, we sometimes play \"pretend castle\" after the game. As you can maybe tell, i'm not a serious chess player, and I'm sure by the time he is 10, my son will be able to beat me regularly (he's 8 and still gives me a good challenge). Chess has this image of geniuses playing it attached to it, but it can very much be enjoyed as a board game like any other. I play it like I would play, say, a game of Scythe.",
    "timestamp": 1754431200
  },
  {
    "username": "AMisi24",
    "rating": 10.0,
    "comment": "simply perfect\nyou can live your whole life just to learn it...\nendless varietys\nwith time control it can be very tense for example in a 2/3\nor 1 minute bullet",
    "timestamp": 1754258400
  },
  {
    "username": "Entices",
    "rating": 9.6,
    "comment": "Times played: 3,000+\n\nStrategy: 35/35 (A+)\nFreshness: 25/25 (A+)\nSpeed: 19/20 (A)\nEase of learning: 7/10 (C-)\nTheme: N/A (abstract)\n\nOverall: 86/90 = 9.6/10\n\nStrategy: a lower rating means the game is shallow in depth, or heavy luck is involved to win. A higher rating means the game is rich in depth, has a good skill/luck balance, and is almost always won through better skill.\nSpeed: a lower rating means the game drags on, or not much happens when it’s not your turn. A higher rating means time flies when playing this game, or that things continue happening even when it’s not your turn. (The overall length of a game is not what is being rated, though this may contribute to the rating.)\nFreshness: a lower rating means the game usually feels the same and stagnant. A higher rating means the game constantly feels different and new.\nEase of learning: a lower rating means the rules are complex or cumbersome for most people. A higher rating means the rules can be grasped by most without a huge time input.\nTheme: a lower rating means the vibe isn’t the most compelling, or that the mechanics don’t thematically relate to the game’s world. A higher rating means the vibe is beautiful and fascinating, or that the mechanics thematically relate to the game’s world.\n\nEach category is weighted differently based on how much it matters to me for the overall rating. For example, I believe the level of skill and luck involved and the speed of the game contributes more to the overall enjoyment of a game than the theme of a game or its initial ease of learning, but others may disagree.",
    "timestamp": 1754258400
  },
  {
    "username": "Sunitzme",
    "rating": 10.0,
    "comment": "The best classic board game to play for life skills.",
    "timestamp": 1754172000
  },
  {
    "username": "JesusChristIsKing97",
    "rating": 10.0,
    "comment": "A játékok csúcsa",
    "timestamp": 1752876000
  },
  {
    "username": "Giangigione",
    "rating": 10.0,
    "comment": "Google \"En Passant\"",
    "timestamp": 1752789600
  },
  {
    "username": "Oliver_D",
    "rating": 10.0,
    "comment": "Does not need an expansion :-)",
    "timestamp": 1752012000
  },
  {
    "username": "Ya1r",
    "rating": 10.0,
    "comment": "Tal vez sea el juego de mesa más famoso de todos los tiempos. Este juego es más que un juego de mesa, es un deporte, y para muchos un hobby que dura toda la vida. Es imposible no darle 10 al ajedrez, entiendo nueves por quienes les pueda parecer aburrido pero menos es una falta de respeto, o de no entender el juego y el impacto que tiene a nivel mundial. Probablemente el mejor juego de estrategia que existe, fácil de aprender y tan profundo que ningún humano puede llegar a dominar al 100%, con iconos y estrellas del deporte como Magnus Carlsen, una comunidad de millones de personas, el respaldo de organizaciones, un juego del que incluso algunos afortunados pueden llegar a vivir dando clases o como competidores, etc.",
    "timestamp": 1749938400
  },
  {
    "username": "ProgramMan",
    "rating": 10.0,
    "comment": "2 players; abstract game\n8x8 board\nVariant Board Sizes:\n3x4 cardboard (let’s catch the lion) in box\n4x4 / 6x6 / 4x6 cardboard (bosworth) in box\n4x4 cardboard (flip over frog) in box\n4x5 heavy duty paper (self-print)\n5x5 cardboard (talat)\n5x5 cardboard (six making)\n5x5 cardboard (all queens) in box\n5x5 heavy duty paper (self-print)\n5x6 cardboard (quick chess)\n6x6. cardboard (quick checkers)\n7x9 / 9x11 cloth (dragon face) in tube\n9x9 vinyl (18”x18”)\n9x9 cardboard (18”x18”) (ministers chess) in box\n10x10 vinyl (18”x18”)\n10x10 vinyl (22.5”x22.5”)\n11x11 vinyl (16”x16”) 4-handed checkers\n12x12 vinyl\n8x15 vinyl\n\n37-hexagons heavy duty paper (Polgar Superstar)\n48-hexagons vinyl (hexes) in hexes bag\nInfinite chess board\n\n3-way vinyl\n4-way vinyl\n\nVariant Pieces: 2w&2b Archbishops, 2w&2b Camels, 3w&3b Cannons, 2w&2b Chancellors, 2w&2b Dragons, 1y Duck, 3w&3b Elephants, 2w&2b Emperors, 3w&3b Falcons, 2w&2b Fortresses, 2w&2b Giraffes, 3w&3b Leopards, 2w&2b Rats/Mice, 2w&2b Unicorns, 2w&2b Rhinoceroses, 2w&2b Lions, 1w&1b Wildebeest, 1w&1b Wizard\n\n2w&2b Longbowmen (short range bishops)\n2w&2b Onagers (short range rooks)\n2w&2b Ren. Castles, 2w&2b Ren. Knights (Knight Riders)\n3w&3b Ren. Pawns (Super Pawns)\n4 unpainted mini wizards, 4 unpainted crocs/alligators\n\nSimpsons’ Chess pieces w/o board\n\nPurchase: Superchess board ($15)\nPurchase Griffins?? Bombardes?? $21??\nhttp://rover.ebay.com/rover/1/1185-53479-19255-0/1?type=4&ca...\n\nLooking for vinyl 7x7 board and\nA vinyl 8x10 board",
    "timestamp": 1749938400
  }
]