[
  {
    "username": "Silencer2003",
    "rating": 1.0,
    "comment": "DON'T BUY this Version for this amount of Money - buy an old Version:\nNothing new to the Gameplay\nNothing new to Minis or Map\nDual-Layer Boards and pre shaded Buildings are not worth >200$ !!!\nDon't let you milk like a cashcow - go to other new / great games",
    "timestamp": 1761127500
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Old pre-German design that didn't really stood the test of time.",
    "timestamp": 1684188000
  },
  {
    "username": "Biscotti",
    "rating": 1.0,
    "comment": "Good game for someone just starting out playing board games. Neat plastic game pieces.",
    "timestamp": 1363647600
  },
  {
    "username": "fr014371",
    "rating": 1.0,
    "comment": "http://boardgamegeek.com/thread/706190/army-crests-could-som...\nWhy do American never learned to respect other country's history, even though you designed a game with such an exciting background?",
    "timestamp": 1326668400
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1627423200
  },
  {
    "username": "seepieceeggshell",
    "rating": 2.0,
    "comment": "More interesting than Risk but with many of the same problems. Random initial seeding of the map can take people out of the running before their first turn. Also the game will very rarely actually end, it just makes more sense to call it early.",
    "timestamp": 1611270000
  },
  {
    "username": "qwints",
    "rating": 2.0,
    "comment": "Badly needs a rules update",
    "timestamp": 1470348000
  },
  {
    "username": "oskari",
    "rating": 2.0,
    "comment": "An old Risk variant with player elimination and excessive downtime. Boring, pointless, and way too long.",
    "timestamp": 1133910000
  },
  {
    "username": "Ramen",
    "rating": 3.0,
    "comment": "Too long for the decision space. So many better modern area control games.",
    "timestamp": 1708210800
  },
  {
    "username": "melau",
    "rating": 3.0,
    "comment": "Played the German version. Simple beer and bretzel game.",
    "timestamp": 1581894000
  },
  {
    "username": "benjaminehlers1",
    "rating": 3.0,
    "comment": "Never actually made it through a full game, way too long and too little enjoyment... Gave it away a while back to a group of friends that like longer games.",
    "timestamp": 1578610800
  },
  {
    "username": "macrsson",
    "rating": 3.0,
    "comment": "I always have disliked strategy games which start with a randomized distribution of territories or armies. This game is a perfect example.",
    "timestamp": 1563228000
  },
  {
    "username": "Huldor",
    "rating": 4.0,
    "comment": "Turns are way to long and like with other older board-games half way there is a winner/ loser runoff effect where 1 or 2 players are very likely going to win while 1 or 2 players can never get back on-track with them. resulting in a waiting game instead of fun",
    "timestamp": 1699830000
  },
  {
    "username": "bhudson1972",
    "rating": 4.0,
    "comment": "Greatly enjoyed this game when I was in high school. I still own, but I have it in storage as I don't foresee ever playing this with my daughters. Takes too long to play.",
    "timestamp": 1653429600
  },
  {
    "username": "stenole",
    "rating": 4.0,
    "comment": "(5P) Area control game where you try to gain dominance in Japan. Slightly dated.",
    "timestamp": 1652652000
  },
  {
    "username": "heli",
    "rating": 4.0,
    "comment": "http://spotlightongames.com/military/mnights/sa.html#shogun",
    "timestamp": 1593468000
  },
  {
    "username": "nerman8r",
    "rating": 5.0,
    "comment": "2 to 5 players. Got this used at a local store, surprisingly with all the pieces. I have played this once, and it was alright.",
    "timestamp": 1761017700
  },
  {
    "username": "Kiyote",
    "rating": 5.0,
    "comment": "Leisure Ways 1988",
    "timestamp": 1739919600
  },
  {
    "username": "Bust Nak",
    "rating": 5.0,
    "comment": "Sold",
    "timestamp": 1733266800
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "An oldie from way back.",
    "timestamp": 1724796000
  },
  {
    "username": "Vorpa",
    "rating": 5.0,
    "comment": "Has some nice mechanics, but after a few rounds it bogs down into an endless exchange of minor provinces with no real direction.",
    "timestamp": 1705100400
  },
  {
    "username": "jtarno",
    "rating": 5.0,
    "comment": "Was a great game had to let it go at the time. Looking forward to picking up the reprint Ikusa.",
    "timestamp": 1700089200
  },
  {
    "username": "HiTracey",
    "rating": 5.0,
    "comment": "Shogun: This Risk variant is a nice design, and is very evocative with a number of clever elements. It can be long if the if the players serially pull back the leader rather than one alliance or other prevailing. Ultimately one player may win through as the others start to consider hare kiri as a viable alternative to playing on (and on).\n\nSlightly revised rules. Complexity - 2/10",
    "timestamp": 1692568800
  },
  {
    "username": "gstevens31",
    "rating": 5.0,
    "comment": "played MB Samurai Swords. Wouldn't mind trying the update.",
    "timestamp": 1677538800
  },
  {
    "username": "John Tenzer",
    "rating": 6.0,
    "comment": "One of the many Risk-like Strategy Dudes-On-A-Map wargames out there.\nThis time around with the Sengoku-periode Civil War of Medieval Japan as thematic background.\n\nPlayers act as powerful Lords who send out their private armies led by generals into the land to conquer provinces. There is an experience point RPG system for their generals, random turn order and a bidding maket for dangerous Ninjas included, that can be ordered to kill experienced enemy generals.\n\nAll in all a more detailed, engaging setting and game, that s dripping full of theme due to the artwork of all gamng piece including its miniatures.\n\nAn all time classic - that competes with modern titles mostly through its nostalga factor.",
    "timestamp": 1744668000
  },
  {
    "username": "Lord_Loren_Soth",
    "rating": 6.0,
    "comment": "2-5",
    "timestamp": 1708038000
  },
  {
    "username": "lorax21",
    "rating": 6.0,
    "comment": "My copy is titled 'Samurai Swords'. It's better than Risk with its greater complexity but I find something unsatisfying about historical wargames. They pretend to be historical, yet they invite players to do things that never happened historically. In the end, I generally prefer straightforward fictions.",
    "timestamp": 1706655600
  },
  {
    "username": "dwruck",
    "rating": 5.8,
    "comment": "It is a better version of Risk but too much luck for a strategy game.",
    "timestamp": 1706050800
  },
  {
    "username": "Timmi",
    "rating": 5.5,
    "comment": "Jugendsünde",
    "timestamp": 1668466800
  },
  {
    "username": "collezionista",
    "rating": 6.0,
    "comment": "QUI 22.04.2022",
    "timestamp": 1650578400
  },
  {
    "username": "BillNC",
    "rating": 6.0,
    "comment": "Fun, but long.",
    "timestamp": 1648504800
  },
  {
    "username": "CirdanD",
    "rating": 6.0,
    "comment": "Great game. Miss the samurai swords.",
    "timestamp": 1636844400
  },
  {
    "username": "Lendengold",
    "rating": 7.0,
    "comment": "Gereon\n(gekauft)",
    "timestamp": 1759442400
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".niet compleet : 3 grijze ronins, 3 foam sword stands en 3 battle markers tekort, geen originele spelregels\nEAN 032244047206\nIJK1",
    "timestamp": 1758319200
  },
  {
    "username": "rogedavi",
    "rating": 7.0,
    "comment": "Risk with ninjas. Definite upgrade and this is the archetypal dudes on a map board game for a long sunday afternoon. There is just a lot more strategical options and mechanics in this game and the win condition is tighter. Modern reprint well received, however it still struggles with the fundamental problem of length and long downtime between turns.",
    "timestamp": 1758319200
  },
  {
    "username": "Piotrpan",
    "rating": 7.0,
    "comment": "Very incomplete. Has lots of missing units; blue & orange are mostly complete, not other colors. Non-army pieces seem mostly there. Cards & styrofoam complete. Didn't fully count since so obviously not all there.",
    "timestamp": 1755381600
  },
  {
    "username": "Glic2003",
    "rating": 8.0,
    "comment": "Update: I was intrigued by the announcement of a reprint, and I'm almost impressed by how much they've bungled it. Worse artwork. Worse player colours. No improvements to the rules. And a price that's more than $50 more than what most people would pay. Perhaps some games are just better off left in the past?\n\n------------------------\n\nA stylish, elegant alternative to Risk set in Japan, this game was a staple of my board gaming youth. It's not terribly complex, but there are a couple of interesting strategic options (although make no mistake, having more troops than your opponent is always a good idea).\n\nThe only drawback is it takes forever to play; we would usually leave it set up for weeks at a time and play it over several 2-hour sessions.",
    "timestamp": 1760652000
  },
  {
    "username": "bernthawichez",
    "rating": 8.0,
    "comment": "The key to winning (at least against amateurs) can be moving your armies to \"commandeer\" friendly units you've spawned in adjacent areas.",
    "timestamp": 1754517600
  },
  {
    "username": "deadboy23",
    "rating": 8.0,
    "comment": "It is a big commitment to play this game, but it can be so rewarding!\n\nGreat flavor and nice mixture of strategy, deception, and luck!",
    "timestamp": 1754085600
  },
  {
    "username": "wread",
    "rating": 8.0,
    "comment": "Nostalgia",
    "timestamp": 1748296800
  },
  {
    "username": "Posco",
    "rating": 8.6,
    "comment": "SKIRMISH",
    "timestamp": 1750802400
  },
  {
    "username": "ecombarton",
    "rating": 9.0,
    "comment": "A very good but simple to understand game focused on conquest through dice based combat. There are many concepts in this game that I really like: secret planning, variable turn order of the players from turn to turn, secret hiring of ronin to supplement your forces, army experience, the ninja,.... It was originally released in 1986 as Shogun by Milton Bradley but though it is an old game it is very fun and challenging to play.",
    "timestamp": 1745791200
  },
  {
    "username": "Marius n Milan",
    "rating": 9.0,
    "comment": "2025\nN",
    "timestamp": 1745791200
  },
  {
    "username": "Cuneyt1907",
    "rating": 9.0,
    "comment": "My favorite war game.",
    "timestamp": 1735858800
  },
  {
    "username": "eldergames",
    "rating": 10.0,
    "comment": "מתאים עצמאים מנוסים",
    "timestamp": 1758664800
  },
  {
    "username": "Katanalx",
    "rating": 10.0,
    "comment": "One of the best, if not the best, board game in the world... That Ninja is everything!!!",
    "timestamp": 1712527200
  },
  {
    "username": "Neopeius",
    "rating": 10.0,
    "comment": "I love this game. Subtle strategy, fast action. The game is NOT Risk. There are lots of elements and they are all useful. It is a long game -- every one I've played has been around 7 hours, even with experienced players (note: I always play with the full 5). But there isn't much downtime.\n\nI own the original version since the new one is a nightmare for the colorblind.",
    "timestamp": 1705100400
  },
  {
    "username": "t5851dh",
    "rating": 10.0,
    "comment": "Originally titled \"Shogun\"",
    "timestamp": 1695592800
  }
]