[
  {
    "username": "petermc",
    "rating": 1.0,
    "comment": "This rating is unfair, but it is based on two consecutive 7 player games I was in. They were the worst FTF gaming experiences of my life, and so I have no choice but to give EIA a \"1.\" Sorry guys...but the game is SO slow, SO painstaking to get through...and the rules, while inspired, are so incomplete, that this game ultimately is a waste of time. I'd rather watch survivor.",
    "timestamp": 1096063200
  },
  {
    "username": "heikman",
    "rating": 2.0,
    "comment": "I'm actually extremly happy not having to play this no more.. although i have fond memories, i have also nightmarish memories about this one.. like everyone! allying against me (france) & pounding me into the ground for !!70!! playing hours.. YAY!\nIt belongs to a time that fortunately has past.\n\n__________________________________________\n\nWell what can one say about EiA.. the epic game of grandness.. for starters that it's simply too long, because of all the bookeeping.. but then again it's part of EiA.. sometimes i miss playing it.. but then i'm quite happy not sacrificing that much time to one board game anymore.",
    "timestamp": 1452294000
  },
  {
    "username": "AZrugger",
    "rating": 3.0,
    "comment": "I've given this game just about as many chances as I ever should. I'm probably in the 95th percentile of global plays for this game, and I'm in the middle of my 4th game.\n\nI feel like if someone took this game and edited it fully, there would be a wonderful game underneath, but unfortunately every effort to do so has just resulted in more pregame rituals where you decide with 6 other people how you will attempt to resolve every rules discrepancy before it happens. Currently, the google doc for this is a 120 question survey - and this has not captured every rules paradox we've run into in our current game.\n\nThat isn't to say there isn't a LOT that is amazing about this game - Formal alliances, wars, the way your political status feeds into your victory points, sieges actually taking time, combat resolution, supply lines - these are all absolutely fantastic.\n\nIt's just that the ruleset is a swiss cheese block of inconsistencies and poorly worded chrome. It would be fine if the game lasted a few hours - but one game of this lasts multiple real world years (current game session we are playing once every two weeks for about 3 hours. We're about 30% of the way through the game and have been playing for over a year). So that means if you get into one argument over the rules you are at risk of the rules breaking your strategy for multiple real-world months, or are at the risk of someone leaving the game entirely. In a recent game, we missed a (pretty obvious) rule and although we caught the miss one month after the flub, we chose not to fix it. It altered the game's course so drastically that it's impossible to say who would be in the lead now or what the map would look like.\n\nI would love to find a wargame that has a more bulletproof ruleset that can be played over the course of years... but for now, I believe I'm done with EiA.",
    "timestamp": 1679868000
  },
  {
    "username": "Pandorzecza",
    "rating": 4.0,
    "comment": "Not for me",
    "timestamp": 1645398000
  },
  {
    "username": "dash.jp",
    "rating": 5.0,
    "comment": "I've played this game a long time ago that my friend has.",
    "timestamp": 1724018400
  },
  {
    "username": "djberg96",
    "rating": 5.0,
    "comment": "I might have the time to play this game after I'm retired, and I can find six other retirees who are willing to spend some of their last moments on Earth playing this game.\n\nUnfortunately, even if I had the time and found the players, every review and session report I've read suggests that this game suffers from \"Must Be Played A Certain Way\" syndrome, where one screwup and/or ahistorical alliance throws the game into total whack.\n\nPlus, there's no way I'm reading a 44 page rulebook in that tiny font. My eyeballs are way too old for that crap now.\n\nTraded.",
    "timestamp": 1600639200
  },
  {
    "username": "zeotter",
    "rating": 6.0,
    "comment": "Traded to Noble Knight",
    "timestamp": 1741042800
  },
  {
    "username": "Cavedog_pdx",
    "rating": 6.0,
    "comment": "I bought this game in 1990 new. I sold it on Ebay in 2002 because it was too difficult to find 6 opponents who would want to give up one night a week for the rest of their lives to play and then teach them how to play. The scenarios are awful fiddly and annoying. War & Peace by Avalon Hill is a little more user friendly - lends itself better to two players - and a scenario can be played easily in an hour or so. At the same time part of me still wants to play this again online or something. The combat system was amazing!",
    "timestamp": 1695852000
  },
  {
    "username": "Kaiser116",
    "rating": 7.0,
    "comment": "AH",
    "timestamp": 1736377200
  },
  {
    "username": "Ciro7",
    "rating": 7.5,
    "comment": "(Played the introductory scenario)\nFrom having explored this game just once, I think this game will probably see my table again.\n\nThe counters look a little bit outdated compared to more modern counter art, but given the scale of the game they serve its purpose well.\n\nThe map is pretty simple but it contains all the needed information at a glance. However, sometimes the excessive clutter of counters, specially in some small areas, can be a little annoying and make it difficult to read the map.\n\nThe use of strength points in the aid cards can lead to some mistakes and confusion when you use neutral (gray) markers for all the Major Powers. I have not tested the other option yet (using side two of the national cards, keeping track of armies strength with pencil / eraser, which is recommended for Campaign Scenarios), so I don't know if it will be better. At least, you are given the two options, which is a good point.\n\nIn terms of rules, they are very dense and daunting when you read them for the first time (and maybe even second time). In the typical Avalon Hill style, they try to be as comprehensive and detailed as possible, but even so there are still some points that remain somewhat obscure and open to interpretation. However, in the end you realize that the game mechanics are realtively easy to grasp, in spite of what the long and hard-reading rulebook suggests.\n\nThe protracted battle with the tactical flavour and progressive attrition of troops and morale is very interesting and gives a nice additional dimension to the strategic game.\n\nIn short, I liked the game and I would like to play it again, although you will need to put some dedication and effort into it.",
    "timestamp": 1750802400
  },
  {
    "username": "Warren Bruhn",
    "rating": 9.0,
    "comment": "Wrote a long review on the game page. Has serious major flaws. But it's a blast to play, provided that you're with the right group of players. My favorite all time wargame.",
    "timestamp": 1717970400
  },
  {
    "username": "wannan72",
    "rating": 10.0,
    "comment": "un must!",
    "timestamp": 1761003120
  }
]