[
  {
    "username": "Panzerhamster",
    "rating": 1.0,
    "comment": "one of the most boring game I have ever played",
    "timestamp": 1703718000
  },
  {
    "username": "Murlock22",
    "rating": 1.0,
    "comment": "Argh",
    "timestamp": 1612306800
  },
  {
    "username": "ThomTech",
    "rating": 1.0,
    "comment": "Unalmas, logikai játék. Többen az asztalnál gondolkodtak, hogyan meneküljenek meg a hátralévő játékidőt.",
    "timestamp": 1414101600
  },
  {
    "username": "KayTeEm",
    "rating": 2.0,
    "comment": "1997, 3−5 players, 0.75 h, Rank 1122, Weight 1.7",
    "timestamp": 1577746800
  },
  {
    "username": "spieleben",
    "rating": 2.0,
    "comment": "sehr repetitiv",
    "timestamp": 1564869600
  },
  {
    "username": "Klausi300",
    "rating": 2.0,
    "comment": "2",
    "timestamp": 1483657200
  },
  {
    "username": "jellynut",
    "rating": 3.0,
    "comment": "Trudging trip along a dull cardboard river.",
    "timestamp": 1556920800
  },
  {
    "username": "Jimmy_Dean",
    "rating": 3.0,
    "comment": "boring....",
    "timestamp": 1470866400
  },
  {
    "username": "nuke3D",
    "rating": 3.0,
    "comment": "3-5, Best with 4,5\n\nEasy gameplay, long gametime! bad combination...\n\nsold ebay 3,50€",
    "timestamp": 1379455200
  },
  {
    "username": "tphon",
    "rating": 4.0,
    "comment": "Sold by SCG",
    "timestamp": 1709852400
  },
  {
    "username": "sgosaric",
    "rating": 3.5,
    "comment": "Mostly harmless. Was fun playing with a kid and nongamers. Which is probably the best reason to own this one. Looks cute, theme works, some thinking must be done. (\"Look mom, we're transporting grannies\").\n\nWhat it about? - well like that old paper and pen racing games you can shift gear down or up once per turn, moving as many squares (here it's hexes). that's it.",
    "timestamp": 1642201200
  },
  {
    "username": "Fuzzel",
    "rating": 4.0,
    "comment": "Als Spaßspiel okay. Es gewinnt derjenige der das höchste Risiko eingeht und dabei Glück mit dem flussverlauf hat.",
    "timestamp": 1627768800
  },
  {
    "username": "MichaelaPat",
    "rating": 5.0,
    "comment": "For sale",
    "timestamp": 1753912800
  },
  {
    "username": "rkleopold",
    "rating": 5.0,
    "comment": "!!!!! Going",
    "timestamp": 1748469600
  },
  {
    "username": "greetingsfrombergen",
    "rating": 5.0,
    "comment": "NOK 60",
    "timestamp": 1739487600
  },
  {
    "username": "jtakagi",
    "rating": 5.0,
    "comment": "Fun, light racing game that plays quickly and allows players to be as competitive as they like. When we played it was more like bumper boats than racing. It really needs the Black Rose expansion to become challenging, but as a family game I think it works well. For some reason the linear nature of the race is more interesting to me than a circular track - it seems like you're actually making progress towards a goal, which can be frustrating with tracks on which you have to do multiple laps.\n\nUpdate: While I find it enjoyable, I seem to be in the minority. Traded away.",
    "timestamp": 1721685600
  },
  {
    "username": "mi_de",
    "rating": 5.0,
    "comment": "Good mechanics, but missing a little excitement. Perhaps more aggressive 'bumping' rules or more limited number of passengers would help. I like the little wheel markers.",
    "timestamp": 1708210800
  },
  {
    "username": "bneffer",
    "rating": 5.0,
    "comment": "Theme is well implemented, but there are too many other racing games I'd rather play",
    "timestamp": 1702594800
  },
  {
    "username": "jackycola",
    "rating": 6.0,
    "comment": "Mega Spaß hatten wir nicht aber den Fluss bauen ist eine schöne Mechanik.",
    "timestamp": 1759874400
  },
  {
    "username": "islander",
    "rating": 6.0,
    "comment": "SW6 | I play this one with fellow church-goers, as its fairly benign theme makes me comfortable teaching it.",
    "timestamp": 1753480800
  },
  {
    "username": "marcx",
    "rating": 6.0,
    "comment": "een racespel met boten over de Missisippi",
    "timestamp": 1753135200
  },
  {
    "username": "dirk_leipzig",
    "rating": 6.1,
    "comment": "Spiel des Jahres 1997\nIm Karton der Erweiterung \"The Black Rose\"",
    "timestamp": 1741215600
  },
  {
    "username": "hughthehand",
    "rating": 6.0,
    "comment": "I would really like to have this game. Been told its good, and I like the theme.",
    "timestamp": 1741042800
  },
  {
    "username": "lsobota",
    "rating": 6.0,
    "comment": "Hello again after 13 years of divorce. I would like to introduce you to my daughters",
    "timestamp": 1732834800
  },
  {
    "username": "Nodens",
    "rating": 7.0,
    "comment": "A pretty and fast family race game and deserved SdJ winner. The rules/fun ratio is HIGH. Read a couple of times now it wouldn't hold up to today's standards - that's nonsense or a good thing, depending on how you define 'standards'. Smell my coal exhaust, fools.",
    "timestamp": 1757541600
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 4006592670887\nIJL6",
    "timestamp": 1757196000
  },
  {
    "username": "Food_Please",
    "rating": 7.0,
    "comment": "Played many years ago. Fun tension between speed and manoeuvrability. 7/10.\n\nUpdate: Played again after many years. This is still fun! Decisions are not super deep, but lots of fun pushing and blocking and taunting at the table, great evening! (6p). 7/10.",
    "timestamp": 1756936800
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Low-luck racing game. Neat bits and easy to teach.",
    "timestamp": 1759356000
  },
  {
    "username": "Sagrilarus",
    "rating": 8.0,
    "comment": "Light, short, fun. The kids can play once they reach about seven.",
    "timestamp": 1753740000
  },
  {
    "username": "rod3556lhs",
    "rating": 8.0,
    "comment": "Nice concept of the board (the river) changing as the little steamboats chart their way down the river. And the mechanism for determining speed and coal use by adjusting the wheel on the boat itself is cool. And of course you get to pick up women! When my wargame buddies and I get together we occasionally take time out from the hardships of battle and overthinking (paralysis through analysis)and laugh our way through a quick play of Mississippi Queen . . with the Black Rose added. When playing with the family I tend to not bring in the Black Rose variant.",
    "timestamp": 1752098400
  },
  {
    "username": "thejadeape",
    "rating": 9.0,
    "comment": "Fun racing game with great theme.\n\nComponents are very good overall, but I think the river tiles are particularly beautiful.\n\nMany people feel that MQ does not play well without the Black Rose expansion. The Black Rose expansion is excellent, but the game is still fun on it's own.\n\nI do love that the expansion allows for more players.\n\nYou can play with only 2 without the expansion and you could use one of the other boats as the Black Rose if you have less than 5 players. Just print off the rules from the expansion to see how those things work.\n\nAll of this is to say that I am very happy to own MQ without the expansion it and does not need Black Rose to \"fix\" it.\n\nUpdate: I do enjoy the game even more with the expansion.\n\nUpdate: Raised rating from an 8 to a 9. I can’t believe this game is not more well-loved. I understand race games will generally only appeal to a niche, but even race fans seem not to hold this higher.\n\nMQ does so much that is unique: it’s a race game, but the track is unknown, besides being first you also have a second objective of picking up two passengers, the game has very low luck, but it doesn’t lack passing and other drama that low/no-luck race games typically present.\n\nThe river creation is such a viscerally fun thing in and of itself that I am surprised not to see this used elsewhere. The uncertainty of the river combined with the clear control one has is delightful.\n\nThere is even “combat” in the race in that bumping is totally a thing and makes for some real strategic choices.\n\nI will admit that playing bumper boats at the finish line can be problematic and add unwanted playtime. This is typically only a problem with lower play counts as the zero-sum nature makes bumping degenerative. The fix to this is not to require docking at a speed of “1” at the finish line.\n\nSpeaking of playtime, one can control this depending on how many tiles you use, but even with the full twelve (as per base game) it is less than an hour.\n\nThe expansion just adds more options that make the game even better.\n\nA unique game, fun at all player counts (2-7 if you own expansion), easy to teach, plays in an hour and beautiful. Sign me up!\n\n\n\n\nSuitability for Travel:\n\nI have a 1 to 5 scale for four categories (1 is worst, 5 is best) in order of importance:\n\nPortability (the less luggage space the better) - 1\nFootprint (the less table space when playing the better) - 3\nScalability (the wider range of player counts the better) - 3\nLearnability (the easier to teach non-gamers the better) - 3\n\n\nOverall - 1.25",
    "timestamp": 1688767200
  },
  {
    "username": "M St",
    "rating": 9.0,
    "comment": "Totally simple and elegant, but constantly replayable. Spiel des Jahres winner and deservedly so. The exact opposite of the convolution-for-its-own-sake games that are en vogue today.",
    "timestamp": 1677970800
  },
  {
    "username": "EclecticMatt",
    "rating": 8.5,
    "comment": "Lovely components and simple rules mean you can quickly get the game to the table. While it looks simple, managing your speed, coal and direction become challenging later on - you quickly become your own worst enemy! As it plays up to 6 (and more in teams) then this has plenty of mileage and you can use the advanced rules if you want more depth.",
    "timestamp": 1615849200
  },
  {
    "username": "s-man",
    "rating": 10.0,
    "comment": "The one that started it all for me. It is the game that got me in to modern day board gaming and I love it eternally for that. It remains one of the most original and clever race games to me, even if it would come across as a fairly simple game by today's standards.\n\nRating: 9 (love it!) + 1 for originality and nostalgia",
    "timestamp": 1754690400
  },
  {
    "username": "IrwinMFletcher",
    "rating": 9.5,
    "comment": "This is my favorite racing game. There is direct interaction, possible screwage, and if you play without the coal depot, good resource management is absolutely essential. Even with it you can't just burn your coal willy nilly. It does suffer from some things that modern gamers don't like such as a possible runaway leader or people being completely out of the race by the time is half way complete. I say, learn how to play better.",
    "timestamp": 1701730800
  },
  {
    "username": "Jean_Leviathan",
    "rating": 10.0,
    "comment": "Spiel des Jahres back in 1997. I love this game - once more it is a fantastic combination of the simplicity of the rules and a multitude of options. After a few games I change my rating from 9 to a deserved 10.\n\nMy review: https://www.youtube.com/watch?v=uYlVN48zXgE",
    "timestamp": 1538690400
  }
]