[
  {
    "username": "gaetan12",
    "rating": 1.0,
    "comment": "Very bad and boring.\nI don't recommend...",
    "timestamp": 1703199600
  },
  {
    "username": "cnaujok",
    "rating": 1.0,
    "comment": "One of the most annoying and boring games I played in my life. Never ever want to see this crap again on any table. Sorry, if my verdict seems very harsh but this piece of *$*% really deserved it...",
    "timestamp": 1193785200
  },
  {
    "username": "candoo",
    "rating": 2.0,
    "comment": "Dry wines are nice. Dry games aren't. So dry, that 3 of 4 players did not want to continue playing the first game after 30 minutes.",
    "timestamp": 1357254000
  },
  {
    "username": "asfhgwt",
    "rating": 2.0,
    "comment": "Too complex, no flow and universally despised. Not one positive comment from my group. Lots of cute little grapes (purple balls), though.",
    "timestamp": 1041289200
  },
  {
    "username": "andy hart",
    "rating": 3.0,
    "comment": "Very dissapointed by this one. Came highly recommended but failed to impress me on the day (night). The rules seemed overly complicated in some places, and rather sparse in others. Maybe we were all just a little tired that evening. I'll try it again,.......sometime.",
    "timestamp": 1034114400
  },
  {
    "username": "Legomancer",
    "rating": 4.0,
    "comment": "This is a pretty nifty economic game, even if it has some thematic oddness.\n\nIn 2011 I gave this a 7. Boy have my tastes changed since then. Downgraded to 4.",
    "timestamp": 1469397600
  },
  {
    "username": "monstrooper",
    "rating": 4.0,
    "comment": "I found this to be a pretty dry game. Terrible color choices for the game pieces.",
    "timestamp": 1281564000
  },
  {
    "username": "jtakagi",
    "rating": 5.0,
    "comment": "Kind of ironic how dry this game is, but there was enough in there to make me want to give this another try someday.",
    "timestamp": 1694728800
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "Interesting economic game. Definitely much better than Power Grid!",
    "timestamp": 1671490800
  },
  {
    "username": "naehlen",
    "rating": 5.0,
    "comment": "gespendet an bodo",
    "timestamp": 1599429600
  },
  {
    "username": "Sonicwarhol",
    "rating": 5.0,
    "comment": "Not a bad game at all, I just don't see it getting many plays with all the other games I own.",
    "timestamp": 1515020400
  },
  {
    "username": "tphon",
    "rating": 6.0,
    "comment": "No cards",
    "timestamp": 1728856800
  },
  {
    "username": "Ossos_Brettspielcafe",
    "rating": 5.5,
    "comment": "It is not the worst game. It is thinky and strategic and can be fun.\n\nThere is a mood for this game. But is is a very dry, no pun intended, experience.\n\nThe game drags towards the end and whenever I played it so far I wanted it to end about 30 minutes sooner.\n\nI got it for 4€ at a thriftshop. I would not want to pay much more for it though.",
    "timestamp": 1726005600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "One play in 2001, and a second play in 2024. For me, I kept stumbling with the region names and the varietal names. The game is worthy, but parts of it are hard to size up. I was quite bad at getting awards of free vineyards from the government.\n\nI doubt that I ever play much more of this game. It is good, but not new, nor especially seductive. I am glad to have played it.",
    "timestamp": 1721512800
  },
  {
    "username": "luvdiscgolf",
    "rating": 6.0,
    "comment": "Challenging but fun game requiring strategy and planning.",
    "timestamp": 1714428000
  },
  {
    "username": "OsideP",
    "rating": 7.0,
    "comment": "Like Medieval Merchant, I think this is underrated. Gamers tastes have changed over the last twenty-five years, so perhaps a high-strategy, low-luck game is passe now but I still enjoy it. This was power grid before there was power grid.",
    "timestamp": 1744581600
  },
  {
    "username": "Wodoom",
    "rating": 6.6,
    "comment": "intelligent, really smart majority run.",
    "timestamp": 1601071200
  },
  {
    "username": "Cosmid",
    "rating": 8.0,
    "comment": "Elegant and beautiful design.",
    "timestamp": 1760133600
  },
  {
    "username": "Robert Osvalds",
    "rating": 8.0,
    "comment": "COMPLETLY UNDERATED! This is a GAMER'S game! Great flavor, and smooth design. All of the BGGs that I respect the most, have nothing but praise for VINO. We are at a loss as to why this title never got the recognition that it deserved.",
    "timestamp": 1758837600
  },
  {
    "username": "JimPAX",
    "rating": 9.0,
    "comment": "Just played this for the first time after avoiding it for years. The theme is great, but I believed too many of the other comments here.\nThe mechanic is well balanced, and decisions are almost always meaningful.\n\nDON'T LISTEN TO THEM! This game is a great resource management game. Decisions are never trivial, and frequently excrutiating. The combination of competition and cooperation is also a refreshing nuance. This game is a great one.\n\nUpdate: This game only works with 4+ players. With 2 or 3 the board is too open and the game becomes intensely uninteresting.",
    "timestamp": 1594072800
  },
  {
    "username": "modboy",
    "rating": 9.0,
    "comment": "Commodities game that's quite deep. It's a bit of a brain-burner at first as you try to figure out the value of controlling the market: what type of vineyards to buy, where to buy, how much to spend, when to sell, how much to sell, etc. Some of the economic decisions influence selling prices & turn-order. There's also a bit of a strange area control mechanism wherein many regions have government controlled vineyards and once all of the privately owned vineyards have been bought in that region the rest are given away properties: 1 to the player in first place in that region, 2 to the player in second place & the rest to the player in 3rd place (anybody else is shut out). I should mention that although it's an extremely economic game the winner is the player who owns the most vineyards rather than the player with the most money. Fun theme with excellent bits (wine bottles, grapes, a barrel, colourful pieces).",
    "timestamp": 1236034800
  },
  {
    "username": "zefquaavius",
    "rating": 9.5,
    "comment": "Wow, this game is tricky, vicious, and cool, and it is really standing the test of time - or so I say November 2006. Advice: Use the little punch-out circles from the grape-holding wine cellar cards as six feet for those cards. With the added height, the grapes are held off the table, and much more stably. I've even considered permanently affixing them to the cards, if I could just bring myself to defile the sanctity of a game well made.",
    "timestamp": 1163113200
  },
  {
    "username": "starman",
    "rating": 10.0,
    "comment": "A vintage game, with an interesting theme on Italian grape/wine production",
    "timestamp": 1039215600
  }
]