[
  {
    "username": "kindraw",
    "rating": 1.0,
    "comment": "Novelty item only. Not playable, even with tweezers.",
    "timestamp": 1755986400
  },
  {
    "username": "Kazdan353",
    "rating": 1.0,
    "comment": "In all fairness, I don't like word games.",
    "timestamp": 1745964000
  },
  {
    "username": "ETHANVAN",
    "rating": 1.0,
    "comment": "Not a fan of word games, so my rating makes sense.",
    "timestamp": 1741302000
  },
  {
    "username": "FavnirLiorenth",
    "rating": 1.0,
    "comment": "I always lose to my mom",
    "timestamp": 1736118000
  },
  {
    "username": "Mitoma",
    "rating": 1.0,
    "comment": "This has to be the most uninteresting game in existence. But maybe I've just been spoiled by thematic games.",
    "timestamp": 1735513200
  },
  {
    "username": "fussymongoose",
    "rating": 1.0,
    "comment": "Basic Game",
    "timestamp": 1734476400
  },
  {
    "username": "Gregor34",
    "rating": 1.0,
    "comment": "Hate it.",
    "timestamp": 1734044400
  },
  {
    "username": "Panda1104",
    "rating": 1.0,
    "comment": "I no spell good, letters what are those?",
    "timestamp": 1667430000
  },
  {
    "username": "emptyset",
    "rating": 1.0,
    "comment": "I know it's a totally different game, but Qwirkle scratches the same itch for me and just plays so much faster.",
    "timestamp": 1665266400
  },
  {
    "username": "lynx1998",
    "rating": 1.0,
    "comment": "Games are not suppose to be boring spelling bees, Just shoot me now.",
    "timestamp": 1640214000
  },
  {
    "username": "Swedish_Chef_",
    "rating": 1.0,
    "comment": "A terrible, really boring wordgame that has been replaced by other better games. If you need a special dictionary to play a game then it is broken. Also, if you speak more than one lamguage it makes the concept of this \"game\" even more silly.",
    "timestamp": 1633816800
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "Just read a book this 'game' is trash.",
    "timestamp": 1623880800
  },
  {
    "username": "DanFred",
    "rating": 1.0,
    "comment": "My mother's favorite game that I know a lot of people love, but I'm just not one of them. Creating words out of random tiles is just not my idea of fun.",
    "timestamp": 1621548000
  },
  {
    "username": "ratbulogg",
    "rating": 1.0,
    "comment": "Quijibo is a perfectly cromulent word.",
    "timestamp": 1619820000
  },
  {
    "username": "FutureSpec",
    "rating": 1.0,
    "comment": "One of the most boring games ever invented.\nDull, dry, dismal.\nIf you want a half-decent word game, try Letter Tycoon.",
    "timestamp": 1619560800
  },
  {
    "username": "Takhyon",
    "rating": 1.0,
    "comment": "I know this is not the only game I have given the score of only one star, but I'd say this is probably the only one I actually, sincerely, really, really hate, and will never play ever again. An awful game which always leads into arguments about what qualifies as a word and turns people into insufferable besserwissers for memorizing a bunch of obscure two letter words no-one has actually ever used in a sentence before. It's mind-boggling to me that there's actually a Scrabble dictionary for settling arguments about the game. If this website would allow me to give it a lower score than this, I absolutely would. Avoid, avoid, avoid.",
    "timestamp": 1619301600
  },
  {
    "username": "pauloantunes",
    "rating": 1.5,
    "comment": "It's from my childhood.",
    "timestamp": 1609110000
  },
  {
    "username": "JamesTS",
    "rating": 1.0,
    "comment": "I do not like this game. I think if it were retitled it would be called “Find Out Which of Your Friends Went to a Better School Than You”. I don’t like winning or loosing based on how well you did on exams, maybe that’s just me, but that’s not how I have fun.",
    "timestamp": 1596751200
  },
  {
    "username": "safety pin",
    "rating": 1.0,
    "comment": "Too much reward for 2-3 letter words and not enough for longer ones. At least give special bonuses for 4-letters.",
    "timestamp": 1587506400
  },
  {
    "username": "djedi gamer",
    "rating": 1.0,
    "comment": "No, no and once again NO!!!",
    "timestamp": 1582498800
  },
  {
    "username": "Mr_Bean",
    "rating": 1.0,
    "comment": "2p: ?\nsolo: n",
    "timestamp": 1566770400
  },
  {
    "username": "Irondell",
    "rating": 1.0,
    "comment": "A memory game for anal retentives.",
    "timestamp": 1543359600
  },
  {
    "username": "Kingsoby1",
    "rating": 1.0,
    "comment": "I hate scrabble. memorizing all the fake 2 and 3 letter words in the scrabble dictionary is not my idea of a fun time. play qwirkle instead. or even bananagrams. or any game for that matter.",
    "timestamp": 1518044400
  },
  {
    "username": "HypnoticSpecter",
    "rating": 1.0,
    "comment": "This game is not fun especially with snobby people who know every two-letter word in existence. This game falls into the \"if you can do something better, or are smarter than other people you will win\" Such as Pictionary, Cranium, etc. Even so, it is not a fun game in the least. Paperback pretty much destroys this game in every way",
    "timestamp": 1509922800
  },
  {
    "username": "kavispires",
    "rating": 1.0,
    "comment": "Gameplay fun determined by how big your vocabulary is.",
    "timestamp": 1500501600
  },
  {
    "username": "Meel",
    "rating": 1.0,
    "comment": "Insufferably dull",
    "timestamp": 1496527200
  },
  {
    "username": "beanieboy007",
    "rating": 1.0,
    "comment": "It is a game... but NOT for me.",
    "timestamp": 1483311600
  },
  {
    "username": "harry cherry 1972",
    "rating": 1.0,
    "comment": "I don't like word games.",
    "timestamp": 1483311600
  },
  {
    "username": "Friff14",
    "rating": 1.0,
    "comment": "How can you not hate this game?",
    "timestamp": 1473631200
  },
  {
    "username": "Rpierce1892",
    "rating": 1.0,
    "comment": "I hate spelling!",
    "timestamp": 1460930400
  },
  {
    "username": "aaarg_ink",
    "rating": 1.0,
    "comment": "151117 I might be desperate to play games post baby but this is still absolutely not on the list.\n\n100518 Man, I understand its a classic, but it is one of the very few games I refuse to play.",
    "timestamp": 1447801200
  },
  {
    "username": "TheRealHats",
    "rating": 1.0,
    "comment": "chelsea sucks",
    "timestamp": 1440626400
  },
  {
    "username": "Hutten122",
    "rating": 1.0,
    "comment": "Lets spell Chinese words with the\nEnglish alphabet and not let anyone\nuse french words, then we can make\nsome up on the spot.",
    "timestamp": 1431986400
  },
  {
    "username": "Daby",
    "rating": 1.0,
    "comment": "This game is extremely fun free because I can't spell.",
    "timestamp": 1410300000
  },
  {
    "username": "airjudden",
    "rating": 1.1,
    "comment": "This game is as fun as a root canal. A game? No. It's just an exercise to see who memorized the most small \"q\" and \"x\" words from the dictionary.\n\n\"Hey, I memorized a bunch of Q words that don't start with \"Qu\", like \"Qat.\"\nDo you even know what that word means?\nNo, I just memorized it from the Scrabble dictionary.\n\nI have always believed that a dinosaur can help make any game (except Diplomacy), tolerable, but I'm not sure: I think the only way a dinosaur could help this was if you had a REAL dinosaur and he ate the game...and the person who recommended that you play it.",
    "timestamp": 1391727600
  },
  {
    "username": "chaese",
    "rating": 1.0,
    "comment": "Total Words With Friends ripoff.",
    "timestamp": 1351724400
  },
  {
    "username": "Gracz_Geek",
    "rating": 1.0,
    "comment": "BOOOOOOOOOOOOOOORING !!!",
    "timestamp": 1345327200
  },
  {
    "username": "Chrisrob",
    "rating": 1.0,
    "comment": "I hate spelling games.",
    "timestamp": 1289343600
  },
  {
    "username": "deadsunwheel",
    "rating": 1.0,
    "comment": "At least I have fond memories of playing Monopoly.",
    "timestamp": 1281564000
  },
  {
    "username": "Doombellow",
    "rating": 1.0,
    "comment": "For those of us who struggle to spell words like \"the\", this game sucks!",
    "timestamp": 1277762400
  },
  {
    "username": "JasonTR",
    "rating": 1.0,
    "comment": "I've always been a numbers guy, so my low rating from this game probably stems from just how awful I am at this. There's probably a reason it's a classic though...",
    "timestamp": 1262646000
  },
  {
    "username": "hollywooddoodle",
    "rating": 1.0,
    "comment": "BLECK!!!!!! Longest Boringest game in the history of the universe! Makes me want to puke!!!",
    "timestamp": 1262041200
  },
  {
    "username": "cesartustro",
    "rating": 1.0,
    "comment": "Para alguna partida ocasional...",
    "timestamp": 1217455200
  },
  {
    "username": "verdigast",
    "rating": 1.0,
    "comment": "Skip-a-cross was licensed by Selchow & Righter and manufactured by Cadaco. Both games have identical rules but Skip-a-cross has tiles and racks made of cardboard instead of wood. The game was published to because not enough Scrabble games were manufactured to meet the demand.",
    "timestamp": 1213308000
  },
  {
    "username": "Bowmangr",
    "rating": 1.0,
    "comment": "I hate these games.",
    "timestamp": 1209852000
  },
  {
    "username": "Chipps",
    "rating": 1.0,
    "comment": "I can never play through an entire game.",
    "timestamp": 1201388400
  },
  {
    "username": "FiveStars",
    "rating": 1.0,
    "comment": "Reason: Hasbro is run by idiots. Hope they will all roast in hell.",
    "timestamp": 1197586800
  },
  {
    "username": "42ndSSD",
    "rating": 1.0,
    "comment": "Scrabble is inherently broken in that it relies on a particular wordlist which isn't included in the game, and doesn't include words which are used by many people on an everyday basis. It's basically a torture test to see who can memorize the most words (and not even their definitions, just the spelling). Very little strategy. Avoid.",
    "timestamp": 1164927600
  },
  {
    "username": "shyuechou",
    "rating": 1.0,
    "comment": "Memorising the dictionary anyone? Lame luck-driven tile-placing game.",
    "timestamp": 1162767600
  },
  {
    "username": "Gamedeity",
    "rating": 1.0,
    "comment": "Ugh what an awefull game unless you love spelling bees and crossword puzzles. Games are long and monotonous...",
    "timestamp": 1158357600
  },
  {
    "username": "Innovan",
    "rating": 1.0,
    "comment": "I read the book on the guy who memorized all the words necessary to become a Scrabble Champion, and now like the game even less. Simply no fun at all.",
    "timestamp": 1110150000
  },
  {
    "username": "Dynamokiev",
    "rating": 1.0,
    "comment": "I hate word games",
    "timestamp": 1105398000
  },
  {
    "username": "Vincentskater1",
    "rating": 2.0,
    "comment": "This game needs to be dethroned. I used to go to a competitive Scrabble Club, and it was a lot of fun if you play this game by tournament standards! But for a casual board game night with friends, this game is not fun! It's cruel, inaccessible, there are tons of arguments over what constitutes as a valid word (scrabble dictionary, valid \"2 letter\" words, etc.) and there are way better word games out there like Bananagrams, Letter Jam, Kittos, etc! There is also a huge luck element to this game over which tiles you draw from the bag, and you have to be a seasoned player to count tiles and understand which tiles are worth keeping. Plus, you can easily win the game if you go for the double and triple word scores, despite having good words. It rewards location of letters rather than word creativity. It is sadly even worse online, I think playing by tournament rules in person is the way to play, and even then the game becomes more of a skill like chess rather then a nice family game it's advertised and known for.\n\nUPDATE: I've started watching Dweebovision on Youtube, he's a competitive Scrabble player, and he's a total Chad, and has reignited my love for competitive Scrabble. If you ever find this comment, check him out, he's hilarious and you will not regret it xD",
    "timestamp": 1754949600
  },
  {
    "username": "Byte",
    "rating": 2.0,
    "comment": "Extremely luck based.",
    "timestamp": 1750111200
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\noutdated classic game. there are better word games today. 50+ plays.",
    "timestamp": 1735254000
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "Not a ravishing game by any means, but I'll never turn down a game of SCRABBLE, truthfully. The key to elevating your game is to memorize all the acceptable two-letter words. QI and XU, for example.",
    "timestamp": 1734822000
  },
  {
    "username": "SkyGlad",
    "rating": 2.0,
    "comment": "Word game and tile placement don’t work well together. Literally every other word game I know of is a better game than this one.",
    "timestamp": 1734476400
  },
  {
    "username": "raptorello",
    "rating": 2.0,
    "comment": "AÁ",
    "timestamp": 1729288800
  },
  {
    "username": "marcus_t_k",
    "rating": 2.0,
    "comment": "CULLCULLCULLCULL",
    "timestamp": 1713996000
  },
  {
    "username": "Entropology",
    "rating": 2.0,
    "comment": "Bad speller = poor opponent and no fun for either player. Who has two thumbs and can't spell wurth a dern. Dis guy!",
    "timestamp": 1700434800
  },
  {
    "username": "Pirata Negro",
    "rating": 2.0,
    "comment": "I have it incomplete and sometime I get to actually play it. I don't understand why my parents bought the English version, if we were little and didn't know how to write English at that time. Whatever.",
    "timestamp": 1699311600
  },
  {
    "username": "SamuraiCoyote",
    "rating": 2.0,
    "comment": "A game where the META varies with language, makes you see words only if they're effective, long turntime and not compelling unless you're extremly lucky with a long word. There are a lot of mroe itneresting word games.",
    "timestamp": 1698620400
  },
  {
    "username": "Yokiboy",
    "rating": 2.0,
    "comment": "This is not my word game of choice.",
    "timestamp": 1698184800
  },
  {
    "username": "Dash Justice",
    "rating": 2.0,
    "comment": "Metagame hinges on knowing obscure small words. I'd rather read a book.",
    "timestamp": 1692396000
  },
  {
    "username": "TGorson",
    "rating": 2.0,
    "comment": "Nicht mein Spiel",
    "timestamp": 1677193200
  },
  {
    "username": "Aurora84",
    "rating": 2.0,
    "comment": "I was an English major in college.The first half of my career I was a librarian. In the second half of my working days I was a magazine editor and staff writer. Two professions immersed in language. I love the English language. And I hate this game. I hate the rules. I hate the scoring system. I hate the special dictionary. I even hate the carrying-case/board of my \"deluxe\" version. Among the \"classic\" games that typical BGG users detest, I would so much rather play Monopoly than having to sit through the ordeal that is Scrabble.",
    "timestamp": 1676674800
  },
  {
    "username": "benloese",
    "rating": 2.0,
    "comment": "Weight: 2.07",
    "timestamp": 1674860400
  },
  {
    "username": "Awstraw",
    "rating": 2.0,
    "comment": "X",
    "timestamp": 1664488800
  },
  {
    "username": "pmmeyer",
    "rating": 2.0,
    "comment": "Any game that publishes its own dictionary needs to not be played.",
    "timestamp": 1660514400
  },
  {
    "username": "Raceofrobots",
    "rating": 2.0,
    "comment": "I hate word games",
    "timestamp": 1650060000
  },
  {
    "username": "Poptech",
    "rating": 2.0,
    "comment": "This is not a game you play to learn about words, this is a game of memorizing obscure words in the Scrabble dictionary and being good at anagrams. You never have to learn a single definition of a word to become good at Scrabble. Unless you love anagrams you will not like this games. Watch a couple of Scrabble documentaries (see: Tabletop Documentaries) to understand why you have no hope of ever being good at this game unless you wish to give up every normal aspect of your life. Highly overrated.\n\nFor anyone with a life I highly recommend Scattegories instead.",
    "timestamp": 1648504800
  },
  {
    "username": "BrainBursta",
    "rating": 2.0,
    "comment": "High AP game where board state changes constantly so thinking ahead is usually pointless. This creates way too much downtime for a family game. Also constant debate of allowed words is just a pain",
    "timestamp": 1640991600
  },
  {
    "username": "Wismerhill",
    "rating": 2.0,
    "comment": "There are so many better games than Scrabble...",
    "timestamp": 1640559600
  },
  {
    "username": "otoolejp",
    "rating": 2.0,
    "comment": "I hated English class at university. Why would I subject myself to this?",
    "timestamp": 1634767200
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "90 Min 2–4 Players p2 p3 p4 Weight: 2.09 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "1 Family Meeple",
    "rating": 2.0,
    "comment": "zzzzzzzzz",
    "timestamp": 1626991200
  },
  {
    "username": "lindre3000",
    "rating": 2.0,
    "comment": "I hate scrabble, because the winning strategy is to create short words that aren't actual words we use in everyday speech and clog up the board so your opponent has no fun moves they can make. When winning strategies and fun are at odds with each other, it's a poorly designed game.",
    "timestamp": 1623362400
  },
  {
    "username": "Skoy",
    "rating": 1.5,
    "comment": "Stef 1\nGeert 2 (won)",
    "timestamp": 1598565600
  },
  {
    "username": "worshipgeek",
    "rating": 2.0,
    "comment": "My rating isn't a reflection so much of a lack of quality for this game, but rather a reflection of my loathing for playing it.",
    "timestamp": 1590357600
  },
  {
    "username": "HellslayeR",
    "rating": 2.0,
    "comment": "It is popular, but i don't like it after all.",
    "timestamp": 1574377200
  },
  {
    "username": "Stankiem",
    "rating": 2.0,
    "comment": "I LOATH Scrabble",
    "timestamp": 1571263200
  },
  {
    "username": "Bloobik",
    "rating": 2.0,
    "comment": "One of the worst gameplay experiences so far.",
    "timestamp": 1568757600
  },
  {
    "username": "emperormark",
    "rating": 2.0,
    "comment": "Rubbish game. No skill or strategy-just luck and knowledge of words.",
    "timestamp": 1565301600
  },
  {
    "username": "WillBePlayin",
    "rating": 2.0,
    "comment": "I really don't like word games but my gf insists on playing them from time to time. Finnish scrabble is just dumb.",
    "timestamp": 1562623200
  },
  {
    "username": "mattomaw",
    "rating": 2.0,
    "comment": "My turn takes way too long and then i put down CAT . Hate this game",
    "timestamp": 1562364000
  },
  {
    "username": "Alannamairead",
    "rating": 2.0,
    "comment": "I LOATHE Scrabble",
    "timestamp": 1560722400
  },
  {
    "username": "Castlevanio",
    "rating": 2.0,
    "comment": "Vendido febrero 2018.",
    "timestamp": 1554933600
  },
  {
    "username": "HadMatter",
    "rating": 2.0,
    "comment": "As someone remarked pointedly, a game about verbal mastery, where a formidable portion of points is gained by laying down banal monosyllables. My native language is Finnish, in which words are relatively long, certain consonants (e.g. q, f, g, b, c) are very rare, and the consonant-vowel ratio is low, three facts that the Finnish version of the game does not take into consideration sufficiently enough. The result is that you are left wandering around with too little amount of vowels to come up with any kind of creative outcome. For me this game is not a monster, it is an undead – it is a pale creep that sucks life out of you.",
    "timestamp": 1553209200
  },
  {
    "username": "Longshanx",
    "rating": 2.0,
    "comment": "I'm rating this at 2, though I'm willing to play - only because my wife likes this. Anyone else suggesting a game would keep coughing up letters for days to follow.\n\nYes, I hate this game.",
    "timestamp": 1549062000
  },
  {
    "username": "werekin",
    "rating": 2.0,
    "comment": "Alfred Mosher Butts has a lot to answer for.",
    "timestamp": 1533765600
  },
  {
    "username": "dragonster",
    "rating": 2.0,
    "comment": "Ok, so a Maths Graduate shouldn't have anything against arithmetic, but I just prefer the simpler scoring in Upwords.",
    "timestamp": 1526335200
  },
  {
    "username": "halbower",
    "rating": 2.0,
    "comment": "Obsoleted not just by other word games but EVERY game released since 1970.",
    "timestamp": 1524348000
  },
  {
    "username": "jlp303",
    "rating": 2.0,
    "comment": "Make words on a grid and make your other half feel thick when all he/she can manage is ‘cat’. I’ll pass thanks!",
    "timestamp": 1520290800
  },
  {
    "username": "VeganDodo0",
    "rating": 2.0,
    "comment": "The only way I will play this game is because I can spend time with my mom. I love my mom that much.",
    "timestamp": 1520204400
  },
  {
    "username": "wolfthatwonders",
    "rating": 2.0,
    "comment": "Not a bad game. I am just horrible at spelling and this game is not fun for me at all. I would rather play Paperback.",
    "timestamp": 1518044400
  },
  {
    "username": "buckeTde",
    "rating": 2.0,
    "comment": "I don't know about other languages, but this games sux in german",
    "timestamp": 1515366000
  },
  {
    "username": "Tsaar",
    "rating": 2.0,
    "comment": "Dutch edition 1972 with rotation frame, letters updated to match current standard.\nPlayed it a lot in my youth, hated it. Played it again and it wasn't really fun.\n\nGave it to my parents.",
    "timestamp": 1515193200
  },
  {
    "username": "Qumpelblase",
    "rating": 2.0,
    "comment": "Langweiliges Spiel, das schnell seinen Reiz verliert.",
    "timestamp": 1502834400
  },
  {
    "username": "program2game",
    "rating": 2.0,
    "comment": "People (like me) that cannot spell stay away.",
    "timestamp": 1494280800
  },
  {
    "username": "big_booboo",
    "rating": 2.0,
    "comment": "I enjoy other word games, but this one is tedious and excruciating.",
    "timestamp": 1492812000
  },
  {
    "username": "Klausi300",
    "rating": 2.0,
    "comment": "2",
    "timestamp": 1483657200
  },
  {
    "username": "Rust00",
    "rating": 2.0,
    "comment": "2013 - 3 No need to explain this, make up a word and get points, that is it.\n\n2016 - 2 A booring, outdated game that belongs in the past.",
    "timestamp": 1481410800
  },
  {
    "username": "tod_13",
    "rating": 2.0,
    "comment": "Okay, but prefer other games.",
    "timestamp": 1469311200
  },
  {
    "username": "spacejambi",
    "rating": 2.1,
    "comment": "Wife loves it, I don't.",
    "timestamp": 1464300000
  },
  {
    "username": "TheRiskMaster",
    "rating": 3.0,
    "comment": "Scrabble sounds smart, but in reality it’s just three people staring at their letters while one vocabulary nerd ruins the fun. Half the game is arguing if “qi” is a word, the other half is waiting. More dictionary fight than board game.",
    "timestamp": 1756245600
  },
  {
    "username": "Born-of-Ashes",
    "rating": 3.0,
    "comment": "Boring overhyped BS. I like etymology, but not being put on the spot to do a crossword.",
    "timestamp": 1743458400
  },
  {
    "username": "Laslow",
    "rating": 3.0,
    "comment": "Párok számára ideális játéknak érzem abból a szempontból, hogy mind a férfi-, mind a női agy számára hasonló szintű kihívást jelent, és mindenki hasonlóan próbál boldogulni játék közben. Kifejezetten könnyen tanulható, de jó, ha van a közelben szótár, mert konfrontációra adhat okot, hogy valamely szót elfogadjuk-e, vagy sem. (Én szerencsére a párommal egész hasonlóan éreztem, hogy mely szavakat fogadhassuk még el, és melyeket már ne, csak az \"oké\" szóról vélekedünk eltérően.)\nA játék során könnyen előfordul az, hogy hosszasan elgondolkozik az ember amikor rákerül a sor, ez hátrány. Hátrány az is, hogy a végjátékban frusztráló, hogy semmilyen értelmes szót nem tudunk már kirakni, hiába nézzük akárhogy a táblát és a betűinket (bár ez nem mindig van így, van, hogy semmi gond a végjátékkal).\nelőfordul, hogy valamelyik játékos folyamatosan használhatatlan betűket húz, míg egy másik játékos meg csupa jót - ez elveheti a kedvet a játéktól.\nÖsszességében üde színfolt a matematika-alapú társasjátékok mellett, örülök neki és szívesen játszom vele. És kíváncsi vagyok merre alakul majd a véleményem a további játékok során.\n\nUpdate: Mostanra egyáltalán nem vonz ez a játék, nem szívesen ülnék le vele játszani. Egyszerűen frusztrál, hogy semmi értelmes szót nem tudok kirakni szinte sosem, legfeljebb a már kirakottakból alkotok 1-2 betű hozzárakásával újat, vagy ragozgatom őket. Ez így nekem szenvedés, nem pedig élvezet. El fogom adni, csak lusta vagyok meghirdetni.",
    "timestamp": 1741906800
  },
  {
    "username": "Silver Fang",
    "rating": 3.0,
    "comment": "See my comment for monopoly.",
    "timestamp": 1739055600
  },
  {
    "username": "ncc1701jv",
    "rating": 3.0,
    "comment": "Grammar! The Game. Boo.",
    "timestamp": 1738450800
  },
  {
    "username": "ConquerorsOfRisk",
    "rating": 3.0,
    "comment": "A simple/basic game to play if you're new to boardgames or if you want to play with your family. However, if u are an OG player, we don't recommended it! It´s a very calm game that involves thinking.",
    "timestamp": 1737932400
  },
  {
    "username": "Valeixo",
    "rating": 3.0,
    "comment": "Chato.",
    "timestamp": 1737327600
  },
  {
    "username": "Ooluong",
    "rating": 2.5,
    "comment": "Not for players who do not have the time to memorize a list of legal words.\n\nBest played on a platform that can check valid words for the player, such as Letter League on Discord.",
    "timestamp": 1737068400
  },
  {
    "username": "GirloftheFandom",
    "rating": 3.0,
    "comment": "Parent’s old games (X2)",
    "timestamp": 1736118000
  },
  {
    "username": "Cuchulainn1795",
    "rating": 3.0,
    "comment": "Not my cup of tea at all!\n\nTo be fair, my problem with the game is that I'm not great at speeli... at spelling, a bit of a handicap when trying to play a word game.\n\nI know it's a popular game, but based on my own experience with it, I can't give any better than a 3.",
    "timestamp": 1734649200
  },
  {
    "username": "ShiannLin",
    "rating": 3.0,
    "comment": "In this classic word game, players use their seven drawn letter-tiles to form words on the gameboard",
    "timestamp": 1733785200
  },
  {
    "username": "pluviometer",
    "rating": 3.0,
    "comment": "I like to play Scrabble by myself and just spell out cool words on the board without paying attention to the multiplier tiles. That version of the game is fun for me, but any version of the game where I have to pass up on playing a cool word to instead play a lame word that is in a strategically smart location... no thanks!",
    "timestamp": 1733353200
  },
  {
    "username": "princesse_lapin",
    "rating": 3.0,
    "comment": "I don't really like Scrabble, even though I love to read and my job involves writing. I find it hard to come up with words -- there aren't any clues to limit the possibilities a bit and focus my thinking -- and I don't like having to remember (or consult a list of) all the two-letter words.",
    "timestamp": 1729375200
  },
  {
    "username": "OthelloKeys",
    "rating": 3.0,
    "comment": "Good word game if you play with people with shared legal word sets.",
    "timestamp": 1728424800
  },
  {
    "username": "kapikui",
    "rating": 3.0,
    "comment": "Played once. Not really interesting to me.",
    "timestamp": 1725314400
  },
  {
    "username": "GarthUncle",
    "rating": 3.0,
    "comment": "Takes so long for what it is. Well designed though.",
    "timestamp": 1718661600
  },
  {
    "username": "tommynomad",
    "rating": 3.0,
    "comment": "My favourite versions are \"Take Two\" for no down time, and \"Dirty Word Scrabble\" for gettin' down time.\n\n*at Ed's in Canada*",
    "timestamp": 1717711200
  },
  {
    "username": "Rhythm_and_Blues",
    "rating": 3.0,
    "comment": "Scrabble is a strange game for me. For some reason, Scrabble feels like it is a lot worse than the sum of its parts. I like the mechanical design choice of having a maximum \"hand\" of seven letters to create a word. I like the bonus point spaces scattered around the game board. And most importantly, Scrabble is a word game. And I love word games. I think that most people generally enjoy word games too, no matter what their gaming background is. They're so accessible for everyone, and just the sheer nature of this genre provides individuals with so many chances and so much agency to excite humor. It's one of the key reasons why popular party games are so often word games.\n\nBut for some reason, the positives just don't add up for Scrabble. I want Scrabble to be a game where the players can feel clever and funny at the same time, often creating entertaining words that provides both high points and laughs. Or a game where I can plan ahead of time to make that big word which has others in awe. But in reality, the chances of Scrabble games playing out \"optimally\" is close to zero. The board states are so often stale and boring. More times than not, your supply of letters are solely composed of vowels. On top of this, the game is always plagued by analysis paralysis. And having AP in Scrabble is not a good time for anyone. The game is extremely reactive, which means that when it isn't your turn, there is really nothing that you are doing except waiting for the other player to make a new word.\n\nAnd all of what I said above sums up to a game that massively overstays its welcome. I think that if designers continued to develop and actively looked to innovate more on Scrabble, there might have been a smart, satisfying, and smooth word game classic. I know that somewhere out there in my theoretical imagination, there is a version of this game that I love. But alas.",
    "timestamp": 1709679600
  },
  {
    "username": "heyitshenry",
    "rating": 3.0,
    "comment": "I don't like scrabble",
    "timestamp": 1703977200
  },
  {
    "username": "Ostiombe",
    "rating": 3.0,
    "comment": "My mother would be horrified to see that I gave such a low rating to this game",
    "timestamp": 1701730800
  },
  {
    "username": "Katzenfuerstin",
    "rating": 3.0,
    "comment": "Inherited from parents.... It's just not the time for this anymore",
    "timestamp": 1698530400
  },
  {
    "username": "yroeht",
    "rating": 3.0,
    "comment": "I hate this game. It's basically trivia. Serves only to show off your social status and upbringing.",
    "timestamp": 1696543200
  },
  {
    "username": "Forgeforgeforge",
    "rating": 3.1,
    "comment": "Utterly dominated by the superior anagramming game: Snatch. Scrabble is bad, but the dictionary is an abomination. Maybe the only book that should be burned.",
    "timestamp": 1695592800
  },
  {
    "username": "GreatAtuin",
    "rating": 3.0,
    "comment": "Tedious",
    "timestamp": 1691445600
  },
  {
    "username": "s2alexan",
    "rating": 3.0,
    "comment": "(J)",
    "timestamp": 1690581600
  },
  {
    "username": "JearShad",
    "rating": 3.0,
    "comment": "No es mi tipo de juego, me aburro facilmente y es dificil formular palabras, a menos que tengas la \"suerte\" de tener buenas letras. No me gusta, pero fue un regalo, ni modos.",
    "timestamp": 1686088800
  },
  {
    "username": "andreakis",
    "rating": 3.0,
    "comment": "HUN",
    "timestamp": 1685829600
  },
  {
    "username": "leonkonsta",
    "rating": 3.0,
    "comment": "βαρετό",
    "timestamp": 1685224800
  },
  {
    "username": "Ambro11",
    "rating": 3.0,
    "comment": "+M.",
    "timestamp": 1676329200
  },
  {
    "username": "tehARD",
    "rating": 3.0,
    "comment": "I just despise it with a passion. It's because I always played it with a particular person who is really proficient at it. This changed it from a fun, simple game of making up words to a struggle of trying to fit anything on the board because of that player blocking everyone and making it feel like a slog.\n\nThere were no \"damn, I can make this amazing move\" moments created by making a long word or creatively connecting existing tiles. Every turn was painful and felt like a survival.\n\nI'd rather do literally anything else. Wash the dishes. Do my taxes. Self-flagellate. Anything.",
    "timestamp": 1671145200
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "Some letters tend to be slightly overpowered depending on a given language's grammar (e.g. plural of nouns); which could possibly make luck-of-the-draw a valid concern, but honestly I have more prominent issues with Scrabble. Firstly, mechanically speaking, it is a game where you try to find out and lay down the best tile combos to score large amounts of points, which makes the vast majority of your turns about short-term efficiency rather than strategy or voluntary player interaction. (Not my cup of tea.) Secondly, it mostly rewards people with a larger vocabulary; and I don't highly rate gaming as a platform for the validation of social status via a display of the accumulation of vast amounts of arbitrary out-of-game knowledge (what's more, knowledge that's already heavily rewarded by schools and workplaces).\n\nLet's not even talk about dictionary disputes.",
    "timestamp": 1665352800
  },
  {
    "username": "diamondsmasher",
    "rating": 3.0,
    "comment": "You play it to teach your kids how to play it. The carrot of the board game world.",
    "timestamp": 1665093600
  },
  {
    "username": "Dugy",
    "rating": 3.0,
    "comment": "The downtime kills the game a bit.",
    "timestamp": 1664488800
  },
  {
    "username": "Randall Silver",
    "rating": 3.0,
    "comment": "Personally, I think this game is boring.",
    "timestamp": 1662933600
  },
  {
    "username": "laexpls",
    "rating": 3.0,
    "comment": "Classic game. But there are better word building games nowadays.\n\nUpdate: Another game I seem to can't find anymore. Maybe I gifted or trashed it at some point in my life. Don't know. Strange.",
    "timestamp": 1660860000
  },
  {
    "username": "PlayerPersoon",
    "rating": 3.0,
    "comment": "Also in Jason's Collection (travel and generic editions).",
    "timestamp": 1659650400
  },
  {
    "username": "benjaminehlers1",
    "rating": 3.0,
    "comment": "This falls into the same category for me as chess - I like to play but there's a huge gap in trying to find the right matchup of players. I'm not the kind to study word-lists or memorize all the bizarre 2-letter words in order to maximize scoring opportunities. I also have nightmare memories of playing this with one particular super-aggressive opponent who was also a TERRIBLE loser with severe rage issues... so I often just threw the game so that I wouldn't have to suffer the wrath of said individual. I don't often lose games on purpose, but in the case of scrabble I have probably become conditioned to lose on purpose at this point.\nAdditionallly, The game also favers those who speel words correctley, wich I have been nown to strugle with frum time to time. Insidentely, its a good thing we all have fones with autokorrekt now so knowone has to think fore themselfs anymore...",
    "timestamp": 1657663200
  },
  {
    "username": "PlayerPersoon",
    "rating": 3.0,
    "comment": "Jason's Collection: basic and travel.",
    "timestamp": 1656194400
  },
  {
    "username": "villepa",
    "rating": 3.0,
    "comment": "I hate word games. Not a big fan.",
    "timestamp": 1655330400
  },
  {
    "username": "Brechtos",
    "rating": 3.0,
    "comment": "Just not my cup of tea but a classic. Do have some fond memories of this game when played as a kid with made up words.",
    "timestamp": 1652565600
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Good spatial game. But I dislike how you're avoiding to create openings to the player on your left.",
    "timestamp": 1652220000
  },
  {
    "username": "Luke23007",
    "rating": 3.0,
    "comment": "doubt i will ever play this one again. im not great at words anyways. modern games like Paperback would be suggested over this any day.",
    "timestamp": 1651960800
  },
  {
    "username": "Restlin158",
    "rating": 3.0,
    "comment": "I guess it's good... if you are a linguistics teacher...",
    "timestamp": 1643756400
  },
  {
    "username": "Maxplanck12",
    "rating": 3.0,
    "comment": "Sitting there, trying to think of words, is just not appealing on its own. Other games have figured out how to incorporate this as a single mechanic rather than having it be the entirety of the game. That works much better, for me.\n\nI would probably rate this one higher if I hadn't had to spend so much time playing it when I was younger.",
    "timestamp": 1642460400
  },
  {
    "username": "Jmarkmoss",
    "rating": 3.0,
    "comment": "Nothing about this.. Would play Qwirkle instead. The same thing but with shapes.",
    "timestamp": 1639090800
  },
  {
    "username": "Ravensburg24",
    "rating": 3.0,
    "comment": "If you ever need time to feel like it's slowing to a crawl, this is the game for you!",
    "timestamp": 1637103600
  },
  {
    "username": "VitoYin",
    "rating": 3.0,
    "comment": "Good for short-medium length plays.",
    "timestamp": 1635112800
  },
  {
    "username": "Gatekeeper3000",
    "rating": 3.0,
    "comment": "A classic game, but can get a bit boring. Although I have been playing a lot of \"scrabulous\" lately on Facebook, maybe thats because I can take it in little doses =)",
    "timestamp": 1635112800
  },
  {
    "username": "Jrb259",
    "rating": 3.0,
    "comment": "Spelling- never a strong suit for me, so do not love exposing this in a group setting.",
    "timestamp": 1632175200
  },
  {
    "username": "GameCat3",
    "rating": 3.0,
    "comment": "Well, it's a classic spelling game which I can't even recommend for educational purposes, since we played it all through my childhood & I still failed every spelling exam from elementary through high school... Gamecat can not recommend.",
    "timestamp": 1630274400
  },
  {
    "username": "Fuzzel",
    "rating": 3.0,
    "comment": "Meeeeh.",
    "timestamp": 1621634400
  },
  {
    "username": "surlyduff",
    "rating": 3.0,
    "comment": "Deluxe Scrabble Edition",
    "timestamp": 1619042400
  },
  {
    "username": "4McTavish",
    "rating": 4.0,
    "comment": "A2",
    "timestamp": 1759528800
  },
  {
    "username": "darkk_",
    "rating": 4.0,
    "comment": "Make words to score points, and learn using a dictionary when in doubt. lol\n\nCaptivating ❌\nEngaging ✅\nReplayable ✅\nRules ❌\nQuality ✅",
    "timestamp": 1759096800
  },
  {
    "username": "TheWinner1",
    "rating": 4.0,
    "comment": "Played competitively for 2 years and ran a Scrabble club for another 4 years. Playing at a competitive level requires memorizing large swathes of the dictionary, which I no longer do. Burnt out from playing so much, and I don't even own it, although could be convinced to play on occasion.",
    "timestamp": 1757800800
  },
  {
    "username": "thomasdc3po",
    "rating": 4.0,
    "comment": "Fun if you know all sorts of different words. Otherwise makes you feel dumb.",
    "timestamp": 1754776800
  },
  {
    "username": "Auroric",
    "rating": 4.0,
    "comment": "I think scrabble is one of the best \"classic\" games, but it rewards meta knowledge of the 2 letter words far too much, and I don't find it particularly fun. I respect it though. It's a decent area control game",
    "timestamp": 1753999200
  },
  {
    "username": "Weirdsalmon",
    "rating": 4.0,
    "comment": "4/10: A word game, so it starts off low, and Im not great with vocabulary, so scrabble is a fruitless, frustrating experience that I will go through for family.",
    "timestamp": 1752444000
  },
  {
    "username": "EllenCaroline",
    "rating": 4.0,
    "comment": "used to own",
    "timestamp": 1750802400
  },
  {
    "username": "Bagherra",
    "rating": 4.0,
    "comment": "Both English and Russian editions",
    "timestamp": 1746309600
  },
  {
    "username": "Hoodie_Wearing_Idiot",
    "rating": 4.0,
    "comment": "I feel like rating Scrabble low isn't right, but I have a personal problem with it. I've always had some level of analysis paralysis, though I've been working on eliminating that over the years. There are way too many options for my brain to handle. I sit there for WAY too long, trying to figure out how to maneuver my seven letters on the board, while my friends become more and more frustrated. I just can't handle the limitless options, and I end up playing a bunch of dumb three letter words. Yeah, yeah, skill issue on my part, but later word games created limitations that make it more fun to play, without eliminating the strategic knowledge of words.",
    "timestamp": 1744322400
  },
  {
    "username": "CortexBomb",
    "rating": 4.0,
    "comment": "I'm not good at word games, and my general enjoyment of games in the genre is not high because I feel that I can't compete, at all in them, and have no ability to come up with words. It's not just that I'm bad, my brain lacks the wiring to actually play the game. On occasion, my brain clicks with this one, and I can at least play it though.\n\nI used to rate this a 3, but after having played it quite a few times lately I have to inch this one up to a 4. This is still not the type of game that I'm ever going to request, but as mainstream fare goes it is pretty good, and though there are many games that I enjoy more, I am willing to play this with people who like it. The trick is to play not just for large words, but to the value of the squares on the board. Short words, which are easier to come up with anyway, hence, are actually better in many situations because they are harder for the other player(s) to build off of.\n\nThe thing I dislike the most in this game is the ambiguity concerning what a legal word is though, and the fact that strong play seems to revolve around memorizing a bunch of obscure (and questionable) 2 and 3 letter words; but still, for an older title it's not too bad.",
    "timestamp": 1739833200
  },
  {
    "username": "dseagle",
    "rating": 4.0,
    "comment": "Had this one since I was a kid. Hasn't been played in decades.\n\nIt's scrabble. It's fine. There are a ton of better word games out there these days.",
    "timestamp": 1738278000
  },
  {
    "username": "TFang",
    "rating": 4.0,
    "comment": "Spanish language edition before 2021 changes with the W (we play it as a blank)",
    "timestamp": 1736982000
  },
  {
    "username": "Yurienu",
    "rating": 4.0,
    "comment": "2-4 joueurs",
    "timestamp": 1736636400
  },
  {
    "username": "bggmatje",
    "rating": 4.0,
    "comment": "[January 2021]\nClassic family word game, but outdated.",
    "timestamp": 1736290800
  },
  {
    "username": "Namenotfound999",
    "rating": 4.0,
    "comment": "The game is probably good but it's not my cup of tea.",
    "timestamp": 1736031600
  },
  {
    "username": "BowlerConspiracy",
    "rating": 4.0,
    "comment": "just play bananagrams",
    "timestamp": 1735599600
  },
  {
    "username": "Sanderson1044",
    "rating": 3.5,
    "comment": "Turns take too long and feels too slow.",
    "timestamp": 1735081200
  },
  {
    "username": "Tyiliyra",
    "rating": 4.0,
    "comment": "side collection",
    "timestamp": 1731884400
  },
  {
    "username": "HackFin",
    "rating": 4.0,
    "comment": "Phew, I am not a big fan. If you play it strategically for the most points, it can be very draggy, but if your just play basically cooperatively, it has no tension at all. Not a game one needs to play nowadays.",
    "timestamp": 1731279600
  },
  {
    "username": "MatroidX",
    "rating": 4.0,
    "comment": "A solid word game, if a bit dry. I found it boring as a kid, but it's acceptable now.",
    "timestamp": 1730242800
  },
  {
    "username": "DealPete",
    "rating": 4.0,
    "comment": "My dislike for this game comes not really from the design, which is fine, but the way it plays in practice. People tend to spend a long time on their turns as they mentally line up their letters in all the combinations that fit on the board, leaving me bored when I already know what I'm going to play.\nI often end up playing this with people who have memorized all the two-letter word combinations from the official \"scrabble dictionary\", and it's no use arguing with them. Generally they don't even know what most of these words mean, they just know they're in the dictionary. It's essentially a rules supplement that isn't distributed with the game, and it takes the fun out of it for me.",
    "timestamp": 1723759200
  },
  {
    "username": "MaxImpactGames",
    "rating": 4.0,
    "comment": "Scrabble isn't a very good game, but I do play it occasionally with family. I would rather play a word game like \"GHOST\" that doesn't require a board, but some people love Scrabble.",
    "timestamp": 1722204000
  },
  {
    "username": "NormandyWept",
    "rating": 4.0,
    "comment": "A decent mix of word knowledge and spatial control on a 2d grid, and finding a bingo is particularly satisfying. But there's usually something else I'd rather play, especially with family, friends, and non-native English speakers, all of whom are some of my preferred opponents.",
    "timestamp": 1721685600
  },
  {
    "username": "bardfark",
    "rating": 4.0,
    "comment": "Yeah definitely not my game",
    "timestamp": 1720908000
  },
  {
    "username": "Telaz",
    "rating": 3.5,
    "comment": "My rating(50%): 4\nMy “want to play-again” rating(50%): 3\nMy overall rating: 3.5\nPlays: 5+",
    "timestamp": 1713391200
  },
  {
    "username": "darthmoeder",
    "rating": 4.0,
    "comment": "“This is a terrible board game! Vincent! You ever play a Scrabble board game? Want to play? It’s real terrible.”\n\n“I ain't hungry.”\n\n“Well, if you hate board games, give this a try sometime. Me, I usually play it 'cause my wife’s a Scrabble player which pretty much makes me a Scrabble player…. But I do love the taste of a good board game.”",
    "timestamp": 1712527200
  },
  {
    "username": "rogedavi",
    "rating": 4.0,
    "comment": "Never enjoyed this game as a child, but as an adult I think its quite fun to pull out the box every once in awhile.",
    "timestamp": 1712095200
  },
  {
    "username": "PolarDad",
    "rating": 4.0,
    "comment": "Fun for children learning to spell or increase their vocabulary. Also fun for adults that like to show off their vocabulary. Very uneven playing field when playing with children. Gaming world has much better options now...\n\nLast played 2024",
    "timestamp": 1710543600
  },
  {
    "username": "asmallcat",
    "rating": 4.0,
    "comment": "I appreciate the timelessness of this design, but it's not for me.",
    "timestamp": 1709247600
  },
  {
    "username": "Destrio",
    "rating": 4.0,
    "comment": "Finally played this classic. Still not a fan of word games, but I can see why this is a good one that has earned its reputation.",
    "timestamp": 1708297200
  },
  {
    "username": "TheGamersCollective",
    "rating": 4.0,
    "comment": "not good for people with bad spellig",
    "timestamp": 1706914800
  },
  {
    "username": "ngoomie",
    "rating": 4.0,
    "comment": "[This is about the Parker Brothers English folio edition from 2001 specifically, as an FYI]\n\nThe small tiles take a stupid amount of force to stick in sometimes, but once they're in, they're DEFINITELY in. The tiles don't actually stick in the little player stand, so if you knock them around then you might legitimately lose tiles. I don't know why but something about the board being small also made me + the people I was playing with *think small*, in that we kept seemingly only being able to play absolute piss words, often only 3 letters long. I like Scrabble in general, but I don't like this version and find playing it to suck. I'd bet there's a better travel version I haven't played. Also I want to eat the tiles?\n\n[Owned by my immediate family/parents]",
    "timestamp": 1705618800
  },
  {
    "username": "erichilm",
    "rating": 4.0,
    "comment": "Fun concept but luck + long playtime kill the fun",
    "timestamp": 1704495600
  },
  {
    "username": "Fspluver",
    "rating": 4.0,
    "comment": "Scrabble is a poorly designed game, but I'm still giving it four stars because of how accessible it is. I'm not the first to say this, but Scrabble is a mediocre area control game masquerading as a word game.",
    "timestamp": 1703026800
  },
  {
    "username": "BluliaBrown",
    "rating": 4.0,
    "comment": "ITA",
    "timestamp": 1701644400
  },
  {
    "username": "trader_vic",
    "rating": 4.0,
    "comment": "I can't recall ever having fun playing Scrabble. If you can find a group of people with similar levels of vocabulary I'm sure it can be good, but that's not been my experience.",
    "timestamp": 1701039600
  },
  {
    "username": "kvarclovag",
    "rating": 4.0,
    "comment": "Hát, ez nem a magyar nyelvre van kitalálva. Az Óvakodj a törpétőlben viszont nagyon vicces amikor a két néni játssza.",
    "timestamp": 1700866800
  },
  {
    "username": "elrhays84",
    "rating": 4.0,
    "comment": "Too slow.",
    "timestamp": 1700348400
  },
  {
    "username": "emily84",
    "rating": 4.0,
    "comment": "Wordfeud is better as there it's ok to play not have a slow game. But as a BoardGameGeek it's way to slow.",
    "timestamp": 1700002800
  },
  {
    "username": "efrazier",
    "rating": 4.0,
    "comment": "Rewards memory recall of obscure 3-letter words employing rare (and high-value) letters. Does not actually reward vocabulary, let alone any strategic or tactical skill. Can be 100+ points behind the leader with hours yet to go.",
    "timestamp": 1699311600
  },
  {
    "username": "Jose_Enrique",
    "rating": 4.0,
    "comment": "A lo que vi dentro de la caja no tenia instrucciones así que por esa parte toca ver las reglas del juego por fuera y es algo bastante tedioso\nPero jugar sin reglas y con amigos es bastante divertido",
    "timestamp": 1692568800
  },
  {
    "username": "morteigan",
    "rating": 4.0,
    "comment": "I never was a fan of scrabble, too much way to screw with you opponent without adding more fun to the game. In fact this game was killed by itself. Not a fan of vocabulary game anyway. Lost it when I moved away from my parents.",
    "timestamp": 1687816800
  },
  {
    "username": "SanHolo39",
    "rating": 3.5,
    "comment": "Super boring.",
    "timestamp": 1685224800
  },
  {
    "username": "Raidents",
    "rating": 4.0,
    "comment": "You're either good at the game or you're not. I'm too competitive and too bad at it to appreciate it on the casual level that it deserves.",
    "timestamp": 1683496800
  },
  {
    "username": "Beefy79",
    "rating": 4.0,
    "comment": "Not on shelf",
    "timestamp": 1683237600
  },
  {
    "username": "Gravey",
    "rating": 4.0,
    "comment": "I will never complain about the length of 6-player Quiddler again.",
    "timestamp": 1682892000
  },
  {
    "username": "Greenosaur",
    "rating": 4.0,
    "comment": "Family Classic!!!!",
    "timestamp": 1682287200
  },
  {
    "username": "lainesko",
    "rating": 4.0,
    "comment": "Scrabble is one of my favorite so-called \"classic games\" but it does take too long for what it is. Thinking of words, especially if someone else takes your spot, can take for ages and it leaves others just waiting around. Maybe a timer could solve this issue but then the game would be too stressful for what it is.\n\nI don't mind playing Scrabble every now and then but I feel like there have to be better options out there, just haven't found them yet.",
    "timestamp": 1679954400
  },
  {
    "username": "angigmk",
    "rating": 4.0,
    "comment": "4 players",
    "timestamp": 1678834800
  },
  {
    "username": "digitaldemigod",
    "rating": 4.0,
    "comment": "",
    "timestamp": 1674774000
  },
  {
    "username": "kamikaza",
    "rating": 4.0,
    "comment": "Bad. Many things are wrong.",
    "timestamp": 1673478000
  },
  {
    "username": "CHRISDH",
    "rating": 4.0,
    "comment": "Word game If put in the right spot you can score good amount of points. A little luck in this game with what letters are drawn but A more literate player is likely going to win.",
    "timestamp": 1672786800
  },
  {
    "username": "rharn",
    "rating": 5.0,
    "comment": "Would be a better game without the ability to just plop on random and obscure 2-letter words that nobody has ever used in an everyday conversation.",
    "timestamp": 1760220000
  },
  {
    "username": "gergo314",
    "rating": 5.0,
    "comment": "hungarian edition",
    "timestamp": 1759269600
  },
  {
    "username": "Spengliosis",
    "rating": 5.0,
    "comment": "family; board + letters\n- word assembly",
    "timestamp": 1757455200
  },
  {
    "username": "Jclancy15",
    "rating": 5.0,
    "comment": "This game could be cool but I resent having my vocabulary be a prerequisite to participate in an spacial influence game.",
    "timestamp": 1756332000
  },
  {
    "username": "LovecraftCountry",
    "rating": 5.0,
    "comment": "Scrabble is neat. My wife really likes this game but I just hate how slow it plays. Some turns take a minute, while others take 5 minutes. If you play with the official rules and bring out an egg timer it works well enough, though there are better word games out there today.",
    "timestamp": 1755036000
  },
  {
    "username": "Haemonculus",
    "rating": 5.3,
    "comment": "A classic word game. There are many language versions of this game in a world.",
    "timestamp": 1753999200
  },
  {
    "username": "camidon",
    "rating": 5.0,
    "comment": "My mom played scrabble relentless when I was little, often playing solo. She still plays solo today (too bad I can't get her into so many other games...). We're both so good that my wife won't play with me (I don't blame her). However, my mom claims I always beat her (not true as I have the game statistics to prove it), so she has started to complain about everything, and games have become less fun over the years. I still always play this with her, though. This is classic that deserves its accolades.\n\nSOLD KC BONKERS",
    "timestamp": 1753740000
  },
  {
    "username": "Shrewmaster",
    "rating": 5.0,
    "comment": "I can sometimes be a bit hard on the classics. Too ubiquitous and unmysterious for me, \"classic\" fatigue. But they aren't classics for nothing; if word games are your bag then this is very hard to beat.",
    "timestamp": 1751925600
  },
  {
    "username": "TrueMead",
    "rating": 5.0,
    "comment": "Scrabble is the Star Wars or Citizen Kane of word games. It was great for its time, and it still hold up. That said, there are a plethora of better word games that have come out in the intervening half century since its creation. And yet, how many of those others can claim to secretly not be a word game, but an area control game in disguise?",
    "timestamp": 1751493600
  },
  {
    "username": "MichaelaPat",
    "rating": 5.0,
    "comment": "2025",
    "timestamp": 1750888800
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "meh",
    "timestamp": 1750888800
  },
  {
    "username": "Sawney",
    "rating": 5.0,
    "comment": "Alright if its the only game you own like some people?",
    "timestamp": 1749592800
  },
  {
    "username": "MA2HB",
    "rating": 5.0,
    "comment": "Not very fun",
    "timestamp": 1748556000
  },
  {
    "username": "yoyomanhihi",
    "rating": 4.8,
    "comment": "Not my type of game at all. I'm not saying it's bad, but I just think it's not fun.",
    "timestamp": 1742338800
  },
  {
    "username": "jerjerbinks",
    "rating": 5.0,
    "comment": "- I don't want to play scrabble, even though i have it",
    "timestamp": 1741647600
  },
  {
    "username": "anton",
    "rating": 5.0,
    "comment": "The only game in my collection that by wife kicks my can at with great regularity.\nMaybe its that pocket Thesaurus of hers...?!",
    "timestamp": 1740351600
  },
  {
    "username": "Bal_505",
    "rating": 5.0,
    "comment": "Never played a game of this that felt truly competitive.",
    "timestamp": 1740092400
  },
  {
    "username": "klaypoll",
    "rating": 5.0,
    "comment": "Yep, it’s another classic - and for good reason too.",
    "timestamp": 1739487600
  },
  {
    "username": "CountVowl",
    "rating": 5.0,
    "comment": "Inferior game to Upwords, fight me",
    "timestamp": 1739228400
  },
  {
    "username": "GameCr8zGal",
    "rating": 5.0,
    "comment": "Includes an extra retail pack of official score sheets!\n\nSold @ RSG on 2/01/2025.",
    "timestamp": 1738882800
  },
  {
    "username": "nebsboi",
    "rating": 5.0,
    "comment": "my auntie beat me at scrabble.",
    "timestamp": 1738278000
  },
  {
    "username": "Lowengrin",
    "rating": 5.0,
    "comment": "I don't actually remember the last time that I played Scrabble, but it was likely in the 1990s. It was definitely with my mother and at least one of my sisters. And that's about the only way I'll play it.",
    "timestamp": 1737586800
  },
  {
    "username": "Gwar13",
    "rating": 4.9,
    "comment": "facile",
    "timestamp": 1737068400
  },
  {
    "username": "WhaleShark9",
    "rating": 5.0,
    "comment": "Good, basic game",
    "timestamp": 1736377200
  },
  {
    "username": "beardandglasses",
    "rating": 5.0,
    "comment": "Thrift/yard sale find",
    "timestamp": 1736290800
  },
  {
    "username": "repear",
    "rating": 5.0,
    "comment": "This game is great but it gives me heavy analysis paralysis.",
    "timestamp": 1736118000
  },
  {
    "username": "rkimerer",
    "rating": 5.0,
    "comment": "It is not fun if you cannot spell. There always seems to be one person in your group that destroys everyone else, it is no surprise when this is the game that friend always wants to play.",
    "timestamp": 1736031600
  },
  {
    "username": "jodokast4",
    "rating": 5.0,
    "comment": "It's a classic",
    "timestamp": 1735513200
  },
  {
    "username": "jaheged",
    "rating": 5.0,
    "comment": "K",
    "timestamp": 1735340400
  },
  {
    "username": "DestinyThinker",
    "rating": 4.5,
    "comment": "My mom loves this game (and has a fantastic vocabulary) so I am willing to play it on occasion, knowing I might improve my vocabulary while I loose miserably.",
    "timestamp": 1735340400
  },
  {
    "username": "chanyuekong",
    "rating": 5.0,
    "comment": "2-4",
    "timestamp": 1734908400
  },
  {
    "username": "edaelon",
    "rating": 5.0,
    "comment": "it's not game's fault, just not my thing",
    "timestamp": 1734044400
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "I use to play this as a kid with my mom. She thought it would help me with spelling and word comprehension. I would hate playing this game because I sucked. Imagine a 9 year old playing against a 30 year old. I got stomped every game.\n\nGot in 2007",
    "timestamp": 1731452400
  },
  {
    "username": "Nicodemus42",
    "rating": 5.0,
    "comment": "-2-3-4",
    "timestamp": 1730674800
  },
  {
    "username": "tphon",
    "rating": 5.0,
    "comment": "No Cards",
    "timestamp": 1728511200
  },
  {
    "username": "jellyfishjoe",
    "rating": 4.7,
    "comment": "An area control game that weaponizes vocabulary at low-level play, and rote memorization at higher levels. Most fun when no one is really trying to win",
    "timestamp": 1728338400
  },
  {
    "username": "LordGarySugar",
    "rating": 5.0,
    "comment": "Misleading. The verb 'scrabble' implies urgency or speed.",
    "timestamp": 1728165600
  },
  {
    "username": "alexdesouza",
    "rating": 5.0,
    "comment": "A timeless classic. Nu, in Nederlandse!",
    "timestamp": 1726696800
  },
  {
    "username": "DreamDancer82",
    "rating": 5.0,
    "comment": "A bit confusing. I couldn't finish it because I couldn't figure out the rules very well. I think I have to see it being done before I get the hang of it.",
    "timestamp": 1724882400
  },
  {
    "username": "Smagi",
    "rating": 5.0,
    "comment": "Liczba graczy: 2 - 4\nCzas gry: 90 minut",
    "timestamp": 1724709600
  },
  {
    "username": "MD87",
    "rating": 5.0,
    "comment": "I like words, which is probably why I don't like Scrabble that much. Trying to make words out of nonsense isn't fun; having an amazing word that you just cannot place anywhere isn't fun.\n\nWhen it works, it's great. I don't remember many specific moments from board games, but I remember playing \"toothiest\" across two triple word scores for a game-ending number of points.\n\nUnfortunately that doesn't make up for all the times it doesn't work, and everyone involved is just annoyed at the lack of places to play, confused at how they've ended up with an entire rack of vowels, and put off by the huge score difference.",
    "timestamp": 1724104800
  },
  {
    "username": "Psychobob99",
    "rating": 5.0,
    "comment": "Just don't get the rules these days. 'unpaused' is not accepted, but 'Japan' is according to google. 'st' is allowed. WTF?",
    "timestamp": 1723500000
  },
  {
    "username": "andresuss",
    "rating": 5.0,
    "comment": "Russian Edition",
    "timestamp": 1720389600
  },
  {
    "username": "G_Riffy",
    "rating": 5.0,
    "comment": "I grew up playing this, but grew tired of it as the player with the broadest vocabulary wins.\n\nWithin my family, that was not me.",
    "timestamp": 1720216800
  },
  {
    "username": "Capntallon",
    "rating": 5.0,
    "comment": "In the classroom.",
    "timestamp": 1719525600
  },
  {
    "username": "Topdecker577",
    "rating": 5.0,
    "comment": "Brain work 10, fun factor 2.",
    "timestamp": 1717624800
  },
  {
    "username": "TuesdayFortnite",
    "rating": 5.0,
    "comment": "dice based version",
    "timestamp": 1712786400
  },
  {
    "username": "Dessyreqt",
    "rating": 5.0,
    "comment": "Best at: 2 - Plays: 2-4",
    "timestamp": 1712613600
  },
  {
    "username": "locollama",
    "rating": 5.0,
    "comment": "2-4 10+",
    "timestamp": 1712181600
  },
  {
    "username": "dsumw01",
    "rating": 5.0,
    "comment": "1948 2-1% 1-91%",
    "timestamp": 1711062000
  },
  {
    "username": "magoivan",
    "rating": 5.1,
    "comment": "Clásico. Ya sabes lo que te espera.\n\n20/03/2024\nRevisión de nota:\n-Reglamento: 6\n-Diseño: 5\n-Componentes: 8\n-Adicción: 5\n-Escalabilidad: 6\n-Originalidad: 5\n-Tema: 1",
    "timestamp": 1710889200
  },
  {
    "username": "Animepops",
    "rating": 5.0,
    "comment": "Childhood memories",
    "timestamp": 1710802800
  },
  {
    "username": "Gia187",
    "rating": 5.0,
    "comment": "Nostamgie. Mijn eerste woordenpuzzel. Goed voor kinderen maar de punten maken dan niet zoveel uit.",
    "timestamp": 1710716400
  },
  {
    "username": "nikodems",
    "rating": 5.0,
    "comment": "Age: 10+\nCommunity: 10+",
    "timestamp": 1710025200
  },
  {
    "username": "Nye27",
    "rating": 5.0,
    "comment": "it's a simple word game, not a fan.",
    "timestamp": 1710025200
  },
  {
    "username": "rcokting",
    "rating": 5.0,
    "comment": "2–4 Players (Best 2)\n90 Min\nWeight: 2.07 / 5",
    "timestamp": 1709593200
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "Decent word game. Main issue is downtime between turns, which is what makes it unplayable with more than two. With two downtime can be brought down to an acceptable degree by adding a timer. Are there better word games out there? Yes. Is Scrabble still decent? Also yes.\n\nRating: \nOptimal number of players:\n 2\n 3~4\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "lorax21",
    "rating": 5.0,
    "comment": "Brilliant design. Since much of my job is spent writing, our games Scrabble and Super-Scrabble don't feel recreational to me.\n\nMy wife, a coffee-drinker, wins when we play in the morning. I win evening games. Afternoon games are toss-ups.",
    "timestamp": 1709074800
  },
  {
    "username": "dER_aAl",
    "rating": 5.0,
    "comment": "2-4 empfohlen\n2 beste\n2,07 weight",
    "timestamp": 1708470000
  },
  {
    "username": "Bethobrien",
    "rating": 5.0,
    "comment": "Game category: Family Game\n\nA classic.",
    "timestamp": 1708210800
  },
  {
    "username": "Maddest Hatter",
    "rating": 5.0,
    "comment": "Will never play again, but was fun as a child.",
    "timestamp": 1707692400
  },
  {
    "username": "thestoryguy",
    "rating": 5.0,
    "comment": "Best with 2 players. More than that gives advantage to the player left of the weakest player.",
    "timestamp": 1707692400
  },
  {
    "username": "tscox87",
    "rating": 5.0,
    "comment": "I prefer other word games but this is a classic of course.",
    "timestamp": 1707260400
  },
  {
    "username": "IvoryDaggers",
    "rating": 5.0,
    "comment": "Whether it's fun or miserable depends heavily on who you play with. Everyone needs to be similar in vocab strength and have the same attitude - are we playing a word game where we make the best words we can, or are we playing a ruthless area control game where word quality is completely beside the point?",
    "timestamp": 1706742000
  },
  {
    "username": "lee elektrik",
    "rating": 5.0,
    "comment": "Ah! Great times!",
    "timestamp": 1706742000
  },
  {
    "username": "Mannyx200",
    "rating": 5.0,
    "comment": "It's a classic game of coming up with the best words to score. I don't dislike it, but there are more clever word games out there now.",
    "timestamp": 1704841200
  },
  {
    "username": "gwebOn",
    "rating": 5.0,
    "comment": "2 sets (plastic & wooden).",
    "timestamp": 1704754800
  },
  {
    "username": "Roma99",
    "rating": 5.0,
    "comment": "Es un clásico que puede llegar a sacarte un par de carcajadas y ponerte a pensar, las estrategias son pocas y es disfrutable un par de partidas",
    "timestamp": 1704322800
  },
  {
    "username": "galvornman",
    "rating": 5.0,
    "comment": "It's fine.",
    "timestamp": 1704150000
  },
  {
    "username": "burker",
    "rating": 5.0,
    "comment": "Best with a 1 minute timer to speed it up. Levels the playing field as well as making the game fly.",
    "timestamp": 1703890800
  },
  {
    "username": "churchb3",
    "rating": 5.0,
    "comment": "Classic. Played this a lot. I'd rather do a crossword.",
    "timestamp": 1703113200
  },
  {
    "username": "Glic2003",
    "rating": 5.0,
    "comment": "A pretty bad game by most metrics.",
    "timestamp": 1701558000
  },
  {
    "username": "Sammisar",
    "rating": 5.0,
    "comment": "Base Game",
    "timestamp": 1701471600
  },
  {
    "username": "thebaysix",
    "rating": 5.0,
    "comment": "I like this game because I am good at it, but I acknowledge it is a flawed game. It doesn't reward any interesting word-related skill but rather 2 and 3 letter word memorization (and not even in an interesting chess-like motif kind of way, it's just rote memorization). I'll play it with family and establish my dominance though.\n\nThe scoring is also clearly broken.",
    "timestamp": 1700780400
  },
  {
    "username": "bpa7403",
    "rating": 5.0,
    "comment": "Better know your words or people will just make up stuff",
    "timestamp": 1700348400
  },
  {
    "username": "dead_eye_dodo",
    "rating": 5.0,
    "comment": "Scrabble is by far my favorite \"really really old game\". It still has the potential for a few funny rounds.",
    "timestamp": 1696802400
  },
  {
    "username": "jtakagi",
    "rating": 5.0,
    "comment": "My respect for this game went way up after having watched \"Word Wars\". While not an excellent documentary, the passion the characters had for the game was contagious and really inspired me.",
    "timestamp": 1695074400
  },
  {
    "username": "Der Das",
    "rating": 5.0,
    "comment": "Converted from old Junior board.\nAlso own a wooden SIO made board-turner.\n\nNot the best word-game in the world: basic 5.",
    "timestamp": 1693951200
  },
  {
    "username": "Yves1981",
    "rating": 5.0,
    "comment": "10",
    "timestamp": 1693173600
  },
  {
    "username": "mehdijavani88",
    "rating": 5.0,
    "comment": "I know I'm not good at it!",
    "timestamp": 1692828000
  },
  {
    "username": "Frederick_Langlois",
    "rating": 5.0,
    "comment": "Pas vraiment mon style de jeu, peut-être agréable avec un café le matin pour débuter une journée pluvieuse genre...",
    "timestamp": 1691100000
  },
  {
    "username": "Welcheren",
    "rating": 5.0,
    "comment": "Okay, but there are so many better options around now.",
    "timestamp": 1690408800
  },
  {
    "username": "Tristan_Lannister",
    "rating": 5.0,
    "comment": "I'll happily play scrabble, but I think as a game it can be fairly rough. You really need to play with all the bizarre two-letter words to make consistently play well, and even then there are plenty of turns that just feel terrible.",
    "timestamp": 1689890400
  },
  {
    "username": "Ellogeyen",
    "rating": 5.0,
    "comment": "2-4 plays (2020)",
    "timestamp": 1689631200
  },
  {
    "username": "Chris Babcock",
    "rating": 5.0,
    "comment": "An all time classic. You have to be \"in the know\" to do well at it though. Like memorizing all the 2 letter words.",
    "timestamp": 1688508000
  },
  {
    "username": "Reciclerishu",
    "rating": 5.0,
    "comment": "I am not huge on word games. At same time, sometimes scoring in scrabble does not relay on person knowing best words - but finding best location where to put word.",
    "timestamp": 1688248800
  },
  {
    "username": "Firearchitect",
    "rating": 5.0,
    "comment": "Played countless times",
    "timestamp": 1687903200
  },
  {
    "username": "Cynecheverriab",
    "rating": 5.0,
    "comment": "Very boring game to be honest. You depend a lot on what the other people do and it's very slow",
    "timestamp": 1685311200
  },
  {
    "username": "TwirlingFern",
    "rating": 5.0,
    "comment": "The game is okay, but I'd much rather play most any other game. The play time is quite long also.",
    "timestamp": 1683842400
  },
  {
    "username": "breakbeatnik",
    "rating": 5.0,
    "comment": "classic game, enjoyable for a laid-back evening... it's just too long. maybe would be good to have a game timer and end after 30min or so",
    "timestamp": 1683583200
  },
  {
    "username": "apostolaras1971",
    "rating": 5.0,
    "comment": "10€",
    "timestamp": 1683064800
  },
  {
    "username": "edugon",
    "rating": 5.0,
    "comment": "Jugado mucho con la familia cuando era pequeño. Ahora me da un poco de pereza.",
    "timestamp": 1681336800
  },
  {
    "username": "tootstorm",
    "rating": 5.0,
    "comment": "I hate Scrabble. In theory, I should love it (and Banagrams). I read a lot, my vocab is p. danged good (*toots*), but the second I pick up one of these word games, all I can do is spell 'loot' and 'boot' and 'toot' and 'the.' I suck at these games so much. I have never won any of them -- ever.\n\nBananagrams is better, but just barely.",
    "timestamp": 1681250400
  },
  {
    "username": "Dgotrek",
    "rating": 5.0,
    "comment": "It has been years since I last used it. Fun with grandma way back when.",
    "timestamp": 1679785200
  },
  {
    "username": "ts0ng",
    "rating": 5.0,
    "comment": "kids/family",
    "timestamp": 1678834800
  },
  {
    "username": "guestid1250",
    "rating": 5.0,
    "comment": "A good \"thinking\" game to introduce kids to. One big potential problem with this one is analysis paralysis (AP). Definitely need to put a timer on people who take too long. I really don't have the patience for this one anymore.",
    "timestamp": 1678489200
  },
  {
    "username": "elitegamingsociety",
    "rating": 5.0,
    "comment": "Ty",
    "timestamp": 1678057200
  },
  {
    "username": "casualcasual",
    "rating": 5.0,
    "comment": "Challenge mode with a single dictionary is a must.... if only my gaming partners saw it that way! It's an area control game (they say). Okay. I like the bluffing game.",
    "timestamp": 1677452400
  },
  {
    "username": "onigaming",
    "rating": 5.0,
    "comment": "Less about the words and more about just finding the best ties to land on the right point squares. It's not my favorite word game, but again it's a classic I own because others might want to play it occasionally.",
    "timestamp": 1677452400
  },
  {
    "username": "DoctorAnn",
    "rating": 5.0,
    "comment": "2 players. This is the Deluxe Travel Edition from 1990.",
    "timestamp": 1676847600
  },
  {
    "username": "gyroscope1045",
    "rating": 5.0,
    "comment": "No Cards",
    "timestamp": 1676242800
  },
  {
    "username": "SunnyD44",
    "rating": 5.0,
    "comment": "My version of scrabble is the standard card board board. Will play if someone wants to, but doesn't get to the table much as you need to play against someone who can spell, otherwise it gets tedious.",
    "timestamp": 1675983600
  },
  {
    "username": "sudothefox",
    "rating": 4.5,
    "comment": "A family tabletop classic.",
    "timestamp": 1675206000
  },
  {
    "username": "DSmitty",
    "rating": 5.0,
    "comment": "Played a lot of Scrabble with my Mom when I was a kid. Used to have a game called Scrabble Duplicate, which was like inverse Scrabble (everyone has their own paper board and uses the same letters), which I liked a lot more.",
    "timestamp": 1672441200
  },
  {
    "username": "C Thompson",
    "rating": 6.0,
    "comment": "A mass-market classic, overlooked by modern hobbyist gamers. It's a crossword puzzle on the surface, but it reveals more depth than you'd expect. Dare I say it, Scrabble is an area-control game comparable to the lauded Tigris and Euphrates.",
    "timestamp": 1761147120
  },
  {
    "username": "YoLYcmqZ",
    "rating": 6.0,
    "comment": "Rating: +0.0\nOwn: Physical",
    "timestamp": 1759615200
  },
  {
    "username": "Alaena",
    "rating": 6.0,
    "comment": "I'm not a wordsmith and my vocabulary sucks. I wouldn't mind playing though...I think. David doesn't enjoy this game because he always loses to his sister.",
    "timestamp": 1758232800
  },
  {
    "username": "Darknlves",
    "rating": 5.5,
    "comment": "This game is good until it gets to the end. Then you're playing the last 10% of the game for one hour and it just becomes bad. Makes no sense to spend half the play time playing the last words. If this game's ending was fixed, it could trully shine.",
    "timestamp": 1758146400
  },
  {
    "username": "TeamSOLUNE",
    "rating": 6.0,
    "comment": "OK - Kinda boring",
    "timestamp": 1757887200
  },
  {
    "username": "CKaefe",
    "rating": 6.1,
    "comment": "I wish I was better at this game. No love for wordsmithing and literature was enough to make me win more times.",
    "timestamp": 1756764000
  },
  {
    "username": "Avid_Equinox",
    "rating": 6.0,
    "comment": "Still kinda decent in the modern day and somewhat educational",
    "timestamp": 1756159200
  },
  {
    "username": "xionc",
    "rating": 6.0,
    "comment": "This is a good game, I give 6 for Polish version using Polish letters that I cannot look for in my phone",
    "timestamp": 1755381600
  },
  {
    "username": "ahrnge",
    "rating": 5.5,
    "comment": "I'm sure I'd rate scrabble much higher if I put in the work to get better at it (learning 2-letter words, bingos, leave valuations, etc). My understanding is that there's a ton of depth to this game. For me, it's mostly just getting stuck on \"Surely there's something great I can spell with these,\" until I eventually give up and play a word that smells of failure. I think this is why my preference is for Bananagrams, where playing whatever pops into your head first is much more viable.",
    "timestamp": 1754344800
  },
  {
    "username": "surrutia",
    "rating": 5.6,
    "comment": "På Norsk 1",
    "timestamp": 1754172000
  },
  {
    "username": "winchesterkaveman",
    "rating": 6.0,
    "comment": "I wasn't even sure if I should rate Scrabble here. I mean, it's almost an antique game these days, and is so widely disseminated that I'd be surprised to find a home that doesn't have a copy somewhere.\nIts a true classic that will endure for ever I think.",
    "timestamp": 1753740000
  },
  {
    "username": "irie_pepe",
    "rating": 6.0,
    "comment": "Scrabble has its moments and so I keep it in my collection.",
    "timestamp": 1752271200
  },
  {
    "username": "WeNeedthePooh",
    "rating": 6.0,
    "comment": "Needs a dictionary to play.",
    "timestamp": 1750716000
  },
  {
    "username": "Ostropol",
    "rating": 6.0,
    "comment": "Peep",
    "timestamp": 1750629600
  },
  {
    "username": "MenHunlahun",
    "rating": 6.0,
    "comment": "A lot of downtime involved, but still a compelling and challenging word game which I play with my mom ocassionally.",
    "timestamp": 1750197600
  },
  {
    "username": "Racelympics",
    "rating": 6.0,
    "comment": "Played this version again. It’s actually really nice for a travel set! In terms of my hands to the tiles, it’s not a big deal. You just need to have patience for it, if you’re like me.",
    "timestamp": 1748728800
  },
  {
    "username": "Zaytor",
    "rating": 6.0,
    "comment": "I still enjoy a good game of Scrabble from time to time. The release I own is the Barnes and Noble Onyx Edition and I think it is very sleek, attractive and contains quality components.\n\nLocation: Board Game Room Closet",
    "timestamp": 1748469600
  },
  {
    "username": "jagunlimited",
    "rating": 6.0,
    "comment": "Tile placement\nHand management\n\n2–4 Players\n90 Min\nAge: 10+\nWeight: 2.07 / 5",
    "timestamp": 1748469600
  },
  {
    "username": "veve33",
    "rating": 6.0,
    "comment": "za ya",
    "timestamp": 1748210400
  },
  {
    "username": "wantofaname",
    "rating": 6.0,
    "comment": "deluxe version",
    "timestamp": 1747778400
  },
  {
    "username": "Frog0fWar",
    "rating": 6.0,
    "comment": "2-4 (2)",
    "timestamp": 1747432800
  },
  {
    "username": "mycheze",
    "rating": 6.0,
    "comment": "Owned in Spanish",
    "timestamp": 1746828000
  },
  {
    "username": "WhiteSeal",
    "rating": 6.0,
    "comment": "2-4 spelers (best 2)\n10+",
    "timestamp": 1746828000
  },
  {
    "username": "Arctic00",
    "rating": 6.0,
    "comment": "It’s Scrabble. What else is there to say? I wish it were a little shorter, a bit less tedious to score. But…. Fun every once in a while.",
    "timestamp": 1746568800
  },
  {
    "username": "TheHowzers",
    "rating": 6.0,
    "comment": "6.3\n2 to 4 players.",
    "timestamp": 1745877600
  },
  {
    "username": "TabletopPrincess",
    "rating": 6.0,
    "comment": "There's not a great deal to say about Scrabble that hasn't already been written. Our copy was purchased new by our great grandmother and has seen semi-regular family play for generations. Its telling that with no changes of note, the same game has been entertaining families for all this time.",
    "timestamp": 1745532000
  },
  {
    "username": "Bropo",
    "rating": 6.0,
    "comment": "-",
    "timestamp": 1745359200
  },
  {
    "username": "beep_beep",
    "rating": 6.0,
    "comment": "Don't tell my dad. Scrabble is a family tradition; 100 plays surely dramatically underestimates the reality. And I have lots of great memories of playing Scrabble!\n\nBut it's a mess. You can fall 150 points behind in the first two turns. You can have unplayable letters all game long. You can draw all the power tiles and run roughshod over your opponent. On top of all that, good play at the intermediate level (when you haven't memorized thousands of letter combinations and aren't able to pull an obscure bingo out of every rack) means blocking out your opponent with cramped, closed-off plays that rely heavily on two-letter words. This makes your own future moves harder, of course, and it's also just sort of ugly. The game's more fun when you aren't trying to win!",
    "timestamp": 1744840800
  },
  {
    "username": "DexGeek",
    "rating": 5.5,
    "comment": "Owner: Dex & Katie",
    "timestamp": 1744754400
  },
  {
    "username": "Mimsbee",
    "rating": 6.0,
    "comment": "2-4 players, word game. Enjoyable but too slow",
    "timestamp": 1743976800
  },
  {
    "username": "MaxxoBass",
    "rating": 6.0,
    "comment": "Scrabble ermöglicht eine gewisse Kreativität, insbesondere bei der Wortbildung und dem Nutzen von Buchstaben, aber es gibt nicht viele dynamische Veränderungen im Spielverlauf. Es bietet dennoch Raum für strategisches Denken.",
    "timestamp": 1743631200
  },
  {
    "username": "W1LDH0R53",
    "rating": 6.0,
    "comment": "Magnet Version",
    "timestamp": 1742943600
  },
  {
    "username": "mykindameeple",
    "rating": 6.0,
    "comment": "- 2-4 players",
    "timestamp": 1742770800
  },
  {
    "username": "kingwilli",
    "rating": 6.0,
    "comment": "[NR] (#128) The classic word game..",
    "timestamp": 1742079600
  },
  {
    "username": "jimavet",
    "rating": 5.5,
    "comment": "Non Solo:",
    "timestamp": 1741820400
  },
  {
    "username": "jqh928",
    "rating": 5.5,
    "comment": "Best word game I have played and will always play if asked.",
    "timestamp": 1740524400
  },
  {
    "username": "colinporter68",
    "rating": 6.0,
    "comment": "I've found myself enjoying this classic more and more in recent years, likely because my vocabulary has expanded. Dilemma between turns taking too long but not wanting to add pressure to make a word quickly.",
    "timestamp": 1739574000
  },
  {
    "username": "HuckmanT",
    "rating": 6.0,
    "comment": "2025 I think my passion for word play came from playing Scrabble with my grandparents.",
    "timestamp": 1738969200
  },
  {
    "username": "Staban Tuek",
    "rating": 6.0,
    "comment": "When I am in the right frame of mind I really enjoy this game. It is sort of like a vocabulary version of chess with a little luck thrown in via tile draws. My wife is an English literature buff so she and I are evenly matched and our games tend to come down to the wire.",
    "timestamp": 1738882800
  },
  {
    "username": "GermanPineros",
    "rating": 6.0,
    "comment": "Clásico",
    "timestamp": 1738882800
  },
  {
    "username": "Xyt4n",
    "rating": 6.0,
    "comment": "+ mentally challenging\n+ looks beautiful in the original classic variant\n- can sometimes drag, because you need much time to find a word\n- not such a big fun. Its okay, but nothing I am fascinated by. Good time killer",
    "timestamp": 1738796400
  },
  {
    "username": "Pyonopon",
    "rating": 6.0,
    "comment": "A classic, word board game. There is a co-op mode in newer versions.",
    "timestamp": 1738796400
  },
  {
    "username": "ShelfHelp",
    "rating": 6.0,
    "comment": "Replaced by Paperback.",
    "timestamp": 1738537200
  },
  {
    "username": "BrotherCheese",
    "rating": 6.0,
    "comment": "Official Player #: 2-4\nRecommended #: 2-4\nBest #: 2\nPlay Time: 90 minutes\nMin Age: 10+\nComplexity: 2.06/5",
    "timestamp": 1738278000
  },
  {
    "username": "FamilyGamer20",
    "rating": 6.0,
    "comment": "Received as a gift from parents circa 2023. Classic game that the wife enjoys.",
    "timestamp": 1738105200
  },
  {
    "username": "Donimbatron",
    "rating": 6.0,
    "comment": "Available on TTS",
    "timestamp": 1737932400
  },
  {
    "username": "KaNife073",
    "rating": 6.0,
    "comment": "“KWYJIBO - a big, dumb, balding North American ape with no chin and a short temper”",
    "timestamp": 1737241200
  },
  {
    "username": "grmagne",
    "rating": 6.0,
    "comment": "Classic word game, but board often gets cluttered. You have to know all the obscure words that are allowed to fit smaller spaces.",
    "timestamp": 1736809200
  },
  {
    "username": "bennbanasik",
    "rating": 6.0,
    "comment": "I like words, I write for a living and this should be the go to game for me. Except it isn't. I like playing it, reminds me of holidays with my family, being able to stay up, play the game and come close to beating my mother. The issue is however that it requires a high knowledge of language and is the luck of the bag.\n\nThis all sounds ok, the issue that has ended the game for me was reading about min/max with the shortened word memorization of words. Being competitive and being in my field of work means the game ends with me winning. Doesn't sound bad, but it gets tiresome and isn't meant to sound like a humble brag, rather it gives reason to why this old version of the game I've had since I was young hasn't been opened in 10 years.\n\nDon't get me wrong, it's a great game, just no longer for me.",
    "timestamp": 1736722800
  },
  {
    "username": "EhSlashEh",
    "rating": 6.0,
    "comment": "fun but I have dyslexia",
    "timestamp": 1736118000
  },
  {
    "username": "udance4ever",
    "rating": 6.0,
    "comment": "classic vocabulary building game.",
    "timestamp": 1736118000
  },
  {
    "username": "snth",
    "rating": 6.0,
    "comment": "Amazing tile laying game marred by the completely arbitrary and proprietary Swedish word list.",
    "timestamp": 1735772400
  },
  {
    "username": "Mountaingardner",
    "rating": 6.0,
    "comment": "2-4 Player",
    "timestamp": 1735426800
  },
  {
    "username": "saksi",
    "rating": 6.0,
    "comment": "The classic word game. I don't really mind it anymore. But my girlfriend likes it, so I keep it.",
    "timestamp": 1735081200
  },
  {
    "username": "Luminance6496",
    "rating": 6.0,
    "comment": "Fine but can go agonizingly slow.",
    "timestamp": 1732748400
  },
  {
    "username": "PaniGrazynka",
    "rating": 6.0,
    "comment": "Well, it's Scrabble. Nothing more, nothing less.",
    "timestamp": 1732230000
  },
  {
    "username": "pezboy",
    "rating": 6.0,
    "comment": "KEEP",
    "timestamp": 1732230000
  },
  {
    "username": "Hpsun",
    "rating": 6.0,
    "comment": "You can say Scrabble is a flawed game, and you may be right. It's very long for what it offers, and has a lot of downtime between turns, but it still holds a special place in my heart and you can still catch me playing once a year or so.",
    "timestamp": 1729980000
  },
  {
    "username": "Fury",
    "rating": 6.0,
    "comment": "I enjoy playing Scrabble occasionally. It's a game that needs regular playing to get good. I need to learn those 2 letter words for the end-game",
    "timestamp": 1729288800
  },
  {
    "username": "GameTutor",
    "rating": 6.0,
    "comment": "2 copies.",
    "timestamp": 1728856800
  },
  {
    "username": "SeboEla",
    "rating": 6.0,
    "comment": "Wohnzimmer",
    "timestamp": 1728684000
  },
  {
    "username": "Janneman96",
    "rating": 6.0,
    "comment": "Jan",
    "timestamp": 1728511200
  },
  {
    "username": "africainspired",
    "rating": 6.0,
    "comment": "A classic but needs other people to play so doesn't get to the table often.",
    "timestamp": 1727906400
  },
  {
    "username": "Pixpetr",
    "rating": 6.0,
    "comment": "100%",
    "timestamp": 1727733600
  },
  {
    "username": "protuberanetz",
    "rating": 5.5,
    "comment": "Игра к счастью/сожалению на английском - поэтому в неё много не поиграешь. Зато оригинальная версия.",
    "timestamp": 1727474400
  },
  {
    "username": "rytwin",
    "rating": 6.0,
    "comment": "It can be fun. I think it's better as a 2-person game. It works fine with more people but there's just a lot that changes on the board and it's hard to plan ahead for each turn effectively.",
    "timestamp": 1727301600
  },
  {
    "username": "otterpotts",
    "rating": 6.0,
    "comment": "i used to be a scrabble player in grade school so i love this game",
    "timestamp": 1727042400
  },
  {
    "username": "Caedmus",
    "rating": 6.0,
    "comment": "It is what it is. If you have a good vocabulary, you're going to dominate.",
    "timestamp": 1726264800
  },
  {
    "username": "srfdevotee",
    "rating": 6.0,
    "comment": "I'm not a word game fan. Engaging but a bit dull.",
    "timestamp": 1726178400
  },
  {
    "username": "brnineworms",
    "rating": 6.0,
    "comment": "One of those family favourites. Not bad, but turns can take a while if you get stuck and it can get particularly frustrating towards the end when there are fewer places to play your tiles. Is it fun to play a ridiculously high scoring word? Yes. Is it fun to be one of the other players who is now hopelessly behind? Generally no, but ymmv. I think as soon as players have to start looking up what is and isn't a valid word, the fun wanes. But the game does scratch a specific \"competitive crossword\" itch.",
    "timestamp": 1725746400
  },
  {
    "username": "Steward206",
    "rating": 5.5,
    "comment": "These sets are all folding paper boards with the assigned assortment of 100 wooden letter tiles. Most set have the game instructions on the inside of the box lid. 4 Wooden letter racks are included with each set as is a bag for shuffling the tile in.",
    "timestamp": 1724796000
  },
  {
    "username": "TinyTimTam",
    "rating": 6.0,
    "comment": "i wonder if this'll be 10 stars when I'm 75",
    "timestamp": 1724104800
  },
  {
    "username": "SultanSevy",
    "rating": 6.0,
    "comment": "The classic word-game. Fun family game which works well with non-gamers and gamers alike. However, it's not something that I eagerly seek out to play.",
    "timestamp": 1723500000
  },
  {
    "username": "Zenji",
    "rating": 6.0,
    "comment": "Storage Location: Pune",
    "timestamp": 1723068000
  },
  {
    "username": "NOOCX",
    "rating": 6.0,
    "comment": "A classic which I respect, but rarely want to play. How many german words with \"Y\" you know?",
    "timestamp": 1722981600
  },
  {
    "username": "Racelympics",
    "rating": 6.0,
    "comment": "Might get rid of this in the future. I’ve got so many Scrabble sets at this point and the tiles are eh.",
    "timestamp": 1722549600
  },
  {
    "username": "sunibd",
    "rating": 6.0,
    "comment": "There's better word games, but like the large print design",
    "timestamp": 1721599200
  },
  {
    "username": "DarkJjay",
    "rating": 6.0,
    "comment": "Gave it to my SO",
    "timestamp": 1720821600
  },
  {
    "username": "AJSGeek",
    "rating": 6.0,
    "comment": "Probably the most well known and liked of the classic word games. I enjoy playing it but it's not really my favorite genre.",
    "timestamp": 1720648800
  },
  {
    "username": "Regnad Kcin",
    "rating": 6.0,
    "comment": "Travel edition\nDonated to Jervis Library 6/24",
    "timestamp": 1719352800
  },
  {
    "username": "Innsbruck",
    "rating": 6.0,
    "comment": "Player Count: 2 to 4\n Competitive Game: One player wins alone.\n\nIt's a spelling game. You knew that already. A classic.\n\nDesigned by Alfred Mosher Butts.",
    "timestamp": 1719266400
  },
  {
    "username": "Racelympics",
    "rating": 6.0,
    "comment": "The electronic scoring unit is nice, but the tiles could’ve been better.",
    "timestamp": 1719180000
  },
  {
    "username": "nburrrzy",
    "rating": 6.0,
    "comment": "A dictionary is usually pulled out at some point",
    "timestamp": 1719093600
  },
  {
    "username": "EmeraldYam",
    "rating": 6.0,
    "comment": "10 years on... So far remains the only game I've ever managed to play with my mum, so here it stays.",
    "timestamp": 1717711200
  },
  {
    "username": "PizzaChip",
    "rating": 6.3,
    "comment": "Grę chyba każdy zna. Mimo swojej długiej historii gra wciąż cieszy się dużym sukcesem. Scrabble są dla mnie takim łącznikiem ze starszym pokoleniem. Rodzice i dziadkowie, często krzyżówkowicze, dobrze odnajdują się w tej grze. Ja mam wersję travel, która sprawdza się idealnie zarówno w podróży, jak i zwykłego grania na stole.\n\nOcena po 50 partiach w każdym składzie. Średni czas gry = 66 min.\n\nKamil",
    "timestamp": 1716242400
  },
  {
    "username": "Flummoxa",
    "rating": 6.0,
    "comment": "its the only thing at the air bnb.",
    "timestamp": 1715810400
  },
  {
    "username": "Holzmichel01",
    "rating": 6.0,
    "comment": "Classic game, parents love it.",
    "timestamp": 1715551200
  },
  {
    "username": "TheBombBeard",
    "rating": 6.0,
    "comment": "if i was a dictionary i would have played it more?",
    "timestamp": 1714428000
  },
  {
    "username": "m2f2",
    "rating": 6.0,
    "comment": "Family Games\n\nx",
    "timestamp": 1712613600
  },
  {
    "username": "ClashCityClarky",
    "rating": 6.0,
    "comment": "2-4",
    "timestamp": 1712527200
  },
  {
    "username": "EquinoxOmega",
    "rating": 6.0,
    "comment": "okay crossword game\n\nstored at my grandparents' place",
    "timestamp": 1710457200
  },
  {
    "username": "Thorsten Koch",
    "rating": 6.0,
    "comment": "German version.",
    "timestamp": 1709938800
  },
  {
    "username": "Primalwolf",
    "rating": 6.0,
    "comment": "Classic",
    "timestamp": 1709506800
  },
  {
    "username": "stephenritchie10810",
    "rating": 6.0,
    "comment": "BANANAGRAMS(Scrabble set), CHESS, CHECKERS, BACKGAMMON, UNO, AFTER DINNER ARGUEMENTS, TENSION",
    "timestamp": 1708902000
  },
  {
    "username": "Prop_Joe",
    "rating": 6.0,
    "comment": "There are legitimate complaints about strange words and memorizing 2-letter words. But it is wrong to think that's all the strategy. Board management is big, and you have to avoid giving your opponent(s) easy points.",
    "timestamp": 1708729200
  },
  {
    "username": "tigrevasco_2003",
    "rating": 6.0,
    "comment": "I don´t like memorizing 2-3 letter words was so important, even more than making long words. Also it is pretty long to play it (90-120 min is too much time for us). Anyway it provides a great scope for tactic/strategy which I enjoy.",
    "timestamp": 1708210800
  },
  {
    "username": "RobyaVP",
    "rating": 6.0,
    "comment": "2 player, 3 player, 4 player",
    "timestamp": 1707951600
  },
  {
    "username": "SecretMussolini",
    "rating": 5.9,
    "comment": "Parents",
    "timestamp": 1706828400
  },
  {
    "username": "captaincomic",
    "rating": 6.0,
    "comment": "The board with multiplier fields always felt unnecessary and a little unfair to me as a child.\n\nI have since warmed up about the game.",
    "timestamp": 1706223600
  },
  {
    "username": "TropicalFreeze21",
    "rating": 5.5,
    "comment": "The basic game is fine, just watch out for that one relative that's memorized 2 letter words",
    "timestamp": 1705705200
  },
  {
    "username": "Meloni",
    "rating": 6.0,
    "comment": "Modern word games, card games and board games are so much better but occasionally you need an old style word game to sharpen you up. I've got 3 copies of Scrabble....",
    "timestamp": 1705618800
  },
  {
    "username": "teebzzz",
    "rating": 6.0,
    "comment": "2-4P\n2B\n2-4C",
    "timestamp": 1704754800
  },
  {
    "username": "Sebuzz",
    "rating": 6.0,
    "comment": "6 as a 2 player, each additional player makes the rating lower for me, because of added downtime.",
    "timestamp": 1704409200
  },
  {
    "username": "Lapming1992",
    "rating": 6.0,
    "comment": "old classic",
    "timestamp": 1704322800
  },
  {
    "username": "hanvelsing",
    "rating": 7.0,
    "comment": "Need a new copy",
    "timestamp": 1760652000
  },
  {
    "username": "Gwen_stuffs",
    "rating": 7.0,
    "comment": "My dyslexia be bitch on this one",
    "timestamp": 1760479200
  },
  {
    "username": "david_os",
    "rating": 6.5,
    "comment": "What can you say about Scrabble? Classic. Although it is painful against really serious players (are you listening, Dad?) who never let you near triple word bonuses. Of course he was playing it right, since it's really an area control game with the longest rulebook ever.\n\nMore recently son number 1 has leaned into ditching all his tiles to target 7 letter plays and has won nearly every time that way. That changes it completely and not really in a good way, especially as it turns out that is probably the right way to play to win.",
    "timestamp": 1760306400
  },
  {
    "username": "ethanbg20",
    "rating": 7.0,
    "comment": "classic",
    "timestamp": 1760306400
  },
  {
    "username": "zasizo",
    "rating": 7.2,
    "comment": "Nekünk egyaránt megvan angol és magyar betűkészlettel, nehézségi szintje a játékosok szókincsének függvénye.\nNémi szerencsefaktor van benne, hiszen a betűkhöz húzással jutunk, de az egyes betűk számszerű előfordulását az adott nyelvben való előfordulás arányához igazították, ezért itt ez is rendben van.\nKb ezen áll vagy bukik az élmény a hasonló, szókirakó játékokban.\nMára kicsit túlhaladta a kor, de ez nem a játék hibája. A játékdömping az eladhatóság miatt az ötletesebb és látványosabb játékok irányába halad, de attól még ez egy jó játék ma is.",
    "timestamp": 1760133600
  },
  {
    "username": "elucidarian",
    "rating": 7.0,
    "comment": "The classic word game to challenge your vocabulary. Little more needs to be said.",
    "timestamp": 1759442400
  },
  {
    "username": "AerynSpaceMuseum",
    "rating": 7.0,
    "comment": "Travel Edition, popular with kids & grandma (although both play with very sketchy words, lol).",
    "timestamp": 1759442400
  },
  {
    "username": "kwalzl",
    "rating": 7.0,
    "comment": "5A",
    "timestamp": 1758492000
  },
  {
    "username": "Scifi66",
    "rating": 7.0,
    "comment": "Status:Shelf\n->Scifi Family HQ loves it.\nEnjoy it on occasion.",
    "timestamp": 1758060000
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN nvt\nGL1",
    "timestamp": 1757628000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "Classic, but can be rather slow\n\nKeep",
    "timestamp": 1757628000
  },
  {
    "username": "Kisun",
    "rating": 6.9,
    "comment": "Co tu opisywać. Jak ktoś lubi literki i ma duży zasób słów, zwłaszcza dłuższych niż 4 literowych, to tu może znaleźć rozrywkę. A że można wygrać mistrzostwa Francji nie znając francuskiego?",
    "timestamp": 1757541600
  },
  {
    "username": "fletch49er",
    "rating": 6.5,
    "comment": "Now who hasn't played scrabble? It goes on every holiday and is played as the sun drops below the horizon accompanied with a nice Chianti. Ffffff!",
    "timestamp": 1757368800
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 5011363523469\nIJL4",
    "timestamp": 1757196000
  },
  {
    "username": "Udruga Kockica",
    "rating": 7.0,
    "comment": "BID.",
    "timestamp": 1756936800
  },
  {
    "username": "hiimjosh",
    "rating": 7.0,
    "comment": "Tag: L's Favorite",
    "timestamp": 1756850400
  },
  {
    "username": "JacobDoolittle",
    "rating": 7.0,
    "comment": "Scrabble is an absolute classic! A one of a kind game that everybody can enjoy! Learned to play when I was super young!",
    "timestamp": 1756591200
  },
  {
    "username": "lookingglass",
    "rating": 7.0,
    "comment": "Scrabble is a game that, like chess, depends on who you're playing with. If you're going against competition-goers, chances are you'll be demolished (unless you're also one yourself). Best bet for us casual players is to play it with other friends who also play casually, but ideally not ones who just make 3 letter words, dirty words, or stop to think for 15 minutes each turn. It also plays very well at 2-4, without \"missing experiences\" at different player counts.",
    "timestamp": 1756504800
  },
  {
    "username": "Parapon",
    "rating": 7.0,
    "comment": "My partner likes it more than I do",
    "timestamp": 1756332000
  },
  {
    "username": "Kaiho",
    "rating": 7.0,
    "comment": "Would not pass on an opportunity to play this again or even owning.\n\nMaking or failing at making words with at times frustrating deal is funny, and the area control aspect adds some strategic depth to the game; one could say that Scrabble has both tactical and strategic dimensions.",
    "timestamp": 1756159200
  },
  {
    "username": "Kubidi",
    "rating": 7.0,
    "comment": "Players: 02 - 04\nBest: 02",
    "timestamp": 1756072800
  },
  {
    "username": "ditterio",
    "rating": 7.0,
    "comment": "",
    "timestamp": 1755295200
  },
  {
    "username": "we3die",
    "rating": 7.0,
    "comment": "Classic game which I enjoyed a lot as a kid. Bananagrams is enough for us, so we have no room for this in our collection. I would not turn this down if the other players where in to it.",
    "timestamp": 1755036000
  },
  {
    "username": "Knothyelf",
    "rating": 7.0,
    "comment": "better without obscure 2 letter words",
    "timestamp": 1754604000
  },
  {
    "username": "cicerunner",
    "rating": 7.0,
    "comment": "(Estimated 300 unlogged plays pre 2020, in the preceding 40+ years ... )",
    "timestamp": 1754604000
  },
  {
    "username": "slantysteve",
    "rating": 7.0,
    "comment": "Scrabble is a classic word game that combines vocabulary skills with strategic thinking, making it a perfect choice for fans of both casual and competitive gameplay. As the game that got me into board games, it holds a special place in my heart. The challenge of creating high-scoring words while managing your tiles adds depth, and the ever-changing board ensures no two games are alike.\n\nThe balance of luck and skill makes each playthrough exciting, and it's a great way to engage with friends and family.\n\nOverall, Scrabble is a timeless game that offers both fun and mental stimulation, making it a staple in any collection.\n\n\nPremium Board Edition",
    "timestamp": 1753394400
  },
  {
    "username": "QuI4ViC",
    "rating": 7.0,
    "comment": "Entretenido y competitivo, ayuda a mejorar la ortografía, a saber improvisar con las letras que tengamos, es un buen juego",
    "timestamp": 1753048800
  },
  {
    "username": "Jobe_gamer",
    "rating": 7.0,
    "comment": "Scrabble’s fun. We play with some fun house rules like “everybody gets one word that’s in the general lexicon but isn’t in any sanctioned Scrabble dictionary”. This has resulted in great plays like ‘DIH’, ‘FUXABENTOS’ and several more gems. We play it all the time and always have… a time.",
    "timestamp": 1751407200
  },
  {
    "username": "Racelympics",
    "rating": 7.0,
    "comment": "Same comment from the 2009 release, except it’s 2001.",
    "timestamp": 1751148000
  },
  {
    "username": "JohnGrimes",
    "rating": 7.0,
    "comment": "Klassiker, Wackelkandidat",
    "timestamp": 1751061600
  },
  {
    "username": "GrimyGrundle",
    "rating": 7.0,
    "comment": "Vintage",
    "timestamp": 1749679200
  },
  {
    "username": "Xiroxio",
    "rating": 6.5,
    "comment": "Un clásico.",
    "timestamp": 1748815200
  },
  {
    "username": "Guthwine3",
    "rating": 7.2,
    "comment": "2018.11.14: As a writer and English major, SCRABBLE would absolutely make my 'top 100 favourite games of all time' list. Love the high-quality components and own more than one version.\n\nNOTE: The number of logged plays of this game is nowhere close to being accurate (the majority of our plays occurred prior to the year I began tracking such information).",
    "timestamp": 1748296800
  },
  {
    "username": "cliff1066",
    "rating": 7.0,
    "comment": "Need to have scrabble dictionary to prevent may arguments. Maybe its just us!",
    "timestamp": 1747173600
  },
  {
    "username": "AthenaDog",
    "rating": 7.0,
    "comment": "No Longer Own",
    "timestamp": 1746655200
  },
  {
    "username": "SMeijers1",
    "rating": 7.0,
    "comment": "Thuis-thuis",
    "timestamp": 1746655200
  },
  {
    "username": "Nonoku",
    "rating": 7.0,
    "comment": "2-4 B: 2\nW: 2.06\n\nPros\n-Simple to learn\n-Easy setup\n\nCon\n-Must have a lot of words memorized\n-Luck with letters you obtain",
    "timestamp": 1746396000
  },
  {
    "username": "Nicodemus_",
    "rating": 7.0,
    "comment": "The time my wife spelled \"PROTON\", and had to listen to her say \"Ha! Take that chemistry boy!\", then I changed it into \"PROTONATE\" for the triple word score and won... it was the last time we played back in 2006 (",
    "timestamp": 1745791200
  },
  {
    "username": "dmajor1848",
    "rating": 7.0,
    "comment": "The Official Scrabble Players Dictionary, 7th Ed. (Merriam-Webster, 2023) (ISBN 9780877795773)",
    "timestamp": 1745618400
  },
  {
    "username": "Rodsch01",
    "rating": 7.0,
    "comment": "Scrabble als Ergänzung zu Rummikub. Einfache Regeln, kann jeder spielen.",
    "timestamp": 1745272800
  },
  {
    "username": "Medic Jesus",
    "rating": 6.8,
    "comment": "Good game but there's too much downtime. Haven't played this game in years.",
    "timestamp": 1742857200
  },
  {
    "username": "lausdower",
    "rating": 7.0,
    "comment": "Word game.\nClassic game.\nMedium clamshell box",
    "timestamp": 1742338800
  },
  {
    "username": "john1212",
    "rating": 6.8,
    "comment": "25.3\n0.0+0.1",
    "timestamp": 1741302000
  },
  {
    "username": "ArktusFrost",
    "rating": 7.0,
    "comment": "Classic.",
    "timestamp": 1740956400
  },
  {
    "username": "Kaffedrake",
    "rating": 7.0,
    "comment": "Classic, enjoyable. Good with \"non-gamers\".\n\nThrifted on 6/8 2011, 2/7 2016, two copies on 11/2 2017, 1/7 2017, 8/7 2017, 2/8 2017, four copies on 9/9 2017, 20/1 2018, two copies on 5/7 2018, 24/8 2018, 25/8 2018, 1/9 2018, four copies on 8/9 2018, 27/11 2018, 22/2 2019, 27/4 2019, 4/5 2019, 29/5 2019, 29/6 2019, 4/7 2019, 24/8 2019, 15/10 2020, two copies on 27/10 2020, 17/12 2020, 17/7 2021, 27/10 2021, 20/11 2021, 21/7 2022, 4/10 2022, 28/2 2023, 5/4 2023 and 21/2 2025.",
    "timestamp": 1740092400
  },
  {
    "username": "flamejuggler",
    "rating": 6.7,
    "comment": "i like word games. this is a classic. i go for the double/triple word scores aggressively.",
    "timestamp": 1739833200
  },
  {
    "username": "Tomono",
    "rating": 7.0,
    "comment": "I go to English conversation class from a few years ago.One day,I requested to play this game with native speakers,and then we played with 3.Surprisingly they sometimes looked like harder to work well.Either way it was good exeperience for me.",
    "timestamp": 1739401200
  },
  {
    "username": "Zappa68",
    "rating": 7.0,
    "comment": "its scrabble",
    "timestamp": 1739055600
  },
  {
    "username": "adesireg",
    "rating": 7.0,
    "comment": "Classic",
    "timestamp": 1738882800
  },
  {
    "username": "GomJabbar",
    "rating": 6.9,
    "comment": "",
    "timestamp": 1738537200
  },
  {
    "username": "Stockpot",
    "rating": 7.0,
    "comment": "A classic and deservedly do. By today's standards, it's rather dated, but still a perfectly pleasant experience to play.",
    "timestamp": 1738537200
  },
  {
    "username": "guimel",
    "rating": 6.5,
    "comment": "Suitable for 2 players. 90 mins. Very light game. Vintage version with wooden letter tiles. This went to Revive All. May have been sold now.",
    "timestamp": 1738537200
  },
  {
    "username": "Lumimyrakka",
    "rating": 8.0,
    "comment": "The more I play it, the more I'm intrigued. Playing Scrabble as it is - an area control game tied to a word retrieval exercise - makes it better than I originally expected.\n\nFinnish edition, 2-4P",
    "timestamp": 1760133600
  },
  {
    "username": "Togii",
    "rating": 7.5,
    "comment": "Strategic Depth: 7/10\nRNG Mitigation: 7/10\nGoofiness Potential: 9/10\nSimplicity: 10/10\nArtistic Direction: 5/10\n\nTime Commitment: 1 hour",
    "timestamp": 1759960800
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "My family would play this sometimes, then my old roommate would put me through my paces. It's nice that there is some clever moves to be made sometimes, but having a good vocabulary (which I do) and being able to spell very well (which I can't always do) are ultimately more important.",
    "timestamp": 1759356000
  },
  {
    "username": "Shadning",
    "rating": 7.5,
    "comment": "Le plateau est pivotant et les lettres reste en place. c'est vraiment utile pour tous les joueurs. surtout pour lire les mots.",
    "timestamp": 1758664800
  },
  {
    "username": "TowersAlez",
    "rating": 8.0,
    "comment": "Pueblo",
    "timestamp": 1758060000
  },
  {
    "username": "cabbagekingaf",
    "rating": 8.0,
    "comment": "Classic word building game.",
    "timestamp": 1757800800
  },
  {
    "username": "whalecat",
    "rating": 7.5,
    "comment": "Scrabble",
    "timestamp": 1757023200
  },
  {
    "username": "aphadonn",
    "rating": 8.0,
    "comment": "Classic. I love it because I was an English/lit/spelling nerd throughout my schooling years, so Scrabble is where I shine.\n\nI personally love crushing my competitors and seeing how many points I can get per word, or the strangest/longest words I can make, etc. It's a great challenge for some and easy for others, and both of those factors either make you love it or hate it.",
    "timestamp": 1756677600
  },
  {
    "username": "DDG13",
    "rating": 8.0,
    "comment": "VERSION + RECENTE, acheté en Aout 2025",
    "timestamp": 1756245600
  },
  {
    "username": "Alfasto_Barker",
    "rating": 8.0,
    "comment": "The better your knowledge, the more enjoyable this game becomes.",
    "timestamp": 1755554400
  },
  {
    "username": "Yekrats",
    "rating": 8.0,
    "comment": "Don't scoff. Scrabble is a marvelous 2-player dueling game. The 3- and 4-player games have somewhat of a long down-time, however.",
    "timestamp": 1754431200
  },
  {
    "username": "Racelympics",
    "rating": 8.0,
    "comment": "The original rubber feet wore off, but that’s fixable!",
    "timestamp": 1754344800
  },
  {
    "username": "barryrussell1980",
    "rating": 7.5,
    "comment": "For me this is still currently one of the best word puzzle game on the market. Although I'd sooner play it in short bursts on my ios rather than play the tabletop version.",
    "timestamp": 1753740000
  },
  {
    "username": "Sportsam26",
    "rating": 8.1,
    "comment": "Similar to backgammon but for when we have more time to spare. Very thinky, feels fresh every time with lots of replayability. Score tracking is the most tedious part. Maybe my parter's favorite game",
    "timestamp": 1753394400
  },
  {
    "username": "macUladh",
    "rating": 8.0,
    "comment": "A solid area control game masquerading as a word game. Immensely satisfying with a well-matched opponent, but too difficult to consistently find that match.",
    "timestamp": 1753221600
  },
  {
    "username": "Racelympics",
    "rating": 8.0,
    "comment": "The quality’s nice after managing to complete it with that one missing tile! Prefer this over Folio.",
    "timestamp": 1752357600
  },
  {
    "username": "Racelympics",
    "rating": 8.0,
    "comment": "This travel set is more accommodating for the road!",
    "timestamp": 1751148000
  },
  {
    "username": "Lbrereton",
    "rating": 7.5,
    "comment": "love it. but only if it's played casually.",
    "timestamp": 1750716000
  },
  {
    "username": "Ya1r",
    "rating": 7.5,
    "comment": "Creo que es un juego bastante subestimado, es entretenido y es bastante satisfactorio armar palabras grandes, definitivamente se necesita habilidad, ingenio y estrategia aunque dependa de la suerte.",
    "timestamp": 1749938400
  },
  {
    "username": "UncleDRW",
    "rating": 8.0,
    "comment": "The preeminent word game, besides crosswords, that is, that everyone knows and loves. Many would-be game designers won't even bother with developing new word games, because this behemoth has dominated the market. It's always welcome at family gatherings. A treat for everyone.",
    "timestamp": 1748556000
  },
  {
    "username": "MartiN8029",
    "rating": 8.0,
    "comment": "Srdcovka, z obdobia kedy ešte žil môj otec. Boli to vždy perfektné zážitky, najmä kvôli tomu, že som ešte lúštieval rôzne rébusy a tajničky, a tak som v tejto hre bol prakticky vždy na popredných priečkach....",
    "timestamp": 1748383200
  },
  {
    "username": "Spada_",
    "rating": 8.0,
    "comment": "10+. Family. 2-4 players - Best: 2",
    "timestamp": 1747605600
  },
  {
    "username": "beerwah2000",
    "rating": 8.0,
    "comment": "2,09\n10+\n2-4 2!\n90min\nClassic\n2312",
    "timestamp": 1745445600
  },
  {
    "username": "dogzard",
    "rating": 8.0,
    "comment": "A game that truly deserves the title \"classic\" Plus, it makes my wife happy to play it, which makes me happy.",
    "timestamp": 1744581600
  },
  {
    "username": "Pelijussi",
    "rating": 8.0,
    "comment": "Yes this is one of my favourites.",
    "timestamp": 1742770800
  },
  {
    "username": "Beastly_Venturer",
    "rating": 8.0,
    "comment": "100+ plays over my life time. My grandmother loved playing this and had a version from the 70s which sat on a roulette which was cool. Made her happy when we played. Strong game.",
    "timestamp": 1742684400
  },
  {
    "username": "sams247",
    "rating": 8.0,
    "comment": "Classic for a reason.",
    "timestamp": 1742511600
  },
  {
    "username": "jackadven",
    "rating": 8.0,
    "comment": "One of the games Daddy pulled from the countainer.",
    "timestamp": 1739660400
  },
  {
    "username": "Chuffsalad",
    "rating": 8.0,
    "comment": "Scrabble gets way too much hate on here as far as I'm concerned. If you've got two competent players on the board, it's one of the crunchiest two player games on the market. It's got all the elements. Area control, hand management, play optimization. If you haven't played since you were a youngster, give it another shot.",
    "timestamp": 1738882800
  },
  {
    "username": "BearableEnd",
    "rating": 8.0,
    "comment": "Classic.",
    "timestamp": 1737846000
  },
  {
    "username": "Rfpotterf",
    "rating": 8.0,
    "comment": "D1 |",
    "timestamp": 1736290800
  },
  {
    "username": "stevepwalker",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1735945200
  },
  {
    "username": "RodRahmati",
    "rating": 8.3,
    "comment": "Love this game. Better than a LOT of modern games. An example of perfection in design.",
    "timestamp": 1733785200
  },
  {
    "username": "NerdWithWords",
    "rating": 8.0,
    "comment": "It's Scrabble.",
    "timestamp": 1732575600
  },
  {
    "username": "pmanpman",
    "rating": 8.0,
    "comment": "It's basic, it's a simple ruleset, gameplay is complex though. I do recommend",
    "timestamp": 1732316400
  },
  {
    "username": "Dycast",
    "rating": 8.0,
    "comment": "Loved as a kid and adult.",
    "timestamp": 1732230000
  },
  {
    "username": "badgerguts",
    "rating": 8.0,
    "comment": "The liberal media doesn't want you to know this but scrabble is actually fun",
    "timestamp": 1731884400
  },
  {
    "username": "Racelympics",
    "rating": 8.0,
    "comment": "Got this since I was fascinated with the reprint with the Hasbro logo. Still alright.",
    "timestamp": 1726264800
  },
  {
    "username": "squiddd",
    "rating": 8.0,
    "comment": "wonderful classic. played it throughout most of my childhood. simple rules. simple concept. beautiful gameplay.",
    "timestamp": 1725660000
  },
  {
    "username": "Josh123212321",
    "rating": 8.0,
    "comment": "It's not my first choice of word game, but with the right crowd (old people) it can often be the best choice for a casual game",
    "timestamp": 1724191200
  },
  {
    "username": "Racelympics",
    "rating": 8.0,
    "comment": "A very great word game, timer is finnicky, but it doesn’t matter if you’d like a normal game. Plus the raised gameboard is awesome.",
    "timestamp": 1720908000
  },
  {
    "username": "sculley",
    "rating": 8.0,
    "comment": "100+ plays. Best ever word JOTTINGS across two Triple Word scores for 146 points. Typically I can score 1-3 seven letter words in a game if my skills are sharp...and you don't mind waiting.",
    "timestamp": 1720821600
  },
  {
    "username": "Cheesecakes101",
    "rating": 8.0,
    "comment": "Its a classic! Although I don't think it fits into the category of board games.\nMy gradparents love playing this, you get better with practice and its a timeless brain teaser.",
    "timestamp": 1719352800
  },
  {
    "username": "montsegur",
    "rating": 8.0,
    "comment": "I always thought that Scrabble is max a 5. I hated it as a child to look around for scoring spaces . Building other words by just adding a letter for the plural form etc.\n\nBut last year I ve found a website to play it online pvp or against the Bot. What a great game and I ve learned a lot of new words I ve never heard before. But I still prefer to get the score done by the machine ...",
    "timestamp": 1718575200
  },
  {
    "username": "Bateyes",
    "rating": 8.0,
    "comment": "Inklusive 2x \"ß\"-Steine im Beutel, erhalten auf der Spielemesse 2017. Steine unterscheiden sich leicht in der Farbe.\n\nGeholt von der Spiele-Offensive (06/2024): Drehteller.",
    "timestamp": 1718143200
  },
  {
    "username": "PhilSchwarzmann",
    "rating": 8.0,
    "comment": "Took me 44 years to buy a Scrabble board and play a full game. Had a blast.",
    "timestamp": 1716328800
  },
  {
    "username": "dauda",
    "rating": 8.0,
    "comment": "+ Hundreds of plays since the mid 90's.",
    "timestamp": 1716156000
  },
  {
    "username": "Vitamine_jeu",
    "rating": 8.0,
    "comment": "J'ai toujours du plaisir à y jouer.",
    "timestamp": 1713996000
  },
  {
    "username": "JuusoAfk",
    "rating": 8.0,
    "comment": "Loved it as a kid and still today",
    "timestamp": 1712700000
  },
  {
    "username": "Smileyface091",
    "rating": 7.5,
    "comment": "Own Scrabble Typography 2nd edition by Andrew Capener",
    "timestamp": 1712440800
  },
  {
    "username": "M33Seed",
    "rating": 8.0,
    "comment": "Easy setup. Any occasion. Beautiful deluxe board.",
    "timestamp": 1712095200
  },
  {
    "username": "RogerDHyman",
    "rating": 8.0,
    "comment": "Who doesn't like Scrabble? The epitome of a Classic Game! My wife's favorite game, perfect family game.",
    "timestamp": 1711753200
  },
  {
    "username": "juanitogan",
    "rating": 9.0,
    "comment": "Okay, I'm not a fan of heads-down, multiplayer solitaire games. So why does this one get a pass? Not sure. I grew up playing it and, thus, it is a very social game for us despite the HDMPS status. It has a fair amount of \"take that!\" I suspect, however, it gets a pass due to the running score and the sense of blood-on-the-grass competition that tally brings out. Mano a mano a mano a mano!",
    "timestamp": 1760306400
  },
  {
    "username": "dnlcoleman",
    "rating": 9.0,
    "comment": "One of my all-time faves. My wife and I have a running score in the tens of thousands. It's a classic for a reason. Only drawback is it's no fun to play against someone who isn't the same skill level.",
    "timestamp": 1758924000
  },
  {
    "username": "Veronium",
    "rating": 9.0,
    "comment": "In Latvian",
    "timestamp": 1752703200
  },
  {
    "username": "Aurion254",
    "rating": 9.0,
    "comment": "Probably the best mass-market game still around today.",
    "timestamp": 1751148000
  },
  {
    "username": "murumeli",
    "rating": 9.0,
    "comment": "Love this!",
    "timestamp": 1746741600
  },
  {
    "username": "bravewulf",
    "rating": 9.0,
    "comment": "I love Scrabble!",
    "timestamp": 1745272800
  },
  {
    "username": "shakaalie",
    "rating": 8.7,
    "comment": "I have learned to enjoy this game - in Polish",
    "timestamp": 1743202800
  },
  {
    "username": "stude",
    "rating": 9.0,
    "comment": "Classic word game, always fun for a while.",
    "timestamp": 1737759600
  },
  {
    "username": "WalpurgisNight",
    "rating": 9.0,
    "comment": "Classic game that forces creativity. Best with those with equal skill levels and often daunting for new players, and can run long with downtime",
    "timestamp": 1734994800
  },
  {
    "username": "Jackmm98",
    "rating": 9.0,
    "comment": "I love this give me 14 more",
    "timestamp": 1733353200
  },
  {
    "username": "GoldenTorch",
    "rating": 9.0,
    "comment": "Almost the perfect word-building game. The board layout, the strategies, the ways you can sabotage opponents, the feeling of placing a massively scoring word: it's all great. The only negative is that the letter distribution isn't quite right.",
    "timestamp": 1732748400
  },
  {
    "username": "ousgg",
    "rating": 9.0,
    "comment": "A prince among word games. Its only detractors are Ameritrashers and wargamers who think that D20s are God's own gift. They're philistines.",
    "timestamp": 1732662000
  },
  {
    "username": "glutealgeometry",
    "rating": 9.0,
    "comment": "I found a used turntable board... which originally came with plastic tiles, but does fit my nice old wooden ones.\nA classic for a reason! The positional tactics are deeper than many casual players realize, but are completely knowable & optimizable. I keep a timer handy for opponents prone to analysis paralysis, & when their time is up (i like 1 minute!) force them to play their best idea immediately or lose their turn.\nMy house rules include:\n-You may challenge an opponent to demonstrate they know the precise meaning of a word they just played (but i'm not a stickler for perfect phrasing or matching dictionary definitions). If they can't, they have to remove it & lose that turn. If they can, you lose your next turn.\n-Acronyms are acceptable if they are in common use PRONOUNCED AS THEY ARE SPELLED (not by saying the letters).\n-Proper nouns are acceptable if they are in common use as verbs or common nouns, ie \"Jones\" meaning a craving or \"Lou\" meaning a bathroom.\n-Common slang is acceptable whether it's in the dictionary or not if it has a standard spelling.",
    "timestamp": 1729461600
  },
  {
    "username": "Kiro",
    "rating": 9.0,
    "comment": "2 - 4",
    "timestamp": 1725228000
  },
  {
    "username": "Bjell4",
    "rating": 9.0,
    "comment": "Enjoyment 9\\10\nThematic 5\\5\nReplay value 5\\5",
    "timestamp": 1718402400
  },
  {
    "username": "Hughmongus",
    "rating": 9.0,
    "comment": "Got this from a teacher in G4. Hello to vocab!",
    "timestamp": 1717624800
  },
  {
    "username": "BogusKoszalka",
    "rating": 8.6,
    "comment": "w pudełku 9x12",
    "timestamp": 1714946400
  },
  {
    "username": "pierbg",
    "rating": 9.0,
    "comment": "You need to see the competitive play (on youtube/video platforms) to see how great the game is.",
    "timestamp": 1714687200
  },
  {
    "username": "Dingus",
    "rating": 9.0,
    "comment": "I don't play this face-to-face, had a brief affair with it online awhile back. Went to the local scrabble club once, came home depressed. Kind of like going to the university chess night. There's just a whole nother higher level that you'd have to work very hard to get into. And I avoid work.\n\n15 years ago. Now it’s 2024 https://upload.wikimedia.org/wikipedia/commons/9/98/Cool_wor.... Good for Bananagrams too",
    "timestamp": 1714082400
  },
  {
    "username": "Nanato3",
    "rating": 9.0,
    "comment": "2",
    "timestamp": 1710630000
  },
  {
    "username": "Kimchi_Goddess",
    "rating": 9.0,
    "comment": "I love word games, and the deluxe version is beautiful to play on, if a bit cumbersome to unpack. I typically play solo, but then it’s a toss up between this and the app.",
    "timestamp": 1708729200
  },
  {
    "username": "LadylexUK",
    "rating": 9.0,
    "comment": "Classic original. Still stands up as one of the most popular games in the world.",
    "timestamp": 1707606000
  },
  {
    "username": "ExcellentRaven",
    "rating": 9.0,
    "comment": "competitive scrabble is my life. 2p only, ofc",
    "timestamp": 1706569200
  },
  {
    "username": "sorennarnia",
    "rating": 8.5,
    "comment": "I just never get tired of playing. Every turn is a fun light mental exercise and the board positioning adds a simple and deep twist. My only frustration with the game has to do with the allowance of very obscure two- or three-letter words, which can result in the game feeling a little absurd toward the end.",
    "timestamp": 1702767600
  },
  {
    "username": "Niara7",
    "rating": 8.5,
    "comment": "If someone could tell me how to turn this into an educational game (for myself), I'd rate it even higher. I'd like to learn new words, rather than just be tested on ones I already know.",
    "timestamp": 1699311600
  },
  {
    "username": "Dreadchylde",
    "rating": 9.0,
    "comment": "To me this is the grandmaster of all word games. My greatest moment was laying down \"xylofon\" (Danish for xylophone) on round one and having my opponent rage-quit on the spot. Peak board game moment.",
    "timestamp": 1699138800
  },
  {
    "username": "Trebor1415",
    "rating": 9.0,
    "comment": "My wife and each grew up playing this. Now we play it all the time.\nThe only good grade I got in HS Spanish is when we played the Spanish version of this and I could use my Scrabble skills to earn more points to make up for my horrible Spanish vocab.",
    "timestamp": 1691964000
  },
  {
    "username": "Bemischen",
    "rating": 9.0,
    "comment": "The game I love to hate.\n\nI want to play it... but then I get frustrated when I am not doing well and am grateful that my gf is tolerant of my character flaws.\n\nIt is a classic.",
    "timestamp": 1687125600
  },
  {
    "username": "kevan",
    "rating": 9.0,
    "comment": "Have drifted in and out of this since childhood, playing a lot of online asynchronous games these days. And it stands up well, so long as both players are of the same mind on the obscure two-letter and Q-friendly words. The luck of the draw can foil even the best hand management (I liked a suggestion I read somewhere that high scoring letters and blanks should be annotated on the score sheet to show how lucky that player was), but it averages out if played enough.",
    "timestamp": 1684447200
  },
  {
    "username": "swanstuff",
    "rating": 8.5,
    "comment": "Also: Scrabble Pocket (Mattel, 1999)",
    "timestamp": 1679612400
  },
  {
    "username": "robbsutherland",
    "rating": 9.0,
    "comment": "“It’s a classic. Got to give it at least a 9. Not like shitty monopoly”. My wife has spoken.",
    "timestamp": 1676070000
  },
  {
    "username": "ShyftyCent",
    "rating": 8.5,
    "comment": "Plays 2-4",
    "timestamp": 1671750000
  },
  {
    "username": "ngwoengvowa",
    "rating": 9.0,
    "comment": "Polish",
    "timestamp": 1668985200
  },
  {
    "username": "keehveli",
    "rating": 8.5,
    "comment": "Finnish edition",
    "timestamp": 1657144800
  },
  {
    "username": "RJ523",
    "rating": 9.0,
    "comment": "When you're playing with the right people (i.e. intelligent), this game will always be fun.",
    "timestamp": 1656367200
  },
  {
    "username": "smainsish",
    "rating": 9.0,
    "comment": "2 to 4 players",
    "timestamp": 1653775200
  },
  {
    "username": "skifreak737",
    "rating": 9.0,
    "comment": "The quintessential word game. Most folks don’t seem to understand this is a tactical game using letters. Knowing many 2- and 3-Letter words and how to play for Bingos while optimizing Board openings (and blocking them) is the key to success. The bluffing element is often overlooked and can make the game that much more interesting.",
    "timestamp": 1642633200
  },
  {
    "username": "Zoli_Ruttkay",
    "rating": 9.0,
    "comment": "Depends on with whom you play it but in levelled field still top of the game.",
    "timestamp": 1641337200
  },
  {
    "username": "VibroChimp",
    "rating": 9.0,
    "comment": "Between two players of equal experience, this is a “10”. For everyone else, the rating drops, since winning becomes heavily dependent on memorizing word lists. Knowing all of the 2-letter words is a bare minimum for playing well.\nUpdate: Bumped up to a 9. Despite its flaws, this game has provided more fun for me than most modern board games.",
    "timestamp": 1640732400
  },
  {
    "username": "mattjones_56",
    "rating": 9.0,
    "comment": "Matt",
    "timestamp": 1640646000
  },
  {
    "username": "HiveGod",
    "rating": 9.0,
    "comment": "How to ruin Scrabble while winning super-hard: Play it like an area control game where the goal is to minimize the enemy's playable space while waiting patiently to strike out and capture bonuses. Use the smallest words possible for as long as you can to force the enemy to play the large, scaffolding words that extend your reach into the coveted spots. And even then, do everything you can to constantly curl the game back in on itself to deny them any territory. It's brutal, frustrating, and flies in the face of \"vocab-duel\"—but that sesquipedalian shit's for suckers.\n\nUpdate: Oh, man—forget the preceding paragraph and read Stefan Fatsis' Word Freak if you want to get really dirty. First off, memorize ALL THE WORDS, then do shit like play a phony, wait for your opponent to pluralize it, and challenge it off the board. Damn.\n\nWith Scrabble: Players Dictionary.\n\n(+1 travel folio edition in the camping bin.)",
    "timestamp": 1634940000
  },
  {
    "username": "Shnikes",
    "rating": 9.0,
    "comment": "2 players. Parker Brothers English Diamond Anniversary Edition 2007.",
    "timestamp": 1632607200
  },
  {
    "username": "Odd24_7",
    "rating": 9.0,
    "comment": "We have the travel edition, and it is still fun, word game goodness.",
    "timestamp": 1632607200
  },
  {
    "username": "felo",
    "rating": 8.8,
    "comment": "regalo de Pe ¡Gracias!\n\n2-4\n\nagricola\n\n*i*",
    "timestamp": 1628632800
  },
  {
    "username": "Paradiddle5",
    "rating": 9.0,
    "comment": "It's Scrabble. You spell words and you argue whether a word is a real word or not. That's the game. Embrace the argue and you will have fun. Seriously.",
    "timestamp": 1623621600
  },
  {
    "username": "Salviakat",
    "rating": 9.0,
    "comment": "keeper",
    "timestamp": 1623535200
  },
  {
    "username": "Gkeveson",
    "rating": 9.0,
    "comment": "Location: Yankee Tavern\nCondition: Box needs repair",
    "timestamp": 1622239200
  },
  {
    "username": "Trenticles",
    "rating": 9.0,
    "comment": "Word.",
    "timestamp": 1621634400
  },
  {
    "username": "hammerfest451",
    "rating": 9.0,
    "comment": "Target retro version.",
    "timestamp": 1619301600
  },
  {
    "username": "Isandri",
    "rating": 9.0,
    "comment": "a must have!",
    "timestamp": 1618437600
  },
  {
    "username": "jkandell",
    "rating": 8.5,
    "comment": "A truly great game, a 10 in terms of game design and skill. The spatial element is what distinguishes this game above the pack. I agree with the classic complaint that needing to memorize words like \"qat\" is lame; but it gets judged way too harshly here. You'd think it was f'in Candyland! My theory is most BGG are more comfortable with numbers than letters.",
    "timestamp": 1618092000
  },
  {
    "username": "JR6JR6",
    "rating": 9.0,
    "comment": "The classic ....The icon of board games !!",
    "timestamp": 1616799600
  },
  {
    "username": "Boardgameplayer67",
    "rating": 10.0,
    "comment": "Scrabble is a classic",
    "timestamp": 1756245600
  },
  {
    "username": "Maximaler",
    "rating": 10.0,
    "comment": "Tausendmal mit meinen Eltern gespielt",
    "timestamp": 1754776800
  },
  {
    "username": "docka",
    "rating": 10.0,
    "comment": "I think Scrabble is a game that never gets old. You could play with any kind of people and still love it. Also, you can chose to create new rules, like : only fantasy words, only non-existent words (as long as you can tell us what it is), etc...\nI'll never get tired of it, that's for sure.",
    "timestamp": 1753394400
  },
  {
    "username": "OldCrappyCouch",
    "rating": 10.0,
    "comment": "Great balance of chance, skill, and educational value. Can be played in many languages, and appeals to a broad range of players. Scrabble is high on my list of near perfect games.",
    "timestamp": 1750716000
  },
  {
    "username": "El_KaBong",
    "rating": 10.0,
    "comment": "Requires some strategy, knowledge of the dictionary and luck of the draw. No two games are the same and a lot of fun.",
    "timestamp": 1750284000
  },
  {
    "username": "kalmari77",
    "rating": 10.0,
    "comment": "Fantastic game, with two same level players",
    "timestamp": 1744322400
  },
  {
    "username": "starspangledgirl",
    "rating": 10.0,
    "comment": "Modified the board with stickers to have the original board colors",
    "timestamp": 1743976800
  },
  {
    "username": "HeartShapedBox",
    "rating": 10.0,
    "comment": "Scrabble is alot of fun.",
    "timestamp": 1743372000
  },
  {
    "username": "Dvaoid",
    "rating": 10.0,
    "comment": "So convenient.",
    "timestamp": 1730674800
  },
  {
    "username": "WolfSoul121",
    "rating": 10.0,
    "comment": "2-4 players",
    "timestamp": 1721858400
  },
  {
    "username": "SteveMcG",
    "rating": 10.0,
    "comment": "Word Game",
    "timestamp": 1718920800
  },
  {
    "username": "Blake Stone",
    "rating": 10.0,
    "comment": "Once I read \"Word Freak\" by Stefan Fatsis back in 2001 and saw the incredible level of play, intricacy and strategy possible with this game, I became hooked and began studying to become a tournament-level player. Still can't get enough of it.",
    "timestamp": 1718661600
  },
  {
    "username": "Addboilingwater",
    "rating": 10.0,
    "comment": "Classic (4)\nPlace Words In A Crossword Format, Aiming For The Most Points With Strategic Words & Letter Placement",
    "timestamp": 1715810400
  },
  {
    "username": "wbgfun",
    "rating": 10.0,
    "comment": "***12/2023 2 TRAVEL COPIES OFF TO THE US NAVY SUBMARINES NOW!***\n\n2-4players\n\nPlayed lots. LOVE it!",
    "timestamp": 1712700000
  },
  {
    "username": "piko66",
    "rating": 10.0,
    "comment": "Polska Edycja",
    "timestamp": 1712527200
  },
  {
    "username": "AgaPablo",
    "rating": 10.0,
    "comment": "All time entertainment",
    "timestamp": 1710370800
  },
  {
    "username": "SirMarmight",
    "rating": 10.0,
    "comment": "A Q's worth of points for rating Scrabble? Ludicrous!\n\nTime for an explanation... we all have a childhood treasure trove of tabletop memoirs. Among the spades & spades of All Fours, desperate Market Day sheep sprints, cheating controversies of Cluedo, & Risk's hopeless last stands in Australia. None as I sidle closer to Midlife Corner have weathered quite like this crossword nonsense.\n\nAs a dyslexic juvenile with a fructose stunted attention span, I winced knowing Grandma's visits would result in being shackled to a 'game' that felt like homework every evening. Times change, people change. There's a transparent poetry to a zero teach required, pick seven letters & go spell structure. The relatable apex of making dictionary lemonade out of a consonant lemon handful.\n\nA BGG 10 for me doesn't represent perfection, I removed my blindfold to Scrabble's flaws long ago. What it does equate to however, is a legendary status enveloping clarity of a box which has been, & will be, opened again & again, & again... & again, continuing to forge memories hundreds of sittings later. Memories abundant with a sister triple word score crushing her Ma, Pa & brother's morale into the vowelless dirt!\n\nLong live our battered, grubby & beloved Spear's Games copy, my family's last board game bastion.",
    "timestamp": 1707260400
  },
  {
    "username": "glenartrock",
    "rating": 10.0,
    "comment": "This should only be a 2-player game. You must be a scrabble player to really enjoy it. Know your 2 letter words, go for the double triple letter scores with an X or Z. It's among the most satisfying game expiriences with an equally matched player. It's not a vocabulary game remember, it's a math game.",
    "timestamp": 1707174000
  },
  {
    "username": "Tulilipe",
    "rating": 10.0,
    "comment": "My best classical game. Great game. Always challenging and different.",
    "timestamp": 1706482800
  },
  {
    "username": "CooperGore",
    "rating": 10.0,
    "comment": "It's still one of the best games around.",
    "timestamp": 1704927600
  },
  {
    "username": "hkproc",
    "rating": 10.0,
    "comment": "2023- #12 Top 50",
    "timestamp": 1703458800
  },
  {
    "username": "Peterping",
    "rating": 10.0,
    "comment": "Hard to beat this - the original and best. You do need a good knowledge of words to play it really well but if players are of a similar standard they will always have a good game.",
    "timestamp": 1703113200
  },
  {
    "username": "FamilySmile",
    "rating": 10.0,
    "comment": "SOLO PLAYING: Not a day goes by without me playing this at least a couple of times (against a computer). It has it all: creativity, strategy, and just enough luck to always remain challenging (or frustrating!). My all-time favourite.",
    "timestamp": 1701903600
  },
  {
    "username": "Attard",
    "rating": 10.0,
    "comment": "It’s pogchamp",
    "timestamp": 1700002800
  },
  {
    "username": "villerrionne",
    "rating": 10.0,
    "comment": "Will be posting a new way to play this boardgame soon.",
    "timestamp": 1698098400
  },
  {
    "username": "Canafra",
    "rating": 10.0,
    "comment": "Oldie but goodie, perennial favourite in my house. We have a giant turning version with indentations so the tiles stay still, couldn't find it in the BGG list.",
    "timestamp": 1697925600
  },
  {
    "username": "lydsiegbg",
    "rating": 9.5,
    "comment": "Classic word game -- points for being a staple. Great for seeing what weird words your friends know.",
    "timestamp": 1694296800
  },
  {
    "username": "ShurikF",
    "rating": 10.0,
    "comment": "un juego que te hace pensar demasiado y ademas te entretiene",
    "timestamp": 1692482400
  },
  {
    "username": "elistvan",
    "rating": 10.0,
    "comment": "A gyűjteményem egyik első darabja mindig különleges helyet fog elfoglalni q szívemben. Ajándékba kaptam a húgomtól karácsonyra, de a munkahelyemen játszottam először a kedven volt kolléganőmmel. Előnye, hogy nincs két egyforma játék, hátránya, hogy közel azonos szókinccsel, műveltségi szinttel rendelkező játékosok kellenek hozzá, különben nem kíhívás.",
    "timestamp": 1690063200
  },
  {
    "username": "Jeruzelsky",
    "rating": 10.0,
    "comment": "Classic for a reason.",
    "timestamp": 1687039200
  },
  {
    "username": "WifeObscure",
    "rating": 10.0,
    "comment": "Love the original and have two travel versions! Love them!",
    "timestamp": 1684360800
  },
  {
    "username": "Jarops1",
    "rating": 10.0,
    "comment": "Best word game ever ! Classic of the classic,",
    "timestamp": 1683324000
  },
  {
    "username": "noporunner68",
    "rating": 10.0,
    "comment": "Scrabble is a classic. This board helps the game along for all the players.",
    "timestamp": 1673823600
  },
  {
    "username": "gattosaurus",
    "rating": 10.0,
    "comment": "A classic that we've been regularly playing (mostly) with my mother since I was little. It's escpecially fun in Hungarian if you allow affixation and proper nouns. I have a lot of sweet and funny memories.",
    "timestamp": 1670886000
  },
  {
    "username": "mattysgirl09",
    "rating": 10.0,
    "comment": "It's a classic and fun to play.",
    "timestamp": 1664229600
  },
  {
    "username": "Rex_Lui",
    "rating": 10.0,
    "comment": "Language",
    "timestamp": 1663106400
  },
  {
    "username": "FoxdaleGames",
    "rating": 10.0,
    "comment": "Two copies of Deluxe in Living Room, one original purple in Puzzle Room",
    "timestamp": 1662588000
  },
  {
    "username": "CaptainAndTheMill",
    "rating": 10.0,
    "comment": "Childhood fave. Gotta give it a 10.",
    "timestamp": 1658613600
  },
  {
    "username": "CherieB",
    "rating": 10.0,
    "comment": "Word nerd here. One of my fave games.",
    "timestamp": 1649714400
  },
  {
    "username": "brytonwood",
    "rating": 10.0,
    "comment": "Not sure how za is a word meaning pizza but ok",
    "timestamp": 1649541600
  },
  {
    "username": "mhipolito",
    "rating": 10.0,
    "comment": "Own but no one wants to play this game. I think I prefer the Words With Friends app Bananagrams for solo play (B) and ease of play (W)",
    "timestamp": 1649023200
  },
  {
    "username": "bubbajonez",
    "rating": 10.0,
    "comment": "Played",
    "timestamp": 1646866800
  },
  {
    "username": "munkeyjunkey",
    "rating": 10.0,
    "comment": "2,3,4 Players",
    "timestamp": 1646175600
  },
  {
    "username": "LordChambers",
    "rating": 10.0,
    "comment": "My wife's Favorite Game",
    "timestamp": 1640559600
  },
  {
    "username": "Melatonina",
    "rating": 10.0,
    "comment": "May 2021",
    "timestamp": 1640386800
  },
  {
    "username": "GameNut7",
    "rating": 10.0,
    "comment": "The best word game IMO. Love the swivel base with special grid board that holds tiles in place.",
    "timestamp": 1628373600
  },
  {
    "username": "bunion",
    "rating": 10.0,
    "comment": "love of my life. i love to see what words everyone puts on the board. who cares if the scoring system is too dependent on layout. this game is just fun",
    "timestamp": 1626213600
  },
  {
    "username": "fsoguero",
    "rating": 10.0,
    "comment": "altillo",
    "timestamp": 1626213600
  },
  {
    "username": "PeterTheUnGreat",
    "rating": 10.0,
    "comment": "I won't ever get tired of this classic!",
    "timestamp": 1625868000
  },
  {
    "username": "ROADRUNN3R",
    "rating": 10.0,
    "comment": "+ many more w/ family, friends and Xs when bgg wasn't even a script in MS DOS.",
    "timestamp": 1624917600
  },
  {
    "username": "vnemecek",
    "rating": 10.0,
    "comment": "I don’t generally rate games, but I’m rating this one to counter some of the ridiculously low ratings piled on it by haters who — based on many of the comments I’ve read — either don’t understand the rules, don’t appreciate the skill and strategy involved, or have the attention span of a housefly.",
    "timestamp": 1619992800
  },
  {
    "username": "dancing rob",
    "rating": 10.0,
    "comment": "Probably the best of the 'traditional' games that everyone knows.\n\nA completely different game if you play with people who know what they are doing / have a reasonable knowledge of the ridiculous 2 letter word list etc. which takes it into a very different area from the 'played with your nan as a kid' game.\n\nI'm not a lifestyle game person, but if I was, this would be the one.",
    "timestamp": 1617314400
  }
]