[
  {
    "username": "Hedric3248",
    "rating": 1.0,
    "comment": "All i can say is AAAAHHHHHHHHHHHHHHHHH!!!!!!",
    "timestamp": 1618092000
  },
  {
    "username": "randrews",
    "rating": 1.0,
    "comment": "Pure luck, not a game.",
    "timestamp": 1416697200
  },
  {
    "username": "Pandorzecza",
    "rating": 1.5,
    "comment": "Not for me",
    "timestamp": 1633557600
  },
  {
    "username": "johncraven",
    "rating": 1.5,
    "comment": "A lot harder than I expected!",
    "timestamp": 1320620400
  },
  {
    "username": "purplecow55",
    "rating": 3.0,
    "comment": "A light deduction game where players are trying to guess the 3 secret numbered tiles facing away from them. Each turn, a player draws a card and answers questions based on what they see on other players' standees to inform others about what they may have. Each number occurs itself that many times, there are only 1 one tile, 2 two tiles, ... 7 seven tiles. There are 4 shapes and colors mapped to all the numbered tiles.\nA downside is that someone can wait several turns until they are able to learn something new.",
    "timestamp": 1733094000
  },
  {
    "username": "thealmostkid",
    "rating": 3.0,
    "comment": "2.6 weight",
    "timestamp": 1606345200
  },
  {
    "username": "Indy500sr",
    "rating": 4.0,
    "comment": ".compleet\nEAN 8710126003992\nL5",
    "timestamp": 1757109600
  },
  {
    "username": "infeneris",
    "rating": 4.0,
    "comment": "My brain does not work well with this game. I always seem to screw some deduction up, removing any fun I may have been having.",
    "timestamp": 1753653600
  },
  {
    "username": "Lazui",
    "rating": 5.0,
    "comment": "보드피아 책박스",
    "timestamp": 1736463600
  },
  {
    "username": "Qhorin",
    "rating": 5.0,
    "comment": "Heads down deduction puzzle",
    "timestamp": 1736377200
  },
  {
    "username": "ShiannLin",
    "rating": 5.0,
    "comment": "1986 Spiel des Jahres Recommended",
    "timestamp": 1733785200
  },
  {
    "username": "charmed_0215",
    "rating": 5.0,
    "comment": "Purchased 06/02/18\nSold 9/11/24",
    "timestamp": 1726092000
  },
  {
    "username": "GuppyGamer",
    "rating": 6.0,
    "comment": "Missing",
    "timestamp": 1752530400
  },
  {
    "username": "rkleopold",
    "rating": 6.0,
    "comment": "Keep",
    "timestamp": 1748037600
  },
  {
    "username": "thebigwhitepolarbear",
    "rating": 6.0,
    "comment": "Cut Down Box",
    "timestamp": 1747519200
  },
  {
    "username": "srand",
    "rating": 6.0,
    "comment": "Players try to deduce three numbers from a common pool (1x1, 2x2... 7x7), facing away from them. New information is obtained by taking turns reading prescribed questions/statements (on cards) like \"I can see less/more/the same blue numbers than brown numbers\" or \"I can see X players with 3 consecutive numbers\".\n\nIt's not bad. My favourite deduction game of this kind is the recent Hooky and I compare most others to that. The biggest weakness here is that the deduction is entirely passive; it's much more fun to come up with your own probes to try and leverage private knowledge to learn more than other players, mislead other players etc. It's a little annoying here that some questions seem in general better than others (great if an opponent picks them up!) and you have no way to create your own opportunities.\n\nThere are some odd quirks around the timing since a player who guesses at the right time can take advantage of the significant information available prior to re-shuffling and be ready to guess again quickly - you definitely need to use one of the variants to reshuffle when more tiles are left, but even narrowing down to 3/10 or 3/7 makes it possible for the next guess to be very quick. It becomes difficult to record the information and I don't think the included sheets are ideal.\n\nWouldn't choose over Hooky, but if I were in an AirBnB with a bunch of old mass-market games on the shelf I'd be thrilled to have one this good available.",
    "timestamp": 1723154400
  },
  {
    "username": "Card",
    "rating": 6.9,
    "comment": "[$] Best with 4 (2-5) 60 mins, Age:10, 2.32 [$30] OOP",
    "timestamp": 1756072800
  },
  {
    "username": "lexay1415",
    "rating": 7.0,
    "comment": "One of the most approachable deduction games.",
    "timestamp": 1754604000
  },
  {
    "username": "ConnerCP",
    "rating": 7.5,
    "comment": "sell",
    "timestamp": 1754344800
  },
  {
    "username": "mdsb",
    "rating": 8.0,
    "comment": "xx",
    "timestamp": 1740006000
  },
  {
    "username": "MMGrad",
    "rating": 8.5,
    "comment": "Expansions / Promos / Extras:\n+ 30th anniversary edition",
    "timestamp": 1737068400
  },
  {
    "username": "evilwhaleboy",
    "rating": 8.8,
    "comment": "barely played",
    "timestamp": 1733871600
  },
  {
    "username": "Tolkana",
    "rating": 10.0,
    "comment": "9",
    "timestamp": 1661292000
  },
  {
    "username": "Hopkins",
    "rating": 9.5,
    "comment": "Despite (and probably because of) it's abstract nature, this is one of the most fun deduction games I have ever played. It's very difficult to record all the information you need to, which forces you to attempt to refer to assumptions you previously made. In turn, this causes errors based on false premises, and the pressure to guess first encourages risk taking which, inevitably, ends in amusing failures!\n\nThis game compares well to Hanabi, but seems to have more potential for clever deduction thanks to the note taking and more complex clues.",
    "timestamp": 1626645600
  }
]