[
  {
    "username": "icheyne",
    "rating": 1.0,
    "comment": "Far too long. You can be effectively eliminated early and then you have to sit around for hours.",
    "timestamp": 1730588400
  },
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "I'd rather undergo Chinese water torture.",
    "timestamp": 1037574000
  },
  {
    "username": "theromulans",
    "rating": 2.0,
    "comment": "Replaced by Twilight Imperium Fourth Edition.",
    "timestamp": 1597183200
  },
  {
    "username": "Lucaswolfox",
    "rating": 2.0,
    "comment": "Some people love it. I hate it. Feels like Solitaire in terms on that sometimes luck is against you from set up. Make a mistake 1st turn and you will lose. Then you end up sitting there for hours losing. I understand what they were going for, well made and written but terrible actual play.",
    "timestamp": 1596492000
  },
  {
    "username": "jens_hoppe",
    "rating": 3.0,
    "comment": "Hardcord empire building, diplomacy and backstabbing, set in space. Not my cup of tea...",
    "timestamp": 1551049200
  },
  {
    "username": "Bakka",
    "rating": 3.0,
    "comment": "Русское издание 2 редакции. Игра не пошла никак. Было сыграно наверное 3, может 4 партии. Игра медленно растаскивается на фигурки для п'н'п.",
    "timestamp": 1333663200
  },
  {
    "username": "TongDelphine",
    "rating": 4.0,
    "comment": "時空爭霸是經典的科幻策略遊戲，玩家會在宇宙中建立自己的帝國並控制資源，需要用策略和謀略來擊敗其他帝國，以贏得最多的勝利點數。",
    "timestamp": 1683151200
  },
  {
    "username": "brumcg",
    "rating": 4.0,
    "comment": "Not my cup of tea; I don't generally like games that combine heavy fighting with heavy negotiation and I tend to turtle. I do like this game more than most of its ilk though.",
    "timestamp": 1558476000
  },
  {
    "username": "NoNamium",
    "rating": 5.0,
    "comment": "A good game of space-Axis&Allies, though some game imbalances exists I like this better than the static and often repetitative game of A&A\n\nA better version has been made since",
    "timestamp": 1413928800
  },
  {
    "username": "Crikrunner",
    "rating": 5.0,
    "comment": "Too long and many chits for my friends to like. We tried to play it once and never played it again. Wish I had the newer edition to try out.",
    "timestamp": 1408744800
  },
  {
    "username": "eugene256",
    "rating": 5.0,
    "comment": "Not a bad game, but it takes way too long to play for what it is.",
    "timestamp": 1391122800
  },
  {
    "username": "madhatter",
    "rating": 5.0,
    "comment": "A 4X game that is clunky, too long, and fraught with balance issues.",
    "timestamp": 1370988000
  },
  {
    "username": "ShadowDad7",
    "rating": 6.0,
    "comment": "A good conept with some nice elements. Pieces were a bit underwhelming. Overall, this was a good game!",
    "timestamp": 1601848800
  },
  {
    "username": "Fragfritz",
    "rating": 6.0,
    "comment": "Punched and clipped. Includes Borderlands and Distant Suns expansions",
    "timestamp": 1566856800
  },
  {
    "username": "Volstag",
    "rating": 6.0,
    "comment": "2nd Edition. Fun space opera game. Politics, battles, conquest, technology, etc. Caveat: very long playtime, plays best with 6, lots o' bookkeeping (I recommend a windows TI manager). Superseded by several new editions. Update 11/13/17: given to Mike D.",
    "timestamp": 1566252000
  },
  {
    "username": "Thrylos",
    "rating": 6.0,
    "comment": "It started it all!",
    "timestamp": 1431986400
  },
  {
    "username": "Boerni72",
    "rating": 7.0,
    "comment": "Impulse Buy",
    "timestamp": 1591308000
  },
  {
    "username": "jacobderosenoir",
    "rating": 7.0,
    "comment": "So this is the first version which created many memorable moments among my friend and I. Go check the latest version and you won't regret it.",
    "timestamp": 1587420000
  },
  {
    "username": "TalesWithinWheels",
    "rating": 8.0,
    "comment": "A marvelous experience, though less baroque than its successors. A much more pure experience, it nonetheless still has many roads to victory. I find the political phase in this one more bland, but I far prefer the turn structure. All-in-all probably the best of the TIs, but they all have something to offer.",
    "timestamp": 1690236000
  },
  {
    "username": "derblob",
    "rating": 8.0,
    "comment": "In this classic, you get a real sense of Christian Petersen photocopying things by hand in the early days of Fantasy Flight.",
    "timestamp": 1526421600
  },
  {
    "username": "sbester",
    "rating": 9.0,
    "comment": "This was my grail game for a long time. I finally found a copy and then it took almost 3 years to finally table the thing. I think it was worth the wait, as I absolutely loved it. It did take 10 hrs to play, and that was only with 4 players, but we were learning. My plan was to play this once and then move onto the 2nd edition, but I def want to give it another play now, as I feel it is worth more than just a one-off (even if it's just a prototype for what the series would become).",
    "timestamp": 1717970400
  },
  {
    "username": "TGCRequiem",
    "rating": 8.8,
    "comment": "Just a great game. It has luck, but I feel it is less complex than the 3rd Edition which is a good thing. Still plays way to long. Roughly 7 hours in 3 player games. Obviously that time can come down and come down fast, but with that length we can't play it enough to bring length significantly down.\n\nPlayed 4 player recently and this might be my favorite space epic now...just need to get the time down...and more players...is that to much to ask.",
    "timestamp": 1673478000
  },
  {
    "username": "ys3bagsfull",
    "rating": 10.0,
    "comment": "Hey you, get off my planet!! I'm a sucker for player abilities. And the council is a fun idea.",
    "timestamp": 1407448800
  },
  {
    "username": "manowarplayer",
    "rating": 9.5,
    "comment": "1st edition - 2 sets. Nice blend of mechanics from Settlers, Axis & Allies, Risk & Cosmic Encounter. Ive made a few special scenery hexes for this game myself. Raised this to a 9 as it has consistantly been a game where I walk away from a game of 4+ hours feeling like I want more.\n\nComment:\n... Abstract ...___________[]...Themed .....\n......... Luck ...________[]__... Skill ...........\n...... Simple ..._______[]___... Complex ...\n.. Strategic ...______[]____... Tactical ....\n.... Friendly ..._________[]_... Cutthroat ..\n....... Fiddly ...______[]____... Elegant .....\n\nGraphics: 9\nPackaging: 8\nComponents: 7\nRules: 8\nFun Factor: 9\n\nOVERALL RATING: 9\nRating Date: 11/20/2005\nRating History/Dates N/A",
    "timestamp": 1360537200
  }
]