[
  {
    "username": "Mushmo",
    "rating": 1.0,
    "comment": "Time waster \"Classic\" I have no desire to play ever. Too basic and there are hundreds of games that do this type of game better. Antike is what I recommend people play over Risk. Loads more to do and a rondel to throw in a little Manacala too.",
    "timestamp": 1745704800
  },
  {
    "username": "B_Moores",
    "rating": 1.0,
    "comment": "Not really a game is it? No decisions, no theme, objectives are dull.",
    "timestamp": 1739142000
  },
  {
    "username": "Yoda2798",
    "rating": 1.0,
    "comment": "\"Risk\" is an aptly named war game, as just like participating in real wars will do, you risk your mental health by playing it. Go roll some dice and you'll get bored just as quickly, but at least you can move on and do literally anything else with your life. WarGames put it best: \"A strange game. The only winning move is not to play.\"",
    "timestamp": 1736636400
  },
  {
    "username": "Kwaxel",
    "rating": 1.0,
    "comment": "German version of square box",
    "timestamp": 1729202400
  },
  {
    "username": "ToBakai",
    "rating": 1.0,
    "comment": "Der Urvater des Area Control und eines der glücksbasiertesten und schlechtesten Spielen aller Zeiten.",
    "timestamp": 1711321200
  },
  {
    "username": "Raphael2112",
    "rating": 1.0,
    "comment": "No strategy.\nVery poorly designed.\nJust plain dice rolling.\nProbably will never play again.",
    "timestamp": 1711062000
  },
  {
    "username": "tom_q",
    "rating": 1.0,
    "comment": "This game has aged really, really badly. After one play, I'd rather visit a dentist than repeat the experience :/",
    "timestamp": 1704927600
  },
  {
    "username": "ragnaroek23",
    "rating": 1.0,
    "comment": "The pointlessness of Risk is only topped by it's ubiquity.\n\nHated by avid board gamers, because it detracts new player from longer board games, by being long, tedious and above all pointless for most of it's game time.\n\nEver wondered why potential gaming partners whine at the prospect of a >2h game? Probably risk and it's cousin in pointlessness monopoly.",
    "timestamp": 1704668400
  },
  {
    "username": "rabuto",
    "rating": 1.0,
    "comment": "Slow and boring",
    "timestamp": 1699138800
  },
  {
    "username": "VikingduDimanche",
    "rating": 1.0,
    "comment": "Jouons à lancer des dés",
    "timestamp": 1678921200
  },
  {
    "username": "BitOfaFanatic",
    "rating": 1.0,
    "comment": "Very little interesting decision; pretty much no variation between games, and eliminated players have absolutely nothing to do but be sad that someone decided to choose to play risk for 'the nostalgia'",
    "timestamp": 1667862000
  },
  {
    "username": "emptyset",
    "rating": 1.0,
    "comment": "Outdated. Takes way too long and encourages turtling. I also dislike the negotiation in this. There are much better alternatives like Small World, History of the World, and tons more. If you want to play Risk, pick up Risk Legacy instead.",
    "timestamp": 1665266400
  },
  {
    "username": "GarfieldKlon",
    "rating": 1.0,
    "comment": "#4\n\nToo long, too much luck involved. And if someone is eliminated he's out for the rest of the game, very nice.",
    "timestamp": 1663797600
  },
  {
    "username": "alfonzo54",
    "rating": 1.0,
    "comment": "Pretty much everything about this game drives me nuts. I keep it around for the plastic Roman numerals.\n\n9/22: I've recently been watching some Risk: Global Domination high level play on youtube and the fact that the tournaments include a bot player that purposely makes mediocre to bad decisions and acts as a fish is a scathing indictment of this game.",
    "timestamp": 1662933600
  },
  {
    "username": "boynamedgordy",
    "rating": 1.0,
    "comment": "I am so glad that we no longer have to play this monstrosity of a terrible board game.",
    "timestamp": 1640732400
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "A \"classic\" game - meaning it's dated. Drags on and on and on with serious runaway winner issue.",
    "timestamp": 1639954800
  },
  {
    "username": "Catanians",
    "rating": 1.0,
    "comment": "Wish there was a 0 star. Complete luck on dice rolls and starting locations. Slow mechanics paired with elimination makes this game unbearable.",
    "timestamp": 1635112800
  },
  {
    "username": "p00q",
    "rating": 1.0,
    "comment": "\"Classic\" game.\n\nWhere are all the people talking about how amazing the theme for this game is because it has dice combat?",
    "timestamp": 1627596000
  },
  {
    "username": "barmyfongyphipps",
    "rating": 1.0,
    "comment": "To paraphrase the Wise Old Elf, 'this is not a game. It’s an abomination!'\nLong, boring, frustratingly repetitive, it defies any kind of strategic nous. There’s no rhyme or reason to it. No plan, no strategy, no nothing will see you prevail, or fail. It's just a bucket of dice and gormless luck. Doesn't matter how well you build and craft your \"empire\", someone will dump down a fistful of cards, procure 50 million troops and sweep through you, only to be swept away themselves by someone else whose army is even bigger next turn.\n\nThroughout all this, there’s dice rolling. Endless dice rolling. Nothing to modify like terrain, tactics, leadership or defence. Just the crass, base stupidity of mindless dice rolling.\n\nAfter so many hours of tedious play moving well past midnight, no one cares any longer who wins. Everyone just wishes it would end. But it doesn't. It just keeps going ... on and on and on ... more armies, more dice rolling, more ....aaaaagh!!!! Kills me just thinking of it.\n\nMost people, fed up and tired by this point, politely excuse themselves and go to bed, leaving the final two players to battle it out ... more armies, more dice rolling, more ... bleh.\n\nAnd even when you win, it feels like a loss.\n\nThere is no bonfire in the world too big that wouldn’t benefit from adding this shallow drivel to it.\n\nSafe to say, I have learned from mistakes of innocent, gullible youth; nowadays, I simply curl my lip, adopt a death stare and give my best Flashman sneer at anyone who dares suggest we play it.",
    "timestamp": 1627336800
  },
  {
    "username": "kanniebaal",
    "rating": 1.0,
    "comment": "Wargame with alot of luck involved by throwing the dice.",
    "timestamp": 1623362400
  },
  {
    "username": "Instinct8",
    "rating": 1.0,
    "comment": "Hate this game. From the time I cried as a kid to last month with friends who weren't into video games. Play Axis and Allies if you have to or at least Lord of the Rings Risk.",
    "timestamp": 1603926000
  },
  {
    "username": "dreamsincolor721",
    "rating": 1.0,
    "comment": "I do no like area control games.",
    "timestamp": 1592690400
  },
  {
    "username": "Meowtiful",
    "rating": 1.0,
    "comment": "Absolutely the worst game I've ever played, theres nothing more to it.",
    "timestamp": 1578265200
  },
  {
    "username": "frozzy3",
    "rating": 1.0,
    "comment": "It doesn't feel like a game, more like a thing you do to pass the time",
    "timestamp": 1576882800
  },
  {
    "username": "Niamak",
    "rating": 1.0,
    "comment": "- Dice based combat\n- Gateway",
    "timestamp": 1571004000
  },
  {
    "username": "isfella33",
    "rating": 1.0,
    "comment": "The original war game. Played this one as a kid and I knew I hated it then. Which is sad because you look at the board, dream of becoming Napoleon and then you realize that you can't win if you get involved in a land war in Asia. You will never win but the end of the game is a slog of ways off. I begged to sleep... as a child... rather than play this game.",
    "timestamp": 1555365600
  },
  {
    "username": "Fribian",
    "rating": 1.0,
    "comment": "I hate Risk due to the ability for players to gang up on one person. I liked it the first few times I played it, but found out I hated it later on.",
    "timestamp": 1551740400
  },
  {
    "username": "Almeck",
    "rating": 1.0,
    "comment": "This game may take credit for many people having an opinion they dislike board games. While the game play is very simple to understand it is also very unfair to the least popular player who may get booted from game play during the first 10 minutes of play and have to wait 2 hours if lucky for the others to finish.",
    "timestamp": 1549148400
  },
  {
    "username": "lch912",
    "rating": 1.0,
    "comment": "This is an awful game almost solely based on luck and if you don’t manage to do what you wanted to do someone else will trade in a higher set of cards and wipe you out. There are two games I never play now. This and Monopoly, they are both horrendous.",
    "timestamp": 1547938800
  },
  {
    "username": "laucion",
    "rating": 1.0,
    "comment": "lost my copy",
    "timestamp": 1505772000
  },
  {
    "username": "n00bstar",
    "rating": 1.0,
    "comment": "Terribly flawed game. Very much a product of its era. Takes about 18 weeks to play, and during those 10,886,400 seconds, not a single one of them will feel satisfying.",
    "timestamp": 1489014000
  },
  {
    "username": "ergophone",
    "rating": 1.0,
    "comment": "lead can swing very heavily from turn to turn.",
    "timestamp": 1488063600
  },
  {
    "username": "gijoe250",
    "rating": 1.0,
    "comment": "It might have changed for the better now, but back then there was to much dice rolling and not enough strategy.",
    "timestamp": 1484348400
  },
  {
    "username": "egalotron",
    "rating": 1.0,
    "comment": "No Risk = FUN!\n\nor should I rephrase...\n\nRisk = NO FUN?",
    "timestamp": 1480460400
  },
  {
    "username": "RCdragon",
    "rating": 1.0,
    "comment": "sent it far away in Mexico",
    "timestamp": 1475532000
  },
  {
    "username": "Taalis_rrr",
    "rating": 1.0,
    "comment": "I did not go well with me, I don't know why. Even though I tried. Don't want to give it any more chances, sorry...",
    "timestamp": 1452898800
  },
  {
    "username": "David_Tennant_10",
    "rating": 1.0,
    "comment": "This game is the very, very, very, VERY... simple and super, super, super, SUPER... boring version of Axis and Allies. And Axis and Allies is a TON of fun.",
    "timestamp": 1452294000
  },
  {
    "username": "kika80_Litwa",
    "rating": 1.0,
    "comment": "30 EUR",
    "timestamp": 1446073200
  },
  {
    "username": "Ghost CoD",
    "rating": 1.0,
    "comment": "Magic the gathering is the only game that I hate more than this supposed game. I hate how people identify boardgames with this endless piece of shit dice fest, deprived of any strategy whatsoever, apart from Conquer Australia, whatever your objective is. On the other hand, I love laughing at people's face when they use Risk as an example of a good board game.",
    "timestamp": 1441144800
  },
  {
    "username": "Parceval",
    "rating": 1.0,
    "comment": "Austria, German Version",
    "timestamp": 1440799200
  },
  {
    "username": "quaoar10",
    "rating": 1.0,
    "comment": "Overloooooong playtime. Influence is rather low.",
    "timestamp": 1433023200
  },
  {
    "username": "Hypermooo",
    "rating": 1.0,
    "comment": "Kinda fun but the dice element is just far too strong. The game relies heavily on luck rather than strategy and also can go on for far too long!\n\nThere are far better area control board games out there, I really can't understand the popularity of Risk when games like \"A game of thrones 2nd edition\" are so much better!",
    "timestamp": 1430949600
  },
  {
    "username": "quetzal513",
    "rating": 1.0,
    "comment": "TOO MUCH DICE RAGE!",
    "timestamp": 1429999200
  },
  {
    "username": "grantsg",
    "rating": 1.0,
    "comment": "Saturday game",
    "timestamp": 1397426400
  },
  {
    "username": "eugene256",
    "rating": 1.0,
    "comment": "One of those games I loved when I was a kid that I couldn't imagine sitting through now, except on a computer...",
    "timestamp": 1391122800
  },
  {
    "username": "Redward",
    "rating": 1.0,
    "comment": "This game has turned me off of war games until now but I really need to give them a shot. This was poop though.",
    "timestamp": 1387494000
  },
  {
    "username": "waz synth",
    "rating": 1.0,
    "comment": "The randomness of the dice ruins this game. I avoid it at all costs.",
    "timestamp": 1372888800
  },
  {
    "username": "Floating World",
    "rating": 1.0,
    "comment": "A dicefest. Fun game when I was a kid, but can't stand it now.",
    "timestamp": 1367791200
  },
  {
    "username": "mistermarino",
    "rating": 1.0,
    "comment": "Fundamentally and unredeemably stupid. This alleged game ranks somewhere between reality t.v. and disco on the list of reasons why a spiteful god might choose to exterminate humanity and try again. Nothing but a wretched excess of pointless die rolling. Taking a crap takes more concentration, and you feel better afterward. If only we could flush this game, and the memory of its existence, from the collective unconsciousness.\n\nIt's too long for a game that is 99 percent luck, and it's not challenging. I must say that of all the games I rank a \"1\", this one vexes me most heavily. I understand the social appeal of Cosmic Encounter, the gambling appeal of Poker, etc. But I cannot, for the life of me, get a handle on the appeal of this one. It just leaves me so cold. I cannot think of a single reason why anyone would want to play this again. Well, I suppose someone might like it. But that's crazy talk.",
    "timestamp": 1363820400
  },
  {
    "username": "pgkashmir",
    "rating": 1.0,
    "comment": "No differing strategy to this game. One of the worst popular games ever in my opinion.",
    "timestamp": 1363561200
  },
  {
    "username": "darkfonix",
    "rating": 1.3,
    "comment": "Voy a decir algo bueno de este juego: Las misiones. Le dan rejugabilidad y algo de misterio, pues cuesta un poco deducir el objetivo de tus rivales.\nAh, y voy a decir algo malo: Todo lo demás.",
    "timestamp": 1356994800
  },
  {
    "username": "davedanger",
    "rating": 1.0,
    "comment": "Player elimination,unknown length, and rolling 3 dice at a time. Garbage. This & Monopoly have the power to turn potential gamers off. Burn it!\nOk I lied; I pillage it for markers.",
    "timestamp": 1348092000
  },
  {
    "username": "jerseygrrrl",
    "rating": 1.0,
    "comment": "Evil, horrible game that caused so many fights in my family growing up. In our last game, we finally beat the system: my brother and I teamed up to defeat my father (an obnoxious and vindictive Risk player) and then declared the game over (much to my father's dismay). After that, no more games and no more Risk fights. Today, Risk stays on the game shelf of a reminder of how destructive a game can be.",
    "timestamp": 1342908000
  },
  {
    "username": "lachose1",
    "rating": 1.0,
    "comment": "Played it when I was a kid and recently played it again. It's seriously bad, once you're losing there's no going back and there's 0 strategy.",
    "timestamp": 1340143200
  },
  {
    "username": "selwyth",
    "rating": 1.0,
    "comment": "Cool when I was little, until I found the superior Risk spin-offs.\n\n1+0",
    "timestamp": 1327359600
  },
  {
    "username": "Dr Brian",
    "rating": 1.0,
    "comment": "Rated a 1, only because as a war game, it is blah. I'd also give it a \"10\" at the same time, because it was my first \"war game\" and you can get people to play it.",
    "timestamp": 1304287200
  },
  {
    "username": "Shovelmint",
    "rating": 1.0,
    "comment": "Ugh, lets roll dice over and over and over again for HOURS.",
    "timestamp": 1301349600
  },
  {
    "username": "whokan",
    "rating": 1.0,
    "comment": "Why do I hate this game so much? There are a lot of games that boil down to monotonous luck of the dice rolling and I enjoy those? Not this. Anything but Risk.",
    "timestamp": 1296946800
  },
  {
    "username": "skipsizemore",
    "rating": 1.0,
    "comment": "My last play will forever remain my last play. Never-ending, luck-driven torment.",
    "timestamp": 1296687600
  },
  {
    "username": "johncraven",
    "rating": 1.0,
    "comment": "Too long.",
    "timestamp": 1291330800
  },
  {
    "username": "weidox",
    "rating": 1.0,
    "comment": "Who the hell created this. General consensus is \"it's only ok game when company is drunk and thus mindless.\".",
    "timestamp": 1266620400
  },
  {
    "username": "Shade92008",
    "rating": 1.0,
    "comment": "I hate RISK... I absolutely loathe this game and all it's incarnations.",
    "timestamp": 1266361200
  },
  {
    "username": "anubis_cuk",
    "rating": 1.0,
    "comment": "Played this once a while back, and will never play again. Not a single redeeming feature. The rating is 1 too high.",
    "timestamp": 1264201200
  },
  {
    "username": "fateswanderer",
    "rating": 1.0,
    "comment": "I got this monstrosity as a kid thinking that it would be engaging and strategic instead of an endurance borefest. I despise it for wasting my childhood and not having incorporated any improvements over the decades that it could have.",
    "timestamp": 1259708400
  },
  {
    "username": "georgech7713",
    "rating": 1.0,
    "comment": "I can't think of a game I loathe more than this one. Last time I played it was in 1982. It's likely I will never play it again (unless my son or daughter gets into it, heaven forbid).",
    "timestamp": 1250546400
  },
  {
    "username": "Mynth",
    "rating": 1.0,
    "comment": "No me gusta nada. Cuando lo estrene empece la partida y con \"algo\" de fortuna al empezar e ir tirando 3 dados contra 2 acabe con mi rival en el primer turno dejandole valdado y con dificiles posibilidades de recuperacion.",
    "timestamp": 1250028000
  },
  {
    "username": "KukistajA",
    "rating": 1.3,
    "comment": "Random game. Never been a fan.",
    "timestamp": 1245967200
  },
  {
    "username": "Pintsizepete",
    "rating": 1.0,
    "comment": "The most boring play ever. A dice-fest if ever there was one.",
    "timestamp": 1233961200
  },
  {
    "username": "Kwyjibo",
    "rating": 1.0,
    "comment": "Never again.",
    "timestamp": 1231628400
  },
  {
    "username": "outofthenorth",
    "rating": 1.0,
    "comment": "poor game - it only has one real strategy.",
    "timestamp": 1213221600
  },
  {
    "username": "audpopdeb",
    "rating": 1.0,
    "comment": "GAAAAAAAAAAAAAAAAAAAAAAAAAAAK",
    "timestamp": 1203980400
  },
  {
    "username": "Carcagarbage",
    "rating": 1.0,
    "comment": "Australia assures victory: the game is BROKEN",
    "timestamp": 1203980400
  },
  {
    "username": "Ratio",
    "rating": 1.0,
    "comment": "Another of those games which has player elimination and extended gaming time--the ultimate combination of boredom.",
    "timestamp": 1188511200
  },
  {
    "username": "JuliaZ",
    "rating": 1.0,
    "comment": "My brother tormented me with this game when we were in middle school. It ended up being a \"throw pieces at each other and yell a lot\" kind of game, which is honestly not what I would call a \"game\". I will never ever play this game again.",
    "timestamp": 1186437600
  },
  {
    "username": "waterborg",
    "rating": 1.0,
    "comment": "One big dice festival.\nWith some adjustments it can be a fun game.\nBut on the other hand why? There are so many other good games.",
    "timestamp": 1184104800
  },
  {
    "username": "kuchick",
    "rating": 1.0,
    "comment": "people are mean.. and no matter how much you prep for battle the die roll is RANDOM.. UGH",
    "timestamp": 1181080800
  },
  {
    "username": "Potallo",
    "rating": 1.0,
    "comment": "Es aburrido, muy aburrido, solo tienes la opcion de atacar turno tras turno, si no atacas estas muerto, no hay ninguna estraegia a parte de conseguir Australia. No entiendo porque tanta gente lo idolatra y se jacta de estar horas y horas jugando a este juego. Supongo que debe ser una proeza aguantar 3 o 4 horas jugando a este juego.",
    "timestamp": 1179352800
  },
  {
    "username": "Ironpants",
    "rating": 1.0,
    "comment": "The most boring game in the whole world.",
    "timestamp": 1173999600
  },
  {
    "username": "Speedwaysupporter",
    "rating": 1.0,
    "comment": "when I first saw the bgg ranking list, I asked myself: What game could be rated 1? Had no idea...until yesterday. Don't know from where it came,I'm a really boardgame-mad, remember playing a game with 39 degrees celsius fever still having fun. But ask me which game I won't hesitate to decline an offer to play, thinking: What a waste of time... it's definitely this game. Cruel memories: Sitting 10 hours around a table, new day dawning, dicing, dicing 'til the arm gets lame, no winner in sight, but two compatriots sitting around doing nothing, early eliminated. What good is such a game for ?",
    "timestamp": 1170111600
  },
  {
    "username": "Alethra",
    "rating": 1.0,
    "comment": "Awful. Too strategy and conflicts. I prefer games that meet people in mercy, than games where people quarrel all time.",
    "timestamp": 1162508400
  },
  {
    "username": "Icedanno",
    "rating": 1.0,
    "comment": "You're lucky, you win. You not lucky, you lose.",
    "timestamp": 1155679200
  },
  {
    "username": "Mirascael",
    "rating": 1.0,
    "comment": "Loved it as a kid. But then, as a kid, I almost played any game. Until my first RPG. Afterwards, it became to return to ordinary dull games.\n\nMeant for the garbage can, perhaps it might serve a purpose at an incineration plant.",
    "timestamp": 1107212400
  },
  {
    "username": "davedaring",
    "rating": 1.0,
    "comment": "Hurts real gaming. Burn all copies.",
    "timestamp": 1104793200
  },
  {
    "username": "garea37",
    "rating": 1.0,
    "comment": "I really hate this game.",
    "timestamp": 1099350000
  },
  {
    "username": "faqtotum",
    "rating": 1.0,
    "comment": "I hate this game. Completely.",
    "timestamp": 1090792800
  },
  {
    "username": "peaks326",
    "rating": 1.0,
    "comment": "Man, do I hate Risk.",
    "timestamp": 1085436000
  },
  {
    "username": "denis_1929",
    "rating": 1.0,
    "comment": "Too draggy and game is decided before half the time and just drags on.",
    "timestamp": 1071788400
  },
  {
    "username": "ssummerer",
    "rating": 1.0,
    "comment": "If it weren't for Monopoly this would be my absolute least favorite game ever! It takes forever to end and I just can't keep interested long enough to make it worthwhile. Unfortunately, my husband likes Risk, so we have the original version, Risk 2210 and LoTR Risk. When will it ever end???",
    "timestamp": 1056664800
  },
  {
    "username": "greyfalco",
    "rating": 1.0,
    "comment": "This game is for little babies/young kids that enjoy rolling dice that are red, and WOW, you get to roll 3 whole dice at the same time! This is the extent of the complexity, and it's perfect for those who love watching randomness play out for 3 hours slowly while the grown-ups in the room entertain your precious and slowly developing mind. Forget the more robust and complex strategy games out there, the well designed masterpieces that are playtested and shaped into exquisite thinking experiences. Forget those unique mechanics and thoughtout gameplay that ends just when you think it should end. No no, it's much more important to let this juvinile diversion, which only has any credit because of some random childhood memories.\n\nLook, I know people that love this game. They talk about when they played it for hours and hours. But look around you! This is a dated and random dicefest. I can't sit through another game of this, it's a waste of every players time except for the back breaking winner (and it might even be a waste of time for him/her). Don't make me defend my position, I shouldn't have to. This game is not just a waste of time, but it's an insult to all the hardworking game designers out there that are truly trying to innovate and sincerely care about the design of games.\n\nFine, play it if you want to reminisce about the good old days when you were 2 years old and indoor plumbing was an innovation. But the rest of us really want to move on. Don't teach this to your kids people, don't buy it for a friend. Lets end this virus for good.",
    "timestamp": 1052690400
  },
  {
    "username": "RobRose",
    "rating": 1.0,
    "comment": "Long, drawn out game of...rolling dice. Yawn.",
    "timestamp": 1007766000
  },
  {
    "username": "shawnmackay1593",
    "rating": 2.0,
    "comment": "This is an absolutely awful game. The defensive 6 always winning a battle with no way to mitigate hurts it as does the length. It *might* have been good for it's day (although I would prefer to just not a play a game) but it is terrible now.",
    "timestamp": 1759442400
  },
  {
    "username": "Kicker64",
    "rating": 2.0,
    "comment": "Pure luck, 0 strategy",
    "timestamp": 1755468000
  },
  {
    "username": "Ephorus",
    "rating": 2.0,
    "comment": "What I like:\n- THE game of my childhood.\n\nWhat I dislike:\n- Games tend to drag. They usually never finish.\n- Game play is pretty luck driven and mostly tactical.",
    "timestamp": 1755208800
  },
  {
    "username": "g4bor",
    "rating": 2.0,
    "comment": "The stone axe also had a long history, but that doesn't mean it has any use outside the museum.",
    "timestamp": 1755122400
  },
  {
    "username": "putumayo",
    "rating": 2.0,
    "comment": "I'd rather play a free online flash version than this travesty that has somehow stayed around for so long. Or better still if I wanted a long game, with no catch ups, dice rolls, map painting, I'd rather play HOI4 or EU4 or Civ V.",
    "timestamp": 1753567200
  },
  {
    "username": "Nightyblade",
    "rating": 2.0,
    "comment": "Dice Luck, Card Luck and you know who wins 1h before the ending.",
    "timestamp": 1749506400
  },
  {
    "username": "KingInTheCorner",
    "rating": 2.0,
    "comment": "It improves kids' geography skills, so that's nice.",
    "timestamp": 1747692000
  },
  {
    "username": "werewinterwolf",
    "rating": 2.0,
    "comment": "Too long for what it is",
    "timestamp": 1747087200
  },
  {
    "username": "Pacres",
    "rating": 2.0,
    "comment": "Demasiada influencia de los dados para mi gusto",
    "timestamp": 1743890400
  },
  {
    "username": "Knoqx",
    "rating": 2.0,
    "comment": "Probably the only board game I actively dislike",
    "timestamp": 1741561200
  },
  {
    "username": "mduke",
    "rating": 2.0,
    "comment": "For such a thematically simple game, you would think there would be mechanisms that better ensured game balance and prevented the other players beating up on the leader to make the game go on forever.",
    "timestamp": 1736377200
  },
  {
    "username": "victorpalmer",
    "rating": 1.9,
    "comment": "I hate this game.\nEste juego tiene bastante culpa que mucha gente no entrara más a fondo en la afición de los wargames o incluso de boardgames en general.\nTécnicamente mal juego y largo, es cierto que en los 80 no parecía tan malo. Para niños de 12 años pasa, pero para adultos es un juego al que habría que quitar su etiqueta de clásico porque no se la merece. Ha hecho mucho mal en la historia de los wargames porque es un mal juego introductorio de lo que es un wargame. De todas maneras le doy 0.9 puntitos de más por haber sido durante 15 años el único wargame introductorio (que no fuera NAC) y uno de los pocos boardgames para el gran público disponibles en España.",
    "timestamp": 1735686000
  },
  {
    "username": "MatroidX",
    "rating": 2.0,
    "comment": "Gets a point for the cool-looking map and army pieces. But the play is pretty bad: rolling dice hundreds of times over many many hours. Overlong games became a form of drawn-out torture, similar to War or Snakes & Ladders.\n\nUpdate: Recently played it for the first time in decades. Better than I remembered, though still not great. (Needs some kind of dice / luck mitigation..?)",
    "timestamp": 1735686000
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\noutdated classic. far too much randomness and dice throwing fest. can take far too long as well.",
    "timestamp": 1735254000
  },
  {
    "username": "devourblast",
    "rating": 2.0,
    "comment": "If the length of your game is a joke in pop culture, your game is too long.",
    "timestamp": 1732230000
  },
  {
    "username": "SenorBivins",
    "rating": 2.0,
    "comment": "Base Game\nRevised Edition",
    "timestamp": 1731884400
  },
  {
    "username": "abssalom",
    "rating": 2.0,
    "comment": "Uno de los que lo empezó todo... Pero claramente superado por el tiempo. Excesivo azar, excesiva duración, eliminación, etc. Todo lo que evitas hoy en día lo tiene este clásico de clásicos",
    "timestamp": 1731538800
  },
  {
    "username": "TinyTimTam",
    "rating": 2.0,
    "comment": "long n tedious\nmy entire personality is based off hating risk",
    "timestamp": 1719352800
  },
  {
    "username": "cagriggs",
    "rating": 2.0,
    "comment": "Used to be one of my favorite games before I discovered German games. Now it's OK but likely won't play it much in the future.",
    "timestamp": 1714255200
  },
  {
    "username": "asfhgwt",
    "rating": 2.0,
    "comment": "Almost as weak as Monopoly. Roll those dice -- again and again and again!",
    "timestamp": 1712181600
  },
  {
    "username": "Dday27",
    "rating": 2.0,
    "comment": "Won't ever end",
    "timestamp": 1705705200
  },
  {
    "username": "ErikLevin",
    "rating": 2.0,
    "comment": "Falling behind early ensures you will never get back in the game. But simultaneously, a desperate player might sometimes mount an impenetrable defense on a small area, making the game take forever. Bad design. I don't like it.",
    "timestamp": 1704754800
  },
  {
    "username": "Spaccamazza",
    "rating": 2.0,
    "comment": "You can replace any player with a bot that randomply attacks and trow the dices and it would eliminate the most infuriating thing, namely playing this game. It's almost all luck based, you don't need to think. This game is for the simple man who believes that trowing a dice and getting a six is skill...",
    "timestamp": 1704236400
  },
  {
    "username": "bmilli333",
    "rating": 2.0,
    "comment": "I know its a classic, but I just cant get into this game. I feel like it takes a year to play and I still end up getting completely obliterated. I always joke that I lose on purpose just so it will come to an end. Sorry, I just don't care for it much.",
    "timestamp": 1702854000
  },
  {
    "username": "KlaztheBoardgamer",
    "rating": 2.0,
    "comment": "This game ain`t worth it if it took 45minutes, but when it can drag for hours, repeating what you do each round I rather watch paint dry. Its no tactics or strategy involved. Its all about rolling 6 after 6 after 6 and one guy can defeat 100.",
    "timestamp": 1700780400
  },
  {
    "username": "josuyoshi",
    "rating": 2.0,
    "comment": "200$ inv",
    "timestamp": 1697234400
  },
  {
    "username": "Priestess_of_Neptune",
    "rating": 2.0,
    "comment": "2-6 player, best 4.",
    "timestamp": 1694296800
  },
  {
    "username": "tothrmate",
    "rating": 2.0,
    "comment": "Go to Australia...",
    "timestamp": 1674601200
  },
  {
    "username": "TomJanssens",
    "rating": 2.0,
    "comment": "I only ever play this to humour my wife who, for some elusive reason (probably nostalgia) likes this game. I hate it. It’s flawed and doesn’t stand up to any other game in the collection, so why spend multiple hours on it?",
    "timestamp": 1672614000
  },
  {
    "username": "Khan3",
    "rating": 2.0,
    "comment": "V",
    "timestamp": 1668380400
  },
  {
    "username": "Yokiboy",
    "rating": 2.0,
    "comment": "After trying Axis & Allies, World at War, and other wargames I just can't go back to Risk.",
    "timestamp": 1668207600
  },
  {
    "username": "genresavvy",
    "rating": 2.0,
    "comment": "This game has issues just so many, it last forever and the math favors playing slower. The overall game is old and bad luckily there are lots of great replacements.",
    "timestamp": 1664748000
  },
  {
    "username": "kamomillatee",
    "rating": 2.0,
    "comment": "I liked this a lot when I was a kid but it just doesn't cut anymore. So much better games out there",
    "timestamp": 1663624800
  },
  {
    "username": "Ahmadneama",
    "rating": 2.0,
    "comment": "2 for components. Otherwise a hard 1",
    "timestamp": 1662674400
  },
  {
    "username": "Hispanus",
    "rating": 2.0,
    "comment": "Tiradados consistente en pegar al primero. No se puede perder el tiempo en jugar al Risk.",
    "timestamp": 1662501600
  },
  {
    "username": "AudunAgnar",
    "rating": 2.0,
    "comment": "Very outdated, and immensely overrated. There are thousands of WAAAY better board games than this today. But still, once you tell people that you like \"complicated\" board games, most of them go \"You mean like Risk? Or Monopoly?\"\n\nAt leats this is better than Monopoly",
    "timestamp": 1657749600
  },
  {
    "username": "the_ryno",
    "rating": 2.0,
    "comment": "Why did I play this so much as a kid?",
    "timestamp": 1655416800
  },
  {
    "username": "joshua109",
    "rating": 2.0,
    "comment": "Played it a large handful of times growing up, and enjoyed it at the time. Now that I've played some other dudes-on-a-map war boardgames, I can see how sub-par the dice-rolling, turtling, gang-up prone mechanics of Risk are when compared to better entries in the genre.",
    "timestamp": 1653256800
  },
  {
    "username": "Korwin",
    "rating": 2.0,
    "comment": "Old game and not good one.\nTakes ages",
    "timestamp": 1650664800
  },
  {
    "username": "PepaSed",
    "rating": 2.0,
    "comment": "I got this game when I was a child. At the first look I was captivated by it. I was trying to convice others to try this with me and finally when I played it, I realized that it was just boring.\n\nChess and computer games were just much better than this.",
    "timestamp": 1648850400
  },
  {
    "username": "Poptech",
    "rating": 2.0,
    "comment": "The over-hyped classic strategy game I wanted to love but instead found long and tedious. A game that is still as bad as I remembered it. This game actually ends as soon as one player gains significant momentum midway through while the rest of the players wait to slowly die since there is no way for them to recover. I did not find spending hours of my time in a hopeless death spiral fun.\n\nShogun (AKA Ikusa) is a superior game that gives players far more tactical choices and deeper strategies.",
    "timestamp": 1647558000
  },
  {
    "username": "AmesGames",
    "rating": 2.0,
    "comment": "Abysmal game design. A boring lethargic slog with worthless random combat. This was never good. I like the board game map, that's it.",
    "timestamp": 1647126000
  },
  {
    "username": "Koko_Lores",
    "rating": 2.0,
    "comment": "AHN / STO / TVT",
    "timestamp": 1643497200
  },
  {
    "username": "rcog",
    "rating": 2.0,
    "comment": "Easy war game to play with kids. \"Sudden death\" mechanism ensures games don't drag for too long.",
    "timestamp": 1634853600
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "120 Min 2–6 Players p2 p3 p4 p5 p6 Weight: 2.08 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "Tjorriemorrie",
    "rating": 2.0,
    "comment": "So random it is pointless",
    "timestamp": 1629064800
  },
  {
    "username": "Desigual",
    "rating": 2.0,
    "comment": "You should try Quartermaster General instead of this!",
    "timestamp": 1628028000
  },
  {
    "username": "Niklahun",
    "rating": 2.0,
    "comment": "Never ever again, broken mechanics",
    "timestamp": 1618610400
  },
  {
    "username": "lindre3000",
    "rating": 2.0,
    "comment": "Mediocre game, takes all day to play.",
    "timestamp": 1618178400
  },
  {
    "username": "SlantyME",
    "rating": 2.0,
    "comment": "Stupid luck of the dice - hate dice games.",
    "timestamp": 1617228000
  },
  {
    "username": "Phenomona_Obscura",
    "rating": 2.0,
    "comment": "One of my very worst gaming memories involved Risk.\n\nThe other one is Chess.",
    "timestamp": 1615071600
  },
  {
    "username": "Old Svedala",
    "rating": 2.0,
    "comment": "RISK... What is there to say? Loved it as a child. Hate it now (because of the runaway problem and that it drags on forever). You can never persuade me to play this game again. ...even now when my kids have reached the \"Risk age\".\nRecently bought Risk Europe which, though not perfect, is a much better game.\nUpdate: Persuaded my kids to try Memoir 44 instead, and I think that my old copy of RISK will stay permanently on the shelf from now on.\nUpdate: Finally gave it away to a flee market.",
    "timestamp": 1612306800
  },
  {
    "username": "perzsa",
    "rating": 2.0,
    "comment": "Van aki nem ismeri? Harcolás kockadobással, nagy szerencsefaktorral. Fiatalon jó volt - \"hűű katonák\", felnőtt fejjel már unalmasabb lehet. Nagyon rég nem játszottuk már.",
    "timestamp": 1611529200
  },
  {
    "username": "ali16590",
    "rating": 2.0,
    "comment": "Naimans",
    "timestamp": 1608591600
  },
  {
    "username": "Stolen_Goods",
    "rating": 2.0,
    "comment": "Has a few redeeming qualities, but ultimately causes more arguments than it's worth. I will actively avoid it whenever possible for my own mental health and that of everyone around me.\n\n12/4/2020: Nah. Never playing again. 3 -> 2.",
    "timestamp": 1607036400
  },
  {
    "username": "BradJacobs",
    "rating": 2.0,
    "comment": "An eternal wargame driven by luck of the draw and luck of the dice, with grueling, bickering, and annoyances aplenty.",
    "timestamp": 1606863600
  },
  {
    "username": "Nactra",
    "rating": 2.0,
    "comment": "Completely outdated, there is no reason to play this instead of any other wargame. Deserve credit for paving the way, but it's over",
    "timestamp": 1606604400
  },
  {
    "username": "Woodland_Alliance",
    "rating": 2.0,
    "comment": "This game is just a tug of war",
    "timestamp": 1604185200
  },
  {
    "username": "dragooned",
    "rating": 2.0,
    "comment": "A classic EVERYONE has played. Not a simulation, but teaches basic geography to kids. NO NAVIES!",
    "timestamp": 1602021600
  },
  {
    "username": "Fuzzel",
    "rating": 1.5,
    "comment": "Würfelglück Irrsinn.",
    "timestamp": 1598306400
  },
  {
    "username": "JamesTS",
    "rating": 2.0,
    "comment": "Everyone should play this at least once, but honestly there’s better strategy games out there, and I’ve found that this one always seems to bring out the worst in people. Myself included.",
    "timestamp": 1596751200
  },
  {
    "username": "Virabhadra",
    "rating": 2.0,
    "comment": "\"High strategy\" normally devolves into a 'Jihad' variant, whereby every army that can attack on your turn MUST attack until no longer able to do so.\n\nUPDATE: I'd originally given this a 6, which was a nostalgia rating because I played nearly every weekend with my friends in high school. Turns out it just doesn't hold a candle to Nexus Ops' blowtorch of Ameritrash excellence.",
    "timestamp": 1594764000
  },
  {
    "username": "Daniellefler",
    "rating": 2.0,
    "comment": "I used to play this with my friends after high school when you would get together during the holidays when we were in college. Almost always drug on and elimination makes it really boring for those players. Usually ends up the people rely on turning in their cards to get huge armies and then they were just be a big counter-attack back and forth. Also, for some reason whoever went got Australia would always win.",
    "timestamp": 1594245600
  },
  {
    "username": "Treasure01",
    "rating": 2.0,
    "comment": "Really bad Doam game. The classic, but the themed risks are at least a little better",
    "timestamp": 1576537200
  },
  {
    "username": "NowOrNever88",
    "rating": 2.0,
    "comment": "Played app but not for a full game. It's combat reminds me of Cyclades with more dice rolling but I'm not a fan. You can get hosed even with majority troops because the enemy rolls more 6s etc, and there's a lot of back and forth to fully conquer territories so it takes a long time too.",
    "timestamp": 1571781600
  },
  {
    "username": "reeactive",
    "rating": 2.0,
    "comment": "Meh. Just woull play if in the mood.",
    "timestamp": 1571090400
  },
  {
    "username": "Chrono92",
    "rating": 2.0,
    "comment": "Hate the amount of luck the combat has. Also I don't like the way players make alliances.",
    "timestamp": 1569189600
  },
  {
    "username": "PCfromNYC",
    "rating": 2.0,
    "comment": "Avoid. Get the Legacy version if you must.",
    "timestamp": 1563832800
  },
  {
    "username": "Catstacker",
    "rating": 2.0,
    "comment": "I don't know why I still have this game;\nit takes forever to play\nand it all comes down to who gets Australia.",
    "timestamp": 1563400800
  },
  {
    "username": "OMD56",
    "rating": 2.0,
    "comment": "A classic in its own right. The problem to it is that there is no end. Games can last for quite some time and really there is no progress. It gets to a point where one army attacks a single nation, grabs the card and ends their turn. Then it repeats for the next player. It's all about the build up in those \"final turns/hours\" with the luck of a turn-in. Would be a much better game if goals were set or the total time were to be decreased. But with a goal of \"conquer the world,\" it's vastly too long.",
    "timestamp": 1557352800
  },
  {
    "username": "Pierce",
    "rating": 2.0,
    "comment": "Dozens of plays in my youth. I can remember some of those being tense and enjoyable but most of my memories are of a game that lasts way too long for what really ends up being decided by luck.",
    "timestamp": 1557180000
  },
  {
    "username": "Khumbanigash",
    "rating": 2.0,
    "comment": "I simply hate this game. Period. It is basically a two-player game. The other folks on the table usually have no chance to get back in the game after an unlucky start - and have to watch the others play for an hour or two. Bad.",
    "timestamp": 1556834400
  },
  {
    "username": "MrElusive603",
    "rating": 2.0,
    "comment": "The combat has about as much strategic depth as Yahtzee; as in, it relies entirely on luck of the dice. Nothing is more frustrating than seeing your huge invasion force crushed by a single foot soldier who keeps rolling sixes on defense. You might as well decide the battle outcome using a coin toss. It's be a lot quicker.\n\nSecondly, the map design means that all continents have choke-points that cannot be flanked. This leaves the attacker with two choices:\n\n1. Brute force their way through the choke-point and pray for good dice rolls in combat.\n2. Go all the way around the map to attack from another angle (assuming your opponent hasn't bottlenecked that area too).\n\nHowever #2 doesn't apply if attacking Australia, because Australia only has ONE choke-point in Indonesia. This gives the defending player a huge advantage as they don't have to spread their forces at all. (If you image search for the Risk board, you'll see exactly what I'm talking about)\n\nThe bad map design also creates a \"runaway leader\" problem. The number of troops you get per turn is dependent on how many territories you own. If you own a whole continent you get a bonus. In every game I've played, the first player to own two continents ends up winning. Not only will they get far more troops that everyone else per turn, the choke-point map design allows them to turtle up until they have a huge army. This is especially true for the player who holds Australia.\n\nUnsurprisingly, we only played this game twice before it was permanently shelved. Don't waste your money on it.",
    "timestamp": 1555106400
  },
  {
    "username": "che2487",
    "rating": 2.0,
    "comment": "Nostalgiaaaaa....\n\nPart of Trade for new copies of the 2 TI3 expansions",
    "timestamp": 1553986800
  },
  {
    "username": "airjudden",
    "rating": 2.0,
    "comment": "If not for this game and Monopoly, there would be a lot more gamers in this world.\n\nAs a wargamer, this one really pisses me off because when I say I play wargames, I will assuredly get the response, \"Is it like Risk?\"\n\nWell, if Risk didn't suck, then yeah... maybe.\n\nI love dice. Risk can make me (temporarily) hate dice. There is no thought and no strategy to the game. It takes way too long, and has no payoff.\n\nI'd rather play Axis & Allies, and I don't like that game, either.",
    "timestamp": 1552863600
  },
  {
    "username": "Groule",
    "rating": 2.0,
    "comment": "I have much suffered from this game during my childhood as later as an adult. Everytime I hear \"let's play Risk!\" I just want to run away. I don't understand why in 2019 so much people still love this boring, never-ever-ending game. It acted for me as a vaccine against board games, for years. We are in the golden age of board games and now this is time to wake up and to discover the many beautiful and ingenious games available. There are risk/monopoly/game of life/clue-like commercial games and there are real board games. These are two different worlds!",
    "timestamp": 1550098800
  },
  {
    "username": "GingerLi",
    "rating": 2.0,
    "comment": "Who even plays this? Long, dull, and not that tactical.",
    "timestamp": 1545433200
  },
  {
    "username": "enavico",
    "rating": 2.0,
    "comment": "- Classic game of pure luck...",
    "timestamp": 1539554400
  },
  {
    "username": "Krshna",
    "rating": 2.0,
    "comment": "A game of pure chance disguised as a strategy game.",
    "timestamp": 1537221600
  },
  {
    "username": "deepskyblue",
    "rating": 2.0,
    "comment": "Sometimes there's some strategy as to where to position and invade with your troops, but that's the only interesting thing. Most of the game, instead, is a repetitive drag of endless dice-rolling. Not worth the time.",
    "timestamp": 1534197600
  },
  {
    "username": "bvb4life",
    "rating": 1.8,
    "comment": "14942",
    "timestamp": 1532296800
  },
  {
    "username": "alexs34",
    "rating": 2.0,
    "comment": "I'm not sure, but it's entirely possible that I've never actually enjoyed playing Risk, like ever.",
    "timestamp": 1530741600
  },
  {
    "username": "Finn Krogstad",
    "rating": 1.8,
    "comment": "Once upon a time this was one of the best games out there, but why do people still play it now?",
    "timestamp": 1525125600
  },
  {
    "username": "Acslater64",
    "rating": 2.0,
    "comment": "Played for the first time at a friends house. Mechanics are very simple, not much strategy, just hope that your dice rolling is on point.",
    "timestamp": 1524434400
  },
  {
    "username": "WilcoxDave",
    "rating": 2.0,
    "comment": "I do not like player elimination games especially for long games.",
    "timestamp": 1522274400
  },
  {
    "username": "enderhuntiii",
    "rating": 2.0,
    "comment": "Way too much luck. One of the games that drives people out of board gaming because it's so flawed.",
    "timestamp": 1518130800
  },
  {
    "username": "Hannibal Barca",
    "rating": 1.5,
    "comment": "Too much chance, no skill.",
    "timestamp": 1517871600
  },
  {
    "username": "Kingswood",
    "rating": 2.0,
    "comment": "Worst dice chucking nonsense ever created. Advanced phases near the end of the game are something I would never wish even to my enemy. I did not gave 1 star only because of the respect to the production date of this game.",
    "timestamp": 1517871600
  },
  {
    "username": "Kingsoby1",
    "rating": 2.0,
    "comment": "Not fun",
    "timestamp": 1517698800
  },
  {
    "username": "Niluna",
    "rating": 2.0,
    "comment": "This game is not for me in any way. I despise the dice rolling to determine the battles. Sure, statistics plays a roll, but that's still so much left to chance. It feels rather mindless. A lot of miniatures on a non-changing map with a lot of who has better dice rolls. At least, that's the feel it gives me.",
    "timestamp": 1515711600
  },
  {
    "username": "tiagoVIP",
    "rating": 3.0,
    "comment": "Just turtle your way to victory. Or hold steady until people give up - which is way more often, as once a couple of players are eliminated, those still playing often just end up quitting.",
    "timestamp": 1760306400
  },
  {
    "username": "WaffleBoi",
    "rating": 3.0,
    "comment": "I never really liked this game even as a kid. Maybe that was because I wasn't any good at it. But more likely because it drags on for hours and most games I played usually ended by somebody getting bored and smashing the little pieces off the board.\n\nA friend of mine made a version called Nuclear Risk where you can play the Risk Cards to nuke that particular country off the map, never to return. Then, when a portion of the map gets isolated from the rest, the smaller portion is completely eliminated from play. This makes the game chaotically fun and lasts about an hour. It's very random though, so there's not a lot of strategy. But I'll play that version.",
    "timestamp": 1759788000
  },
  {
    "username": "Imsevimse",
    "rating": 3.0,
    "comment": "A classic—everyone’s at least heard of it. Known for lots of dice chucking and a bare minimum of rules, I’d never play this today, and even back then it wasn’t exactly stellar. It was just a really popular mass-market game.",
    "timestamp": 1758924000
  },
  {
    "username": "Markus Hagenauer",
    "rating": 3.0,
    "comment": "What looks rather tactiacl at first, but is mainly about luck in fact.",
    "timestamp": 1757109600
  },
  {
    "username": "rongbeo93",
    "rating": 3.0,
    "comment": "This game is an absolute time-sink, and the constant luck from dice rolls is the final nail in the coffin. I absolutely hate it.",
    "timestamp": 1756677600
  },
  {
    "username": "rexkow",
    "rating": 3.0,
    "comment": "It is impossible to be the only man standing in an old fashion version of this game. Last 3 people will eventually get bored of annoying eliminated players and agree to slit a win. It is a classic and has some better new versions but on its own it didn't stand the test of time.",
    "timestamp": 1756072800
  },
  {
    "username": "Kaengi",
    "rating": 3.0,
    "comment": "Such an old version of risk.\n\nTo be honest though, the nostalgia is funny, but the game itself is absolutely dated, there are way better strategy options nowadays and this old design really stinks.",
    "timestamp": 1755036000
  },
  {
    "username": "riphoenix",
    "rating": 3.0,
    "comment": "English Vintage Collection wooden box edition 2009\nAll pieces accounted for. Practically unplayed. Box has some scratches and scruffs.",
    "timestamp": 1753221600
  },
  {
    "username": "rharn",
    "rating": 3.0,
    "comment": "Flawed design, boring gameplay, AND takes forever to complete a game -- the holy trinity of garbage.",
    "timestamp": 1753048800
  },
  {
    "username": "Food_Please",
    "rating": 3.0,
    "comment": "Battle for world domination with your friends - Fun idea, but very swingy, luck-dependent, frustrating, drawn-out implementation.\n\nI hope I never have to play this again. 3 stars because it is at least a lot more fun than Monopoly.",
    "timestamp": 1751925600
  },
  {
    "username": "maritn",
    "rating": 3.0,
    "comment": "No reason to play risk with the options available. Outdated.",
    "timestamp": 1746309600
  },
  {
    "username": "Hugmenot",
    "rating": 3.0,
    "comment": "3 - Bad - likely won't play this again\n\nIt's unlikely that I will ever play Risk again but I have many happy memories from childhood to get rid of my copy.",
    "timestamp": 1745964000
  },
  {
    "username": "John Tenzer",
    "rating": 3.0,
    "comment": "Luck-based, roll your dice outcomes with no particular agency on the players side other than to choose battlesides (countries) to duel it out with a opponent. Since there is also player elimination as a core mechanic and matches last for roughly 2-3 hrs (depending on player count) or longer, this game is a HARD PASS! for me - unless kids would force me to spend time with them and this game.\n\nIf not I'd always choose the much superior and dynamic (and due to secondary market sales cheaper) out of print \"MARNON/Wizards' Quest\" or IKUSA/SHOGUN over RISK when given the chance.",
    "timestamp": 1744668000
  },
  {
    "username": "benjaminehlers1",
    "rating": 3.0,
    "comment": "I played this in elementary school and hated it even then. Although that might partly be due to J.L. who openly and brazenly cheated with adding extra troops and stealing resources...",
    "timestamp": 1743458400
  },
  {
    "username": "Elius404",
    "rating": 3.0,
    "comment": "Ends in a stalemate way too often",
    "timestamp": 1741906800
  },
  {
    "username": "zamn24",
    "rating": 3.0,
    "comment": ": (",
    "timestamp": 1740438000
  },
  {
    "username": "PierreHM",
    "rating": 3.0,
    "comment": "It’s a long game, but you can shorten it.\nFor a game from the late 50’s it’s good!",
    "timestamp": 1740351600
  },
  {
    "username": "RikHavok",
    "rating": 3.0,
    "comment": "2/25",
    "timestamp": 1740351600
  },
  {
    "username": "Joel2014",
    "rating": 3.0,
    "comment": "Too much luck, but for some players it is the non plus ultra...only if i am forced to",
    "timestamp": 1738710000
  },
  {
    "username": "orthros",
    "rating": 3.0,
    "comment": "It's better than Monopoly at least",
    "timestamp": 1736290800
  },
  {
    "username": "Namenotfound999",
    "rating": 3.0,
    "comment": "This takes too long to setup, takes too long to play it, and already around is really, really, REALLY! boring",
    "timestamp": 1736031600
  },
  {
    "username": "mephezar",
    "rating": 3.0,
    "comment": "martina, zweites exemplar: Dachboden",
    "timestamp": 1733871600
  },
  {
    "username": "janus23",
    "rating": 3.0,
    "comment": "This game is super bad designed. Whoever gets Australia wins the game - every time. Super boring.",
    "timestamp": 1730502000
  },
  {
    "username": "andy61",
    "rating": 3.0,
    "comment": "Classic war game but so random and long-winded!",
    "timestamp": 1730415600
  },
  {
    "username": "krydland",
    "rating": 3.0,
    "comment": "Best med: 4 (5)",
    "timestamp": 1728684000
  },
  {
    "username": "Hymn_of_Limbo",
    "rating": 3.0,
    "comment": "Bring a bucket of doomsday mac and cheese, hole up in Australia and try and outlast time itself.",
    "timestamp": 1728511200
  },
  {
    "username": "Antar3s",
    "rating": 3.0,
    "comment": "The area control nature of this game makes this attractive, but the gameplay... Very long, repetitive and random.",
    "timestamp": 1722981600
  },
  {
    "username": "Croquet",
    "rating": 3.0,
    "comment": "Classic game, luck is dominating. Long and boring.",
    "timestamp": 1722549600
  },
  {
    "username": "ChillernChurchill",
    "rating": 3.0,
    "comment": "Is only played if no one knows what else to play, but it is easy to understand and can be played with family.",
    "timestamp": 1720908000
  },
  {
    "username": "Redweek",
    "rating": 3.0,
    "comment": "Good idea, but too long and everything too much depends on the dice",
    "timestamp": 1720735200
  },
  {
    "username": "Bal_505",
    "rating": 3.0,
    "comment": "Slog. The combo of taking awhile to play and involving a lot of picking on others is not great.",
    "timestamp": 1719698400
  },
  {
    "username": "Nyan",
    "rating": 3.0,
    "comment": "I've played it. It exists.",
    "timestamp": 1719612000
  },
  {
    "username": "Dabond",
    "rating": 3.0,
    "comment": "Just way too long! Once the majority is gained, no way to recover. Watching the crawl to total domination for two hours. Wasted time.",
    "timestamp": 1719180000
  },
  {
    "username": "dakotamassie",
    "rating": 3.0,
    "comment": "This game is not worth the risk",
    "timestamp": 1717624800
  },
  {
    "username": "thestoryguy",
    "rating": 3.0,
    "comment": "Games where someone gets eliminated and watches the rest is not a fun game.",
    "timestamp": 1715205600
  },
  {
    "username": "KevinNoBacon",
    "rating": 3.0,
    "comment": "There are other games that do this way better, without the long runtime and player elimination.",
    "timestamp": 1713650400
  },
  {
    "username": "Isaiah_Stuart",
    "rating": 3.0,
    "comment": "Why bother? There are tons of better options for wargames at this point. If you really like the dice-rolling, at least get Axis & Allies, which is at least interesting and has a manageable win condition. Better yet, get Dune, the greatest wargame ever made.",
    "timestamp": 1712959200
  },
  {
    "username": "Gia187",
    "rating": 3.0,
    "comment": "Duurt te lang voor wat het is maar blijft ok gezien de nostalgie.",
    "timestamp": 1710716400
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "As a kid I loved this - long dice battle games for the conquest of the world. But as an adult boardgames have evolved.",
    "timestamp": 1709420400
  },
  {
    "username": "Nebucadnezzar",
    "rating": 3.0,
    "comment": "Toss?",
    "timestamp": 1707087600
  },
  {
    "username": "Vorpa",
    "rating": 3.0,
    "comment": "When you've conquered the world except for chile and argentina and the blue player in argentina than kicks out the green one in chile and wins.....\nIt has some nice idea's and in it's day and age it was probably pretty okay. Unlike diplomacy, this one did not survive the test of time.",
    "timestamp": 1705100400
  },
  {
    "username": "miofelia",
    "rating": 3.0,
    "comment": "Not deluxe",
    "timestamp": 1704495600
  },
  {
    "username": "Ramen",
    "rating": 3.0,
    "comment": "I don’t enjoy the dice mechanic in this and the rest of the rest of the mechanics don’t make up for it.",
    "timestamp": 1702249200
  },
  {
    "username": "Elvatuar",
    "rating": 3.0,
    "comment": "Poor implemantation of an interesting idea: conquering the world. Too much luck involved for a strategy-heavy game. A relic from the olden days.",
    "timestamp": 1700953200
  },
  {
    "username": "adealisadeal",
    "rating": 3.0,
    "comment": "alright war game, it is just too long. I had a game that once outlived my dnd campaign (Im not joking). For its legth, every game ironoically feels identical. So many issues with length could be fixed with a point system, like is seen in the 2008 version. These also is the issue of dice deciding wins, as opposed to the fun decision wheel in dune.",
    "timestamp": 1700780400
  },
  {
    "username": "Lapin_Malin",
    "rating": 3.0,
    "comment": "Games are too long, fights are too random, and players can be eliminated rather early.",
    "timestamp": 1700434800
  },
  {
    "username": "Amerie",
    "rating": 3.0,
    "comment": "No mission cards, world domination only",
    "timestamp": 1696111200
  },
  {
    "username": "aggiejfreak",
    "rating": 3.0,
    "comment": "Too much emphasis on dice = too much luck.\nClassic game though, with sentimental value making it playable, if nothing else.",
    "timestamp": 1693951200
  },
  {
    "username": "Blubberblase1984",
    "rating": 3.0,
    "comment": "One of the games one playes as a child. Was ok at the time, because nothing better was available. If someone suggested to play it, I guess I would skip it.",
    "timestamp": 1692223200
  },
  {
    "username": "TalesWithinWheels",
    "rating": 3.0,
    "comment": "I played a lot of this in high school. We had a weekly game going for a little over a year. It was less about the game on the table and more about the game above the table. It would last hours while we had secret meetings and passed secret messages with crosses and double crosses. We played with modified rules that were far more flexible in terms of grand campaigns and far more punishing in terms of reinforcements. We had fun, but I will not return to it.",
    "timestamp": 1690236000
  },
  {
    "username": "Magnusson",
    "rating": 3.0,
    "comment": "3 - likely won’t play this again\n\nPlayed it when I was younger, because that was the most well-know boardgame besides Monopoly. The snowball effect of getting more cards by winning a battle, combined with the luck of dice rolls, is what killed it for me.",
    "timestamp": 1689890400
  },
  {
    "username": "Vinetou",
    "rating": 3.0,
    "comment": "Too simple, no tactics.\nshallow, but sometimes fun for casuals, player elimination is hardcore...",
    "timestamp": 1689026400
  },
  {
    "username": "ILoseAtLife",
    "rating": 3.0,
    "comment": "While I do feel a fair amount of nostalgia for this dice chucking game of world conquest (that I spent considerable hours of my childhood playing), the truth is that there are countless other vastly superior games out there.",
    "timestamp": 1687557600
  },
  {
    "username": "Oninohugo",
    "rating": 3.0,
    "comment": "Never ending dudes on a map with set collection and uneven positions.",
    "timestamp": 1684879200
  },
  {
    "username": "ckomiya",
    "rating": 3.0,
    "comment": "100",
    "timestamp": 1684274400
  },
  {
    "username": "Spielmann_",
    "rating": 3.0,
    "comment": "It is an excellent game to play on a digital device, but you don't want to play it as a board game.",
    "timestamp": 1683583200
  },
  {
    "username": "Subaru77",
    "rating": 3.0,
    "comment": "Ó, azok a régi emlékek, amikor éjjelbe menő küzdelmeket folytattunk, megsértődtünk, 2 alkalommal felborítottuk a játéktáblát... - de szerettük.\nFelnőtt fejjel is előkerült egy alkalommal. Minősíthetetlenül rossz játékélményt nyújtott.",
    "timestamp": 1683583200
  },
  {
    "username": "Schlopsi",
    "rating": 3.0,
    "comment": "I would love it so much if only there would be a balance mechanism in place once one player is obviously loosing. We barely finished a round, because it gets so frustrating once you cannot actively do anything to counter.",
    "timestamp": 1682460000
  },
  {
    "username": "tamsynulthara",
    "rating": 3.0,
    "comment": "Come on. Who doesn't just load everything into Australia at the outset and go for broke?",
    "timestamp": 1679612400
  },
  {
    "username": "KarenAB",
    "rating": 3.0,
    "comment": "My husband likes this game, but I get bored with the endless dice rolling and seemingly continuous stalemate. It's like the Western Front during WWI without the mud.",
    "timestamp": 1678230000
  },
  {
    "username": "Olaph",
    "rating": 3.0,
    "comment": "This game defines my entry into the hobby, but the long play time and the proclivity to turtling and kingmaking annoy me now. I've fired it and hired Dust to do its job.\n\n**#GeekSort-Exclude**",
    "timestamp": 1675983600
  },
  {
    "username": "fwkruger",
    "rating": 3.0,
    "comment": "This lacks any mechanism to get back into the game if you've had an unlucky start",
    "timestamp": 1675119600
  },
  {
    "username": "Lincoln6",
    "rating": 3.0,
    "comment": "I hate this game but my husband loves it and calls it the best game ever.\nI just ordered root, hopefully I will enjoy it and it will scratch his risk itch.... otherwise I guess there is kemet to try.",
    "timestamp": 1675033200
  },
  {
    "username": "mrdollar11",
    "rating": 3.0,
    "comment": "I mean, it's a classic. That's all it's got going for it.",
    "timestamp": 1674946800
  },
  {
    "username": "Lawster",
    "rating": 3.0,
    "comment": "Thrifted for the component miniatures and the clear component cases in some editions. Gameplay is boring and takes too long compared to so many other great games on the market.",
    "timestamp": 1672095600
  },
  {
    "username": "basejester",
    "rating": 3.0,
    "comment": "- Too long\n- Kingmaking\n- Random combat",
    "timestamp": 1667430000
  },
  {
    "username": "CRiker64",
    "rating": 3.0,
    "comment": "A real torture as a board game.",
    "timestamp": 1666044000
  },
  {
    "username": "Netlimpopo",
    "rating": 3.0,
    "comment": "Without house rules it is too long and imbalanced. Replaced by the much better Star Wars edition.",
    "timestamp": 1665439200
  },
  {
    "username": "hoponboard4now",
    "rating": 3.0,
    "comment": "Classic Risk played with the orignial rules (World Domination or even with Mission Cards) isn't very good at all - in fact a let down and grossly unfair in my opinion. I would never ever play this game as such (except maybe with 3 or 4 players as then there seems to be sort of a balance between missions) - thus my poor rating of 3pts. You might scream out in terror if I'm out of my mind (well, there's always reason to suggest that)? But consider folloing example: If you play a 6 player game and someone gets the card - kill the red army this will be exceptionally easy and in fact very often an opponent of yours might resolve this mission for you by eradicating this particular army. The same task is next to impossible in a 2-player game. Whereas in a 6 player game it's next to impossible to complete some of the continent-related missions.\n\nOne problem that Classic Risk will always have is that the player who starts first has a significant advantage and that Australia is only attackable through one connection.\n\nClassic Risk in my mind is a brilliant game (would give it a 9 or 9.5) if a few simple house rules are implemented. If you enjoy the social interaction with your mates try the following:\n\n1.Invite 6 friends\n2.Build 3 teams (2 players per team)\n3.Every team draws 2 mission cards with the task to fulfill one mission of their choice.\n4.Dismiss \"Defeat the army with the colour ....\" missions\n\nPlayed the above described altered Classic Risk countless times and 'priceless' is the only word to describe the fun and enjoyment I got out of it.\n\nEnjoy!",
    "timestamp": 1664143200
  },
  {
    "username": "icortezi",
    "rating": 3.0,
    "comment": "A simple classic. However, there are better options when it comes to sitting around a table to play a board game.",
    "timestamp": 1663192800
  },
  {
    "username": "Scossa",
    "rating": 3.0,
    "comment": "Played few times before jump in the hobby. A game that should be length 45 minutes takes hours. Once I played 2 consecutive days in 5 players, the hell.",
    "timestamp": 1662760800
  },
  {
    "username": "Analytical",
    "rating": 3.0,
    "comment": "Unbalanced, random dice rolling and can take forever. This game is outclassed in every way.",
    "timestamp": 1661292000
  },
  {
    "username": "ChrisLaning",
    "rating": 3.0,
    "comment": "There's no meat on this fish, throw it back in the water.",
    "timestamp": 1659132000
  },
  {
    "username": "Legringo",
    "rating": 3.0,
    "comment": "Urgh... how could i ever have played more than 100 games of this. Crazy. You could call it the battle for Australia...",
    "timestamp": 1658008800
  },
  {
    "username": "Roblebob91",
    "rating": 3.0,
    "comment": "Nobody will give you back the lifetime you lost playing this game... Loads of better options for a strategic board game evening!\nImpeRunde and Ankh are among the best alternatives.",
    "timestamp": 1652220000
  },
  {
    "username": "Luke23007",
    "rating": 3.0,
    "comment": "played alot as a kid but i remember it taking FOREVER to play.",
    "timestamp": 1651960800
  },
  {
    "username": "absurdistkobold",
    "rating": 3.0,
    "comment": "Too luck dependent and too long. The core idea isn't terrible, but little about the execution is particularly engaging.",
    "timestamp": 1651874400
  },
  {
    "username": "Jestertrek",
    "rating": 3.0,
    "comment": "If I play it, it's only to be polite. It combines my two least favorite mechanics: pushing players out of the game and making everyone but the winner hate their life as they wait days for their turn. It's possible to lose without getting a single turn.",
    "timestamp": 1650837600
  },
  {
    "username": "perforatore",
    "rating": 3.0,
    "comment": "+strategic\n+alliances & traitors\n+exiting risk moves\n-dice mechanism can crush the best tactics\n-starting position is crucial for winning/losing\n-playing time is to long for this simple mechanics\n-it makes interested people bored about board games",
    "timestamp": 1649800800
  },
  {
    "username": "alfman",
    "rating": 3.0,
    "comment": "Always getting old.",
    "timestamp": 1648591200
  },
  {
    "username": "wouter7048",
    "rating": 3.0,
    "comment": "Location: Spel 2 Verhuisdoos op zolder\nType: Family, Wargames",
    "timestamp": 1647212400
  },
  {
    "username": "KimTjik",
    "rating": 3.0,
    "comment": "Pretty boring. There's a desperate need for a good setting, some beer, good food, to make this endurable.",
    "timestamp": 1646521200
  },
  {
    "username": "aggiefanatic95",
    "rating": 2.8,
    "comment": "I like maps alot, that is the only redeeming thing about this game.",
    "timestamp": 1645138800
  },
  {
    "username": "nuverian",
    "rating": 3.0,
    "comment": "Gifted",
    "timestamp": 1644620400
  },
  {
    "username": "kesulin",
    "rating": 3.0,
    "comment": "Juego de guerra donde se compite por territorios y continentes a fin de cumplir una misión secreta (diferente para cada jugador).\n\nReglas sencillas y fáciles de entender.\n\nPuede que algún jugador tenga mala suerte y pronto no tenga ninguna posibilidad de victoria, cosa que puede provocar que se aburra.\n\nDespués de los primeros 3 o 4 turnos, incluso antes de empezar (después del sorteo de territorios), se suele ver algún ganador claro.",
    "timestamp": 1644188400
  },
  {
    "username": "clokwrkpig",
    "rating": 3.0,
    "comment": "2-6 player",
    "timestamp": 1644188400
  },
  {
    "username": "alialkabah",
    "rating": 3.0,
    "comment": "hate this, very boring",
    "timestamp": 1644015600
  },
  {
    "username": "fordprefect42",
    "rating": 3.0,
    "comment": "The combat mechanic just doesn‘t work. It takes ages to roll all the dice for just one fight in the endgame. Very luck based and boring.",
    "timestamp": 1642719600
  },
  {
    "username": "Maxplanck12",
    "rating": 3.0,
    "comment": "Dice rolling and outcome randomness in a nutshell. The map practically encourages turtling and drawing out the game to a miserable length. It's honestly more like a lesson in probability than a game.",
    "timestamp": 1642460400
  },
  {
    "username": "Chawday",
    "rating": 3.0,
    "comment": "Tactics/Strategy. 4\nThematic Ties. 4\nEase of Play. 4\nAesthetics. 3\nComponents. 2\nReplayability. 2\nGame Length. 1\nPlayer Scale. 2\nPreference. 3\n\nTotal: 5.0\nGifted to Derek",
    "timestamp": 1642374000
  },
  {
    "username": "plushantonio",
    "rating": 4.0,
    "comment": "too long",
    "timestamp": 1760738400
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "War Game\n\nNot a great war game at all. The only positive contribution that this game ever made was that pop culture has some funny references to it. You'll find some better \"Dudes on a Map\" games.",
    "timestamp": 1759356000
  },
  {
    "username": "toorwell",
    "rating": 4.0,
    "comment": "It is possible to have fun with this game.",
    "timestamp": 1758924000
  },
  {
    "username": "WolfieRue",
    "rating": 4.0,
    "comment": "Classic but meh",
    "timestamp": 1757714400
  },
  {
    "username": "Imichan",
    "rating": 4.0,
    "comment": "Before BGG, played around 30 times on Steam.",
    "timestamp": 1757196000
  },
  {
    "username": "Avid_Equinox",
    "rating": 4.0,
    "comment": "Legacy game - there's plenty of games that do what this does but better now.",
    "timestamp": 1756159200
  },
  {
    "username": "Dgotrek",
    "rating": 4.0,
    "comment": "Once enjoyable, it gathers dust in the basement. It was simple and fun, but my tastes matured quickly. I haven't played since about 1982. It can really drag on with beat on the leader.",
    "timestamp": 1754863200
  },
  {
    "username": "mPony",
    "rating": 4.0,
    "comment": "This game takes far too long to play. We have to try it with a variant if we ever try it again.\n\nNot my copy",
    "timestamp": 1753394400
  },
  {
    "username": "Krisspear",
    "rating": 4.0,
    "comment": "A classic with goals and desicion making. Always kind of exciting to play, but the war 3 dice vs 2 dice, just lands about flat, and you do this A LOT. Seems like going first is a massive advantage, forcing the other players to gang up on Player 1 to have a fighting chance. Whenever I play this, player 1 won every time after reinforceing before everyone else. Maybe player 2 and 3 should start with more forces?\n\nI'd rather play something else, but right now in 2025, I do wanna give this an other go, to see if I've maybe played it wrong or underestimate it.",
    "timestamp": 1752703200
  },
  {
    "username": "DaneTheBeast",
    "rating": 4.0,
    "comment": "Played (IRL & ONLINE)",
    "timestamp": 1752184800
  },
  {
    "username": "pmmeyer",
    "rating": 4.0,
    "comment": "A surprising game. Despite its age, it is actually a decent board game. It has a lot of flaws, flaws fixed by later games, but of the classics, this one is still replayable.",
    "timestamp": 1750111200
  },
  {
    "username": "marhawkman",
    "rating": 4.0,
    "comment": "it's a classic for a reason, but later iterations are often better.",
    "timestamp": 1748642400
  },
  {
    "username": "FlurkyTurkey",
    "rating": 4.0,
    "comment": "Played every weekend as a child for many years. But it's been overtaken. It will still always have a place in my heart.",
    "timestamp": 1747951200
  },
  {
    "username": "Frog0fWar",
    "rating": 4.0,
    "comment": "3-5 (4)",
    "timestamp": 1747432800
  },
  {
    "username": "oursino",
    "rating": 4.0,
    "comment": "Trop de hasard.",
    "timestamp": 1744927200
  },
  {
    "username": "JeffPreston123",
    "rating": 4.0,
    "comment": "Was fun as a child, but there are many, many more interesting games now with the same level of complexity.",
    "timestamp": 1743458400
  },
  {
    "username": "Peekstrom",
    "rating": 4.0,
    "comment": "This belongs to the museum.",
    "timestamp": 1741993200
  },
  {
    "username": "TheVampireSaint",
    "rating": 4.0,
    "comment": "The more I play it the less I like it. IT would be better off if battles were determined by real strategy and/or count. Dice rolls can completely ruin a game. Losing a massive army to a single defending unit that rolls a '6' constantly is brutal.\n\nBasically, you're more likely to lose/win Risk to rolls, not anything you've actually done, and that's total garbage, but it's still fun to play from time to time.",
    "timestamp": 1739746800
  },
  {
    "username": "DonJunk",
    "rating": 4.0,
    "comment": "Last Verified\nFebruary 8, 2025\n\nAlso own\nRisk - English Vintage Collection wooden box edition (2005) product code 42750",
    "timestamp": 1739055600
  },
  {
    "username": "Bodobomb",
    "rating": 4.0,
    "comment": "The game is quite boring, relying heavily on dice. There are better games out there in the same genre that are much better.",
    "timestamp": 1737673200
  },
  {
    "username": "Mailman Mike",
    "rating": 4.0,
    "comment": "60th anniversary",
    "timestamp": 1737068400
  },
  {
    "username": "Amraam555",
    "rating": 4.0,
    "comment": "Constant back and forth push and pull that goes on for hours. Alliance and grievances, gang up and fight in a corner. Outlasts its welcome and good chance you won’t finish the game.",
    "timestamp": 1736550000
  },
  {
    "username": "bggmatje",
    "rating": 4.0,
    "comment": "[August 1999]\nClassic nostalgia war game that is outdated.",
    "timestamp": 1736290800
  },
  {
    "username": "guacamolen",
    "rating": 4.1,
    "comment": "Risk is not a luck-based game, but there is luck involved. Good strategy will almost always trump good luck here, but it's the word \"almost\" that makes this game aggravating. The time it takes to play is also a turn-off for a game that is so light.",
    "timestamp": 1735686000
  },
  {
    "username": "fussymongoose",
    "rating": 4.0,
    "comment": "Basic Game",
    "timestamp": 1734476400
  },
  {
    "username": "DerekW1968",
    "rating": 4.0,
    "comment": "play on:\nhttp://board-games.pogo.com/games/risk\nor: http://gamesbyemail.com/Games/Gambit\nor: iOS App (multiple versions)\n\nJordan has Hasbro games Vintage Collection wood box edition",
    "timestamp": 1734390000
  },
  {
    "username": "Rockugan",
    "rating": 4.0,
    "comment": "Ya desfasado pero para iniciar a alguien en este mundo no está mal",
    "timestamp": 1733266800
  },
  {
    "username": "MusicMikePro",
    "rating": 4.0,
    "comment": "To much randomness",
    "timestamp": 1732834800
  },
  {
    "username": "PremiumDays",
    "rating": 4.0,
    "comment": "Aged badly, but would play.",
    "timestamp": 1732748400
  },
  {
    "username": "TheBrainlessdude",
    "rating": 4.0,
    "comment": "Have I... ever FINISHED this game?",
    "timestamp": 1732662000
  },
  {
    "username": "Exo_",
    "rating": 4.0,
    "comment": "Does not stand up to its modern counterparts",
    "timestamp": 1731884400
  },
  {
    "username": "Soureliette",
    "rating": 4.0,
    "comment": "Trop de hasard",
    "timestamp": 1730934000
  },
  {
    "username": "Brucie_Lee",
    "rating": 4.0,
    "comment": "I don't have many great memories of playing the original game but I have played it a good number of times on the app and while it's definitely better, there are still miles better area control games to choose from.",
    "timestamp": 1729634400
  },
  {
    "username": "ChemicalCurry",
    "rating": 4.0,
    "comment": "VERY repetitive.",
    "timestamp": 1729029600
  },
  {
    "username": "mikesanerd",
    "rating": 3.6,
    "comment": "I sort of like the concept of this game, but it almost always devolves into the surviving players taking huge, sweeping turns, painting the board back and forth until one player tips the balance, like rocking a Coke machine back and forth for two hours and seeing which way it falls.",
    "timestamp": 1726610400
  },
  {
    "username": "Gimpzilla",
    "rating": 4.0,
    "comment": "I'm the sadist that explored the competitive meta through the app, more fun with objectives and digital has some nice game variations, also hear good things about Legacy but I haven't played.\n\nNot so good - but could play again.",
    "timestamp": 1724709600
  },
  {
    "username": "James DeBenedetti",
    "rating": 4.0,
    "comment": "Great introductory wargame that typically ends in a stalemate with experienced players.",
    "timestamp": 1724364000
  },
  {
    "username": "mawilson4",
    "rating": 4.0,
    "comment": "I have fond memories of Risk, but even those were a bit disjointed, and half of the games never got finished.\n\nIt's not one I'd ever want to return to, for a host of reasons: ponderous length, monotony of many turns, caprice of the dice rolls without properly rewarding strategic investment. Risk provided the bedrock from which many excellent games sprang, but on its own, it didn't age well.\n\nI keep this as a separate entry to \"Risk & Castle Risk\" because Castle Risk was the better - if lesser known - iteration.",
    "timestamp": 1723068000
  },
  {
    "username": "extrala",
    "rating": 3.5,
    "comment": "\"Childhood Classics\"",
    "timestamp": 1722895200
  },
  {
    "username": "DefLep7702",
    "rating": 4.0,
    "comment": "Another game I like the idea of, but the dice rolling luck factor becomes tedious after a bit.",
    "timestamp": 1722636000
  },
  {
    "username": "matin_rad1234",
    "rating": 4.0,
    "comment": "OK",
    "timestamp": 1722376800
  },
  {
    "username": "Racelympics",
    "rating": 4.0,
    "comment": "My mom left mid-game, so my sister took over. Sounds like something I wouldn’t like to play.",
    "timestamp": 1721858400
  },
  {
    "username": "titoim",
    "rating": 4.0,
    "comment": "It is good when its not frustrating.",
    "timestamp": 1720130400
  },
  {
    "username": "pers0n",
    "rating": 4.0,
    "comment": "2-6p, 120min",
    "timestamp": 1720044000
  },
  {
    "username": "BigToni22",
    "rating": 4.0,
    "comment": "UK",
    "timestamp": 1717106400
  },
  {
    "username": "yoyomanhihi",
    "rating": 3.5,
    "comment": "Very long game, that includes players elimination. The alliances and betrayals aspect can be interesting, but I think there are many games that do it better.",
    "timestamp": 1715205600
  },
  {
    "username": "Telaz",
    "rating": 4.0,
    "comment": "My rating(50%): 5\nMy “want to play-again” rating(50%): 3\nMy overall rating: 4\nPlays: 20+\n\nLord of the Rings risk is just better",
    "timestamp": 1713391200
  },
  {
    "username": "nummijemeo",
    "rating": 4.0,
    "comment": "The classic war game that gets out of hand really quickly and drags on for way too long.",
    "timestamp": 1713218400
  },
  {
    "username": "Hilted",
    "rating": 4.0,
    "comment": "Don't get me wrong, I would definitely play this with the right group but at the end of the day it's to lucky and way to long. Try to fight me in Australia though see what happens",
    "timestamp": 1713132000
  },
  {
    "username": "Spector1331",
    "rating": 4.0,
    "comment": "Just better games available.",
    "timestamp": 1712440800
  },
  {
    "username": "coolguitar7",
    "rating": 4.0,
    "comment": "Keeping for nostalgic reasons. Learned it after Monopoly, but when young became the one game I always wanted to play. Now have better versions of the same type of conflict, but I'd be willing to play this in the right circumstances.",
    "timestamp": 1711148400
  },
  {
    "username": "Animepops",
    "rating": 4.0,
    "comment": "Childhood memories. Base game was ok but got totally left behind once I discovered Axis and Allies. Legacy version is kinda cool though if you have a regular group.",
    "timestamp": 1710802800
  },
  {
    "username": "Windmark",
    "rating": 4.0,
    "comment": "Does nothing that other games do not do better. Dust is perhaps the most obvious straight-up improvement.",
    "timestamp": 1708988400
  },
  {
    "username": "Jittery Jester",
    "rating": 3.5,
    "comment": "Would rather play Axis & Allies or Smallworld to scratch this itch.",
    "timestamp": 1708383600
  },
  {
    "username": "RedKnight808",
    "rating": 4.0,
    "comment": "Count: 4 | Length: B | Complex: 2.1 | Play: Competitive\n3 (4) 6",
    "timestamp": 1706914800
  },
  {
    "username": "oldgoat3769967",
    "rating": 4.0,
    "comment": "After playing Axis & Allies, how can you go back to play Risk again?",
    "timestamp": 1705791600
  },
  {
    "username": "stephenhanbury",
    "rating": 4.0,
    "comment": "Original",
    "timestamp": 1705532400
  },
  {
    "username": "Cusanus123",
    "rating": 4.0,
    "comment": "It's a classic, of course. But there are simply much better games nowadays that do what Risk did, but better.",
    "timestamp": 1705532400
  },
  {
    "username": "Xenozyro",
    "rating": 4.0,
    "comment": "Risk was one of the board games of my childhood that I played very often. On the positive side, the game concept is all right and it plays fairly quickly even for a light war game. However, after a session where one of my soldiers stationed in Siberia killed an entire eighteen men before dying only thanks to random dice rolls, it became too apparent just how much this game suffers from the luck factor. As a reminder, eighteen soldiers are equivalent to one cannon, one cavalry unit and three soldiers or, in other words, to an army that can, in theory, take over an entire continent, so this is not a minor case of unfairness! Therefore, if you really enjoy these types of board games, I would recommend getting one with a more deterministic and fairer combat mechanism such as Shogun because Risk’s one is unfortunately utterly frustrating and arbitrary.",
    "timestamp": 1705273200
  },
  {
    "username": "Chieftain of Chtulhu",
    "rating": 4.0,
    "comment": "Gateway game. I've played this with the kids from time to time.\n\n+very simple to set up and play\n+rules are basic, kids can play it\n-tedious mechanic\n-very much a 'runaway player\" game, the end game is a trudge and never a nail biter\n-clearly good and bad strategies, if all players are somewhat familiar with the game the outcome is determined mostly by luck.",
    "timestamp": 1704754800
  },
  {
    "username": "DanFred",
    "rating": 4.0,
    "comment": "Risk is over 60 years old and shows its age. A very dated game that more recent games have greatly approved upon. An area control game that takes 4 - 6 hours and is highly luck dependent. If one wants a long war game there is Diplomacy. I have had some fun playing the game in the past when I was a kid, but prefer long games to be without luck.",
    "timestamp": 1704668400
  },
  {
    "username": "Sibeliusaurus",
    "rating": 4.0,
    "comment": "I received the 1993 version as a kid for Christmas. I have a lot of fond memories of the game, but would probably hate it now. However, there was a PC version with online play and a \"simultaneous turn\" variant that was actually A LOT more fun to play than the regular game, as it created an entirely new approach to the game with different types of battle phases (such as 'border clashes' where two players attack each other over the same border, and battles involving multiple players) and ultimately a lot more strategy was required. That variant made for a much better game!",
    "timestamp": 1704236400
  },
  {
    "username": "RogueBlade",
    "rating": 4.0,
    "comment": "I loved this game as a child and when it first came out. Its a fun game when you have the element of surprise and unlimited amount of time. But it can tend to be a long game, which is tough for players if they are eliminated early in the game, and after the only 1 or 2 really good strategies to win the game is figured out, it takes a bit of the edge of the game and can tend to seem a bit repetitive and too simple.",
    "timestamp": 1703804400
  },
  {
    "username": "Joker77",
    "rating": 3.9,
    "comment": "App",
    "timestamp": 1703286000
  },
  {
    "username": "icebane",
    "rating": 4.0,
    "comment": "This game never seems to end well",
    "timestamp": 1702940400
  },
  {
    "username": "Hugobossgames",
    "rating": 4.0,
    "comment": "Lekker veel ruzie om dit spel gehad, eigenlijk nooit een leuk potje uitgespeeld terwijl heel vaak begonnen. T idee is leuk maar het wilde nooit echt lukken in the end.",
    "timestamp": 1701817200
  },
  {
    "username": "dukelander",
    "rating": 4.2,
    "comment": "When I was a kid this was probably the most exciting game we could find. Secret assignments, miniature tanks, backstabbing, lots of dice.\nMany years later I am still huge fan of Risk-like games, having Twilight Imperium is one of my favorite games of all time, and many other games with maps, miniatures, dice and conquest are high on my list, and Risk became too simple and too random for my taste.\nHaven't played a game in a very while but I would really like to, for old times sake.\n\nFavorite mechanism: Secret assignments that direct your strategy.",
    "timestamp": 1700780400
  },
  {
    "username": "overcommunikate",
    "rating": 4.0,
    "comment": "Would rather play monopoly.",
    "timestamp": 1700521200
  },
  {
    "username": "Noot",
    "rating": 4.0,
    "comment": "once a favourite, now abandoned in the eternal game fields",
    "timestamp": 1697580000
  },
  {
    "username": "TMacfarlane26",
    "rating": 4.0,
    "comment": "Okay experience. Never really enjoy the experience.",
    "timestamp": 1697493600
  },
  {
    "username": "Ellogeyen",
    "rating": 4.0,
    "comment": "5-20 plays (2006)",
    "timestamp": 1696802400
  },
  {
    "username": "aspine",
    "rating": 3.5,
    "comment": "4000 Ft",
    "timestamp": 1696197600
  },
  {
    "username": "The_Crimson_King",
    "rating": 4.0,
    "comment": "I really liked Risk back when I was 10 or 12 when the lack of any meaningful decisions, the simplicity and the extreme luck didn't matter as we didn't know of anything better, but I absolutely wouldn't bother playing this today. Today there are far better children's strategy games out there.\n\nRated as a children's game. For grown ups it would be a 2.",
    "timestamp": 1695506400
  },
  {
    "username": "kvarclovag",
    "rating": 4.0,
    "comment": "Szép emlék, de nem jó játék.",
    "timestamp": 1694296800
  },
  {
    "username": "Palmberg",
    "rating": 4.0,
    "comment": "2-6 best 4. ok game. fun back in the days. maybe better with more negotiations but im not sure the game can handle it.",
    "timestamp": 1692655200
  },
  {
    "username": "Tbirdmg",
    "rating": 4.0,
    "comment": "So outdated. There are, literally, hundreds...if not thousands, of military area control games that are better than Risk. Why bother?",
    "timestamp": 1692136800
  },
  {
    "username": "Revelation2",
    "rating": 3.5,
    "comment": "This is a war game, which isn't my favorite genre. Losing is slow and painful…",
    "timestamp": 1692050400
  },
  {
    "username": "titianbonce",
    "rating": 4.0,
    "comment": "Played this as a kid.",
    "timestamp": 1686952800
  },
  {
    "username": "Kaffedrake",
    "rating": 4.0,
    "comment": "Even when I was a kid we knew there were issues with this game. It starts out open and promising but turns long and stale. There may be some tactile enjoyment to shuffling the army pegs around but that should be about it.\n\nThrifted on 20/11 2018 and 13/6 2023.",
    "timestamp": 1686607200
  },
  {
    "username": "DarthHenryAllen",
    "rating": 4.0,
    "comment": "It's a classic but the long play time combined with player elimination make it significantly less appealing compared to modern games and newer iterations of this game.",
    "timestamp": 1685743200
  },
  {
    "username": "davescave",
    "rating": 4.0,
    "comment": "Risk is a classic area control game, but it has a number of faults that take it out of contention for play at my game table",
    "timestamp": 1685397600
  },
  {
    "username": "pauloantunes",
    "rating": 4.0,
    "comment": "(in the Kids collection.)\nIt's from my childhood, that version has survived.",
    "timestamp": 1685397600
  },
  {
    "username": "MikeJonez",
    "rating": 4.0,
    "comment": "2023: 3-5 players. 45 mins per player. This game was fun to me when I was a kid. Now I don't want to play it, but could get dragged into it rarely. I don't like the luck, or player elimination. The game also takes way to long for what it offers.",
    "timestamp": 1685311200
  },
  {
    "username": "PhiRatio",
    "rating": 3.5,
    "comment": "This one has gotten pretty boring.",
    "timestamp": 1684706400
  },
  {
    "username": "Royal Blue",
    "rating": 4.0,
    "comment": "cull?",
    "timestamp": 1684447200
  },
  {
    "username": "TomVasel",
    "rating": 4.0,
    "comment": "Fun sometimes, but why play Risk when you can play Axis and Allies?",
    "timestamp": 1684101600
  },
  {
    "username": "mafiul",
    "rating": 4.0,
    "comment": "Do not play this game in modern times.",
    "timestamp": 1683237600
  },
  {
    "username": "Joey0",
    "rating": 4.0,
    "comment": "vv",
    "timestamp": 1681336800
  },
  {
    "username": "pyrosilesl",
    "rating": 4.0,
    "comment": "I like this one, it is a fun game. But come on, a different way to win will be nice. I don't want to spend 12 hours playing this.",
    "timestamp": 1679954400
  },
  {
    "username": "SVan",
    "rating": 4.0,
    "comment": "The older versions of Risk aren't as good as the revised version rules wise, because the objectives make the game go much quicker.",
    "timestamp": 1679266800
  },
  {
    "username": "x99floors",
    "rating": 5.0,
    "comment": "2003 Collectors edition in round tin",
    "timestamp": 1761069600
  },
  {
    "username": "A565Even12",
    "rating": 5.0,
    "comment": "A great game from my childhood. But it's not that enjoyable anymore compared to newer games.It takes too long to play; my longest playthrough was 16 hours. I'm keeping it for nostalgia mostly, but I think I'll get rid of it soon.",
    "timestamp": 1760306400
  },
  {
    "username": "SammySnijbonen",
    "rating": 5.0,
    "comment": "It’s a well-known classic. With some house rules for combat (e.g., income from territories and unit differentiation à la Risk: Europe or Ikusa), this can be a fun introduction to Dudes on a Map games.",
    "timestamp": 1759701600
  },
  {
    "username": "PolarDad",
    "rating": 5.0,
    "comment": "Childhood (Aaron's copy)",
    "timestamp": 1759096800
  },
  {
    "username": "rogedavi",
    "rating": 5.0,
    "comment": "I have a love hate relationship with Risk. I love area control games and I played this a lot, so it has a sentimental hold on me. However the snowballing mechanics and the fact that the only strategy is to brute force it at the borders and rely on the dice means this is fundamentally a shit game. It plays best solo on a PC against 4-5 AI players. For real life I upgraded to Ikusa (aka Shogun/Samurai Swords)",
    "timestamp": 1758319200
  },
  {
    "username": "Fergalleon",
    "rating": 5.0,
    "comment": "Holds a high nostalgic value, however doesn't hold up to the high standards of modern games",
    "timestamp": 1758319200
  },
  {
    "username": "Jpeddle9917",
    "rating": 5.0,
    "comment": "Could be good but isnt",
    "timestamp": 1758146400
  },
  {
    "username": "dpbernath",
    "rating": 5.0,
    "comment": "Hated this game when I played it as a kid; should probably give it another try, but it's hard to overcome my initial revulsion",
    "timestamp": 1757714400
  },
  {
    "username": "skipboris",
    "rating": 5.0,
    "comment": "Really surpassed by modern games but this is cheap and still has some of the best player agency in a game.",
    "timestamp": 1754517600
  },
  {
    "username": "winchesterkaveman",
    "rating": 5.0,
    "comment": "Risk is one of those that I'll always remember fondly from childhood, but ultimately it has been wildly surpassed in every aspect by other games.\nIt has a high status as the inspiration for many of my favourite games, and still does play well. It's just dated and so well played that there are clear strategies that lead to victory that mean the game tends to be fairly formulaic. A loving memory that is unlikely to come out for a game any time soon.",
    "timestamp": 1753740000
  },
  {
    "username": "Biolog_Psihopat",
    "rating": 5.2,
    "comment": "1993's edition",
    "timestamp": 1753740000
  },
  {
    "username": "QuI4ViC",
    "rating": 5.0,
    "comment": "Strategy game, but high level of chance, that is what remains of points, all the troops have the same value regardless of whether it is horse, cannon or soldier.",
    "timestamp": 1753048800
  },
  {
    "username": "Fuzzcrumbler",
    "rating": 5.0,
    "comment": "Like so many, we grew up playing Risk. It has its place in gaming history, I suppose, since there was no other warfare dice chucker so easy to jump into- next classic war-game level being A&A, or Diplomacy. Honestly, for a simple beer & pretzels wargaming fun, it can still serve a purpose, even if there are so many other choices for this type of thing, today. We all know how player elimination is awful, so as an alternative, as soon as the first player is eliminated, tally the territories, score it out & end it.",
    "timestamp": 1752789600
  },
  {
    "username": "mellchia",
    "rating": 5.0,
    "comment": "Classic game that usually devolves into pointless bickering and general hatred.",
    "timestamp": 1752184800
  },
  {
    "username": "SaltedPork",
    "rating": 5.0,
    "comment": "Better than monopoly.",
    "timestamp": 1752184800
  },
  {
    "username": "GrahamWeaver04",
    "rating": 5.0,
    "comment": "Never ever play except for the blue moon where I'm invited to a Risk tournament.",
    "timestamp": 1751320800
  },
  {
    "username": "Edualk",
    "rating": 5.0,
    "comment": "The only one. Completely outdated, obviously. But like Monopoly, like Ludo, like War, we all played it as kids. And we loved it!",
    "timestamp": 1750716000
  },
  {
    "username": "phibilip",
    "rating": 5.0,
    "comment": "We played it a lot in high school but then went to Axis & Allies and just never went back. Despite continuing to own it for the next 15 years, I played it like once after high school; it just doesn't fit me or the people I play with anymore.",
    "timestamp": 1750716000
  },
  {
    "username": "ozsoffy",
    "rating": 5.0,
    "comment": "Played it a few time, as it is classic and they sale it everywhere. still.\n\nits fun game, i''l give it that, and it makes a lot of interactions between the players, but its too long. and the game do not fix the situation of a player that is behind. only give more power to players that already winning.\n\nThe parts of it looks very old. and its a box that was bought this week from the story.",
    "timestamp": 1750629600
  },
  {
    "username": "Ya1r",
    "rating": 5.0,
    "comment": "Depende demasiado de la suerte y se puede hacer muy largo, me refiero, más de lo que es disfrutable, generalmente nunca se acaba una partida de conquista, la gente se aburre antes cuando alguien ya tiene mucha ventaja y se rinde, sin embargo es un juego al que se le tiene cariño.",
    "timestamp": 1749938400
  },
  {
    "username": "intruder2k",
    "rating": 5.0,
    "comment": "My first proper play of this one, and our copy was the world domination version. My experience was limited because we played it as a simple two-player game, which gives zero opportunity for tactics and essentially renders every game the same: initial consolidation of territories leading to a build up of two opposing armies, the rest decided by lots of luck based on endless dice rolling. As such we found this gameplay limited and interminable at times. If we can be bothered, we'll play again with the advanced two-player roles (incorporating neutral armies to a greater degree), and I have a feeling a larger number of players will make this more involving too. On the plus side, the miniatures and components are attractive, and for a game from the 1950s to still be playable it's doing something right. Truth be told it's no MONOPOLY, and there are so many other choices these days.",
    "timestamp": 1749333600
  },
  {
    "username": "clbg65",
    "rating": 5.0,
    "comment": "A attacks B, C wins",
    "timestamp": 1748469600
  },
  {
    "username": "PaperDesigner",
    "rating": 5.0,
    "comment": "I have a lot of nostalgia for it. But Risk Legacy... fulfills me.",
    "timestamp": 1748383200
  },
  {
    "username": "matthewb360",
    "rating": 5.0,
    "comment": "Played a lot as a child, and hundreds of times online.",
    "timestamp": 1748037600
  },
  {
    "username": "ripley3",
    "rating": 5.0,
    "comment": "Partita : Svariate",
    "timestamp": 1747864800
  },
  {
    "username": "MN7z",
    "rating": 5.0,
    "comment": "This game can feel really pointless towards the end, but it felt epic to get invested in this game when i played it almost 2 decades ago.\nNot so sure if i would find any excitement playing it today though.",
    "timestamp": 1747778400
  },
  {
    "username": "bocata_de_cachuela",
    "rating": 5.0,
    "comment": "Not that fun to be honest.",
    "timestamp": 1747519200
  },
  {
    "username": "swampcandy",
    "rating": 5.0,
    "comment": "Old classic, and the basis of what I want in an area control game. Newer versions have cruddy maps.",
    "timestamp": 1746914400
  },
  {
    "username": "TheSwissMeeple",
    "rating": 5.0,
    "comment": "German bookshelf edition 2006",
    "timestamp": 1745964000
  },
  {
    "username": "MaxxoBass",
    "rating": 5.0,
    "comment": "Risk hat eine starke strategische Komponente, aber auch viel Zufall durch die Würfelergebnisse. Das Spiel bietet nicht viele unerforschte Dynamiken.",
    "timestamp": 1743631200
  },
  {
    "username": "KoehnJ",
    "rating": 5.0,
    "comment": "Introductory strategy gaming - too many dice to roll!",
    "timestamp": 1743458400
  },
  {
    "username": "Axinaris",
    "rating": 5.0,
    "comment": "Solidly solid 5.\n\nIt's an old game (much older than I originially thought) so one has to give it credit for standing the test of time for what it offers.\nEasy to pick up and straighforward to udnerstand.\n\nPlayers, during setup, take turns picking regions on the map and then each turn they move troops around and roll (unmodified) dice to decide the outcome.",
    "timestamp": 1742770800
  },
  {
    "username": "dkalley",
    "rating": 5.0,
    "comment": "More of a social interaction than game, I haven't played this in years. I bought this one for parts.",
    "timestamp": 1742684400
  },
  {
    "username": "Regnad Kcin",
    "rating": 4.5,
    "comment": "Sold 11/24",
    "timestamp": 1741302000
  },
  {
    "username": "javitowildchild",
    "rating": 5.0,
    "comment": "Ha envejecido mal, pero para mi fue el primer juego de mesa que quemé hasta el infinito así que tiene un hueco en mi corazoncillo.",
    "timestamp": 1740610800
  },
  {
    "username": "TheGrove_Matt",
    "rating": 5.3,
    "comment": "The classic world domination game that everyone should play once in their life.",
    "timestamp": 1740092400
  },
  {
    "username": "bockhaus",
    "rating": 5.0,
    "comment": "2-6 players\nBest with 4 players",
    "timestamp": 1739660400
  },
  {
    "username": "AzuNiTe",
    "rating": 5.0,
    "comment": "This was my ultimate wargame when I was a kid. Sadly not a lot of people wanted to play this with me due to game length. This game is flawed, with the Australia tactic and doesn't live up to the standards of today.",
    "timestamp": 1738796400
  },
  {
    "username": "Nonoku",
    "rating": 4.5,
    "comment": "2-6 B: 4\nW: 2.06\n\nPros\n-Simple\n-Satisfying when you're winning\n\nCons\n-Whole game is just rolling dice\n-Luck based",
    "timestamp": 1737414000
  },
  {
    "username": "KChancellor",
    "rating": 5.0,
    "comment": "2-6, best 4 - 2,08 - 150 min",
    "timestamp": 1737414000
  },
  {
    "username": "Be_Ka",
    "rating": 5.0,
    "comment": "vk 11-22",
    "timestamp": 1736636400
  },
  {
    "username": "udance4ever",
    "rating": 5.0,
    "comment": "my Western Civilization teacher in 9th grade introduced us to this game as part of class! It's a classic but I'd play Axis & Allies: Europe over this game due to the added complexities and nuances.",
    "timestamp": 1736118000
  },
  {
    "username": "DONALD65",
    "rating": 5.0,
    "comment": "Fun game in the 1970s when there were few if any wargame themed games to play. Many people enjoyed playing risk in the same way they played other board games of the era. Even though I enjoyed the game in the 1970s I do not play it today- it might be 35 years or so since last played the original version.",
    "timestamp": 1735945200
  },
  {
    "username": "Javajoesworld",
    "rating": 5.0,
    "comment": "Nostalgia game. Far too luck of the roll dependent.",
    "timestamp": 1735426800
  },
  {
    "username": "ProfessorChaos",
    "rating": 5.0,
    "comment": "M",
    "timestamp": 1734994800
  },
  {
    "username": "El_Chevi",
    "rating": 5.4,
    "comment": "Más viejo que la batalla de Carrás, nada que decir que no se sepa ya.\n\nParte principal de los albores de los juegos de mesa como Monopoly, Hotel o Stratego y motivo de cruentas batallas dentro y fuera del tablero.\nUno de esos juegos donde, según tu suerte con los dados, puedes conquistar un continente con un puñado de soldados o, por contra, \"disfrutar\" de una batalla de 20 contra 2 a tu favor y ver como te destruyen a 19 de ellos sin miramientos.\n----------------------------------\nLuna: 8\nMamá: 8\n----------------------------------\n-Albert Lamorisse / Michael I. Levin\n-Hasbro",
    "timestamp": 1734822000
  },
  {
    "username": "bomberah",
    "rating": 5.0,
    "comment": "S-5\nTaken by Per at Last Light 12/24",
    "timestamp": 1734217200
  },
  {
    "username": "Olaf Nielsen",
    "rating": 5.0,
    "comment": "Best with 4 players",
    "timestamp": 1733698800
  },
  {
    "username": "NEMISTECH",
    "rating": 5.0,
    "comment": "It's a classic. Although i enjoy playing risk, every round are a bit long to just casually play an evening without it being planned ahead.",
    "timestamp": 1733094000
  },
  {
    "username": "Ffohol",
    "rating": 5.0,
    "comment": "Verkauft für 20€ bei Kleinanzeigen",
    "timestamp": 1733007600
  },
  {
    "username": "docspouse",
    "rating": 5.0,
    "comment": "2-6 players",
    "timestamp": 1733007600
  },
  {
    "username": "CharlieMnemonic",
    "rating": 5.0,
    "comment": "It’s pretty, but it’s still Risk.",
    "timestamp": 1732921200
  },
  {
    "username": "pezboy",
    "rating": 4.5,
    "comment": "KEEP",
    "timestamp": 1732230000
  },
  {
    "username": "MadeInLo",
    "rating": 5.0,
    "comment": "Fácil de entender y en juegos bélicos es de agradecer (porque hay mucha pesadez en esta temática), lo malo que se puede hacer largo.",
    "timestamp": 1731279600
  },
  {
    "username": "LordHaas",
    "rating": 5.0,
    "comment": "Play Risk Strike. So Good!",
    "timestamp": 1730588400
  },
  {
    "username": "Draw_Two_Logan",
    "rating": 5.0,
    "comment": "Way too repetitive for my liking",
    "timestamp": 1729634400
  },
  {
    "username": "alfredoloerav",
    "rating": 5.0,
    "comment": "Heavily luck based and ends with torture cause you know who’s going to win but it takes him 20 long turns to actually win.",
    "timestamp": 1729461600
  },
  {
    "username": "SeboEla",
    "rating": 5.0,
    "comment": "DB 2",
    "timestamp": 1729116000
  },
  {
    "username": "Lichtsturm",
    "rating": 5.0,
    "comment": "outdated, hours of rolling dices, a looot of downtime. BUT... there was a time :-)",
    "timestamp": 1728338400
  },
  {
    "username": "Dmian",
    "rating": 5.0,
    "comment": "My son collects these. I'm a bit \"meh\" about it, though I enjoyed the original as a kid.",
    "timestamp": 1726696800
  },
  {
    "username": "Tyson2015",
    "rating": 5.0,
    "comment": "Maybe the first wargame that I ever played. It was a popular game that was widely owned and I enjoyed it enough to buy a copy. As I got into other games I realized how basic the game was and rarely played it.",
    "timestamp": 1726610400
  },
  {
    "username": "atticusR",
    "rating": 5.0,
    "comment": "Long, dated, and gruellingly repetitive. There are far better games in this expansive genre.",
    "timestamp": 1726524000
  },
  {
    "username": "MacGrammar",
    "rating": 5.0,
    "comment": "I own and have played this game a lot, but the simplicity of the strategy, length of the game and player elimination has made me a bit tired of it. I prefer Lord of the Rings Risk now.",
    "timestamp": 1725919200
  },
  {
    "username": "opinicus",
    "rating": 5.0,
    "comment": "I have the one from my childhood.",
    "timestamp": 1722636000
  },
  {
    "username": "Racelympics",
    "rating": 5.0,
    "comment": "I'd prefer this over the regular version, given Mission Risk seems more enticing than the original, but then again, it's the same concept.",
    "timestamp": 1722549600
  },
  {
    "username": "Enkino",
    "rating": 5.5,
    "comment": "Hasbro Spanish rustic edition (2016)",
    "timestamp": 1720130400
  },
  {
    "username": "trawlerman",
    "rating": 5.0,
    "comment": "First \"wargame\" I ever played.",
    "timestamp": 1719871200
  },
  {
    "username": "nburrrzy",
    "rating": 5.0,
    "comment": "Never got into it like others did but should revisit",
    "timestamp": 1719093600
  },
  {
    "username": "MakkeDude1",
    "rating": 5.0,
    "comment": "Board Game: Strategy\nPlayed: 1980",
    "timestamp": 1718575200
  },
  {
    "username": "mixmixmix",
    "rating": 5.0,
    "comment": "If the game can last less than an hour, fun for a small group of friends who want to roll dice and gang up on each other. Otherwise, this is so simple as to put me to sleep.",
    "timestamp": 1716933600
  },
  {
    "username": "Tavanesh",
    "rating": 5.0,
    "comment": "Possible Kick",
    "timestamp": 1716156000
  },
  {
    "username": "Flummoxa",
    "rating": 5.0,
    "comment": "It is like flour. Its a fundamental thing that makes a bunch of other stuff great. But do you really want to eat just flour on its own?",
    "timestamp": 1715810400
  },
  {
    "username": "Spacem0nkey",
    "rating": 5.0,
    "comment": "Max 6. Le classique!",
    "timestamp": 1715810400
  },
  {
    "username": "stotes221",
    "rating": 5.0,
    "comment": "Too dang long.",
    "timestamp": 1715464800
  },
  {
    "username": "Cknight1985",
    "rating": 5.0,
    "comment": "El juego con el que comenzamos a jugar con los compas. Ultra random, ultra largo.\nAhh no mames, yo ya no juego.",
    "timestamp": 1714687200
  },
  {
    "username": "loofnick",
    "rating": 5.0,
    "comment": "kept for spare counters only",
    "timestamp": 1714255200
  },
  {
    "username": "ajaykrishnan123",
    "rating": 5.2,
    "comment": "SOLD",
    "timestamp": 1712527200
  },
  {
    "username": "RainbowRawen",
    "rating": 5.0,
    "comment": "It is not bad. Just next to all the new games it gets boring. But still a good game... ...",
    "timestamp": 1711839600
  },
  {
    "username": "Isildurinho",
    "rating": 5.0,
    "comment": "Classic, very easy pick up but when using standard rules can take a lot of time to finish games, it also often lacks strategical depth and does not do anything to avoid unbalanced games (like catch up mechanics) meaning that most sessions will be a slow clash between two/three main sides while everyone else watches or can do absolutely nothing. Elimination is guaranteed so not a fun time for everyone and in this version certain locations on the map are clear advantages to own leading to less strategical depth as everyone rushes to conquer the few \"stronghold areas\" (i'm looking at you australia). Headquarters + alternative rules make the game a lot better but only solve some issues.",
    "timestamp": 1710716400
  },
  {
    "username": "W1LDH0R53",
    "rating": 5.0,
    "comment": "29 Containers for Pieces",
    "timestamp": 1710198000
  },
  {
    "username": "Sethenstien",
    "rating": 5.0,
    "comment": "The old grandpa of casual war games. It works fine, simple to understand, feels fun if you're gaining ground. Generally runs a bit too long for what it is though. Small world has completely replaced it for me though",
    "timestamp": 1710111600
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "A nice brainless game that brings good memories to me. Quite short if played with four, and if players are behaving aggressively instead of turtling. Plays well with some non-gamers who are familiar with it, so will play if asked. Now, if suggested amongst a group of seasoned gamers, chances are I'll offer some resistance.\n\nRating: \nNumber of players:\n4\n2,6\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "joeyvigil",
    "rating": 5.0,
    "comment": "Eh, so much rolling. Everything that's wrong with older games.",
    "timestamp": 1708988400
  },
  {
    "username": "Railhead Mike",
    "rating": 4.5,
    "comment": "Played a lot as a teenager, was very enjoyable.",
    "timestamp": 1708210800
  },
  {
    "username": "tycham85",
    "rating": 5.0,
    "comment": "the dice make this game really drag or end too quickly for some. either way, not super fun.",
    "timestamp": 1708124400
  },
  {
    "username": "Kinskey",
    "rating": 5.0,
    "comment": "2-6 players",
    "timestamp": 1707951600
  },
  {
    "username": "TheGamersCollective",
    "rating": 4.7,
    "comment": "I dont know if any body in this world has played this game fully even once. long long game",
    "timestamp": 1706914800
  },
  {
    "username": "GiorgosPaok",
    "rating": 5.0,
    "comment": "+ Basic introduction to war games\n\n- You can feel targeted\n- Prone to king making\n- No dice mitigation",
    "timestamp": 1706914800
  },
  {
    "username": "Eduardpab54",
    "rating": 5.0,
    "comment": "It's Risk. Don't expect too much.",
    "timestamp": 1706655600
  },
  {
    "username": "teebzzz",
    "rating": 5.0,
    "comment": "2-6P\n4B\n3-6C",
    "timestamp": 1704754800
  },
  {
    "username": "Mark_H",
    "rating": 5.0,
    "comment": "An all-time [broken] classic.",
    "timestamp": 1703977200
  },
  {
    "username": "Reikan",
    "rating": 4.7,
    "comment": "Dice fest, stalemates and uninspired gameplay sum this one up. It is fun only on very rare occasions.",
    "timestamp": 1703113200
  },
  {
    "username": "ErikViking",
    "rating": 5.0,
    "comment": "meh... not enough strategy, but that's understandable since it's made for kids.",
    "timestamp": 1701558000
  },
  {
    "username": "ak3hx993bu",
    "rating": 5.0,
    "comment": "2-6 players",
    "timestamp": 1701212400
  },
  {
    "username": "ChobaneWayne",
    "rating": 5.0,
    "comment": "There are better and cheaper ones out there.\nIf you don't have luck in throwing dices you will lose.",
    "timestamp": 1701039600
  },
  {
    "username": "webrow",
    "rating": 5.0,
    "comment": "Not my type of game",
    "timestamp": 1700262000
  },
  {
    "username": "jtarno",
    "rating": 5.0,
    "comment": "Turning friends into enemies for over 50 years",
    "timestamp": 1700089200
  },
  {
    "username": "Shadow17",
    "rating": 5.0,
    "comment": "Gave away.",
    "timestamp": 1700089200
  },
  {
    "username": "Solenoide",
    "rating": 5.0,
    "comment": "I'd rather play Risk than Monopoly, the game feels slightly more immersive at least. I think this can end more friendships than Monopoly, though.\nThat moment when a single unit can hold down a country like they're a sniper taking down anything that comes into view is just so enjoyable. When it happens. If it happens.\nBecause nothing is in your control in this game and the play time can get very long, I prefer pretty much any other Ameritrash. Also the theme is very weak.\nBut this one started it all and I respect that.",
    "timestamp": 1699398000
  },
  {
    "username": "frankqb",
    "rating": 5.0,
    "comment": "I still think it's not awful, mainly because it works as a vehicle for trash talking without thinking.",
    "timestamp": 1698357600
  },
  {
    "username": "Educatedguess",
    "rating": 4.5,
    "comment": "We had a good time with this back in the early 90s. We didn't know any better. and there weren't that many good games back then.",
    "timestamp": 1696802400
  },
  {
    "username": "fliegen5",
    "rating": 5.0,
    "comment": "Game Metrics Scales -\neacqh is measured from the first attribute to the second.\nConfrontational to Insulated: ★☆☆☆☆☆☆\nObfuscated to Transparent:\n☆☆☆☆☆★☆\nStrategic to Casual:\n★☆☆☆☆☆☆\nImmersive to Grounded:\n☆☆☆☆☆★☆\nDriven to Meandering:\n★☆☆☆☆☆☆\nInnovative to Established:\n☆☆☆☆☆☆★\nRandom to Deterministic:\n☆★☆☆☆☆☆\nAssociational to Solitary:\n★☆☆☆☆☆☆\nAesthetic to Mechanic:\n☆☆☆☆☆★☆\nAccessible to Complex:\n☆☆★☆☆☆☆",
    "timestamp": 1696111200
  },
  {
    "username": "Cubs Forever",
    "rating": 5.0,
    "comment": "The \"family\" wargame. Like Monopoly, it drags on too long after you know who is doomed. It is also easy to get eliminated early if you lack skills in rolling a 6. Then you sit on the sidelines for hours while the rest of the crew finished the game. Noble Knight sale.",
    "timestamp": 1695506400
  },
  {
    "username": "bonillarau",
    "rating": 5.0,
    "comment": "Un clásico muy conocido al que ha jugado todo el mundo. En mi juventud este era un clásico de la piscina, con todos los chicos alrededor del tablero mirando la partida durante horas. Antes teníamos más tiempo. Ahora resulta tedioso y los muchos problemas que tiene resultan evidentes.",
    "timestamp": 1695247200
  },
  {
    "username": "Sportomax",
    "rating": 4.8,
    "comment": "Area Majority",
    "timestamp": 1693864800
  },
  {
    "username": "pmyip",
    "rating": 5.0,
    "comment": "C5CB",
    "timestamp": 1693864800
  },
  {
    "username": "StefanieB",
    "rating": 5.0,
    "comment": "Keller",
    "timestamp": 1693260000
  },
  {
    "username": "Goatcabin",
    "rating": 5.0,
    "comment": "Demoralizing, but when your older siblings convince you to play, what can you do?",
    "timestamp": 1692223200
  },
  {
    "username": "Speertjezelf",
    "rating": 5.0,
    "comment": "Just... mwah",
    "timestamp": 1691272800
  },
  {
    "username": "BenRon",
    "rating": 4.5,
    "comment": "1",
    "timestamp": 1691100000
  },
  {
    "username": "Angelbigfoot",
    "rating": 5.0,
    "comment": "Very tedious game that's based heavily on chance. Many elements of poor board game behaviours are present: eg. Turtling, kingmaking, metagaming, attacking leader (and hence lengthening the game),etc.\n\nHowever, it's one of the best entry war games. Play with the Capital/HQ house rules if possible.",
    "timestamp": 1689804000
  },
  {
    "username": "tscox87",
    "rating": 4.8,
    "comment": "Childhood game",
    "timestamp": 1689717600
  },
  {
    "username": "crothlisberger",
    "rating": 4.5,
    "comment": "Classic from my childhood. We mostly played with a number of house rules and modifications to the board.",
    "timestamp": 1689372000
  },
  {
    "username": "Marudka",
    "rating": 5.0,
    "comment": "B",
    "timestamp": 1689372000
  },
  {
    "username": "Trafysion",
    "rating": 5.0,
    "comment": "Wargame / Jeu de contrôle de territoires",
    "timestamp": 1688594400
  },
  {
    "username": "PrWNed",
    "rating": 5.0,
    "comment": "I believe I purchased this from a Goodwill for ~$4.\nNow lives at my parent's place.",
    "timestamp": 1687730400
  },
  {
    "username": "Maiku1983",
    "rating": 5.0,
    "comment": "Let's Play Together!\nDiscord: Maiku Norge#4460",
    "timestamp": 1687730400
  },
  {
    "username": "Fuzzwakka",
    "rating": 5.0,
    "comment": "Horrible game, way too long. Much more fun to watch a tv show abridge people playing it into a 30 minute comedy episode than playing it yourself",
    "timestamp": 1687471200
  },
  {
    "username": "Not_Today",
    "rating": 5.0,
    "comment": "I respect it for what it was, but it simply hasn't aged well. Everything being a die roll and overly straightforward strategy begs other games to be played.",
    "timestamp": 1687471200
  },
  {
    "username": "Arah",
    "rating": 5.0,
    "comment": "Area control game with hidden objectives.",
    "timestamp": 1686261600
  },
  {
    "username": "loweb1",
    "rating": 5.0,
    "comment": "Luck sucks.",
    "timestamp": 1686175200
  },
  {
    "username": "Yves1981",
    "rating": 5.0,
    "comment": "20",
    "timestamp": 1685656800
  },
  {
    "username": "beaniebee",
    "rating": 4.8,
    "comment": "Don't mind me, I'll just be over here in Australia watching everyone else play",
    "timestamp": 1685570400
  },
  {
    "username": "Dusty27",
    "rating": 5.3,
    "comment": "Dean loves it. I like it. Fun. I got the 80's map and the 90's pieces in my copy.",
    "timestamp": 1684274400
  },
  {
    "username": "RalfMalf",
    "rating": 5.0,
    "comment": "Rated 5 for nostalgia. Needs to be played quickly and aggressively with the right people, otherwise it gets boring.",
    "timestamp": 1683237600
  },
  {
    "username": "Zengoeroe",
    "rating": 5.0,
    "comment": "Sweet memories as a child. A pure luckfest. Throwing dice all night long until one person reaches his goal.",
    "timestamp": 1682892000
  },
  {
    "username": "Gamernurse",
    "rating": 5.0,
    "comment": "Kids.",
    "timestamp": 1681596000
  },
  {
    "username": "gab5040",
    "rating": 5.0,
    "comment": "2-6",
    "timestamp": 1681164000
  },
  {
    "username": "Iron_Salamander",
    "rating": 5.0,
    "comment": "Loved it as a kid. There are much better options out there today however.",
    "timestamp": 1680213600
  },
  {
    "username": "langschnabel",
    "rating": 5.0,
    "comment": "Solid 5 for good memories to my childhood. With our family rules it didn´t lasted to long and was epic. Never played for World Domination but for secret goals - this one was the game that told me the value of secret end game goals.",
    "timestamp": 1680127200
  },
  {
    "username": "Aufdermarsh",
    "rating": 5.0,
    "comment": "Played the shit out of this in my youth, mainly ends in animosity and arguments until the next session. Almost a complete luck game.",
    "timestamp": 1678834800
  },
  {
    "username": "Chaiftan",
    "rating": 5.0,
    "comment": "2-6p Thrift",
    "timestamp": 1678316400
  },
  {
    "username": "SultanSevy",
    "rating": 5.0,
    "comment": "The classic game of world conquest. A great gateway strategy game. As a kid, I would have rated this a 7. But as an adult with many other games under my belt, it's really just an average wargame. The downside is it plays really long, has a runaway leader problem, and can feel much too \"rinse & repeat\" after a while.",
    "timestamp": 1677279600
  },
  {
    "username": "mlriley",
    "rating": 5.0,
    "comment": "Can get a little long... but I always have fun playing Risk. Always.",
    "timestamp": 1677279600
  },
  {
    "username": "m0rg0th",
    "rating": 5.0,
    "comment": "Fun if your not eliminated, easily becomes unbalanced.",
    "timestamp": 1676761200
  },
  {
    "username": "tomatojim",
    "rating": 5.0,
    "comment": "x",
    "timestamp": 1675724400
  },
  {
    "username": "ReTeddy",
    "rating": 5.0,
    "comment": "Okay",
    "timestamp": 1675551600
  },
  {
    "username": "sudothefox",
    "rating": 5.0,
    "comment": "At one point in time I owned a copy of this classic. I'd like to give it another try if given the opportunity. I have a feeling I'd enjoy this lightweight strategy war game.",
    "timestamp": 1675206000
  },
  {
    "username": "Dionisis1979",
    "rating": 5.0,
    "comment": "Nilco",
    "timestamp": 1675033200
  },
  {
    "username": "battonline",
    "rating": 5.0,
    "comment": "It is a textbook example of several errors you should never do when designing a board game.",
    "timestamp": 1674687600
  },
  {
    "username": "StimedHydra",
    "rating": 5.0,
    "comment": "Gave me a lot of fun back in the days but I doubt it will ever happen again, have its merit for being a famous gameway",
    "timestamp": 1673823600
  },
  {
    "username": "fambans",
    "rating": 5.0,
    "comment": "I suck at this game.",
    "timestamp": 1672959600
  },
  {
    "username": "the_hop_meeple",
    "rating": 5.0,
    "comment": "Nah...",
    "timestamp": 1672873200
  },
  {
    "username": "thorgn",
    "rating": 5.0,
    "comment": "Classic game of world conflict. I used to play it regularly, but now I have many more games to choose from, so it rarely gets taken out. A little long for most situations as well. Very much a 'guys game'.",
    "timestamp": 1672527600
  },
  {
    "username": "manutd03",
    "rating": 5.0,
    "comment": "Played this a lot growing up. I like lots of other games better, but I bought the 70s version I had as a kid to play with my kids and they actually really enjoy this game!",
    "timestamp": 1672354800
  },
  {
    "username": "bagio99",
    "rating": 4.5,
    "comment": "Discovered a copy of this game while staying in a cabin in northern Canada in the early 80's. My brother and I immediately got hooked. Played sporadically until university where we played it more often. A friend even wrote a simple program to resolve bigger battles: it helped keep the dice chucking and the down-time to a minimum... but the game became less fun!",
    "timestamp": 1672268400
  },
  {
    "username": "Barackleouf",
    "rating": 5.0,
    "comment": "my wife hates it",
    "timestamp": 1672182000
  },
  {
    "username": "edu22mg",
    "rating": 5.0,
    "comment": "Salamanca",
    "timestamp": 1672182000
  },
  {
    "username": "Johnny Awesome",
    "rating": 5.0,
    "comment": "Too long for the low level of strategy required.",
    "timestamp": 1671750000
  },
  {
    "username": "MarleyX",
    "rating": 4.5,
    "comment": "Fun game as a kid. Always been interested in conquest or territory control games even when it has flaws like Risk. It just didn't age well with all these better games that came out since it's creation.",
    "timestamp": 1671058800
  },
  {
    "username": "Fuzzyps234",
    "rating": 5.0,
    "comment": "Weirdly enough, I play this game most years with a group of friends. It is fun because of diplomacy and subterfuge until it becomes 1v1. Then everyone else does something else while two people grind through a never ending game.",
    "timestamp": 1669849200
  },
  {
    "username": "leonidas01",
    "rating": 5.0,
    "comment": "it gets old and theirs so much better on the market if you like risk, buy Root",
    "timestamp": 1669071600
  },
  {
    "username": "Sxar",
    "rating": 5.0,
    "comment": "The board was not the best and it is very simple game. It's a good for introduce new players to war games and to use the components with other games. Personally I love to use the miniatures at Merchants & Marauders and as improved soldiers in Risk Europe. It is cheap.",
    "timestamp": 1668294000
  },
  {
    "username": "ColonelDecker",
    "rating": 5.0,
    "comment": "Roll 6 => easy win",
    "timestamp": 1668121200
  },
  {
    "username": "CapnDem0",
    "rating": 5.0,
    "comment": "I can remember when I thought this was the biggest most complex board game there was.\n\nWhen I play my wife, I always win. So that's a plus.",
    "timestamp": 1667948400
  },
  {
    "username": "MarkusNeedham",
    "rating": 5.0,
    "comment": "Not my favourite game. Always lose to my son.",
    "timestamp": 1667689200
  },
  {
    "username": "SeraCv",
    "rating": 5.0,
    "comment": "2012 \"vintage\" edition in wooden box",
    "timestamp": 1667257200
  },
  {
    "username": "JePaPix",
    "rating": 5.0,
    "comment": "Area control, wargaming",
    "timestamp": 1666476000
  },
  {
    "username": "heavymetalboardgamer",
    "rating": 5.0,
    "comment": "One of my favorites from my childhood but has been replaced by too many superior games.",
    "timestamp": 1666303200
  },
  {
    "username": "Nicolas Weiss",
    "rating": 5.0,
    "comment": "For the kind of ubiquitous MB/Parker/Hasbro mass market game \"everyone\" has grown up with and that many seasoned board gamers tend to only examine with a clothespin on their nostrils, Risk holds up remarkably well. Its combat encounters are simple and to the point (plus numerous enough that die rolls tend to even out), both its economy and dice play reward aggressive play (while the map still offers some defensive choke points), and the reinforcement escalation acts both as a comeback mechanic and a finisher.\n\nThe main downside is that while the default world domination mode overstays its welcome (not helped replayability-wise by about 3-4 viable game plans, all tied to taking and holding a given continent), the alternate secret objective mode is of a questionable balance. (Especially at lower player counts: controlling 24 territories is a turn 1 possibility at 3 players!) Most optional rules make the game fairer, but at the cost of slowing it down further. Overall there's simply not enough pay-off here to justify the intersection between a relatively high playtime and regular player elimination.",
    "timestamp": 1665439200
  },
  {
    "username": "bdeink",
    "rating": 5.0,
    "comment": "I still have a soft spot for Risk, despite all its flaws.",
    "timestamp": 1665352800
  },
  {
    "username": "RNeves",
    "rating": 5.0,
    "comment": "In Portugal",
    "timestamp": 1665180000
  },
  {
    "username": "timinycricket",
    "rating": 5.0,
    "comment": "Players: -; Best: -\nTime: -m; Difficulty:\nCategory:",
    "timestamp": 1665093600
  },
  {
    "username": "Fede__",
    "rating": 4.5,
    "comment": "2011-08-23\n\nUsed to play this a lot as a teenager. Now I'd rather avoid it, if possible, as there's plenty of better games.\n\n\n2015-01-14\n\nWhat makes this game still playable for me is negotiation. It's not enough to make it a good game, but at least it saves it from being terrible.",
    "timestamp": 1664229600
  },
  {
    "username": "Martln",
    "rating": 5.0,
    "comment": "Decent when playing against an AI on a computer but tend to result in drawn-out games where human players gang up on the current leader. Quite fiddly with many plastic figures and I believe wooden cubes make a better playing experience although not as thematic pleasing.",
    "timestamp": 1664056800
  },
  {
    "username": "Benjaminviking",
    "rating": 5.0,
    "comment": "Way overplayed in high school and college. (I knew it was getting bad when we would play with two boards side by side in a duel-world slobberknocker.) Now, just too much of a dicefest to want to invest the time in, especially against conservative opponents who just want to build ad nauseum. If I feel the urge, I prefer the LOTR or A.D. 2210 variants, as there is a definite end, even if you haven't conquered every last nook and cranny of the world. Give me something more that I can sink my teeth into. [Childhood gift]",
    "timestamp": 1663711200
  },
  {
    "username": "gramsdad",
    "rating": 5.0,
    "comment": "For solitaire play against a computer Risk can be a lot of fun, and there are a lot of decent variant rules/game sets out there. Certainly a pioneering wargame. However, plain vanilla risk is hard for a group to finish. Often two folks are left to fight it out three or four hours after everybody else has been knocked out and called it a night.",
    "timestamp": 1663624800
  },
  {
    "username": "AJSalim",
    "rating": 5.0,
    "comment": "1 win",
    "timestamp": 1662847200
  },
  {
    "username": "BobOLink",
    "rating": 5.0,
    "comment": "It's OK. I'll play if asked but will never suggest it myself. I own it because my oldest grandson really, really, wanted to play this one when he was about 11 so I purchased a copy. Oddly enough, I never played this as a kid.",
    "timestamp": 1661810400
  },
  {
    "username": "Sknbkr",
    "rating": 5.0,
    "comment": "No box",
    "timestamp": 1661032800
  },
  {
    "username": "ZipDizzle",
    "rating": 4.5,
    "comment": "If I'm going to play regular risk, I'm going to play a computer version of it. It's fine.",
    "timestamp": 1660946400
  },
  {
    "username": "HS2917",
    "rating": 5.0,
    "comment": "Classic area control game that can go on far too long",
    "timestamp": 1660773600
  },
  {
    "username": "laytox",
    "rating": 5.0,
    "comment": "So dated at this point, there's a million other area control games I have that I'd rather play",
    "timestamp": 1658786400
  },
  {
    "username": "indubitably1",
    "rating": 5.0,
    "comment": "This game provides an accessible and simple way to enjoy total world domination. Unfortunately, the battle mechanic feels so random that any time spent strategizing feels wasted.\nThe game is fun to setup once but never finish.",
    "timestamp": 1657663200
  },
  {
    "username": "Lotrfreak855",
    "rating": 5.0,
    "comment": "Wife",
    "timestamp": 1657231200
  },
  {
    "username": "Iftut",
    "rating": 5.0,
    "comment": "Long. A long slow game.\nLife is too short.",
    "timestamp": 1657231200
  },
  {
    "username": "LucasGentry",
    "rating": 5.0,
    "comment": "Maybe if I was better at this, I might like it more?",
    "timestamp": 1656712800
  },
  {
    "username": "ikealot_34",
    "rating": 5.0,
    "comment": "junky classic wargame",
    "timestamp": 1656626400
  },
  {
    "username": "Jareck80",
    "rating": 5.0,
    "comment": "A staple in my early gaming years. I probably wouldn't play it today unless it was with my old gaming group. Has been replaced by Risk Legacy",
    "timestamp": 1656540000
  },
  {
    "username": "pconza",
    "rating": 5.0,
    "comment": "I grew up with Risk and have played with all kinds of people. It loses a couple of points for the luck factor. Then it loses a few more because of bad experiences while playing. They have not all been bad. But i feel this game is extremely group dependent.",
    "timestamp": 1656367200
  },
  {
    "username": "YoLYcmqZ",
    "rating": 6.0,
    "comment": "Rating: +0.5\nOwn: Physical",
    "timestamp": 1759615200
  },
  {
    "username": "dj_koen",
    "rating": 6.0,
    "comment": "I own the 1992 dutch edition which has secret objectives which really do a lot to add some spice to an otherwise simple game",
    "timestamp": 1759528800
  },
  {
    "username": "The Eraser",
    "rating": 6.0,
    "comment": "not exactly a wargame..",
    "timestamp": 1759442400
  },
  {
    "username": "Lendengold",
    "rating": 6.0,
    "comment": "Gereon\n(geschenkt von Claudia)",
    "timestamp": 1759356000
  },
  {
    "username": "kwalzl",
    "rating": 6.0,
    "comment": "7B",
    "timestamp": 1758664800
  },
  {
    "username": "Brother Abe",
    "rating": 6.3,
    "comment": "2017 from parents",
    "timestamp": 1758578400
  },
  {
    "username": "The_Humungus",
    "rating": 6.0,
    "comment": "Played so many times. So many hours. So many lives. . . . . .",
    "timestamp": 1757282400
  },
  {
    "username": "CKaefe",
    "rating": 5.5,
    "comment": "It's easy to dismiss and point flaws to both Risk and 221b Baker Street (Scotland Yard in Portuguese) now that I know more about board games. Ultimately, I'll remember those as the games that always intrigued me and left an itch on my brain while growing: that one day I should check all that the board game hobby has to offer.",
    "timestamp": 1756764000
  },
  {
    "username": "grayzilla",
    "rating": 6.0,
    "comment": "Wooden special edition. Played once.",
    "timestamp": 1756677600
  },
  {
    "username": "Kubidi",
    "rating": 6.0,
    "comment": "Players: 02 - 06\nBest: 04",
    "timestamp": 1756072800
  },
  {
    "username": "WrathfulJaguar",
    "rating": 6.0,
    "comment": "Enjoyed this as a kid. Would still play if anyone asked.",
    "timestamp": 1755640800
  },
  {
    "username": "FrancoLondo613",
    "rating": 6.0,
    "comment": "Set aside a few hours to set up, play and tear down. The dice can be cruel, but the cards can save you. Gotta be in the mood for it.",
    "timestamp": 1755208800
  },
  {
    "username": "Spelspelare",
    "rating": 6.0,
    "comment": "It's risk...some people love it, some hate it",
    "timestamp": 1755208800
  },
  {
    "username": "nerdycanuck",
    "rating": 6.0,
    "comment": "Potentially sell.",
    "timestamp": 1753912800
  },
  {
    "username": "Chevrez",
    "rating": 6.0,
    "comment": "Digital",
    "timestamp": 1753912800
  },
  {
    "username": "zenmester",
    "rating": 6.0,
    "comment": "På loftet",
    "timestamp": 1753826400
  },
  {
    "username": "eloct",
    "rating": 6.0,
    "comment": "There's way too many pieces that need to be managed in this game. It can drag for too long and waiting for the other player's turns can be boring. But it's better in every aspect than monopoly. You don't feel like you lost all at once. Swings are usually not abrupt.",
    "timestamp": 1753653600
  },
  {
    "username": "HiveGod",
    "rating": 6.0,
    "comment": "Much like Monopoly it's not a bad game—just hideously antiquated. The simplicity of the rules set makes it primarily a social game, a game of pilsner, pals and potty mouth.\n\nEDITIONS OWNED (7 5 4 3):\n\nThat 1970s one with the caltrops\n\nMy very favorite Xmas present when I was nine; played many times all by myself. Lovingly maintained in a state of arrested decay. Rating is for the standard Global Domination game, though it can shoot to superawesome with the right people. And beer.\n\n2003 Edition\n\nSelf-purchased for the mission cards. Makes the base game waaay more playable.\n\nRisk 2210 A.D. (big box edition, 2001)\n\nSelf-purchased for science fiction theme. Good stuff—almost an entirely different game. (Gave this to Ilia, who fixed our dishwasher. Thanks!)\n\nRisk: The Lord of the Rings Trilogy Edition\n\nSelf-purchased because I'm a fanboy. Pretty cool for what it is.\n\nRisk: Star Wars – Clone Wars Edition\n\nPurchased for the kids. (Yeah, right.) Pretty decent 2p game.\n\nRisk: Star Wars – Original Trilogy Edition (2006)\n\nPurchased for me. (The biggest kid in the house.) Great for 3p.\n\nRisk (Revised Edition) (2008)\n\nFantastic additions to the base engine—cities, capitals, objectives, a new card-exchange regime (turn in 2-10 stars for 2-30 troops) and a VP-based victory condition make this a completely different game.\n\nUPDATE: I really, really like the idea of Risk—the stupid-simple conflict game of smack-talk and dice-chucking—far more than actually playing it. It would be difficult to convince me to play the default Global Domination version of this, no matter how tempting the snacks, beer and company. I'm much better disposed toward the improved versions—missions, 2210, LotR, or one of the Star Wars ones. Even better, the 2008 Revised Edition.\n\nThat said, I do play an awful lot of Global Domination Risk in digital formats—you can tap out an entire game in less than 20 minutes.* Stupid fun.\n\nAnd then there's always this:\n\nAn Incredibly Narrow and Deeply Flawed History of Risk Rules\n\n*Says an embarrassing amount about how much time gets eaten up with all the dice rolling and comparing...",
    "timestamp": 1753394400
  },
  {
    "username": "UnstableCards",
    "rating": 6.0,
    "comment": "Too long and could stretch out",
    "timestamp": 1753308000
  },
  {
    "username": "Waffleater",
    "rating": 6.0,
    "comment": "Introduce",
    "timestamp": 1753048800
  },
  {
    "username": "jjoyce",
    "rating": 6.0,
    "comment": "The winner of the game is pretty apparent too early on, then you gotta sit around a chuck dice until it happens. I don't find the decisions interesting enough in it.",
    "timestamp": 1750629600
  },
  {
    "username": "SquirrelFrog",
    "rating": 6.0,
    "comment": "Regular Risk gets a 6.\nSecret Mission Risk variant gets a 7.",
    "timestamp": 1749765600
  },
  {
    "username": "Castellanus",
    "rating": 6.0,
    "comment": "War-strategic",
    "timestamp": 1748383200
  },
  {
    "username": "Spada_",
    "rating": 6.0,
    "comment": "10+. War + Family. 2-6 players - Best: 4",
    "timestamp": 1747605600
  },
  {
    "username": "AetasAaM",
    "rating": 6.0,
    "comment": "I remember wanting this game badly as a kid as the idea of amassing an army and conquering the world was very alluring. I was happy to finally get it and had a good time playing this as a kid. For its simple rules it plays pretty well, and it's probably one of the simplest implementations of a wargame. For adults it's less fun as we'd want more tactical choices to ponder.\n\nBut if someone really wanted to play I would oblige.",
    "timestamp": 1746914400
  },
  {
    "username": "WhiteSeal",
    "rating": 5.5,
    "comment": "2-6 spelers (best 4)\n10+",
    "timestamp": 1746828000
  },
  {
    "username": "thespaniardsteve",
    "rating": 6.0,
    "comment": "3-6, 4",
    "timestamp": 1745445600
  },
  {
    "username": "Pyromkid",
    "rating": 5.5,
    "comment": "Regular old Risk. Good for when you want to play the classic game of world domination.",
    "timestamp": 1745272800
  },
  {
    "username": "Spikejag",
    "rating": 6.0,
    "comment": "OU-D",
    "timestamp": 1744754400
  },
  {
    "username": "Pelijussi",
    "rating": 6.0,
    "comment": "Old board with old ruleset: the game seems to end never. Still ok.",
    "timestamp": 1744668000
  },
  {
    "username": "MyUserNameIs",
    "rating": 6.0,
    "comment": "Fun for nostalgia. Takes too long to play.",
    "timestamp": 1744495200
  },
  {
    "username": "krisclark0",
    "rating": 6.0,
    "comment": "Samuel owns. Decent game but totally decided by luck.",
    "timestamp": 1744408800
  },
  {
    "username": "Xiroxio",
    "rating": 6.0,
    "comment": "Clásico...obsoleto",
    "timestamp": 1743976800
  },
  {
    "username": "SteveLambo",
    "rating": 6.0,
    "comment": "Classic game that everyone should play once in their life.",
    "timestamp": 1743631200
  },
  {
    "username": "thomastallaksen",
    "rating": 6.0,
    "comment": "A classic",
    "timestamp": 1741561200
  },
  {
    "username": "realnameless1",
    "rating": 6.0,
    "comment": "I got this 2016 edition because I miss the little figures. I am quite happy that the changes from the Revised Edition become the standard now, but I wish the plastic cases would have remained. The paper boxes that are used instead are very flimsy, and they look like they will wear out very quickly.\n\nAgain, Risk is very luck based, so some games can be a big frustration.\n\n6/10",
    "timestamp": 1741129200
  },
  {
    "username": "mellamoger",
    "rating": 6.0,
    "comment": "A classic and an entry game for the belic genre. Quite basic, but I still prefer it to most of wargames (genre that I don't like). It's just a dice-throwing luck game.",
    "timestamp": 1740870000
  },
  {
    "username": "Thehiggsfield",
    "rating": 6.0,
    "comment": "Just as many people, loved as a kid, but trying to move into new and better games. Too many good memories.",
    "timestamp": 1740610800
  },
  {
    "username": "dirk_leipzig",
    "rating": 6.4,
    "comment": "Alte Version (\"Erobern Sie ...\")",
    "timestamp": 1740524400
  },
  {
    "username": "anton",
    "rating": 6.0,
    "comment": "Two copies. One with the wooden pieces for normal people, the other has the dumbass \"20th Century futuristic\" plastic thingies. Sheesh!\n\n'Nuff said.",
    "timestamp": 1740351600
  },
  {
    "username": "dcpepp",
    "rating": 6.0,
    "comment": "Played a lot as a kid. My kids also liked it when they were younger. We’ve all moved on to bigger and better games by now…",
    "timestamp": 1740351600
  },
  {
    "username": "wagu_fann",
    "rating": 6.0,
    "comment": "2008 1959 revamp",
    "timestamp": 1740351600
  },
  {
    "username": "CageJenkins",
    "rating": 6.0,
    "comment": "Gift from John",
    "timestamp": 1740351600
  },
  {
    "username": "colinporter68",
    "rating": 5.5,
    "comment": "I used to love this game but have come to realize there are many more interesting types of these games out there with less chance based fighting.",
    "timestamp": 1739574000
  },
  {
    "username": "Surmita",
    "rating": 6.0,
    "comment": "x\nNO FOTO",
    "timestamp": 1739142000
  },
  {
    "username": "adir",
    "rating": 5.5,
    "comment": "Has some strategy aspects to it, but eventually on the tactical level it's very luck based.\nGets too personal too fast.\nNot suitable with people who hold a grudege.\nEven when played in teams (couples) version it has a lot of negative feelings involved.\nStill in terms of battle strategy can be used to teach the concept of battlefront and rear, and the way to spread the forces, and manage risk.",
    "timestamp": 1738537200
  },
  {
    "username": "nabos",
    "rating": 6.0,
    "comment": "Players: 2-6 (4)",
    "timestamp": 1738278000
  },
  {
    "username": "provinzio",
    "rating": 6.0,
    "comment": "German Edition",
    "timestamp": 1738018800
  },
  {
    "username": "keespinosa",
    "rating": 6.0,
    "comment": "Played many times when young. Now too simplistic.",
    "timestamp": 1738018800
  },
  {
    "username": "Sawney",
    "rating": 6.0,
    "comment": "Not bad, never figured the rules out yet and been playing it for 40 years?",
    "timestamp": 1737846000
  },
  {
    "username": "dmajor1848",
    "rating": 6.0,
    "comment": "Family collection (CGW)",
    "timestamp": 1737241200
  },
  {
    "username": "Evandeel",
    "rating": 5.5,
    "comment": "I have a few really good memories with Risk, and know it to be enjoyable in the right circumstances. The dice roles are a good emulation to the degree of luck that real battles can have in a war, and can leave players shouting \"come on!\" as they engage in every conflict set. However, I also know Risk to either end too fast for one or two players, or go on for way way too long. It can be a very unpredictable game.",
    "timestamp": 1737068400
  },
  {
    "username": "Mountaingardner",
    "rating": 6.0,
    "comment": "2-6 Player",
    "timestamp": 1736550000
  },
  {
    "username": "devuna",
    "rating": 6.0,
    "comment": "I used to police playing so much with my brother but I would prefer more strategy to randomness but I get it",
    "timestamp": 1736377200
  },
  {
    "username": "Resyrev",
    "rating": 6.0,
    "comment": "L: 4",
    "timestamp": 1736118000
  },
  {
    "username": "oparga",
    "rating": 6.0,
    "comment": "Monforte",
    "timestamp": 1736031600
  },
  {
    "username": "Croij",
    "rating": 6.0,
    "comment": "Not that good in 2-player matches",
    "timestamp": 1736031600
  },
  {
    "username": "rkimerer",
    "rating": 6.0,
    "comment": "Risk is fun, a gateway to table top war games. May the dice rolls be in your favor.",
    "timestamp": 1736031600
  },
  {
    "username": "llamafish2",
    "rating": 6.0,
    "comment": "Pain just Pain",
    "timestamp": 1735772400
  },
  {
    "username": "DadQuest",
    "rating": 6.0,
    "comment": "My first game as a kid. Still have that copy with duct tape holding the box together. Lots of nostalgia. A fun game despite the common criticism of its simple design. Countless plays.",
    "timestamp": 1735772400
  },
  {
    "username": "sashabc",
    "rating": 6.0,
    "comment": "Fun game and not actually that long when there's only 3 players.",
    "timestamp": 1735686000
  },
  {
    "username": "COWBOYJOE19",
    "rating": 6.0,
    "comment": "Long but pretty fun. The biggest flaw is its length and the fact that the best strategy is to just have a couple countries with all your troops in them",
    "timestamp": 1734390000
  },
  {
    "username": "WeedMonkey",
    "rating": 6.0,
    "comment": "3-6players",
    "timestamp": 1734044400
  },
  {
    "username": "xSingleMaltx",
    "rating": 6.0,
    "comment": "Risk Europe, (Hasbro 2004)",
    "timestamp": 1733612400
  },
  {
    "username": "Gooseggs",
    "rating": 5.5,
    "comment": "This board game is a classic, but I would say that that fact doesn't help it much in this case. A pure strategy minis game where you and your friends go to either complete you \"Secret Mission\" or control the whole world (depending on which gamemode you play). Me and my group played the secret mission and this shortened the game by a lot compared to the original version of the game. You do need a bigger table as this game does take up some table space but it's not as bad as some board games I've seen. I would say that the basics of the game do make the game fun and interesting but if you don't have a great understanding of the strategy in the game and have a good starting position, then the game is already over for you. Combat is pretty fun and encourages you to take other countries but the limit on how many can fight seems to make battles a little less interesting as you can only have 3 fight at once and 2 defend at once. But this allows for one unit to take on all 3 or all 3 to completely dominate the battle depending on the dice roll. Which is the next point, the battles seem to be decided purely on the dice rolls and if you roll bad the entire time you'll most likely lose the game. There is no way for you to change the outcome of the battle to be in your favor if you just are \"rolling bad\" other than having a statistical advantage of 3 dice to 1 or 2. Would I play this again, sure, but only if no one wants to play another game or we want a game that is simple as this game is not that weighty.",
    "timestamp": 1733266800
  },
  {
    "username": "shadowking",
    "rating": 6.0,
    "comment": "Storage Box Shed",
    "timestamp": 1732489200
  },
  {
    "username": "Ryotanimoto16",
    "rating": 6.0,
    "comment": "Good game but a lot of time investment and can lead to arguements.",
    "timestamp": 1732402800
  },
  {
    "username": "Collection 1138",
    "rating": 6.0,
    "comment": "1970's original.",
    "timestamp": 1732316400
  },
  {
    "username": "MiceandMysticslover",
    "rating": 6.0,
    "comment": "Okay, Risk is a good game who deserves a higher rating. It's main problem is time-length and high luck reliance.\n\nTheme- Thematically Risk's map is a triumph. Fun, feels like your actually playing through a war, and doesn't interrupt the game with random abilities and complexities. However, the fact that cavalry and artillery are just representatives of more troops misses an opportunity to give these pieces unique abilities to reward players who manage to get them. Art work isn't amazing but it works. Theme- 8\n\nBalance- Having a good Capital is a big advantage but since half of the strategy of the game is starting placement, balance in Risk is reasonable. The balance tips fast though if a player gains control of Asia or two smaller continents (excluding Australia). Balance- 8\n\nMechanics- Combat is simple but reasonable, giving good depth and a push your luck element. Movement is a lower point. There should be an option to move pieces from one territory to any other territories in addition to being able to move pieces from all territories to one. Mechanics due to time can feel repetitive, and a large strategical player can feel that they've made all their meaningful decisions with in the first twenty minutes. Mechanics- 6\n\nCon: I don't normally put a con in but Risk's time really deserved this. Both normal and capital can drag on and on. Time: -.5\n\nOver all Risk is a descent game that could benefit from some extra boosts. 6.",
    "timestamp": 1731538800
  },
  {
    "username": "bjsully6",
    "rating": 6.0,
    "comment": "Risk is a great but simple game of world domination. This dice can be good or bad to you though in this one. My only issue is length of play and the more advanced the players the longer the game.",
    "timestamp": 1730156400
  },
  {
    "username": "skur78",
    "rating": 5.5,
    "comment": "Octubre 2024",
    "timestamp": 1729548000
  },
  {
    "username": "Irskel",
    "rating": 5.7,
    "comment": "Overall - 5.7\n\n(19%) fun - 4\n(17%) replay value - 5\n(15%) interactivity - 8\n(13%) downtime - 6\n(11%) skill/luck - 6\n(08%) quality/look/atmosphere - 6\n(08%) depth/challenge - 7\n(05%) 2-player - 3\n(03%) beginner-friendly - 7\n(01%) price-performance - 6",
    "timestamp": 1729288800
  },
  {
    "username": "Spengliosis",
    "rating": 6.0,
    "comment": "strategy; dice + board map\n- conquer territory",
    "timestamp": 1728943200
  },
  {
    "username": "BearWithoutaCare",
    "rating": 6.0,
    "comment": "It’s a classic! Take on your friends in a race to world domination! This is my favorite version of Risk. Great presentation, plenty of miniatures, and a board that has held up since I was a kid.",
    "timestamp": 1728943200
  },
  {
    "username": "Darijus",
    "rating": 6.0,
    "comment": "Classic game",
    "timestamp": 1728252000
  },
  {
    "username": "EdgeV",
    "rating": 6.0,
    "comment": "Had many good game sessions with this game, but the game has a couple of big flaws. First it is quite a bit of luck based. But the biggest issue I have is with the player elimination. If you play with more than 2 players (and you should) you could risk that one player is eliminated early and the others can go on for hours. The feelings left after playing the game is also an issue. It feels crushing to loose, and worse it feels crushing during game time as well if you are falling behind.",
    "timestamp": 1726956000
  },
  {
    "username": "stinderdaad",
    "rating": 6.0,
    "comment": "Too much luck involved for my taste but fun nontheless",
    "timestamp": 1726524000
  },
  {
    "username": "Ilford Game Fan",
    "rating": 6.0,
    "comment": "Plus hundreds of historic real life and online plays\nU24",
    "timestamp": 1726351200
  },
  {
    "username": "Peneda1",
    "rating": 6.0,
    "comment": "It has its credit, thats why the 6. But given other options in the same category, i believe I will never play it again",
    "timestamp": 1726178400
  },
  {
    "username": "kapikui",
    "rating": 6.0,
    "comment": "I've never made it all the way through a complete playthrough with more than 2 players, but I've played some six player games by my self and I find that I quite enjoy it.",
    "timestamp": 1725314400
  },
  {
    "username": "jc19019",
    "rating": 6.0,
    "comment": "How many times has a dining room table had this game on it for consecutive days in my life? Too many as the game itself is not very good, but somehow it ends up on the table once a year...",
    "timestamp": 1724796000
  },
  {
    "username": "Olipoliguacamoli",
    "rating": 6.0,
    "comment": "Its a fun introduction game to non boardgamerd and ut gives that war gane feeling on a very basic level )))",
    "timestamp": 1723500000
  },
  {
    "username": "CannonFodderTed",
    "rating": 6.0,
    "comment": "I'll preface by saying I have this on my shelf but I haven't played it in over 20 years. I have played video game versions of it recently though. I remember this was actually my favorite game for a long time as a kid. Seems like the dice rolls might add a bit too much randomness to it for today's standards but this still sets the bar for all \"army dudes on a map, area control\" type games. Definitely something everyone should experience. Common strategies include trying to make sure you take over at least one country every single turn to ensure you get a card because the card turn-ins is the most important thing. Later in the game you want to make sure you time things right so you are able to be the one to dish the final blow to take out an opponent. This is because you get their cards if you are the one who defeats them and this gives you a HUGE advantage getting those extra cards late in the game. The bad part about this is once all players have that same mindset, you are all basically at the mercy of the turn order and the card draw because if you get that one extra card and can't complete a set, it could mean the next player gets it first and mean the difference between winning and loosing.",
    "timestamp": 1722549600
  },
  {
    "username": "BoredGrainGreek",
    "rating": 6.0,
    "comment": "I always really enjoyed it but its so long!",
    "timestamp": 1722376800
  },
  {
    "username": "Synthethic",
    "rating": 6.0,
    "comment": "PT",
    "timestamp": 1722031200
  },
  {
    "username": "Wolfie_89",
    "rating": 6.0,
    "comment": "bevédőzve",
    "timestamp": 1720562400
  },
  {
    "username": "LuckOfTheDrawBG",
    "rating": 6.0,
    "comment": "After playing it a couple more times I actually found myself enjoying this game a lot compared to other simplistic games like monopoly (which i hate with a passion) or life. Easy to learn and chill with friends without getting heated due to the nature of its mechanics.",
    "timestamp": 1718920800
  },
  {
    "username": "Florisofzo",
    "rating": 6.0,
    "comment": "Pure nostalgia. Love to win, hate to lose, everything is at stake",
    "timestamp": 1717365600
  },
  {
    "username": "BoMack",
    "rating": 5.5,
    "comment": "From the box of family games stashed in the basement in the 1990s and recently unearthed. This one came from my childhood home c. 1960-70s.",
    "timestamp": 1717279200
  },
  {
    "username": "blazingKC",
    "rating": 5.5,
    "comment": "Game runs too long but is a plain numbers game.",
    "timestamp": 1716674400
  },
  {
    "username": "RaistlinMajere",
    "rating": 6.0,
    "comment": "Another classic. I played it a lot when I was a teen.\n...But I don't like Risk games too much...",
    "timestamp": 1715896800
  },
  {
    "username": "eddieb",
    "rating": 6.0,
    "comment": "So much nostalgia from playing with my dad as a kid.",
    "timestamp": 1714168800
  },
  {
    "username": "Reimius",
    "rating": 6.0,
    "comment": "Too basic and random for my liking. There are a couple games in my collection which do the same thing, but much better and faster.",
    "timestamp": 1713736800
  },
  {
    "username": "EuropaExpress",
    "rating": 6.0,
    "comment": "Back then this was a great game. Many hours of fun. Nowadays I consider it nothing special anymore. Unless played with good \"Risk\"-players. Otherwise it's just rolling the dice.",
    "timestamp": 1713736800
  },
  {
    "username": "TKWaibel",
    "rating": 5.5,
    "comment": "The OG area control. Keeping more out of sentimental reasons than interest",
    "timestamp": 1713218400
  },
  {
    "username": "m2f2",
    "rating": 6.0,
    "comment": "World Conquest\n\nx",
    "timestamp": 1712613600
  },
  {
    "username": "Bonham R",
    "rating": 5.5,
    "comment": "It's RISK. Everyone knows RISK. What else is there to say other than try to get your hands on Spheres of Influence instead?",
    "timestamp": 1712440800
  },
  {
    "username": "Megamic03",
    "rating": 6.0,
    "comment": "2,09\n2 - 6; best 4\n120 Minuten",
    "timestamp": 1712354400
  },
  {
    "username": "jacbernard",
    "rating": 6.0,
    "comment": "Reflexion",
    "timestamp": 1711922400
  },
  {
    "username": "LovecraftCountry",
    "rating": 5.5,
    "comment": "The classic game of dice chucking combat. Risk is best when it is houseruled to bring it into the 21st century. If you play the game as listed in the rules, you are signing up for a 3+ hour game that has a lot of lucky rolling involved.",
    "timestamp": 1711839600
  },
  {
    "username": "serkelion",
    "rating": 6.0,
    "comment": "Probably one of the most famous (and worse) \"wargames\"",
    "timestamp": 1710889200
  },
  {
    "username": "statto",
    "rating": 6.0,
    "comment": "Also for sale",
    "timestamp": 1710716400
  },
  {
    "username": "Inari44",
    "rating": 6.0,
    "comment": "This is an area control game that relies heavily on luck (dice rolls). I’ve played better games with this mechanic, but Risk holds a nostalgic place in my collection and it's fun to play occasionally.",
    "timestamp": 1710457200
  },
  {
    "username": "TBomb137",
    "rating": 6.0,
    "comment": "If you don't mind games that rely a little bit on luck, then this is a good area control game. I enjoy playing and teaching this game. Sure there are better games out there....but this one scratches a couple itches...world domination and dice rolling.",
    "timestamp": 1710284400
  },
  {
    "username": "Christiancpbcn",
    "rating": 6.0,
    "comment": "Héctor y Josu",
    "timestamp": 1709506800
  },
  {
    "username": "PlayerPersoon",
    "rating": 6.0,
    "comment": "I have 1 extra army token in Red and Yellow(131 total armies); Pink, Blue, Green, and Black total 130 armies.",
    "timestamp": 1709247600
  },
  {
    "username": "ANDY1313",
    "rating": 6.0,
    "comment": "Juego de mesa clásico de estrategia. Los jugadores compiten por la dominación global. Los participantes despliegan ejércitos y pueden hacer alianzas para adquirir territorios y continentes.",
    "timestamp": 1709161200
  },
  {
    "username": "cirrus88",
    "rating": 6.0,
    "comment": "My first strategy game when I was a kid. Had a great time playing this with my dad, but later in life it is a weaker strategy game that is fairly RNG based with poor fighting mechanics.",
    "timestamp": 1708815600
  },
  {
    "username": "PressonDAP",
    "rating": 6.0,
    "comment": "Fun, simple game, introduced to me as a kid, also fun to play on the iPad. Always a kick to wipe out other players and take all their cards and dominate the world!",
    "timestamp": 1708470000
  },
  {
    "username": "Wulfie74",
    "rating": 5.5,
    "comment": "Like many old classic games, Risk starts off well, but quickly and predictably lapses into extreme tedium. Eventually, we grind out a game solely to sate the ego of the person running away with it. (Risk has ZERO balance). Sometimes I wonder if the whole point of Risk is actually to see which player can manipulate another player to rage quit, causing them to swipe the pieces away, flip the table and potentially start a fist fight. At which point, the game mercifully ends and everyone is a winner.",
    "timestamp": 1707519600
  },
  {
    "username": "Ryder_0815",
    "rating": 6.0,
    "comment": "So viel gespielt, dass ich es mittlweile nicht mehr wirklich sehen kann. Grundsätzlich ein gutes Spiel welches ich als Kind gefeiert habe. Mittlerweile kenne/besitze ich bessere",
    "timestamp": 1707346800
  },
  {
    "username": "zzrunner",
    "rating": 6.0,
    "comment": "One of my biggest complaints is kingmaking and diplomacy in this. Too long of a game for that and all the luck involved. Still was an important part of my childhood so I'll give it that.",
    "timestamp": 1707174000
  },
  {
    "username": "Kilgannon",
    "rating": 6.0,
    "comment": "I will probably never play this again but I have too many fond memories of playing this with family I just cant seem to let it go.",
    "timestamp": 1705532400
  },
  {
    "username": "Indiana_Chad",
    "rating": 6.0,
    "comment": "A good game that i would probably rate higher if I were better at it, lol. I enjoy playing it but rarely seem to win. The 1993 version is good and is the one I own. I’d like to get the 1959 version that’s been out by Winning Moves for a while now. It looks cool as I like vintage games.",
    "timestamp": 1704668400
  },
  {
    "username": "JaredEagle",
    "rating": 6.0,
    "comment": "Albert Lamorisse\nMichael I. Levin\nParker Brothers",
    "timestamp": 1704495600
  },
  {
    "username": "Manpower84",
    "rating": 6.0,
    "comment": "3, 4, 5, 6, (4) Spieler\n120 Min",
    "timestamp": 1703718000
  },
  {
    "username": "southseasnurse",
    "rating": 6.0,
    "comment": "The genre-breaker for its time, in a way the 1st euro-war game. However, has been supplanted by much better games and is hampered by a very long playing time.",
    "timestamp": 1703458800
  },
  {
    "username": "Omnisapien",
    "rating": 6.0,
    "comment": "Conquer",
    "timestamp": 1703458800
  },
  {
    "username": "patafta",
    "rating": 6.0,
    "comment": "playing since 1986",
    "timestamp": 1703026800
  },
  {
    "username": "dollo28",
    "rating": 6.0,
    "comment": "4",
    "timestamp": 1702854000
  },
  {
    "username": "Ninergamer",
    "rating": 6.0,
    "comment": "Played this several times in my youth. Would play again, but with home rules to complete games in an hour.",
    "timestamp": 1702508400
  },
  {
    "username": "AnonAmarth88",
    "rating": 6.0,
    "comment": "It's alright but there are so many better war games out there.",
    "timestamp": 1702249200
  },
  {
    "username": "Milka",
    "rating": 6.0,
    "comment": "rating after 1 play",
    "timestamp": 1702162800
  },
  {
    "username": "szadiamond",
    "rating": 6.0,
    "comment": "3 - 6 (best 4) players, 240min",
    "timestamp": 1700780400
  },
  {
    "username": "edugon",
    "rating": 6.0,
    "comment": "Comprado en 2020 en megapaca. Regalado a Francisco Ortiz.",
    "timestamp": 1700607600
  },
  {
    "username": "Shawcio",
    "rating": 5.5,
    "comment": "2-6 Hasbro, Parker - Lamorisse, Levin, Daviau\narena control, strategia\nspora losowość, rzuty kością\nnegatywne interakcje, gra nad stołem\nmapa świata",
    "timestamp": 1700434800
  },
  {
    "username": "Pygwyld",
    "rating": 6.0,
    "comment": "was a favorite as a teen",
    "timestamp": 1700348400
  },
  {
    "username": "aronske417",
    "rating": 5.5,
    "comment": "Pulled all-nighters in high school playing this. I have a myriad of good memories of this game. Doesn't interest me anymore, its just too long, and player elimination isn't fun.",
    "timestamp": 1700348400
  },
  {
    "username": "Beboy208",
    "rating": 6.0,
    "comment": "Digital",
    "timestamp": 1700348400
  },
  {
    "username": "CelticLord56",
    "rating": 6.0,
    "comment": "I think it is a better game than people make it out to be especially when you have 4 or more people.",
    "timestamp": 1699052400
  },
  {
    "username": "Juggernautico",
    "rating": 6.0,
    "comment": "Pseudo strategic \"try-your-luck\" thing. Being lucky with the dice makes you believe that you have become a top strategist. What a shame.",
    "timestamp": 1698793200
  },
  {
    "username": "SpanishJoe",
    "rating": 6.0,
    "comment": "The earliest area-control game I know. Can be fun but there are balance problems (Australia) and the combat system is a drag and very repetitive, but there's enough dice swinginess that there is at least a slim chance of survival. As with most early board games, player elimination is par for the course, so getting knocked out of the game early is a drag. House rules improve the game.",
    "timestamp": 1698271200
  },
  {
    "username": "paolofasola",
    "rating": 6.0,
    "comment": "Lots of luck for a respectable \"ancient\" boardgame. You have to face that luck to continue appreciating the game. Too long for the game experience you have.",
    "timestamp": 1697407200
  },
  {
    "username": "xrosfer",
    "rating": 6.0,
    "comment": "Recommendation: Play if your group is able to play for a medium-long time",
    "timestamp": 1696888800
  },
  {
    "username": "CraigGrigg",
    "rating": 6.0,
    "comment": "I have the nostalgia set with the wooden cubes as armies along with the wooden slider lid box and the happy whale on the board. I bought it as a retro piece in about 2005 so soon it will enter it's second retro phase I suppose!\nBox looks great on the shelf... I play about once every year or so. Glad to have it in my collection.\n\nI am an ESL teacher who uses board games in my English language classes - I once had a class of 16 guys (no girls) aged 18 to 33 from about 6 different countries. They would play this game every afternoon after class. It also drew quite a crowd as some of the lads would spectate while having some drinks and snacks. They were fun times \n\nsold",
    "timestamp": 1696802400
  },
  {
    "username": "darius42red",
    "rating": 6.0,
    "comment": "10. ESSENTIAL\n9. AMAZING\n8. VERY GOOD\n7. GOOD\n6. NOT BAD\n5. MEDIOCRE\n4. I WOULDN'T PLAY IT AGAIN\n_______________________\n\n8, 9 and 10 always on my game shelf ready to be played",
    "timestamp": 1695333600
  },
  {
    "username": "Music_Meeples",
    "rating": 6.0,
    "comment": "Being a huge music lover I knew about Risk from the song “Man on the moon” way before I even knew anything about board games. Risk is one of the first area control games. So many games have since evolved from Risk which sadly means playing Risk today feels a bit slow and messy. Having said that Risk still remains one of the more popular board games today, in many ways Risk has paved the way for so many games that came after it, it even gave us Legacy games, and it has a wonderful online app as well. Risk always found new ways to rebrand itself, but in this review we’ll only focus on the original Risk. Risk is a simple wargame that is easily learned. It is perfect for beginners and uses both luck and strategy. Emphasis on LUCK! But a smart player can use tactics to mitigate the luck aspect to a certain degree. The objective of the game is to conquer the world and eliminate opponents' armies. So under no circumstance play this game with someone who is not prepared to battle, because even in the diplomacy parts of the game, they will be left disappointed when the time comes to break alliances.\n\nAesthetics – 6\nThe minis are great, yes it’s cheap plastic but it does add to the feel of the game. The Board is okay, but the cards and dice are horrible, typical Hasbro quality.\n\nReplayability – 7\nEvery game will play differently, but unfortunately there are some tactics that can be used every game to gain an upper hand for example Australia. The most easily defended country in the world, yes because the only way to enter Australia is from Indonesia and nowhere else not even from New Zealand…oh wait, sorry what was that? … so you’re saying New Zealand wasn’t invented yet?... Yup okay, makes sense.\nIn all honesty, Risk is a decent game to get started with and will keep you satisfied for some time\n\nTheme – 7\nThe theme of global domination and conquest is definitely there. The plastic minis do help with the theme and you do feel like Napoleon conquering region after region after region Mwhahahaha….\n\nFun Factor – 6\nSo this is where the game loses some points. If the Dice gods are on your side then yes it’s a lot of fun but for the other poor bloke, not so much. If you get eliminated early in the game, that’s it, you’re out and your friends keep playing, and this could happen because of people teaming up and that’s never fun in games.\n\nDowntime and rules – 6\nThe rules are very easy, but downtime is a factor in this game. Huge battles can drag out and having to wait while someone conquers the world can become boring.\n\nOVERALL RATING 6.5",
    "timestamp": 1694728800
  },
  {
    "username": "TVal",
    "rating": 6.4,
    "comment": "Mostly risk based, and has \"king maker\" elements. Still an entertaining time if you like dice",
    "timestamp": 1694383200
  },
  {
    "username": "ArbitraryAbsurdities",
    "rating": 6.0,
    "comment": "Iconic strategy game. Old school, but I still enjoy playing.",
    "timestamp": 1694037600
  },
  {
    "username": "platypuskid2",
    "rating": 6.0,
    "comment": "Simple and easy competitive game with an absurdly long play time",
    "timestamp": 1693864800
  },
  {
    "username": "Druivenclub",
    "rating": 5.5,
    "comment": "hans",
    "timestamp": 1693778400
  },
  {
    "username": "Prutser77",
    "rating": 6.0,
    "comment": "Classic. But I won't play it anymore",
    "timestamp": 1693605600
  },
  {
    "username": "AmassGames",
    "rating": 6.0,
    "comment": "Likes the idea, never played it again though and only played it for the first time in my 40s\n\n\n\nGoogle \"AmassGames\" (2,300 board game reviews, podcast, 3000+ Instagram posts and more)",
    "timestamp": 1692655200
  },
  {
    "username": "ASKonigsberg",
    "rating": 6.0,
    "comment": "Since 2010\n3p & 5p\ncca 20 games",
    "timestamp": 1692396000
  },
  {
    "username": "Malarchist",
    "rating": 6.0,
    "comment": "Amazon 2020. Prev owned earlier version.",
    "timestamp": 1692396000
  },
  {
    "username": "Jungle321",
    "rating": 5.5,
    "comment": "2-6",
    "timestamp": 1691532000
  },
  {
    "username": "TVVL",
    "rating": 6.0,
    "comment": "5.6\nWeight 2.08 / 5\n2-6 players\nBest 4\nSpel van Lisa",
    "timestamp": 1690322400
  },
  {
    "username": "Ramavoir",
    "rating": 6.0,
    "comment": "3-6 (4)",
    "timestamp": 1690236000
  },
  {
    "username": "resq_52",
    "rating": 6.0,
    "comment": "TOO LONG. PLAY WITH EXTRA RULES FOR SHORTER GAME. ITS A GRIND",
    "timestamp": 1689199200
  },
  {
    "username": "mothertruckin",
    "rating": 6.0,
    "comment": "Extra black box copy at 1433",
    "timestamp": 1688508000
  },
  {
    "username": "Firearchitect",
    "rating": 6.0,
    "comment": "Played countless times",
    "timestamp": 1687903200
  },
  {
    "username": "Dvs08",
    "rating": 6.0,
    "comment": "Old but gold.",
    "timestamp": 1687644000
  },
  {
    "username": "Jamieago",
    "rating": 6.0,
    "comment": "Showing its age nowadays, but back in the 80s this was one of the better games around. A bit of nostalgia in my rating.",
    "timestamp": 1686780000
  },
  {
    "username": "Beekos",
    "rating": 5.5,
    "comment": "52",
    "timestamp": 1686002400
  },
  {
    "username": "Bozz1606",
    "rating": 6.0,
    "comment": "Many memories with this game just a bit repetitive and whoever grabs Australia usually wins. Still enjoy it",
    "timestamp": 1683842400
  },
  {
    "username": "desertfox2004",
    "rating": 6.0,
    "comment": "My regular gaming crew rarely plays this anymore (when we do, its with the mission cards). It is definitely too vanilla compared to so many other choices out there. However, I have started to play it with my kids, with a few house rules thrown in, to get them more into gaming. From that standpoint, the game still has value.\n\nEDIT: Sold - May 2023",
    "timestamp": 1683669600
  },
  {
    "username": "Edward323",
    "rating": 6.0,
    "comment": "Fun old fashioned map painter if not able to play other more advanced games yet",
    "timestamp": 1683669600
  },
  {
    "username": "badinov",
    "rating": 6.0,
    "comment": "Got an old 1950s edition with wooden pieces at a garage sale for fifty cents some forty-plus years ago. Instruction booklet included a translation of the original French rules, which are the best rules. The cards are only used to randomly determine starting territories and that's it, so you don't have the ridiculous late-game situation of someone almost being wiped out and then all of a sudden they turn in cards and get three dozen armies to dump on the board. In the original French rules you only put one army on each starting territory at the beginning and the only way to get extra armies later is by controlling more territories or an entire continent. Makes for a much more balanced game.",
    "timestamp": 1683583200
  },
  {
    "username": "pdrseuss",
    "rating": 6.0,
    "comment": "Light to med-light, but long, area control game with a war-theme. Multiple ways to play, including Global Domination, and Secret Mission.\n\nNowadays, I'd rather play Small World or Nexus Ops.\n\nThe 1993 version is my favorite version of classic Risk that I've ever played. Components were great. Gameplay is great, compared to some confusing dumbed-down revamps released since then.",
    "timestamp": 1683496800
  },
  {
    "username": "Raidents",
    "rating": 6.4,
    "comment": "You'll fight a war on the board and off of it. Truly diplomacy does win wars. Requires a certain audience & vibe to play.",
    "timestamp": 1683496800
  },
  {
    "username": "SteveMcG",
    "rating": 6.0,
    "comment": "Grid Wargame",
    "timestamp": 1682892000
  },
  {
    "username": "espoon82",
    "rating": 5.5,
    "comment": "A classic, albeit a long one! I could never get anyone to play me, though, because of the length and the fact that I always won. I still have the pieces from mine, but not the game itself.",
    "timestamp": 1681855200
  },
  {
    "username": "MArdukPlagueAngel",
    "rating": 5.6,
    "comment": "2.07",
    "timestamp": 1681596000
  },
  {
    "username": "Drake33",
    "rating": 6.0,
    "comment": "Played it when I was 15 or so. It was okay, but there's no need to ever play it again.",
    "timestamp": 1680818400
  },
  {
    "username": "Giantredmonkey",
    "rating": 6.0,
    "comment": "Takes a long time and sometimes can lead to the occasional table flip, but good strategy game for sure. Classic. Rolling dice for combat is always a mix of fun and infuriating. Mission risk helps a lot with the length.",
    "timestamp": 1680732000
  },
  {
    "username": "Aphexia31",
    "rating": 6.0,
    "comment": "Gateway to board gaming, played this game so many times i have lost count.",
    "timestamp": 1680472800
  },
  {
    "username": "pietereblom",
    "rating": 6.0,
    "comment": "For modern day standards, Risk is relatively unfair and unbalanced. However, the simplicity of the game, the excitement of dice rolling and the politics in table talk can create memorable experiences in the right setting.",
    "timestamp": 1679698800
  },
  {
    "username": "Mr_Odd13579",
    "rating": 6.0,
    "comment": "Too much output randomness",
    "timestamp": 1679526000
  },
  {
    "username": "alaskancrabpuffs21",
    "rating": 6.0,
    "comment": "Axis and Allies is better it is still a good game that I still suck at!",
    "timestamp": 1679007600
  },
  {
    "username": "Theprincessfrog",
    "rating": 6.0,
    "comment": "2023 - Upstairs",
    "timestamp": 1678921200
  },
  {
    "username": "SGart68",
    "rating": 6.0,
    "comment": "Un classico",
    "timestamp": 1678921200
  },
  {
    "username": "guestid1250",
    "rating": 6.0,
    "comment": "Played a lot of this one growing up. The first real wargame I ever played. Strongly inspired Shogun (later known as Samurai Swords, then as Ikusa), another favorite of mine. Axis & Allies built off it too. This game can last a long time. Better for kids to play, in my opinion.",
    "timestamp": 1678489200
  },
  {
    "username": "ajhutt",
    "rating": 6.0,
    "comment": "@iOS",
    "timestamp": 1677884400
  },
  {
    "username": "Anrix",
    "rating": 6.0,
    "comment": "Area control with a lot of dice rolling. Not great but not terrible.",
    "timestamp": 1677279600
  },
  {
    "username": "Striker511",
    "rating": 6.0,
    "comment": "good game- simple and fun for family and kids \nI have the basic edition and the 40th collectors edition, with metal solders and optional VP conditions",
    "timestamp": 1677106800
  },
  {
    "username": "Sapporo",
    "rating": 6.0,
    "comment": "It's just okay. A lot of RNG and lacking a bit of depth.",
    "timestamp": 1676761200
  },
  {
    "username": "MonkeyKnifeFighter",
    "rating": 5.9,
    "comment": "While Risk is far from the best table-top military simulation/ miniature war-game ever made, there's a reason that this classic has survived in the stores for so long; it is entertaining, easy to learn/teach and has extreme player interaction.\nThe absolute emphasis of lucky dice rolls to resolve combats will not appeal to all board gamers, and it has a heavy \"Take That\" element, especially at higher player counts, (which is not my favourite game mechanic).\nThis 2003 version is definitely improved by each player having 4 different randomly determined missions to complete to win the game, but I found it somewhat annoying that some of the colours used for the miniatures are difficult to distinguish from each other at a glance (especially in anything less that very bright lighting)",
    "timestamp": 1676156400
  },
  {
    "username": "accela",
    "rating": 6.0,
    "comment": "My childhood copy...who knows where it is now though? despite all the criticisms of this game, I've always had fond memories of it-- possibly because it was my first \"serious\" board game",
    "timestamp": 1675897200
  },
  {
    "username": "andrewrowe27",
    "rating": 6.0,
    "comment": "a punishing yet fun game, and if you know the stats and tricks then you're going to win and dominate. bummer for those who lost earlier in the game though",
    "timestamp": 1675810800
  },
  {
    "username": "GeneralHazel",
    "rating": 5.5,
    "comment": "Too long. Too much dice rolling. As a kid I loved it and was very proud of the de luxe components.",
    "timestamp": 1675724400
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 3010006600040\nIJK2",
    "timestamp": 1758319200
  },
  {
    "username": "AlPacino11",
    "rating": 7.1,
    "comment": "Too much time! Too much negotiation and backstabbing and too many dice rolls! However, this is one of the games which offered me great moments and enjoyment!",
    "timestamp": 1757887200
  },
  {
    "username": "docker37",
    "rating": 7.0,
    "comment": "Loaned to Brad + all Legacy faction army pieces Sept 2025\nI enjoy playing Risk. Depending on who you playing with, game pieces may go flying.",
    "timestamp": 1757628000
  },
  {
    "username": "treunes",
    "rating": 7.0,
    "comment": "Classic \"war game\" for world domination where you roll dice to beat ennemies and gain territory. Very luck driven, but \"statistically\" you can put sufficient amount of troops on the board to mitigate this luck factor. I've played this A LOT when I was a student, both with friends and at home with my brother and sister. It's having a comeback now with my kids, fun to see...",
    "timestamp": 1757023200
  },
  {
    "username": "tugdad93",
    "rating": 6.5,
    "comment": "Played the computer version of this a ton in college and afterward at work. The board game version takes way too long for what it is, though. I'd give the app a 7.0. This is the Winning Solutions 60th Anniversary Edition: https://www.wsgamecompany.com/shop/collections/deluxe-wood-g...",
    "timestamp": 1756850400
  },
  {
    "username": "fusionbrain",
    "rating": 6.5,
    "comment": "Ow Risk, what a fond memory I have, and friendships ruined.",
    "timestamp": 1756591200
  },
  {
    "username": "Muppetus Galacticus",
    "rating": 7.0,
    "comment": "Archived",
    "timestamp": 1755900000
  },
  {
    "username": "Arakal",
    "rating": 7.0,
    "comment": "We have had this game around for a long time.",
    "timestamp": 1755554400
  },
  {
    "username": "WeberGaming",
    "rating": 6.9,
    "comment": "A childhood favourite. Many hours have been played rolling dice and battling around the table with my family. Secret Missions Risk can have epic moments of intrigue, deduction and deception. At its best, Risk encapsulates the feeling of being a commander of a vast army. Strategically manoeuvring and working out how to complete your goal. Tactically making aggressive moves and knowing when to give up the fight and move away. The board is epic, the little men, horses and cannons are so fun to place and move around.\n\nHowever, in light of the refinement of modern board games, Risk does show its age and mechanics that just aren’t fun on board game night. Particularly at large groups, depending on random chance, people can be eliminated really early on (by no fault of their own) only to watch on the sideline as a very elongated games over hours takes place. Stalemates can ensue and the game can overstay its welcome by a long, long, long time.\n\nThe game will always hold a very soft spot in my heart, but objectively Risk can be a very up and down game. Risk at its best could easily be rated a 9 but it can sometimes easily fall to 2 or 3 at its worst. There is definitely some childhood shine in my rating.",
    "timestamp": 1755468000
  },
  {
    "username": "Griff07",
    "rating": 7.0,
    "comment": "Always a classic.",
    "timestamp": 1754431200
  },
  {
    "username": "q_wertyuiop",
    "rating": 7.0,
    "comment": "just too long",
    "timestamp": 1752962400
  },
  {
    "username": "muncleuncle",
    "rating": 7.0,
    "comment": "2-6, Best: 4 / 120 min\n\n?\n\nKANN WEG -> ELTERN",
    "timestamp": 1751580000
  },
  {
    "username": "bhb_cosmos",
    "rating": 6.5,
    "comment": "Best for 4\nCommunity 3-6",
    "timestamp": 1751061600
  },
  {
    "username": "jeremysprofile",
    "rating": 7.0,
    "comment": "The OG area control. Surprisingly not terrible for its age.",
    "timestamp": 1750629600
  },
  {
    "username": "dmwainw",
    "rating": 7.0,
    "comment": "Would only ever play on the app.",
    "timestamp": 1750111200
  },
  {
    "username": "huddle",
    "rating": 7.0,
    "comment": "i know it has mixed reviews but I have a blast playing this game with my risk group. Nothing like to being able to attach your friends, create alliances, shift on those and just strive for world dominance!",
    "timestamp": 1747173600
  },
  {
    "username": "MightyThor",
    "rating": 7.0,
    "comment": "I liked it as a kid - then \"despised\" it a little bit. Recently (01/2025) I rediscovered it. If you take it as for what it is and don't have wrong expectations, it's a really good game! Nowadays I like it a lot (again). Try to win against a Grandmaster at \"Risk: Global Domination\" (online). Very difficult! Because it's NOT all about luck! It's about maintaining the balance between your opponents! Let them do the dirty work before you sack them all in! There are subtle strategies in that game, that are not so obvious at first glance. Well okay, there is \"player elimination\" and yes, there is luck involved, but that doesn't make it a bad game. It is sure not a perfect game, but it is also not a bad game! Actually, I like it a lot again; and even in the times when I \"looked down on it\", it had always a place in my heart! After all it was the first conquering game I played as a kid and I had a very good time back then!",
    "timestamp": 1746828000
  },
  {
    "username": "SMeijers1",
    "rating": 6.5,
    "comment": "Thuis-thuis",
    "timestamp": 1746655200
  },
  {
    "username": "blackbag",
    "rating": 7.0,
    "comment": "Many plays",
    "timestamp": 1746309600
  },
  {
    "username": "TheLawyer",
    "rating": 7.0,
    "comment": "Fairly simple game to understand, explain, and play and good for a family setting. I like games with the conquest vibe so my rating would be higher than most but I do recommend Risk Legacy over this if you have the time to understand a few more rules.",
    "timestamp": 1745791200
  },
  {
    "username": "andrewsgame12",
    "rating": 6.5,
    "comment": "Classic childhood favorite. Will always hold a place in my heart.",
    "timestamp": 1745445600
  },
  {
    "username": "viranga",
    "rating": 7.0,
    "comment": "Easy to learn, play, and enjoy.",
    "timestamp": 1744408800
  },
  {
    "username": "eskyrane",
    "rating": 7.0,
    "comment": "Kid Friendly\nCombative",
    "timestamp": 1743202800
  },
  {
    "username": "haydenwilkens",
    "rating": 6.5,
    "comment": "classic, cant get rid of for a while at least",
    "timestamp": 1742598000
  },
  {
    "username": "LaOread",
    "rating": 7.0,
    "comment": "Not really for trade - just in this status to remove from list for app.",
    "timestamp": 1742252400
  },
  {
    "username": "kingwilli",
    "rating": 6.5,
    "comment": "[NR] (#124) The classic game of world domination. Enjoyed this one as a kid.",
    "timestamp": 1742079600
  },
  {
    "username": "sorennarnia",
    "rating": 7.0,
    "comment": "Tired of chrome, tired of 36-page rulebooks, tired of special abilities and multiple card decks and multiple paths to victory and counter sheets and expansions, I decided to go old school and picked up a copy of Risk. Had some solid fun playing it and wondered, \"Wow, it takes a lot less to make me happy in gaming than I thought.\" Since then, I have less and less patience for bloat in games and now tend to reserve my admiration for the ones that know what to leave out as opposed to what to throw in.",
    "timestamp": 1741820400
  },
  {
    "username": "aburns94",
    "rating": 7.0,
    "comment": "Cottage Duplicate",
    "timestamp": 1741129200
  },
  {
    "username": "cajun_catfish",
    "rating": 7.0,
    "comment": "[2-6] WAR: Classic, long gameplay",
    "timestamp": 1739660400
  },
  {
    "username": "panzerfaust501",
    "rating": 7.0,
    "comment": "Played.",
    "timestamp": 1739487600
  },
  {
    "username": "Xyt4n",
    "rating": 6.8,
    "comment": "PLAYED AND NOT INTERESTED ENOUGH\n\n++ great tabletalk\n+ world domination as goal (history)\n+ fun area-control gameplay\n+ easy but with strategy-depth\n+ self-balancing\n- Resources-gathering seems improvable\n- big battle are to long & redundant\n- sometimes an endless play\n- figures are same / no races or different abilities\n-- to much luck-based",
    "timestamp": 1738882800
  },
  {
    "username": "Lcj19",
    "rating": 7.0,
    "comment": "Family go to",
    "timestamp": 1738278000
  },
  {
    "username": "ReeseBoyy2",
    "rating": 6.5,
    "comment": "Rules: Read through 12/7/22\nMissing Pieces: None",
    "timestamp": 1738018800
  },
  {
    "username": "Bragallot",
    "rating": 7.0,
    "comment": "The mechanics are simple, but the real depth of the game lies in knowing who and when to attack and how to not make yourself too much of a target while still expanding enough to win in the end, and trying to deduce who is going for which objective, and it's a shame so many people deride Risk seemingly not realizing this.",
    "timestamp": 1737932400
  },
  {
    "username": "Nameless_Fred",
    "rating": 7.0,
    "comment": "Fun war strategy game for lowkey game nights and hangouts. Success solely relies on dice chucking, which can be frusturating. Annoying situations often arise; for example, if your opponent has a bunch of the little army dudes and countries, and you and everyone else is stuck in Europe, surrounded by this guy, you still have to play until he destroys you completely. This results in a bunch of \"Just kill me now!!!!\" moments which can be fun to watch but not so fun to take part in. The fact that you already know you're going to lose and the game continues on for 2 more hours can result in some grumpy afternoons. Fun usually, though.",
    "timestamp": 1737586800
  },
  {
    "username": "vmi1983",
    "rating": 7.0,
    "comment": "I bought a Version Of Risk in France back in\n1981. To win you must fulfill your secret objective.\nLost the game in the flood... best games of Risk ever!",
    "timestamp": 1737586800
  },
  {
    "username": "just_simo",
    "rating": 7.0,
    "comment": "Evergreen",
    "timestamp": 1737586800
  },
  {
    "username": "cmpunk17",
    "rating": 7.0,
    "comment": "This game is not for the weak. It is rated way too low in this database. Learn how to play the game with the right strategies and you'll have a much better time playing. Go for a different theme if you're into that. LOTR or Game of Thrones or even Halo theme risk are all fun in their own right. Trust no one and break alliances. Dominate the world. 7/10.",
    "timestamp": 1736895600
  },
  {
    "username": "flussgeistbusiness",
    "rating": 7.0,
    "comment": "German Edition (1992)",
    "timestamp": 1736895600
  },
  {
    "username": "ZebNet",
    "rating": 7.0,
    "comment": "minis",
    "timestamp": 1736895600
  },
  {
    "username": "WolfgangofChrist",
    "rating": 7.0,
    "comment": "Underrated. I modded it to make it more fun.",
    "timestamp": 1736809200
  },
  {
    "username": "stevepwalker",
    "rating": 7.0,
    "comment": "Keep",
    "timestamp": 1735945200
  },
  {
    "username": "Chrysologus",
    "rating": 7.0,
    "comment": "Underrated on BGG. Dice-rolling combined with the unpredictability of other players' actions does mean that even the best of players will lose often.\n\nThe game is all about maintaining balance while trying to keep yourself in a slightly stronger position. Just blobbing up and taking one arbitrary territory per turn is not a strong strategy. (It's preferable, though, to spreading yourself too thin, which new players tend to do.) You have to wait for the perfect moment to use your card trade-in to wipe out another player, take his or her cards, turn them in again for more armies, and start a chain reaction in which you conquer every player in the turn.\n\nVersion notes: until 2003, you had to have 6+ cards for a mid-term trade in, but Hasbro reduced it to 5+. This shortens the length of the game because it makes it easier to start and maintain the chain reaction (it's also more logical). Hasbro also removed the rule that allows you to put 2 bonus armies on a single territory whose card you turn in. That rule was not part of the original rules when the game came out.",
    "timestamp": 1735772400
  },
  {
    "username": "j333walk",
    "rating": 7.0,
    "comment": "Risk is a great game full of calculated moves, but the problem is, it plays way too long.",
    "timestamp": 1735599600
  },
  {
    "username": "Malabear",
    "rating": 7.0,
    "comment": "Super fun to role play with totally luck based which could be fun",
    "timestamp": 1734044400
  },
  {
    "username": "ShiannLin",
    "rating": 7.0,
    "comment": "2010 JoTa Best Game Released in Brazil Nominee",
    "timestamp": 1733698800
  },
  {
    "username": "BryanTico",
    "rating": 7.0,
    "comment": "el primero de la colección.",
    "timestamp": 1733439600
  },
  {
    "username": "Wario1962",
    "rating": 7.0,
    "comment": "211",
    "timestamp": 1731106800
  },
  {
    "username": "FeiJai24",
    "rating": 6.5,
    "comment": "A game I've had for years. I loved and hated this game. I loved the strategy and conquering the world but I hated resolving conflict with dice rolls. You have 10 armies against you opponents 3 and somehow a few rolls of the dice later and despite numerical advantage its now 2 vs 2. So infuriating.",
    "timestamp": 1730847600
  },
  {
    "username": "sprEEEzy",
    "rating": 6.5,
    "comment": "Best childhood game, by far. These days, you can definitely see the gaping holes.",
    "timestamp": 1726869600
  },
  {
    "username": "chipsmith",
    "rating": 7.0,
    "comment": "college favorite",
    "timestamp": 1720994400
  },
  {
    "username": "AJSGeek",
    "rating": 7.0,
    "comment": "One of the all time classic war simulation games. Not as deep and intense as a game like Axis & Allies but much more approachable and fun in my humble opinion.",
    "timestamp": 1720648800
  },
  {
    "username": "msw7c",
    "rating": 7.0,
    "comment": "Childhood fave",
    "timestamp": 1720389600
  },
  {
    "username": "ming_ameba",
    "rating": 6.5,
    "comment": "The game that started me on wargaming. I think my copy is more than 30 yrs old.",
    "timestamp": 1720389600
  },
  {
    "username": "cp007",
    "rating": 7.0,
    "comment": "Somewhere my cousin is nibbling at forces and not engaging in an all-out attack. It's a great game with the right people.",
    "timestamp": 1718056800
  },
  {
    "username": "PaladinSirChris",
    "rating": 7.0,
    "comment": "Solid classic - I have fond memories of it.",
    "timestamp": 1715896800
  },
  {
    "username": "Atomarverseucht",
    "rating": 6.5,
    "comment": "cooles Spiel, braucht aber Zeit",
    "timestamp": 1715032800
  },
  {
    "username": "louisj2016",
    "rating": 7.0,
    "comment": "Family\nStr.",
    "timestamp": 1714773600
  },
  {
    "username": "NoClueDough",
    "rating": 7.0,
    "comment": "On APP, only.\nUsed to have LOTR version, siblings might have it.",
    "timestamp": 1714428000
  },
  {
    "username": "vgoma",
    "rating": 7.0,
    "comment": "(2003) green box",
    "timestamp": 1714082400
  },
  {
    "username": "Mac_n_cheese",
    "rating": 7.0,
    "comment": "If you ever wanted to conquer the world but didn’t wanna leave your couch, here’s your chance. Just be ready for some friendships to get dicey when you invade Siberia. Takes forever, so maybe start it on a Friday night.",
    "timestamp": 1713391200
  },
  {
    "username": "spudzero",
    "rating": 6.5,
    "comment": "Work",
    "timestamp": 1712440800
  },
  {
    "username": "Jo_Ma",
    "rating": 6.5,
    "comment": "A26",
    "timestamp": 1711753200
  },
  {
    "username": "theAstarrr",
    "rating": 7.0,
    "comment": "Risk is very fun to play with people. The only problem I have with it is that it takes too long. When I'm able to pause it and return to it later, it's almost always great.\n\nHowever the newer versions of the game with special objectives cut the length to around 2/3rds the usual length, while also making you wonder....what is their goal?",
    "timestamp": 1710975600
  },
  {
    "username": "schmitze",
    "rating": 6.5,
    "comment": "One of the best family war games",
    "timestamp": 1709852400
  },
  {
    "username": "tdkelly",
    "rating": 6.5,
    "comment": "App only",
    "timestamp": 1709074800
  },
  {
    "username": "saxy1425",
    "rating": 7.4,
    "comment": "The nostalgia is strong with this one.\n\nI can't help but yearn for another play of this game. The Austrailian strat! Nobody controls Asia. etc. etc. This game holds a place in my heart for teaching me that board games can hold intense moments of competition. I love competitive games that knock other players out. I know this isn't for everyone and that modern games tend to remove this mechanic.\n\nThis is why I love Risk. I want to play with some rowdy friends and get bantering over a map of the world and make deals and backstab and conquer the world!\n\nIs it flawed? Sure. Can it be too long? Definitely. But I just can't shake my love for it. I don't think I ever will.",
    "timestamp": 1708988400
  },
  {
    "username": "PopBoardgame",
    "rating": 7.0,
    "comment": "Mon jeu préféré pour perdre des amis est sans aucun doute Risk. C'est un jeu de stratégie intense et de négociation, où l'avarice et la trahison peuvent surgir à tout moment.",
    "timestamp": 1708988400
  },
  {
    "username": "Tanhauser69",
    "rating": 7.0,
    "comment": "Con el Risk mucha gente entró en la afición. No le puedo poner mala nota aunque sea por nostalgia.",
    "timestamp": 1708642800
  },
  {
    "username": "FalseCognate",
    "rating": 7.0,
    "comment": "An absolute classic. A great basic game to add to the collection, however I will admit that while I have a lot of love for the game, I don't end up playing it very often, looking for some games with deeper mechanics. But it can be good easy fun.",
    "timestamp": 1707951600
  },
  {
    "username": "BeirutWedding",
    "rating": 7.0,
    "comment": "I'm surprised at the low rating for this game just because, in my personal experience, Risk kind of made the other games possible, right? For me, when euro-games, designer games were first introduced to me, the reason why I thought they might be fun is because of my experience playing Risk. I know it bugs other people but me and my friends LOVED it the first time a game stretched over the course of two days. We had never experienced anything like it. Granted, we were twelve. But man, if more people were like, \"Hey, let's get down on some Risk.\" I'd be like, \"Hell, yeah.\"",
    "timestamp": 1707087600
  },
  {
    "username": "Blindsherpa",
    "rating": 6.5,
    "comment": "Multiple Versions:\n- Bookshelf version\n- 1970s x2\n- 2000s x2\n- other unique",
    "timestamp": 1706482800
  },
  {
    "username": "okiedokie",
    "rating": 7.0,
    "comment": "Zz",
    "timestamp": 1705014000
  },
  {
    "username": "Mannyx200",
    "rating": 7.0,
    "comment": "I have a nostalgic soft spot for this classic game of world domination. Lots of luck involved as you roll dice to determine battle outcomes. Very swingy game that can last a long time.",
    "timestamp": 1704841200
  },
  {
    "username": "erichilm",
    "rating": 7.0,
    "comment": "Card-driven quick pickup and delivery game with low interaction. Card draw heavily impacts the result. Hansa (by Michael Schacht) has replaced this for me as pure, quick, interactive pick up and delivery game.",
    "timestamp": 1704582000
  },
  {
    "username": "Ferrabros",
    "rating": 7.0,
    "comment": "The real game is influencing other players... and lot's of fun",
    "timestamp": 1702681200
  },
  {
    "username": "KhurangaBebop",
    "rating": 7.0,
    "comment": "Fun but very long and the bad luck rolls can ruin an entire army.\n\nI have some great memories playing it.",
    "timestamp": 1702508400
  },
  {
    "username": "tea93",
    "rating": 7.0,
    "comment": "B3",
    "timestamp": 1701817200
  },
  {
    "username": "sadyc",
    "rating": 7.0,
    "comment": "Not a particularly good game, but I got great fun with it.",
    "timestamp": 1701039600
  },
  {
    "username": "matzeHRO",
    "rating": 7.0,
    "comment": "GZ SB Unten",
    "timestamp": 1700780400
  },
  {
    "username": "Invisdragon",
    "rating": 7.0,
    "comment": "I still love this game",
    "timestamp": 1698706800
  },
  {
    "username": "Joekneebgoode",
    "rating": 7.4,
    "comment": "A perennial favourite.",
    "timestamp": 1697839200
  },
  {
    "username": "ianoas",
    "rating": 7.0,
    "comment": "I own the 1996 Hungarian version, Riziko. The original game remains the best. This is it, just with soldiers, cavalry, and cannons instead of I, V, X's. Stellar!",
    "timestamp": 1697320800
  },
  {
    "username": "evrmln",
    "rating": 7.0,
    "comment": "speel dit niet graag",
    "timestamp": 1696370400
  },
  {
    "username": "boettler",
    "rating": 6.5,
    "comment": "2-6 players with a difficulty of 2.10. Favorite strategy game during college days (late 80s). Can take a LOONG time to play.",
    "timestamp": 1695938400
  },
  {
    "username": "Def_Os",
    "rating": 6.5,
    "comment": "I've always kind of liked Risk. Grew up with the Dutch rules, which apparently are different (and better) than the US rules.",
    "timestamp": 1695420000
  },
  {
    "username": "johndoe1901",
    "rating": 7.0,
    "comment": "Kiste Kinder",
    "timestamp": 1694815200
  },
  {
    "username": "IainMcl",
    "rating": 7.0,
    "comment": "3-6 players best 4",
    "timestamp": 1692655200
  },
  {
    "username": "TK_422",
    "rating": 7.0,
    "comment": "1975 edt",
    "timestamp": 1691791200
  },
  {
    "username": "Amberley",
    "rating": 7.0,
    "comment": "Classic, love it. Though admittedly we haven't played it since my sister trashed my dad and he had a somewhat uncharacteristic tantrum.",
    "timestamp": 1691791200
  },
  {
    "username": "Zippolinchen",
    "rating": 8.0,
    "comment": "Versionen:\nKlassik\nWarhammer 40k",
    "timestamp": 1758578400
  },
  {
    "username": "ewaldvonkleist",
    "rating": 8.0,
    "comment": "Risk is an excellent game and some of the comments about it are pretty foolish. First let's admit what's obvious: it's not a realistic game. Second, there's some luck but the luck only figures in when you have evenly matched players. Put me up against several beginners and I'll stomp them. Experienced players know the strategy and when they play the luck of the dice matters more. Risk is about understanding the odds and timing, knowing the moment to go for broke. It's a very entertaining game.",
    "timestamp": 1758405600
  },
  {
    "username": "fletch49er",
    "rating": 7.5,
    "comment": "1st modern area control game we played back in the mid 70s. Stevie's game! He ruled at it",
    "timestamp": 1757368800
  },
  {
    "username": "gizmobj",
    "rating": 8.0,
    "comment": "Some of the classics from my childhood still hold up. This one is one of the GOATS as it was so easily modifiable. Will forever hold a place on my shelf.",
    "timestamp": 1757109600
  },
  {
    "username": "zabriskie_point",
    "rating": 8.0,
    "comment": "Esta nota tiene un componente sentimental.",
    "timestamp": 1755900000
  },
  {
    "username": "SammyBoards",
    "rating": 8.0,
    "comment": "Yeah there might be 'better' dudes on a map games. But you can whip this badboy out and have anyone playing in minutes. House rules make it quick, and more balanced... Don't be a snob!\n\nBonus, play the Sharpe music whilst playing. Now that's soldiering!",
    "timestamp": 1755381600
  },
  {
    "username": "theCartoonMrOats",
    "rating": 8.0,
    "comment": "not man enough to play this one for real either. again, with the interplayer politics of a roomful of guys who really know what they're doing, a profound and great game.",
    "timestamp": 1752530400
  },
  {
    "username": "OldCrappyCouch",
    "rating": 8.0,
    "comment": "The classic game of global conquest has never looked better. The map of the board is delightful, and the unit markers are well detailed. This is a great entry in the series.",
    "timestamp": 1750716000
  },
  {
    "username": "Cringy",
    "rating": 8.0,
    "comment": "Si lo juegas pensando que es un juego de venta masiva y que no está enfocado a otros sectores como cualquier juego de nicho, entonces es un gran juego, ve o muchas reseñas en las que dicen “es un juego de mesa basado en suerte en las cartas, suerte en los dados y solo suerte” o comentarios como “hay muchísimas opciones mejores ahora en el mercado para war games” y sí, tienen razón, pero se les olvida que este juego se tiene que comparar con juegos como Monopoly o maratón, no con Warhammer 40,000… ¡Es muy buen juego!, Solo no lo juegues pensando en que estarás jugando algo con muchísima complejidad y menos con personas poco experimentadas en el mismo.",
    "timestamp": 1749592800
  },
  {
    "username": "evrisp1",
    "rating": 7.5,
    "comment": "Risk Board Game 2004 - Gold Cavalry Figure Edition / Sleeved",
    "timestamp": 1749420000
  },
  {
    "username": "CunningCat",
    "rating": 7.5,
    "comment": "Childhood nostalgy but I still love this game, despite its long gameplay. However, I would only play this with the secret missions, because I don't like the original complete world domination winning condition, because then it drags on unnecessarily long. Secret Missions makes the game much shorter and keeps most players in the game till there is a winner.",
    "timestamp": 1745964000
  },
  {
    "username": "JepJepDK",
    "rating": 8.0,
    "comment": "Classic war strategy that I like to repeat every now and then. Part of the fun might also be due to nostalgia.\n\nThe game will also be quite different, depending on who you play with and their desire for diplomacy.",
    "timestamp": 1745186400
  },
  {
    "username": "Axleris69",
    "rating": 8.0,
    "comment": "Great simple strategic warfare game. Simple and straightforward. No more, no less.",
    "timestamp": 1744927200
  },
  {
    "username": "NuttyGameGuy",
    "rating": 7.5,
    "comment": "classic",
    "timestamp": 1743544800
  },
  {
    "username": "nanobastaddo",
    "rating": 8.0,
    "comment": "Perfect for guests that dont wish to learn new rules and wish something longer than monopoly.",
    "timestamp": 1738796400
  },
  {
    "username": "Cucumbertronic",
    "rating": 7.5,
    "comment": "KSA & UK",
    "timestamp": 1738105200
  },
  {
    "username": "bennbanasik",
    "rating": 8.0,
    "comment": "I've owned Risk a number of times and played with groups when I was younger, my family, wife in variant modes and now with a group of workmates. The nostalgic and very simple aspect of rolling dice with advantage against each other and the theme of the map can lead to some very funny and classic moments.\n\nI like the version I own that has a tracker for the combat cards on the board with it's own unique golden rider on a horse. I also like the same MB edition has a less busy map which allows you to see the sea movements easier, and how much of a pain Indonesia is as a territory!\n\nThe game on it's own is a tactical push and pull game of choices which means that naturally it will become less fun for players as they are squeezed down to singular territories. The most iconic part of this is the moments when that little army of two or three units can defend against a horde of 40 due to bad rolls.\n\nFor seasoned boardgame players the luck factor makes this game a pain to participate in. Although I would defend this retail style game more than other similar games such as Monopoly. Yes this game will be filled will minis by the end of your session, but your hand and what you can do is always simple. The complexity is so low that even young children can play.\n\nThe game is made really with 4 players. Even 2 with an 'AI' player doesn't feel as real and engaging. 3 players often leads to a tug of war and bystander scenario. Whereas 4 balances the globe and allows enough push and pull to have an engaging session for approximately 2 hours.",
    "timestamp": 1738018800
  },
  {
    "username": "DaddyDosDeuce",
    "rating": 7.5,
    "comment": "Saw heavy play during my childhood. Have a couple of copies of this game still in my possession, but it'll be hard to get people to play this with so many better war games out there. At most, maybe will see the occasional nostalgia play, or when I can convince my kids to let me destroy them in a session. I guess the dice rolling aspect of this game turns a lot of people off, but I still think the current rating of the game (under 6.0) is a travesty.",
    "timestamp": 1737586800
  },
  {
    "username": "LaurenAlise",
    "rating": 8.0,
    "comment": "2.1 Complexity Rating",
    "timestamp": 1735599600
  },
  {
    "username": "Samh7",
    "rating": 8.2,
    "comment": "Family-game-War game- Strategy40%-Chance60%-Gateway-best: 4-5 players",
    "timestamp": 1735254000
  },
  {
    "username": "Gurluzer",
    "rating": 8.0,
    "comment": "bu hobideki ilk göz ağrım, masaya indiğinde hala ilk günkü gibi heycanla oynuyorum",
    "timestamp": 1734217200
  },
  {
    "username": "Wan_Chai",
    "rating": 8.0,
    "comment": "One of the first turn-based board games I've played and love.",
    "timestamp": 1733526000
  },
  {
    "username": "beaker",
    "rating": 8.0,
    "comment": "After all these years, still great fun, and miles better with missions.",
    "timestamp": 1730502000
  },
  {
    "username": "powers123",
    "rating": 7.5,
    "comment": "A classic, it gets the high rating because it was one of the first games I played with my brother and dad for the long battles. Good memories.",
    "timestamp": 1728943200
  },
  {
    "username": "claidheamdanns",
    "rating": 8.0,
    "comment": "This is the 2013 Parker Brothers Classic Reproduction of the 1959 First Edition",
    "timestamp": 1728597600
  },
  {
    "username": "craftyalien",
    "rating": 8.0,
    "comment": "Fun game, as always. Has stood the test of time as an engaging game, with unexpected game-changing strategizing by opponents (and yourself). Makes you rethink your strategy every turn.",
    "timestamp": 1727560800
  },
  {
    "username": "kefaspierre2",
    "rating": 8.0,
    "comment": "Love it!\nBut I only have it in Swedish so its in my home country and not in my home.",
    "timestamp": 1727301600
  },
  {
    "username": "PurpleOmelette",
    "rating": 8.0,
    "comment": "The only downside is how long it takes to play. Amazing strategy game and a classic",
    "timestamp": 1727215200
  },
  {
    "username": "kastel",
    "rating": 8.0,
    "comment": "Mi",
    "timestamp": 1717797600
  },
  {
    "username": "Mandealerson",
    "rating": 8.0,
    "comment": "Childhood game that was considered one of the most intense. Played a ton in high school too and college. Never gets old trying to rule the world. I love playing form Australia...get early bonus and 1 front to battle from.",
    "timestamp": 1716156000
  },
  {
    "username": "Waveshock",
    "rating": 8.0,
    "comment": "Finca",
    "timestamp": 1714946400
  },
  {
    "username": "filip_152",
    "rating": 8.0,
    "comment": "I love Risk, but understand why many don't. One of the games that introduces some concepts that are still used in many board games.",
    "timestamp": 1712095200
  },
  {
    "username": "BearDen",
    "rating": 8.1,
    "comment": "Family Owned\nMy family created Nuclear Risk where you have a home country ( flip whenever, add to discard pile, and add 5 armies). Every time a double is rolled, you flip over a country card to be nuked. Use normal deck of cards (sets/runs) for armies. Pay 2 armies to denuclearize a country.",
    "timestamp": 1711580400
  },
  {
    "username": "Duurs",
    "rating": 8.0,
    "comment": "All time favorite",
    "timestamp": 1710975600
  },
  {
    "username": "TravisWhit",
    "rating": 7.5,
    "comment": "Classic game of strategy and not to complex",
    "timestamp": 1708815600
  },
  {
    "username": "graybeard76",
    "rating": 8.0,
    "comment": "Spent many an hour playing this as a boy, then playing it with my son. Board gaming may have moved beyond a game like this, but it still holds a fond place in my heart.",
    "timestamp": 1704927600
  },
  {
    "username": "NotCarGuy",
    "rating": 8.0,
    "comment": "Although it was long, it was fun to play! It too a while to get to a winner, but it was fun chatting, rolling, and just doing fun stuff to pass the time!\n\nShould definitely recommend doing it with friends who won't get too anxious about people getting up and doing other things",
    "timestamp": 1703804400
  },
  {
    "username": "MarthaFuller73",
    "rating": 8.0,
    "comment": "A classic",
    "timestamp": 1698012000
  },
  {
    "username": "JussnPedro",
    "rating": 8.0,
    "comment": "brazilian version",
    "timestamp": 1697752800
  },
  {
    "username": "dearphilly",
    "rating": 8.0,
    "comment": "Great game but takes a while! Possibly my favourite strategy game as it has a push your luck element. Played with 4 players and loved the carnage when others were fighting each other.",
    "timestamp": 1697234400
  },
  {
    "username": "Eddie4x",
    "rating": 8.0,
    "comment": "What a great game, such a classic game easy to teach and loads of variants to spice it up",
    "timestamp": 1696284000
  },
  {
    "username": "SkyWoocaY",
    "rating": 8.0,
    "comment": "1-5/6 Players (Steam & Alexa)",
    "timestamp": 1693778400
  },
  {
    "username": "zman1234",
    "rating": 8.0,
    "comment": "really fun but it takes a long time to setup and play but its worth it and 30 dollars or however much it is",
    "timestamp": 1692741600
  },
  {
    "username": "Iamthemountain",
    "rating": 8.0,
    "comment": "Love risk, just don't have anyone to play with.",
    "timestamp": 1692050400
  },
  {
    "username": "johnny_grohl",
    "rating": 8.0,
    "comment": "a classic game that is fun and very competitive",
    "timestamp": 1691100000
  },
  {
    "username": "JimHackerMP",
    "rating": 8.0,
    "comment": "Only thing I don't like are the counters. A little hard to remember what's 1, 5 and 10. Also, contains \"secret missions\" deck (optional) which is kind of neat.",
    "timestamp": 1687989600
  },
  {
    "username": "Colombian85",
    "rating": 8.0,
    "comment": "Gekauft: 33,90€",
    "timestamp": 1680386400
  },
  {
    "username": "xmorridin",
    "rating": 7.5,
    "comment": "Classic. It doesn't get much better.",
    "timestamp": 1673132400
  },
  {
    "username": "Stroodle88",
    "rating": 8.0,
    "comment": "Something like the 1960 edition. Purchased from Guardian Games used for $10",
    "timestamp": 1672441200
  },
  {
    "username": "David68",
    "rating": 8.0,
    "comment": "David",
    "timestamp": 1672009200
  },
  {
    "username": "LDO91",
    "rating": 8.0,
    "comment": "De la stratégie, de la diplomatie et un peu de chance !\n\nJeu sympa, qui demande de la stratégie et qui peut devenir un excellent jeu dans les parties plus nombreuses, avec de la diplomatie, les alliances se font et se déchirent, les promesses se brisent et il faut vraiment être bon pour sortir son épingle du jeu et convaincre les autres de s'entre tuer. La partie est un peu longue et les objectifs faciles à deviner. Je préférais l'ancien système de bonus de troupes via les cartes plutôt que le cheval. Mais rien n'empêche de l'utiliser !",
    "timestamp": 1671231600
  },
  {
    "username": "The_Red_Meeple",
    "rating": 8.0,
    "comment": "The first one for us, before gaming was gaming",
    "timestamp": 1670281200
  },
  {
    "username": "Evil Azrael",
    "rating": 8.0,
    "comment": "Deutsch",
    "timestamp": 1670022000
  },
  {
    "username": "Acrimonous",
    "rating": 8.0,
    "comment": "Ratings for this game is bad but this game takes a lot of strategy and hidden secrets. Love playing this game but would like it better if I had better competitive players.",
    "timestamp": 1669762800
  },
  {
    "username": "SymbioteCollectibles",
    "rating": 8.0,
    "comment": "Such a great game I use to play all the time all the kid. Great miniatures and a ton of fun.",
    "timestamp": 1669071600
  },
  {
    "username": "j111194",
    "rating": 8.0,
    "comment": "A classic",
    "timestamp": 1668207600
  },
  {
    "username": "palmarragg",
    "rating": 8.0,
    "comment": "The first tactical board game I played and I thought it was so good that we played it again and again and after that I started experimented with bigger and more complex board games that I love - Risk was the beginning to all!",
    "timestamp": 1667170800
  },
  {
    "username": "HenryMBodnar1988",
    "rating": 8.0,
    "comment": "Still have my game that was given to me for my birthday in the late 60's. All the armies are the wood pieces.",
    "timestamp": 1662674400
  },
  {
    "username": "badcomma",
    "rating": 8.0,
    "comment": "My game of Risk dates back to the early seventies. The box is held together by duct tape. Back then, it was always me and dad at the end - after dispatching Mom and my yonnger siblings. He won every game until I was about fifteen, then I turned the tide and dominated.\n\nIt's one of the greatest games ever created, but I have two critiques. Too much rides on the roll of the dice. You can have flawless strategy and execution, and lose badly on the chance of dice. Secondly, in my experience, women don't seem to like this game.\n\nSome may criticize the potential length of the contests. We've had games continue until the break of dawn. IMO, that's one of the best parts of Risk, the battle of attrition.",
    "timestamp": 1662328800
  },
  {
    "username": "SamHuston",
    "rating": 8.0,
    "comment": "I'm surprised this has such a low rating on BGG. I absolutely love the options Risk gives you as a player. Losing battles one after the other can be brutal, but the planning that goes into them, and in defending your territories, is a real joy",
    "timestamp": 1661724000
  },
  {
    "username": "theclay",
    "rating": 7.5,
    "comment": "Used to play this game a ton on BBS and as a stand-alone computer game. Probably only played it Face-to-face a few times. We always played Axis & Allies instead.",
    "timestamp": 1661119200
  },
  {
    "username": "Larry_Wayne",
    "rating": 8.0,
    "comment": "Risk is very long, but very worth it!\nIts always a memorable game night when you play Risk. This version's early 17th century theme just feels right (IMO). The packaging, box and board quality are above average for the price point! It should be part of everybody's board-game collection.",
    "timestamp": 1660860000
  },
  {
    "username": "eladnl",
    "rating": 7.5,
    "comment": "V(OLD)\nWe used to play Risk a lot during my teenage years. It was highly popular, but somehow interest in it disappeared...\nThe game is long and player elimination brings to boredom of eliminated players. Nonetheless, lots of hours of fun are guaranteed.",
    "timestamp": 1656799200
  },
  {
    "username": "sam1696",
    "rating": 8.0,
    "comment": "(3/5) Conquest",
    "timestamp": 1652479200
  },
  {
    "username": "Maxh150",
    "rating": 8.0,
    "comment": "Great strategy game focused on taking over the world! Love building up my army and going in for slow but steady battles.",
    "timestamp": 1648504800
  },
  {
    "username": "invalid",
    "rating": 7.5,
    "comment": "I have played this several times. Many of those, I can recall events that caused my victory or defeat. It is a classic and a good basic strategy game for beginners. The only draw back... it takes forever. My friends and I usually play it as a World Domination Night with several other games on hand for the players that get eliminated.",
    "timestamp": 1646434800
  },
  {
    "username": "Espacioconjuegos",
    "rating": 7.5,
    "comment": "Comprado en Alcampo en la Navidad de 2021",
    "timestamp": 1646348400
  },
  {
    "username": "TEN27",
    "rating": 8.0,
    "comment": "Childhood favorite. The amount of friendships that almost collapsed due to this game is amazing. Witnessed my two friends fist fight each other frequently over this game, while I was the smart one to form an alliance with the stronger player. This game had it all in my mind, 'take that' moments, dice based battles (love the stress that adds), 'dudes on a map', area control, etc. Wish I could find a game like RISK that seriously plays well with 2 (and more).",
    "timestamp": 1644102000
  },
  {
    "username": "SquareParticle",
    "rating": 8.0,
    "comment": "I likely rate this so highly due to nostalgia. I loved playing this game as a kid, and still do to this day.",
    "timestamp": 1643756400
  },
  {
    "username": "stevejuggler",
    "rating": 8.0,
    "comment": "Al, Pete, Jeff, Andy, Dave and I are currently working through Risk Legacy Series 1 (again)",
    "timestamp": 1641596400
  },
  {
    "username": "illilli",
    "rating": 8.0,
    "comment": "I have played this game more than any other game on the planet. I think it is a tremendous game that has obviously stood the test of time as an all-time classic. I am always willing to play it, I never care whether I win or lose, and I feel like I've played many Epic games of it.",
    "timestamp": 1641423600
  },
  {
    "username": "Guvnor",
    "rating": 8.0,
    "comment": "Only got this game in 2020, recommended to me. Absolutely became addicted to it until my friends and I realised that 99% of the time, whoever goes first, wins!! My only flaw with it!!",
    "timestamp": 1640214000
  },
  {
    "username": "Manti1966",
    "rating": 7.5,
    "comment": "",
    "timestamp": 1639004400
  },
  {
    "username": "Fireballed",
    "rating": 7.5,
    "comment": "Dec 2021 upgraded rating to 7.5 - old game, but still fun.",
    "timestamp": 1638918000
  },
  {
    "username": "droberts441",
    "rating": 8.0,
    "comment": "My first war game. I spent many an hour playing this game with my brother the summer he broke his leg in third grade. A great game that you can buy anywhere. I remember where I was when I first saw this game; I was at someone's birthday party (it was a gift) and after playing it, I wasn't satisfied until I got one. Monopoly and Clue went down several notches for a while when I got this game.",
    "timestamp": 1638054000
  },
  {
    "username": "Tonantzin",
    "rating": 7.6,
    "comment": "Un bon classique, bon rapport qualité/prix (25CAN$) pour la meilleure version classique qui n'Est plus en vente officielle !",
    "timestamp": 1635894000
  },
  {
    "username": "Koryes",
    "rating": 7.5,
    "comment": "-Enfundado o no necesita fundas",
    "timestamp": 1634680800
  },
  {
    "username": "jpgoeller",
    "rating": 8.0,
    "comment": "Verkauft",
    "timestamp": 1634248800
  },
  {
    "username": "Jmccue",
    "rating": 8.0,
    "comment": "Absolute classic game that got me started in board gaming. I am still always up for a game of Risk and hate to see that it gets such a bad reputation now. Lots of fun versions of Risk but the classic is still great!",
    "timestamp": 1626559200
  },
  {
    "username": "HerbertML",
    "rating": 7.6,
    "comment": "Very easy game, very easy system. As a teenager I had a lot of fun with this game.\n/*#M1*//*stay*/",
    "timestamp": 1625263200
  },
  {
    "username": "elpisete",
    "rating": 8.0,
    "comment": "25",
    "timestamp": 1624140000
  },
  {
    "username": "Malakizedek",
    "rating": 7.5,
    "comment": "I love Risk. When I was a kid, I always wanted to ply this, but could never find anyone to play with me. Now, I still enjoy it for the nostalgia, but it IS long and it can drag and there are better games than Risk that fill a similar niche.",
    "timestamp": 1618783200
  },
  {
    "username": "pjotrkap",
    "rating": 8.0,
    "comment": "Played it a lot in my student times (long ago :-))\nnice game !!!\nI lost the rules of this version, maybe someone?",
    "timestamp": 1618696800
  },
  {
    "username": "alyogali",
    "rating": 7.8,
    "comment": "No",
    "timestamp": 1616799600
  },
  {
    "username": "uberneil",
    "rating": 8.0,
    "comment": "Risk is long but enjoyable, I never win because everyone teams up against me but that is the RISK I take when I play the game",
    "timestamp": 1616540400
  },
  {
    "username": "Gloomhavener",
    "rating": 8.0,
    "comment": "I do recommend this game, but not for players who like to play for a short time.",
    "timestamp": 1615244400
  },
  {
    "username": "ASaradaTroy21",
    "rating": 8.0,
    "comment": "Risk a fun game where players start with a certain number of troops and are expected to dominate the world using those troops and addition troops gained every turn. Players can receive troops by owning territories, and if one players owned all locations in a continent, then they receive a continental bonus. Risk is based heavily on luck, but there is some strategy involved. I do enjoy playing the game, but wish that there was some way release some of the luck based mechanics present. Overall, this is a very good game and would recommend it to anyone trying to find a board game with little skill and strategy involved.",
    "timestamp": 1612566000
  },
  {
    "username": "JchenTroy21",
    "rating": 8.0,
    "comment": "I enjoy how risk puts you in charge of your own decisions and what to do with your troops. It's fun to dominate over your friends and really builds up the intensity when you lose/gain land.",
    "timestamp": 1612479600
  },
  {
    "username": "JMakowskiTroy21",
    "rating": 8.0,
    "comment": "Risk is a fun game to play but also takes very long and many times we don’t end up finishing it just because the more people that you have the way longer it will end up lasting especially if you’re playing with people who know how to play it takes a lot longer.",
    "timestamp": 1612479600
  },
  {
    "username": "sanuma",
    "rating": 8.0,
    "comment": "Para mi, el mejor juego de la conquista del mundo",
    "timestamp": 1611270000
  },
  {
    "username": "Brandon04",
    "rating": 9.0,
    "comment": "Definitely makes my list of games I need to save.",
    "timestamp": 1743116400
  },
  {
    "username": "DrSocrates",
    "rating": 9.0,
    "comment": "The first board game I bought. It was 1978 and I was 10. Played it with my friends for countless nights.",
    "timestamp": 1737673200
  },
  {
    "username": "TimoDevincke",
    "rating": 9.0,
    "comment": "A classic that I always enjoy playing with friends. Only downside is that games can become lenghty.",
    "timestamp": 1735599600
  },
  {
    "username": "Moiz_",
    "rating": 9.0,
    "comment": "A good strategic game to start with - it's a highly engaging game. It's a great example of keeping your foes close and your allies closer.\nInitially, you have to spawn all your troops one by one. Make sure to spawn all your troops close together.\nTaking over continents is crucial, as they give you extra troops every turn. Watch out for Australia - it's got just one way in, making it a hot target early on. You'll need friends to win, but don't trust them too much - they might stab you in the back when you least expect it!\nSmart players know to pick their battles. Sometimes it's better to bulk up your forces than spread them thin. Watch those with the most territories - they get more troops each turn, making them stronger. But if everyone teams up against them, they'll fall hard.",
    "timestamp": 1733007600
  },
  {
    "username": "nasosp01",
    "rating": 9.0,
    "comment": "-- Permanent game of my collection --\nPlaying and debating with my children .",
    "timestamp": 1730502000
  },
  {
    "username": "chadsg",
    "rating": 9.0,
    "comment": "Great strategy game. There's a fair amount of luck involved, but overall it can be real fun to play. It can also take a long time to play, but you don't realize it because time really flies by when playing it.",
    "timestamp": 1722117600
  },
  {
    "username": "upinflames89",
    "rating": 9.0,
    "comment": "A classic game that I am always willing to play.",
    "timestamp": 1716847200
  },
  {
    "username": "LeeLa88",
    "rating": 9.0,
    "comment": "Hab die kleine Blaue edition mit den falschen Missionen\nMarc besitzt die Deluxe version",
    "timestamp": 1712700000
  },
  {
    "username": "Katanalx",
    "rating": 9.0,
    "comment": "10 is only for Chess if you know what I mean...",
    "timestamp": 1712527200
  },
  {
    "username": "SnowDH",
    "rating": 8.5,
    "comment": "CC125",
    "timestamp": 1709679600
  },
  {
    "username": "Reedy8",
    "rating": 8.8,
    "comment": "One of the best games ever. Been playing this since 1975 countless times. I’ll never say never. Play time 2hrs to 2 days if beer is involved.",
    "timestamp": 1709506800
  },
  {
    "username": "The_Dionysian",
    "rating": 9.0,
    "comment": "Very fun. Australia is broken though.",
    "timestamp": 1698879600
  },
  {
    "username": "JPSFOX",
    "rating": 9.0,
    "comment": "My friends and I always loved playing risk many years ago but we just don't break it out anymore.",
    "timestamp": 1698012000
  },
  {
    "username": "RenaudMFC",
    "rating": 9.0,
    "comment": "A classic game that I highly recommend!",
    "timestamp": 1693951200
  },
  {
    "username": "ShurikF",
    "rating": 9.0,
    "comment": "un muy buen juego de estrategia por turnos",
    "timestamp": 1692482400
  },
  {
    "username": "Zanov",
    "rating": 9.0,
    "comment": "Versión corta de 1984 en español y Nuevo Risk con nuevas reglas 2020.",
    "timestamp": 1690840800
  },
  {
    "username": "JimHackerMP",
    "rating": 9.0,
    "comment": "Nice looking wooden box that saves a lot of space. Great using the wooden cubes and ovals (like in the '59 repro).",
    "timestamp": 1687989600
  },
  {
    "username": "Cornflakecake",
    "rating": 9.0,
    "comment": "Stalwart of the \"more than just blind luck\" games! You feel like a proper grown up when you can play this well",
    "timestamp": 1686693600
  },
  {
    "username": "malefictum",
    "rating": 9.0,
    "comment": "I thought it will be bad game\nI made a mistake\nThis is a good game for anyone)",
    "timestamp": 1682028000
  },
  {
    "username": "MurrayTO",
    "rating": 9.0,
    "comment": "Contents: Very Good Box: Good; some splitting on edges of box lid Component Completeness : complete Version: English/French Parker Bothers Canadian Edition 1975",
    "timestamp": 1677193200
  },
  {
    "username": "TheCrazyRussian",
    "rating": 9.0,
    "comment": "The game that started it all. My favorite ameritrash game.",
    "timestamp": 1676502000
  },
  {
    "username": "jorisbatelaan",
    "rating": 9.0,
    "comment": "Rank: 13261\nTime: 120 min\nWeight: 2,11",
    "timestamp": 1675724400
  },
  {
    "username": "RodeSquirl",
    "rating": 9.0,
    "comment": "Classic that always will stay good",
    "timestamp": 1675638000
  },
  {
    "username": "mothertruckin",
    "rating": 9.0,
    "comment": "The occasional game of mission risk can be awesome, especially with kids. I prefer spicing it up with capitals and the official variants or the 12 or 14 card version of mission risk. Risk is still fun for me as long as it only takes an hour or so. Martian Risk is also cool, in fact there are a lot of pretty sweet variants (Euro Risk). Risk is essentially a durable game kit, which is why it appeals to me. Wood pieces only! I've never liked the plastic versions as much, whether numerals, stars or figures (or arrows).",
    "timestamp": 1659477600
  },
  {
    "username": "AmoralGamer",
    "rating": 9.0,
    "comment": "Much nostalgia. Still fun",
    "timestamp": 1648162800
  },
  {
    "username": "TMcgaughey84",
    "rating": 9.0,
    "comment": "Risk: My First Love.",
    "timestamp": 1643065200
  },
  {
    "username": "JBiggsjr7",
    "rating": 9.0,
    "comment": "Call me old school but I'm always up for a game of Risk",
    "timestamp": 1641250800
  },
  {
    "username": "ubeep",
    "rating": 9.0,
    "comment": "The ultimate classic Godfather of Desktop gaming. You can't go wrong with Risk",
    "timestamp": 1628114400
  },
  {
    "username": "ParminderSingh",
    "rating": 9.0,
    "comment": "this is one great game. Only if more maps can be produced apart from World map. Online game has many maps which makes it really interesting game.",
    "timestamp": 1620597600
  },
  {
    "username": "Jan__Zizka",
    "rating": 8.5,
    "comment": "Oldie but glodie",
    "timestamp": 1614812400
  },
  {
    "username": "SatinIridium317",
    "rating": 9.0,
    "comment": "Awesome game. Risk was the board game that got me into board games. It didn't get a 10 out of 10 because of the potential lengths it can be stretched to. I've played this game twice and I've only managed to finish one full game.",
    "timestamp": 1606777200
  },
  {
    "username": "Lord Flashheart",
    "rating": 9.0,
    "comment": "Quite simply a classic. A fantastic way to spend an evening with a bunch of friends!",
    "timestamp": 1605654000
  },
  {
    "username": "Benguino",
    "rating": 9.0,
    "comment": "Easily one of the best games of all time. Big difference in strategy between an experienced player vs. an inexperienced player. Games can go for a looong time if players have a similar skill level. Better with 3 or more but doable with 2, with some variation.",
    "timestamp": 1604876400
  },
  {
    "username": "Musturd",
    "rating": 9.0,
    "comment": "Got so many days of fun out of this game, one of my favourite",
    "timestamp": 1602453600
  },
  {
    "username": "AKapalaTroy20",
    "rating": 9.0,
    "comment": "Great game that relies heavily on strategy and sometimes forming alliances and agreements with other players. Has some amount of luck involved when fighting but overall is pure strategy.",
    "timestamp": 1599688800
  },
  {
    "username": "egwoolsie",
    "rating": 9.0,
    "comment": "Wooden game pieces have been switched with plastic ones.",
    "timestamp": 1598392800
  },
  {
    "username": "casualjoe",
    "rating": 9.0,
    "comment": "I love this kind of games where you have to fight over territories. The game is however too long and a bit random to be a 10.",
    "timestamp": 1596751200
  },
  {
    "username": "Gigi_83",
    "rating": 9.0,
    "comment": "Fantastic game",
    "timestamp": 1593640800
  },
  {
    "username": "danii1401",
    "rating": 9.0,
    "comment": "creo que lo seguire jugando",
    "timestamp": 1588111200
  },
  {
    "username": "vouncher",
    "rating": 9.0,
    "comment": "El ultimo juego de una era... o el primero de otra...",
    "timestamp": 1572822000
  },
  {
    "username": "R0xeeqc",
    "rating": 8.5,
    "comment": "2010",
    "timestamp": 1571004000
  },
  {
    "username": "Prasanthjim",
    "rating": 9.0,
    "comment": "Interesting game which lasts for more than 2 hours!!!",
    "timestamp": 1569967200
  },
  {
    "username": "Vlizze",
    "rating": 9.0,
    "comment": "x",
    "timestamp": 1569708000
  },
  {
    "username": "retrosoldier",
    "rating": 9.0,
    "comment": "Love the 60s wooden cube versions.\nI've been interested in, and played war games most of my life...but most have just caused headaches and sleepless nights (too complicated or confusing).\nRisk has the fundementals; territory, armies that move and fight, reinforcement, (easy to incorporate a Naval component), and dice rolling that resolves combat; just like all the other games!\nWith some imagination and creative table-talk, this Napoleonic/colonial war game can really satisfy and won't cause stress.",
    "timestamp": 1568930400
  },
  {
    "username": "cobro",
    "rating": 9.0,
    "comment": "loved this as a child. But as others have said, the trade-in cards usually end up with one person sweeping across 2/3 of the world and if they don't wipe out the other side, their opponent trades in their cards on the next turn and wins.",
    "timestamp": 1568239200
  },
  {
    "username": "major_rawne02",
    "rating": 9.0,
    "comment": "The classic. Probably the game responsible for my love of boardgames to this day. Strategic gameplay, luck, and more than a little backstabbing are the tools leading to victory here",
    "timestamp": 1565042400
  },
  {
    "username": "Mrticktack",
    "rating": 9.0,
    "comment": "Be careful who you play with, this is the most aggressive game of all time. The staple game of childhood, adolescence and adulthood. For some reason I compare all war games to risk. It's as natural as comparing all bluffing games to poker and all strategy games to chess.\n\nWay too much luck for my taste, but once in a while you just want to smash dice on the table!!",
    "timestamp": 1557871200
  },
  {
    "username": "big_booboo",
    "rating": 9.0,
    "comment": "This is the game that got me to take board games seriously. I love the aspect of having to be able to fly under the radar until it's too late for the other players to stop you. Or setting up things just right so that it's in a player's best interest to attack someone else even though he knows you are winning. Another thing I enjoy is talking other players into courses of action that benefit me in the long run. Risk may be a massive dice-fest, but it's interesting to observe how little the luck of the dice affect the final outcome.",
    "timestamp": 1555624800
  },
  {
    "username": "BlackPhalanx",
    "rating": 9.0,
    "comment": "1993 version",
    "timestamp": 1553036400
  },
  {
    "username": "RawiriJS",
    "rating": 9.0,
    "comment": "Yes I like Risk. The only thing I don't like about it is how long it takes, I don't play it often because of this, but when I have a day where I don't have a lot planned this is something that springs to mind.\n\nGameplay time can make finding other players impractical , but it plays well solo so that isn't a problem.\n\nAlways a place for it on my shelf, timeless classic.",
    "timestamp": 1546038000
  },
  {
    "username": "bsquared169",
    "rating": 9.0,
    "comment": "I always enjoy playing risk, but it isn't for every board game gathering. you need a specific crowd and to plan on dedicating an evening around it. Games are long. It sucks with bigger crowds when people get out early, but others remain in game for hours on end. On the occasions I do get a good group together for risk, it is very memorable. I recommend the PC version which saves time if you can set up the space for it.",
    "timestamp": 1538949600
  },
  {
    "username": "Gecko97",
    "rating": 9.0,
    "comment": "Classic wargame, with simple rules. A nice blend of planning and luck - bad luck will rarely derail a good plan, but may delay it just long enough ...",
    "timestamp": 1536012000
  },
  {
    "username": "David Stennett",
    "rating": 8.5,
    "comment": "Addictive and simple for almost anybody to quickly learn and play. Taught me a lot about strategy, strength, negotiation and alliance. Played to death as kid.\n\nInspired me to design the Moral Conflict civilization games with a more complicated, realistic and skill full Military War dimension.",
    "timestamp": 1535234400
  },
  {
    "username": "GameTutor",
    "rating": 9.0,
    "comment": "I have 2 copies, and RG has a 3rd copy.\n>>>>> Holding for WI Mensa (3rd copy)",
    "timestamp": 1526594400
  },
  {
    "username": "yauyyb",
    "rating": 9.0,
    "comment": "only if you play with 4. And only if you play with the no dice, simultaneous action variant",
    "timestamp": 1518303600
  },
  {
    "username": "Prismamew",
    "rating": 9.0,
    "comment": "2014 - Played with Ben and friends from Barrhaven (3-6, Best 4)",
    "timestamp": 1515106800
  },
  {
    "username": "Rubiroth",
    "rating": 9.0,
    "comment": "2010 versie",
    "timestamp": 1515106800
  },
  {
    "username": "Hand2Hand",
    "rating": 9.0,
    "comment": "Have a couple of these. It's amazing playing this game on its original board.",
    "timestamp": 1514847600
  },
  {
    "username": "TylakSpacejam",
    "rating": 8.8,
    "comment": "Love Risk! I just wish everyone else felt the same way.",
    "timestamp": 1511996400
  },
  {
    "username": "Leondavinciclassic12",
    "rating": 9.0,
    "comment": "I've played this board game and found this so absorbing and would play again.",
    "timestamp": 1510873200
  },
  {
    "username": "jasowas",
    "rating": 9.0,
    "comment": "One of the games in my youth",
    "timestamp": 1510786800
  },
  {
    "username": "Hunter2001",
    "rating": 9.0,
    "comment": "Classic, Great strategy game, very long, winning based on luck more than strategy at times, winner becomes obvious fairly quickly",
    "timestamp": 1508709600
  },
  {
    "username": "kindakrazy",
    "rating": 9.0,
    "comment": "Wonderful game of strategy for kids and adults! I have played this game for many years and have fond and bitter memories. Watch out as this game can cause tensions to rise if you're with a group of competitive friends! Have fun",
    "timestamp": 1502661600
  },
  {
    "username": "Brokenearth",
    "rating": 9.0,
    "comment": "Classic game of Risk, its what got me into the war game genre, and as such will always hold a special place in my heart",
    "timestamp": 1499292000
  },
  {
    "username": "SgtTodd",
    "rating": 9.0,
    "comment": "Found on ebay cheap!\n\nUsed to play this with the gang at the end of the bar at Rick's in Fells Point, Baltimore.",
    "timestamp": 1493416800
  },
  {
    "username": "Vodot",
    "rating": 9.0,
    "comment": "Suck it, haters! RISK is THE most accessible/popular \"wargame\" (which is actually a social dice game), and probably always will be. I'll ALWAYS play a game of RISK, unless I have a group with more time and more complex taste/ability.\n\nRISK is ridiculously simple, should play much faster than most people seem to report, and ends fast. The more you play with the same group, the better and obviously faster the game gets, until you graduate as a group to something more complicated.\n\nIs it random? Yes it is. Do the dice favor the attacker? Yes they do.\n\nRisk is not a war game, a simulation game, or a strategy game: It is dice + diplomacy, sprinkled with a few superficial flakes of 'strategy'. Stop \"defending\" and ignore the temptation to \"plan\" or \"prepare\". Turns should take five minutes, and the game, no longer than an hour (2-4 players) or two (with 6) when you play by the rules, i.e., with INCREASING rewards for tuning in cards.",
    "timestamp": 1492034400
  },
  {
    "username": "joebelanger",
    "rating": 9.0,
    "comment": "Classic! Gather the guys and have a grand old throwback to your days as a thirteen year old.",
    "timestamp": 1475532000
  },
  {
    "username": "trainmaster027",
    "rating": 9.0,
    "comment": "What can I say?\nA true classic!",
    "timestamp": 1466200800
  },
  {
    "username": "darbjustic",
    "rating": 9.0,
    "comment": "Though I don't play it as much lately, this is one of my favorite games of all time. I think I prefer to play with the mission cards instead of world domination. Frankly, many times the mission cards leads to nearly-world-domination anyway.",
    "timestamp": 1464904800
  },
  {
    "username": "evingerm@epix.net",
    "rating": 9.0,
    "comment": "2008 hasbro updated pieces",
    "timestamp": 1460584800
  },
  {
    "username": "taemx",
    "rating": 9.0,
    "comment": "One of my gaming groups favorite, standard Risk is a classic that lasts the ages. Most players find it boring and drawn out with a simplistic plot, however strategists like myself love it and find 50% of the game is reading you're enemies (players) faces to determine their mission or objectives.",
    "timestamp": 1458687600
  },
  {
    "username": "bowie47",
    "rating": 8.5,
    "comment": "Cant believe this does not score higher. Always stood the test of time as far as i am concerned. Right amount of skill and luck",
    "timestamp": 1455577200
  },
  {
    "username": "DarrylFerster",
    "rating": 9.0,
    "comment": "I have many copies. I had never played Risk until near the end of university.\n1-3. Garage sale copies, likely paid $2, $2, $5. Wooden or plastic cubes. 1953 boards. Boxes all in terrible shape.\n4. Garage sale copy, likely paid $2, with Napoleonic plastic pieces. 1993 map. Mission cards. Napoleon on the box.",
    "timestamp": 1422313200
  },
  {
    "username": "Ian2014",
    "rating": 9.0,
    "comment": "It’s Risk what more is there to say. Absolute classic game.\n\nCan be comical, frustrating, exciting and exhausting among other words when negotiating alliances.",
    "timestamp": 1421967600
  },
  {
    "username": "tayo666",
    "rating": 8.5,
    "comment": "Gift",
    "timestamp": 1418425200
  },
  {
    "username": "3sapphires",
    "rating": 9.0,
    "comment": "2,3,4,5,6 p",
    "timestamp": 1411077600
  },
  {
    "username": "lunamoth",
    "rating": 9.0,
    "comment": "I know it's a little odd and has been described by friends as \"disturbing\", but we have different personas when playing the game, due to our preferred troop deployment. One friend is Adolf Hitler because he always starts in Europe, another is Saddam because she starts in the Middle East, and I am Imelda Marcos because I start in Australia /Indonesia. We've had Lenin, Teddy Roosevelt, Alexander the Great, Stalin, Napoleon, Ivan the Terrible, the British Tea Company, the Vikings etc etc etc.\n\nAnother of our \"variations\" is that we provide \"rations\" to the troops in the form of Reese's Pieces or M&Ms (they serve no purpose besides entertainment).\n\nWe also have props appropriate for our personas, like Saddam has a fan and some Doritos(what he was found with while hiding during the Iraq War). I have some Barbie shoes because I'm Imelda and she has over 1000 pairs of shoes. Hitler has an easel from a dollhouse (apparently Hitler had been in art school as a young man)\n\nWe have several versions. Usually we switch between boards, everyone picks which style troops we want, and mix up the cards (making sure that there are the bright numbers, of course).\n\nGames last until we are too tired to play any more, sometimes all night long.\nUsually Hitler wins. I've won once, Saddam has won once, and in one game Teddy Roosevelt tied with Hitler.",
    "timestamp": 1410386400
  },
  {
    "username": "gethankins",
    "rating": 9.0,
    "comment": "I still love this game. In many ways, I feel like this the same way I do about Monopoly - it is what taught be to love board games, and while I've outgrown it, I still like to visit it and be nostalgic. And it's still fun to roll a lot of dice, and it's fun to negotiate with people.",
    "timestamp": 1406498400
  },
  {
    "username": "joanofarcadia",
    "rating": 9.0,
    "comment": "Complete??",
    "timestamp": 1404684000
  },
  {
    "username": "Teacher Of Madness",
    "rating": 9.0,
    "comment": "The low score on here for Risk is criminal. Classic, classic game.",
    "timestamp": 1402783200
  },
  {
    "username": "joe canuck",
    "rating": 8.5,
    "comment": "Replenish, attack, reinforce: the classic game of world conquest that still works effectively to this day. Luck with the dice determines victory or defeat, and there are options to keep the game competitive. However, some players will think too defensively or build up at key points, making the game boring because it's really a question of military build up before combat.\n\nBIG PLUS: easy to learn, all ages, attainable victory conditions\nBIG MINUS: player style can affect the game",
    "timestamp": 1401314400
  },
  {
    "username": "Waterloo1815",
    "rating": 8.5,
    "comment": "So many owe their love of strategy and board games to this game. My brother used to walk miles to a friends house to play it. I've read many of the comments that rate the game lowly, I think they are the kind of player who think they are a genius and only lose because of bad luck! Met many during 30 years of gaming. Never mind. Enjoy risk for what Otis and praise it for the role it has played in our hobby.",
    "timestamp": 1393801200
  },
  {
    "username": "starvin",
    "rating": 9.0,
    "comment": "Crazy low BGG rating for the game that has defined a genre and kept so many of us happy, angry, euphoric and desperate for so many hours.",
    "timestamp": 1390690800
  },
  {
    "username": "PSloan",
    "rating": 8.5,
    "comment": "This will help introduce kids into wargaming.",
    "timestamp": 1390086000
  },
  {
    "username": "ZomBen",
    "rating": 9.0,
    "comment": "Love this game, a classic but it gets played like once every 5 years. Not many people wanna spend 3-6 hrs playing this.",
    "timestamp": 1381874400
  },
  {
    "username": "Shaynerichards72",
    "rating": 9.0,
    "comment": "Thanks to computer versions this game is a lot more accessible to play and you can perfect it a lot more than slowly going through countless physical games trying to get good opponents...I cannot be beaten...",
    "timestamp": 1381356000
  },
  {
    "username": "Rachel st",
    "rating": 9.0,
    "comment": "one of my favourite game",
    "timestamp": 1374271200
  },
  {
    "username": "atillaanddale",
    "rating": 9.0,
    "comment": "A lot of snobs turn their nose up at Risk, but it is a fine game. A game which introduced many of us to games. I do not mind the player elimination as long as you have something else to go to when it happens.\n\nI am always down to play Risk as long as you do not play using the rule where cards escalate in value.",
    "timestamp": 1373580000
  },
  {
    "username": "rjgomes",
    "rating": 9.4,
    "comment": "Nao fossem os dados e seria o rei dos jogos; o factor sorte nao tem como ser dispensado e isso retira-lhe um pouco da credibilidade de raciocinio, contudo, e um jogo envolvente e sempre diferente, ideal para uma tarde de domingo em convivio.",
    "timestamp": 1369864800
  },
  {
    "username": "4kadfan",
    "rating": 9.0,
    "comment": "THE war gaming strategy game of choice. No other game came close to producing the amount of emotional involvement. Playing this with a group of mates was incredibly frustrating/annoying and yet wierdly addictive too.\nWorked well with 6, a couple would always get beaten in short order. Everyone couldn't seem to avoid persuing their pet stragey despite obvious diadvantages.\nE.g Russia - no-one was allowed to take Russia, as to win that was to win the game. Getting North and then South America was a pretty good tactic as a springboard to world domination.\nAh, the broken promises, defeat snatched from the jaws of, well something.\nGlory days eh.",
    "timestamp": 1357858800
  },
  {
    "username": "darkk_",
    "rating": 10.0,
    "comment": "Super easy to play, yet tediously hours of dice chucking area control wargame that has numerous strategies!\n\nCaptivating ✅\nEngaging ✅\nReplayability ✅\nRules ✅\nQuality ✅\n\nMy BGG Perfect 10?\nAcquired 2+ ✅",
    "timestamp": 1760911200
  },
  {
    "username": "BoardGameGeekGuest",
    "rating": 10.0,
    "comment": "Risk can be fun and is very simple and easy to teach. You and the other players will have to be ok with: possibly being eliminated, dice determining combat, and long downtimes. But if you are playing with family or kids, Risk can serve as a fun game with more strategy than other options like monopoly or yahtzee.",
    "timestamp": 1758924000
  },
  {
    "username": "Maximaler",
    "rating": 10.0,
    "comment": "Tausendmal gespielt. Einfache Regeln, Interaktiv, Und der Hass und die Rachegelüste auf Mitspielern ist genial",
    "timestamp": 1756764000
  },
  {
    "username": "TheRiskMaster",
    "rating": 10.0,
    "comment": "Risk is a true classic. The rules are simple but the mix of strategy, alliances, and sudden betrayals makes it a lot of fun. Games can get long, but that’s part of the charm",
    "timestamp": 1756245600
  },
  {
    "username": "nathanwailes",
    "rating": 10.0,
    "comment": "My favorite board game of all time, I had so much fun playing this with my friends growing up. This game taught me to love spending huge amounts of time (during other people's turns) brainstorming and calculating what the best possible course of action is, something I've applied in my life over and over to great effect. It's also so simple that it's easy to experiment with adding house rules to spice up the game.\n\nI *would* say that your experience with this game is going to heavily depend on the group you play it with. I was playing with a friend who has a personality closest to that of Kanye West and so the games were incredibly entertaining as he would flip out regularly, I remember him chasing his brother around the table for like a minute straight once. The game could be a bore if you played with people unwilling to negotiate.",
    "timestamp": 1751925600
  },
  {
    "username": "El_KaBong",
    "rating": 10.0,
    "comment": "Classic. Easy and fun. Strategy and luck are both required.",
    "timestamp": 1750284000
  },
  {
    "username": "mothertruckin",
    "rating": 10.0,
    "comment": "50th-anniversary winning moves blue box. I couldn't pass it up on clearance. The map is a thing of early wargame beauty.",
    "timestamp": 1748296800
  },
  {
    "username": "Bighshow3305",
    "rating": 10.0,
    "comment": "Sarah's",
    "timestamp": 1745013600
  },
  {
    "username": "TrevorJr26",
    "rating": 10.0,
    "comment": "Ever rolled dice with your friends and moved little plastic guys around a map?",
    "timestamp": 1743458400
  },
  {
    "username": "Filigon",
    "rating": 10.0,
    "comment": "One of my favorite games to play with my friends",
    "timestamp": 1735426800
  },
  {
    "username": "Spartan519",
    "rating": 10.0,
    "comment": "A classic and will never turn down a request to play \"The game of world domination\" as Kramer puts it. The gateway drug for a potential wargamer.",
    "timestamp": 1733439600
  },
  {
    "username": "friedpotatoes",
    "rating": 10.0,
    "comment": "Love Risk. Always do 2vs2 gameplay we made ourselves..Very Fun!",
    "timestamp": 1719784800
  },
  {
    "username": "conan_mcleod",
    "rating": 10.0,
    "comment": "My all time favourite\nCon: finding people who likes it too",
    "timestamp": 1719266400
  },
  {
    "username": "PlayfulPuzzle",
    "rating": 10.0,
    "comment": "The classic. Played for years. love it. Watch out for board flippers. Heard FunableGames might be making a booster pack of card to speed up game play. not sure if they have done it yet though.",
    "timestamp": 1718143200
  },
  {
    "username": "itzcloudy",
    "rating": 10.0,
    "comment": "the best board game i have everseen",
    "timestamp": 1716156000
  },
  {
    "username": "davybiltoni",
    "rating": 10.0,
    "comment": "Pros :\nEasy to learn\nA classic fun game\nDecent rule system\nGood quality board & okay quality box\n\nCons :\nInfantry miniatures have an extremely small base so fall over easily which is annoying\nFar too reliant on the luck of dice rolls to be considered a serious wargame\n\nComplexity : 3/10",
    "timestamp": 1715032800
  },
  {
    "username": "Galedion",
    "rating": 10.0,
    "comment": "Arbeitszimmer",
    "timestamp": 1712872800
  },
  {
    "username": "Istvanffy",
    "rating": 10.0,
    "comment": "One of the best games invented in the 20th Century. Extremely re-playable. I highly recommend this excellent game.\n\nOften overlooked by Euro-gamers & \"hard-core\" wargamers but Risk is still a great game and always will be...whatever anyone says...",
    "timestamp": 1698966000
  },
  {
    "username": "catanrules",
    "rating": 10.0,
    "comment": "Been a favourite of mine for decades, and probably the most innovative game ever at time of its introduction, various house rules can be mixed, changed and matched to play in different ways, with no definite hard preference for a fixed set of rules, so long as everyone knows what rules they are playing by BEFORE starting a game, and they have a good idea about some rules potentially making the game last many hours if not days if everyone is playing strategically to win. The conventional STANDARD game of \"THROWING DICE\" is great and exciting when you are young, but doesn't cut the mustard once you get older and want to play more challenging games that are not going to be won or lost on luck or kingmaker scenarios, so I have a MUCH better GAMER version that has been thoroughly play tested over decades. I also do have a STRONG preference for original small and large cylindrical pieces or better still 5 and 10mm wooden cubes if pieces rolling away is a problem during your games, as it makes the game overview very easy to interpret and players can concentrate on strategy and diplomacy rather than attempting to count armies on each country on each turn. Whichever version you play, RISK works by far the BEST with 5 or 6 players, and definitely NOT at all with 3 players, I'm 90:10 in favour of having missions, be it slightly different missions to the standard missions, 20:80 against marauding armies, 90:10 in favour of ALL cards face up (including the entire draw pile and mission cards ( 2 each ), and 90:10 in favour of playing a NO DICE version.\nCatan pieces are also used for some of the new rules that are needed for all this to work. Infact my NEW version of RISK is very different to conventional RISK, It involves [almost] ZERO luck, 30% strategy and 70% diplomacy. I personally like games that require DIPLOMACY, it gets 5 or 6 people continuously interacting and talking to each other, instead of all sitting quietly around a table, poker faced and saying nothing, I will publish my FULL ALTERNATIVE Rules for risk sometime in the future titled DIPLOMACY using RISK and CATAN pieces, on condition when you play - you MUST refer to Soldiers as Grenadiers , Cavalry as Tchaikovsky's, and Cannons as Wolamalooos in memory of a good friend of mine who introduced me to RISK in the early 1970s and we played the game hundreds of times since. I am CERTAIN you will find the NEW alternative rules will make you want to elevate classic RISK's status from the lowly 5.6/10 it is at now to a 10/10 game.",
    "timestamp": 1683410400
  },
  {
    "username": "PullMyFinger",
    "rating": 10.0,
    "comment": "2-6\nBest 4\n120 min",
    "timestamp": 1681250400
  },
  {
    "username": "Requis",
    "rating": 9.5,
    "comment": "Have been playing risk since I was 12, great game introduced to the game from one of my sisters Boyfriends and 1st Husband Mike.Great Game lots of fun Mike was a fun Board game enthusiast to play against probably let me win once or twice lol. And have been playing ever since with Friends and family!\n\nCraig and I have history here of being overly competitive and think everyone should take a page out of the passionate playbook as it makes for an awesome experience....a few days later lol.\n\nHighly recommended strategy war game with lots to offer!",
    "timestamp": 1678834800
  },
  {
    "username": "Math_ijs",
    "rating": 10.0,
    "comment": "Klassieker. Het spel heeft een redelijke geluksfactor en is niet voor iedereen weggelegd. Maar met de juiste medespelers kan het spel veel meer dan een spel worden waar urenlang kan gespeeld worden met diepgaande tactieken, plannen en allianties. Met mijn vrienden doen we geregeld een 'risk avond ', het stelt nooit teleur.",
    "timestamp": 1678489200
  },
  {
    "username": "KingsAvatar316",
    "rating": 10.0,
    "comment": "Love the game so much",
    "timestamp": 1672700400
  },
  {
    "username": "lydsiegbg",
    "rating": 10.0,
    "comment": "I like the secret mission version, as it keeps games relatively shorter. We have, however, had games last several hours. It's a good, classic war game.",
    "timestamp": 1672095600
  },
  {
    "username": "Risktaker",
    "rating": 10.0,
    "comment": "Multi - Classic - Risk - Parker Brothers",
    "timestamp": 1671922800
  },
  {
    "username": "InfinityTcg",
    "rating": 10.0,
    "comment": "This game literally gives me so much fond memories of my childhood and staying up at all hours of the night just playing with friends.... I am really surprised that it has such a low review this game is a classic.",
    "timestamp": 1665612000
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "risk 60th edition new",
    "timestamp": 1661205600
  },
  {
    "username": "sculley",
    "rating": 10.0,
    "comment": "Still one of my all-time favourites regardless of its \"flaws.\" I love that moment when you \"go for it\"....assuming that you're not losing.\n\nFavourite Mechanic: Rolling dice in the old-school long box top.",
    "timestamp": 1660168800
  },
  {
    "username": "kwaspek104",
    "rating": 10.0,
    "comment": "This game is a masterpiece. Haters gonna hate.",
    "timestamp": 1659823200
  },
  {
    "username": "stlogan",
    "rating": 10.0,
    "comment": "People are just jealous of the games success.",
    "timestamp": 1659736800
  },
  {
    "username": "Emperor_Claudius",
    "rating": 10.0,
    "comment": "Still after decades a great game to play!",
    "timestamp": 1655503200
  },
  {
    "username": "Gabriel_hoth",
    "rating": 10.0,
    "comment": "Obra maestra.",
    "timestamp": 1654898400
  },
  {
    "username": "Brendon97",
    "rating": 10.0,
    "comment": "First serious wargame-like BG I ever played. Im rating it a 10 to counter the haters. It has its flaws no doubt but I would always play it with gamers and non-gamers alike. Rules are relatively easy to teach and people just understand the concepts in risk as it is a war, plain and simple. Play with the theme that interests you the most (Star Wars, Game of Thrones, Europe, etc.). Probably played this like 30 times since young, during a time when boardgames were just a really really minor side hobby, which actually says something about my love for risk!",
    "timestamp": 1645311600
  },
  {
    "username": "Oldbear42",
    "rating": 10.0,
    "comment": "Gets pulled out at family reunions for nostalgia and late night fun",
    "timestamp": 1645052400
  },
  {
    "username": "Lisayueh",
    "rating": 10.0,
    "comment": "對我來說是一個充滿回憶的遊戲！因為家裡有這款桌遊，所以很小的時候就會和家人一起玩～會需要一點運氣擲骰子，也需要好好思考該把軍隊放到哪些的位置，總之，好玩！",
    "timestamp": 1641337200
  },
  {
    "username": "RogerDHyman",
    "rating": 10.0,
    "comment": "An obvious classic; in college we had a group who played regularly, and where I sharpened my \"Diplomacy skills\". Many fond memories, and I still enjoy playing, even after 50 years or so! Yes, it's basic--so what?! It's still FUN!",
    "timestamp": 1641250800
  },
  {
    "username": "d_shh",
    "rating": 10.0,
    "comment": "OH/Toronto\nBest @ 4p",
    "timestamp": 1640473200
  },
  {
    "username": "prohacker",
    "rating": 10.0,
    "comment": "i want to plasy",
    "timestamp": 1635544800
  },
  {
    "username": "Satori666",
    "rating": 10.0,
    "comment": "This game has been a constant in my life ever since I was a teenager. I got first introduced to this game by an an english friend I had. He took out this game while I was once hanging out in his house. I still love creating new memories every once in a while.",
    "timestamp": 1632261600
  },
  {
    "username": "SpyAvon",
    "rating": 10.0,
    "comment": "yes...I know its a basic game...but Ive played it for ages and still enjoy it with groups decades later.",
    "timestamp": 1627077600
  },
  {
    "username": "Bendalf",
    "rating": 10.0,
    "comment": "*****\n\nIs this the best game ever created? No. Do the dice betray you? Yes. However, this game is timeless, and I will never turn down a game.\n\nRisk is a game that has forever left its impression on my childhood. Throughout space and time, I have been able to find friends who would get this game to the table on a nightly/weekly basis. Eventually you would not be playing the game anymore, you would be playing the player, and your trash talk and goading them into doing certain moves equally, if not, more critical to your victory or loss.",
    "timestamp": 1618869600
  },
  {
    "username": "AMediocrePony",
    "rating": 10.0,
    "comment": "This game will always be a favorite. because of how long it is, my family really will only play on my birthday, but it is well worth the 3 hours to win. again. for the 5th year in a row.",
    "timestamp": 1616968800
  },
  {
    "username": "crsluggo",
    "rating": 10.0,
    "comment": "10+ copies. 1963 edition, 1993 edition, 1998 edition, 2003 edition, Nostalgia Games Series (2003), 1959 50th Anniversary edition, 2009 Bookshelf edition, 2010 edition, 2015 edition, 60th Anniversary edition",
    "timestamp": 1616194800
  },
  {
    "username": "Jeruzelsky",
    "rating": 10.0,
    "comment": "I have no idea how many hours I have spent in my life playing this game with friends.",
    "timestamp": 1614726000
  },
  {
    "username": "broslayer2020",
    "rating": 10.0,
    "comment": "i love this game",
    "timestamp": 1614034800
  },
  {
    "username": "jere_jere",
    "rating": 10.0,
    "comment": "i playd this on swich its rilt fun",
    "timestamp": 1613343600
  },
  {
    "username": "Mycroft31",
    "rating": 10.0,
    "comment": "A classic game that has aged well with time",
    "timestamp": 1613084400
  },
  {
    "username": "pheonixgod5142",
    "rating": 10.0,
    "comment": "I just want to test the game out",
    "timestamp": 1607468400
  },
  {
    "username": "szady",
    "rating": 10.0,
    "comment": "fast, fun, excellent for party and beer with friends",
    "timestamp": 1606518000
  },
  {
    "username": "ChangingSkin",
    "rating": 10.0,
    "comment": "This is the OG... easily over 100 plays lifetime, but pretty burnt out on it now and likely won't make the table unless we were to randomly invite someone over who knows it but doesn't really ever play any other games. But forever a classic, just so many newer games we rather play.",
    "timestamp": 1605913200
  },
  {
    "username": "GameNut7",
    "rating": 10.0,
    "comment": "Love this game! I prefer to play video games version, rolling and moving is usually quicker, and I can play by myself. I loved the Playstation 2 version because there were several maps for maximum replayability. But, the game was buggy and often froze, which was very frustrating!",
    "timestamp": 1602540000
  },
  {
    "username": "BarryMcCockineer",
    "rating": 10.0,
    "comment": "We have the original game. The artwork is old school, The game play takes loads of strategy and a long time to play (3-5 hours with 2+ people). This is like a poor man's Axis and Allies.",
    "timestamp": 1599516000
  },
  {
    "username": "KoLejKA8",
    "rating": 10.0,
    "comment": "Classic game. A must own imo. If you have not played an epic game of Risk!, you cannot consider yourself a board game enthusiast. Essential in everyone's collection.",
    "timestamp": 1594850400
  },
  {
    "username": "cu20000",
    "rating": 10.0,
    "comment": "Hi\nI think risk is amzing game and it is good to play with your friends",
    "timestamp": 1589148000
  },
  {
    "username": "Heather1000",
    "rating": 10.0,
    "comment": "2-6 players",
    "timestamp": 1586815200
  },
  {
    "username": "Beerhamut",
    "rating": 10.0,
    "comment": "Cop at 4:00am \"What are you doing driving home so late?\"\nMe \"I just finished a six hour game of Risk\"\nCop \"You can go\"",
    "timestamp": 1585951200
  },
  {
    "username": "210Khamen",
    "rating": 10.0,
    "comment": "a classic, perfect accessible game that drove entire summers for me.",
    "timestamp": 1585519200
  },
  {
    "username": "El_wopo",
    "rating": 10.0,
    "comment": "Who didn't own Risk? Played with modified rules.",
    "timestamp": 1584399600
  },
  {
    "username": "Papadipupi",
    "rating": 10.0,
    "comment": "This is where it all began for me! Still a classic and always an option whenever there is a round going.",
    "timestamp": 1575759600
  },
  {
    "username": "Mebark",
    "rating": 10.0,
    "comment": "Old but gold",
    "timestamp": 1572390000
  },
  {
    "username": "derZajeb",
    "rating": 10.0,
    "comment": "Best board game ever, mix of strategy, diplomacy and luck. Real politics but simplified and in game and not real world.",
    "timestamp": 1569535200
  },
  {
    "username": "JorgeF",
    "rating": 10.0,
    "comment": "Un gran juego, el ajedrez del siglo 21. Aunque como todos los Risk estan minusvalorados.",
    "timestamp": 1566597600
  },
  {
    "username": "ParzivalTMP",
    "rating": 10.0,
    "comment": "C’mon, it’s Risk! Are there more involved, more complicated strategic level war games out there? Sure. But Risk remains a trash-talking, dealmaking, backstabbing good time. If you don’t like the player elimination crawl, then use the Secret Mission cards that have been incorporated into Risk since the 1990s. There’s a reason this game has hung around, and spawned dozens of variants (and keeps spawning more). One of the greats- I’ll always be a fan, and always play!",
    "timestamp": 1551481200
  },
  {
    "username": "lukemyers83",
    "rating": 10.0,
    "comment": "I love this game. It is perfect. The game snobs have tried to ruin its good name but in the end the marketplace has spoken. This is a great game. I have spent endless hours as a kid playing this in a tent in my parents backyard and have continued to play it whenever I find an opportunity. The \"dice chucking\" that everyone complains about it is a part of the game that adds a luck aspect that makes it more exciting. This means that the bigger force does not always win. Yahtzee and Farkle are also fun games that are literally only dice chucking and luck and in war there is always luck. Also, you can win without starting in Australia and sometimes its fun dragging the game out by building up your boarders to create a kind of cold war and is part of what makes the game great.",
    "timestamp": 1551049200
  },
  {
    "username": "Rumpy_Pumpy",
    "rating": 10.0,
    "comment": "Love this. Play with the family. Secret Missions only, otherwise it drags on forever doing Global Domination.",
    "timestamp": 1546642800
  },
  {
    "username": "JimHackerMP",
    "rating": 10.0,
    "comment": "Love the wood cubes and ovals. Easier to deal with than more modern versions of Risk! A classic reborn.",
    "timestamp": 1528149600
  },
  {
    "username": "sizzlelean",
    "rating": 10.0,
    "comment": "Total Classic!",
    "timestamp": 1526421600
  },
  {
    "username": "markasol",
    "rating": 10.0,
    "comment": "have the 2008 upgraded objectives and earlier standard objectives too",
    "timestamp": 1521586800
  },
  {
    "username": "TodorLalov",
    "rating": 10.0,
    "comment": "Приложение",
    "timestamp": 1514847600
  },
  {
    "username": "DukeZhou",
    "rating": 10.0,
    "comment": "This was the game that made me hate dice! Also a modern classic, and a game I love. Like many, Risk was where I cut my teeth in the realm of territory control strategy. Kamchatka is still my favorite! Whether turtling in Australia, or making a valiant thrust from North America, Risk never fails to provide hours of entertainment for kids of all ages.",
    "timestamp": 1513378800
  },
  {
    "username": "Caper Games",
    "rating": 9.5,
    "comment": "A Classic. Had so much fun playing this with my friends\nin my youth!",
    "timestamp": 1511823600
  },
  {
    "username": "Gilron6",
    "rating": 10.0,
    "comment": "The grandfather of games, this is the one that started it all for me! Zillions of game play hours on this one. Simple as can be, world scale battles, with some luck you’ll take over the world!",
    "timestamp": 1511132400
  },
  {
    "username": "halloweenvillehaunt",
    "rating": 10.0,
    "comment": "Classic Fun Strategy Game",
    "timestamp": 1510527600
  },
  {
    "username": "ace is best",
    "rating": 10.0,
    "comment": "awsome",
    "timestamp": 1507845600
  },
  {
    "username": "UBERALAN",
    "rating": 10.0,
    "comment": "I very much love this game",
    "timestamp": 1507586400
  },
  {
    "username": "Timothee",
    "rating": 10.0,
    "comment": "A classic\nDon't why so much hate.\nThe last version is also so beautiful.",
    "timestamp": 1506722400
  },
  {
    "username": "Hunter2050",
    "rating": 10.0,
    "comment": "When you need to roll a lot of dice",
    "timestamp": 1501020000
  },
  {
    "username": "king_forkbeard",
    "rating": 10.0,
    "comment": "Best game ever made.",
    "timestamp": 1500501600
  },
  {
    "username": "Trogdorf899",
    "rating": 10.0,
    "comment": "This is the classic. I really enjoyed it in my younger years and is a great gateway into more advanced board gaming.",
    "timestamp": 1492812000
  },
  {
    "username": "pillopufy",
    "rating": 10.0,
    "comment": "amazing",
    "timestamp": 1489014000
  },
  {
    "username": "IWilloughbyTroy17",
    "rating": 10.0,
    "comment": "It is a very strategic game that can cause a fight in the household. This game can start family fights for a whole night.",
    "timestamp": 1477432800
  },
  {
    "username": "AntonytheGreat",
    "rating": 10.0,
    "comment": "Most tense game ever",
    "timestamp": 1475100000
  },
  {
    "username": "njesse99",
    "rating": 10.0,
    "comment": "Why are people hating on this game? It's a classic and the game play was way ahead of its time. It still is a great game to introduce young kids into strategy board games.",
    "timestamp": 1474840800
  },
  {
    "username": "Geekygurl2000",
    "rating": 10.0,
    "comment": "Like monopoly it can start some pointless drama, but is more fun in the way there",
    "timestamp": 1472594400
  },
  {
    "username": "noona62",
    "rating": 10.0,
    "comment": "I am surprised this game has such low rating, I think it's a lot of fun!",
    "timestamp": 1472421600
  },
  {
    "username": "tcwik",
    "rating": 10.0,
    "comment": "Classic game.",
    "timestamp": 1469397600
  },
  {
    "username": "gtwucla",
    "rating": 10.0,
    "comment": "Still the best game there is. Been playing an online game for 10 years now (restarting the game hundreds of times), and it never fails to reflect on each player's personalities. Best played stripped down with set trade in values, winner kills all.",
    "timestamp": 1467756000
  },
  {
    "username": "Zellmo",
    "rating": 9.8,
    "comment": "Have played this a lot. It is a game that works well with house rules to mix things up. We always play with the house rule of when trading cards in 2 armies goes on the country on each of the cards even if you don't own the country. This makes it so you can get an extra 6 armies rather than the extra 2 stated in the rules, but it also could mean that you could be giving your opponent up to 6 more armies. Other house rules we change constantly. My favorite way to play is with 2 boards connecting the Alaskas' to the other board's Kamchatkas'. Then you use two sets of cards with different formats so you can tell which is with which board. You can play up to 12 players that way and it gets pretty intense. In general this game is just a great game engine that leaves you free to make your own that will lead to great table talk and intense anxiety raising moments.",
    "timestamp": 1465423200
  },
  {
    "username": "liher86",
    "rating": 10.0,
    "comment": "enfundado",
    "timestamp": 1464472800
  },
  {
    "username": "TGLordShamrock",
    "rating": 10.0,
    "comment": "Classic game. Can never get tired of playing it.",
    "timestamp": 1463781600
  }
]