[
  {
    "username": "Kenfeldman",
    "rating": 1.0,
    "comment": "Everything, the appearance of your troops, leaders and even the map is on the cards. This makes for a very random game. Example, the Union might have a naval squadron and some troops ready to invade New Orleans, however, he may not be able to because the map cards have not been played.",
    "timestamp": 1315864800
  },
  {
    "username": "rogmyersgeek",
    "rating": 1.0,
    "comment": "Beautiful cards with loads of historical content. Based on the cards the game is worth a 10 rating except the rules are so poor that the game is unplayable. Very obscure wargame concept and bizarre Combat CRT. GMT upgrade which includes a really nice play map does make tracking the war easier but the bizarre mechanism for attaching, detaching and moving units is not intuitive and very hard to comprehend. (I must admit I do not have the rewritten rules from GMT or the Turn Sequence card so this rating might be a little harsh.) Bottom line is the game needs a complete ruleset redo and a better combat table layout.\nRating: 10 for cards; -9 for ruleset and gameplay",
    "timestamp": 1175810400
  },
  {
    "username": "DerDiplomat",
    "rating": 2.0,
    "comment": "will give it another chance, but far to luck driven for me right now ( and heavily overpriced )",
    "timestamp": 1094594400
  },
  {
    "username": "cberg",
    "rating": 2.0,
    "comment": "Some may like this game, but it was too long for my tastes.",
    "timestamp": 1093644000
  },
  {
    "username": "mrivera",
    "rating": 3.0,
    "comment": "Overly complex and the rules are poor.",
    "timestamp": 1520204400
  },
  {
    "username": "buggsy",
    "rating": 3.0,
    "comment": "Just a rating from me. Can't add any additional comments that have not been previously recorded.",
    "timestamp": 1469916000
  },
  {
    "username": "rgtft",
    "rating": 4.0,
    "comment": "Strange game that should be better. Can be played via ACTS. Probably not worth investing more time into this with all of the other ACW games out there. I own both the GMT Deluxe and the QED original version.",
    "timestamp": 1737414000
  },
  {
    "username": "RogerDHyman",
    "rating": 4.0,
    "comment": "The cards are excellent good quality, very, very informative and entertaining (just enough humor to make them a joy to read). The cards alone are worth the price of the game.\nHowever--the game-play is disappointing. The \"combat\" system is ridiculous.\nI would play it again to give it another chance--but there are better games out there.",
    "timestamp": 1704063600
  },
  {
    "username": "LuckyStrike",
    "rating": 5.0,
    "comment": "I have the QED version (the one that was sold as two separate decks), and really wanted to like it a lot more than I do; I'm being generous with my 5. The rules are a joke; the game's unplayable without the online fan-written version -- and even then it's a tough slog. There's probably a decent game here, if you can find your way to it through those horrible rules. That's coming from a 40+ year wargame veteran; at least you had SOME idea of how to play after finishing an Avalon Hill or SPI rulebook. The GMT rulebook for B&G was not much better. Played once, many years ago, has been shelved ever since.",
    "timestamp": 1558994400
  },
  {
    "username": "Albert3",
    "rating": 5.0,
    "comment": "Meh. I was expecting more due to some of the glowing reviews I had read. This is a good, fast playing, grand strategic game of the ACW with easy to learn rules; but not my cup of tea. I need to compare this to House Divided down the road to see which is better with regards to simple, easy to play ACW grand strategic games. This has been described as the Civil War played completely with cards, but what it really is is a CDG game on steroids. The strategic action takes place on a small point to point map that looks like it came out of a high school history textbook. Just the basics, ma'am. Armies are put together using the cards. Battles are fought using dice. The game guides you on a strict program of what the Union needs to do to win: seize Richmond, Atlanta and the Shenandoah, control the Mississippi, maintain the naval blockade. The Union has the overwhelming advantage and the Confederates don't have much to do other than stalling for time to win. With the very simple CRT, the game degenerated into Civil War dice Yahtzee waiting for the inevitable to mercifully happen. Also like most CDGs, the game mixes up the historical order of events which really annoys me, having read many Civil War books. The Sherman of 1864 appearing in Virginia in 1861 and steam rolling to Richmond just didn't sit right with me in one of the games I played.",
    "timestamp": 1543186800
  },
  {
    "username": "King Gary",
    "rating": 5.0,
    "comment": "Not played",
    "timestamp": 1424559600
  },
  {
    "username": "charlescab",
    "rating": 5.0,
    "comment": "Game seems like a lot of fun, but some of the movement from east to west add a bit more complexity than needed in my opinion. I love the cards and the idea of the game. Tried to play several times but I just couldnt commit to learning all the rules.",
    "timestamp": 1408572000
  },
  {
    "username": "Sitnam",
    "rating": 6.0,
    "comment": "Inspired design. I love the political pressure Lincoln is under and organization and shuffling required to get a good commander in the action with good troops. The card text is wonderful.\n\nHowever, it gets black mark from me since I've played 4 times and each time the strategic maneuvering has been the same. The actual combat decisions the players are presented with seem repetitive.",
    "timestamp": 1739228400
  },
  {
    "username": "Zerosum",
    "rating": 6.0,
    "comment": "Purchased in the giftshop at the USS Cairo pavilion inside Vicksburg National Military Park, Vicksburg, MS.",
    "timestamp": 1738018800
  },
  {
    "username": "Gwizz",
    "rating": 6.0,
    "comment": "Ok played",
    "timestamp": 1653084000
  },
  {
    "username": "asfhgwt",
    "rating": 6.0,
    "comment": "Anticipated buying this for years when I first read about it (original QED version) in a war magazine. After many delays it was finally released years later, but I was highly disappointed to find an unplayable, overly complex game that seemed to be essentially all about arranging and rearranging your units. Worse, the rules were on cards and impossible to follow. I sold it immediately.\n\nUpdate July 2013: repurchased based on the strength of downloadable GMT rules and charts, which made it playable. While the game now really shines as a simulation -- and the notes on the cards are fantastic --it falls short as a game. One reason is that CSA has very little to do except defend against USA attacks and occasionally counter-attack or try to penetrate into the north. Another is the game's relatively benign combat results chart and use of step-losses; there's a constant and tedious back-and-forth of attacking, taking one step-loss per unit, restoring them to full health, attacking again, etc., etc. Also, a destroyed unit can return to play at the cost of a supply point.\n\nSo both sides' armies get bigger and bigger, which may be historically accurate, but in the game, adding up the strength points and considering the permutations of each side's attack and defense strengths becomes a colossal pain in the butt. Clearly, changes are required to cut the game's playing time down from 3-4 hours to 90 minutes. One of these might be a replacement combat results chart along more traditional lines (which I've tried, but without success).",
    "timestamp": 1602712800
  },
  {
    "username": "kilfara",
    "rating": 7.0,
    "comment": "3 plays (PBEM via ACTS) - unusual, but enjoyable, and currently my go-to Civil War game (on those rare occasions when I want to play a Civil War game).",
    "timestamp": 1757455200
  },
  {
    "username": "natx17",
    "rating": 7.0,
    "comment": "The design is unique and creates a powerful narrative. Card art and info is beautiful and interesting, you can spend an evening learning from the historical texts included. I specially like how the map gets created as you play.\n\nHowever, I find it a little bit fiddly and needs more table space that it seems at first glance. Not so fast-paced as I thought.",
    "timestamp": 1746655200
  },
  {
    "username": "eckra134",
    "rating": 8.0,
    "comment": "Очень хорошая игра про Гражданскую Войну в США.\n\nОсобо хочу отметить то количество информации, которую автор игру умудрился втиснуть на игровые карточки: тут тебе и \"личное дело\" генералов, и история различных боевых соединений, и просто разные интересные события и исторические личности.\n\nЛично мне кажется что игру можно было чуть доработать, но в силу отсутствия опыта в создании подобных игр, не могу указать чего именно не достаёт.\n\nМне это нисколько не помешало насладиться игрой, где каждая партия отличается от предыдущей. Особенно мне запомнилась партия где я, играя за Север, вытащил почти сразу Гранта и Шермана, двух лучших генералов Союза из колоды. Однако война не была выиграна в одночасье, а продлилась ещё довольно долго, учитывая как поздно у Южан появились генералы Ли и Джонстон.\n\nТакже не забуду второе сражение за Мемфис, где чуть ли не единственный активный и успешный генерал Южан (но при этом очень слабый по боевым качествам — по моему Маури или Бакнер) смог победить армию Шермана, что превосходила его в разы, но не смог вернуть город из-за потерь: вот это Пиррова победа!\n\nРекомендую — особенно тем кто хочет узнать побольше про историю этого конфликта, но пока не хочет читать книги на эту тему. Мало того текста на карточках хватит на небольшую книгу, после них вы обязательно пойдёте и что-нибудь прочитаете! Лично от себя рекомендую роман \"Ангелы Смерти\" Майкла Шаары — да, пусть там южане показаны немного приукрашенными (как и в игре пожалуй), но книга сильная.",
    "timestamp": 1740006000
  },
  {
    "username": "airjudden",
    "rating": 8.0,
    "comment": "This design is incredible. I keep asking myself how a deck of cards can capture so much depth and historical feel, yet here you go. The game is not that difficult: the mechanics are really smooth. The Union's forces are so much more powerful as is their ability to supply their troops, yet they have their work cut out for them: trying to meet their objectives in a fixed amount of time and having a large group of ineffective generals. So in many aspects, it captures the feel of the Civil War, and it does it in a card game!\n\nProbably the biggest gripe is that you do a lot of maneuvering and card playing in a battle to see it all decided by a random 2d6 roll. But I have no qualms with it. The game is great enough to overcome that.",
    "timestamp": 1697493600
  },
  {
    "username": "ajpyyzajp",
    "rating": 9.0,
    "comment": "Two decks of cards for an entire Civil War game. That’s it. Ground breaking concept and it’s handled really well in spite of the rules which could have been done a little better but aren't terribly written. Can feel gamey in certain ways, like single dice battle outcomes, but in other ways it’s brilliant for what it accomplishes in such a compact fashion. Lots of historical chrome on the cards. Not a simulation but a really fun representation that reflects lots of historical detail even if those give way to crazy results sometimes. A quirky interesting little game that is unlike any other game I’ve ever owned.",
    "timestamp": 1753221600
  },
  {
    "username": "sushidog",
    "rating": 9.0,
    "comment": "Deeper than it looks. Really scratches the itch for when you want to play the ACW but don't want to be bound to strict history. You can send Stonewall to the west, you can attack whichever cities you like.",
    "timestamp": 1748296800
  },
  {
    "username": "Erik48",
    "rating": 10.0,
    "comment": "Best Civil War strategic simulation out there. Eminently playable.",
    "timestamp": 1720044000
  },
  {
    "username": "Arontje",
    "rating": 10.0,
    "comment": "Superb game! Captures the feeling of leading armies, the problems you run into as you try to win the war.",
    "timestamp": 1687471200
  }
]