[
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "2 player abstract game. The setting doesn't set the immersion at all. The gameplay itself is alright. One of Knizia's average offerings.",
    "timestamp": 1716156000
  },
  {
    "username": "Auzette",
    "rating": 1.0,
    "comment": "Barely a game, this is an exercise in a simplistic puzzle with needlessly trite artwork that really has nothing to do with the game-\"play\", whatever it may be.\n\nIt's so bland and indescript that I keep it around just to see what a wretched game looks like.",
    "timestamp": 1411682400
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "Played 1 time. I don't know how else to say it. This game stinks. It is an older Knizia numbers game in the worst possible way I can use that term. I don't throw '3's around lightly, but this earned it. Far too straightforward and dull, and far too much like Kingdoms, which Knizia also designed. Kingdoms is a VERY similar game (same board, similar pieces) but is a far better game and scales from 2-4 players, where Atlanteon is dull game for 2 players. How this thing rates an average of 6 is beyond me. The other player I played with, who is much more forgiving of numbers games than myself, felt the same way about the game.",
    "timestamp": 1416697200
  },
  {
    "username": "GeneSteeler",
    "rating": 2.0,
    "comment": "Acquired Jan 2009 - Decent enough abstract strategy under the cover, but the short play-time really makes this a boring tactical game. No time for any grandiose strategy.\n\nThis is just the humble opinion of a guy who is a glass half-full, see the silver-lining of the stormclouds kind of guy. I really wanted to find something in this game, but for a game that takes place underwater it is incredibly dry!",
    "timestamp": 1291417200
  },
  {
    "username": "AmesGames",
    "rating": 3.0,
    "comment": "I like the artwork and the aquatic theme. But that theme does not come through the gameplay at all. This is a boring math game that feels far too samey each play. I can see how some would enjoy it, but its design is dry as a desert with nothing special to excite.",
    "timestamp": 1684101600
  },
  {
    "username": "petegrey",
    "rating": 3.0,
    "comment": "has a chesslike feel. If you aren't very careful & remain viligant, you can lose instantly, especially if you allow your king in a weak placement.\n\nMeh...traded away",
    "timestamp": 1599256800
  },
  {
    "username": "Peter The Rat",
    "rating": 4.0,
    "comment": "Reiner Knizia again! I could have told everybody without reading his name on the box, that this is a Knizia game!\nDry to the bone, but still working good, it lacks \"heart\"!",
    "timestamp": 1672441200
  },
  {
    "username": "hiyou",
    "rating": 4.0,
    "comment": "前後左右に影響するタイルを置き合ってエリアマジョリティ。勝利条件が3つあるので、いろんな可能性睨みながらというメカニクスでゲームとして着地させようとしているが、いい手がわかりづらく手応えがない。ディルクヘンの庭師の技を彷彿とさせる。",
    "timestamp": 1662415200
  },
  {
    "username": "gidorah",
    "rating": 5.0,
    "comment": "04.2025\n\nAtlanteon feels like a 2P Weiner Walzer without the set-collection. (Yes, I know Atlanteon proceeded WW by 24 years but I played WW first…) On the face of it, that sounds great! (The importance of the set-collection in WW really grates because it is so damned important to your final score.) And, even better in Atlanteon, you have three end-game victory conditions: 1) capture your opponent’s king; 2) capture all three towers; or 3) place your king and all 11 control markers before your opponent.\n\nAnd, yet, Atlanteon just doesn’t come together in a satisfying way. Placing control markers feels more tit-for-tat than clever. If that’s the case, you can already see that capturing your opponent’s king would likely mean exceptionally poor play. Capturing all three towers similarly seems highly unlikely unless, again, your opponent is playing poorly or not paying attention. (In the latter case, I find *gotcha* wins really unsatisfying.) So, that means most games are going to play out with the king + 11 control maker victory and the whole thing is more ineluctable than electrifying.\n\nI’ll hang on to my weiner (walzer), thank you very much!",
    "timestamp": 1745532000
  },
  {
    "username": "RustyBaker",
    "rating": 5.0,
    "comment": "Classic sort of Knizia design, which is both a good thing and a bad thing. I prefer Kingdoms over this.",
    "timestamp": 1739228400
  },
  {
    "username": "maddiedogson",
    "rating": 5.0,
    "comment": "2000",
    "timestamp": 1662588000
  },
  {
    "username": "Tdex",
    "rating": 5.0,
    "comment": "nice 2 player abstract. may run into analysis paralysis in middle and end game, but experience and good strategy should minimize this 2010-6-16\n\nnot interesting enough to play in 10 years. purged 2021-12-01",
    "timestamp": 1639522800
  },
  {
    "username": "ee_sson",
    "rating": 6.0,
    "comment": "Fully functional, but not very fun. Feels old by now.",
    "timestamp": 1746396000
  },
  {
    "username": "Bagherra",
    "rating": 6.0,
    "comment": "This is a very simplistic \"area control\" game. Essentially it's a similar flavor to a solitaire game in that you can know all the values just not the order you will receive them and the added complication that you have an opponent that is changing the value of your plays.\n\nOn the surface this is a very simple game. When I think I do no need it I take it out play it and realize that its simplicity solidifies the raw power and value of this rough gem.",
    "timestamp": 1742857200
  },
  {
    "username": "montsegur",
    "rating": 6.0,
    "comment": "Mini-Brainburner",
    "timestamp": 1688767200
  },
  {
    "username": "TheNotoriousBGG",
    "rating": 6.0,
    "comment": "I played this three times. I didn't love it, but I have thought about it a fair amount in the intervening weeks, which is a sign of interesting game design.\n\nThings I liked:\n-I always appreciate games designed for two players\n-Fast to set up, and fast to play\n-Interesting decision points\n-Small physical footprint\n-Even after three games, I didn't feel that I had much of an understanding of what optimal play looks like. Moves that seemed obviously correct ended up not leading to good outcomes. In other words, the gameplay was deeper than it seemed at first glance.\n\nThings I disliked:\n-Extremely dry. The theme is almost nonexistent, and it can be hard to even tell the game pieces of the two sides apart (as they are both shades of blue)\n-The rules are relatively simple, but there are some fiddly/inelegant complexities to them. In particular, each player places certain tower pieces at the beginning of the game, but each player places a different number of towers and the towers do different things.",
    "timestamp": 1687471200
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "Revolution is a pure abstract game with an enticing \"French Revolution\" theme. It is definitely a \"see the move\" sort of game of positioning.\n\nTurns out that I like it!\n\nOLD SCHOOL COLLECTION",
    "timestamp": 1757628000
  },
  {
    "username": "JRAMtheBandit",
    "rating": 6.5,
    "comment": "Totally fine abstract, and very easy to learn, but there's a reason this one isn't remembered among Knizia's best.",
    "timestamp": 1747605600
  },
  {
    "username": "Golyadkin",
    "rating": 8.0,
    "comment": "Some of the low scores here are shocking. I played this 3 times back to back and enjoyed each play more than the last. There is MUCH more than meets the eye here. Opportunities for creative play, trap setting, and tough \"hand\" management considerations that echo the fixed bid pieces in Metropolys' (ie. you might regret using your \"hammer\" too early, but you may also regret not using it earlier!) Don't listen to the 1's and 2's given by people who have Terraforming Mars and A Feast for Odin in their top 10s. Atlanteon is for serious gamers",
    "timestamp": 1736290800
  },
  {
    "username": "Andrasthegab",
    "rating": 8.0,
    "comment": "This is a very good 2 player game for occasions, not for frequent plays.\nVery Original, a Great Knizia, with Knizian ideas.",
    "timestamp": 1725055200
  },
  {
    "username": "RonCarlson01",
    "rating": 9.0,
    "comment": "Unpunched.",
    "timestamp": 1705705200
  },
  {
    "username": "pizza the hutt",
    "rating": 9.0,
    "comment": "This game is great. Easy to learn , and it is very strategic in the game play.\nThe more i play this game the more i love it.",
    "timestamp": 1279836000
  },
  {
    "username": "ludopath",
    "rating": 10.0,
    "comment": "Best game I know of its kind (luckfree strategic tile placement for two players).\nWe play with a homemade \"Mars Attacks\" Edition, which adds considerably to the fun.",
    "timestamp": 1168210800
  },
  {
    "username": "drandle",
    "rating": 10.0,
    "comment": "this rating for ATLANTEON.My fvorite abstract strategy game. I love the art and its a cool theme.",
    "timestamp": 1093903200
  }
]