[
  {
    "username": "ratbulogg",
    "rating": 1.0,
    "comment": "Was a 2. Now with Vinci and small world around, no reason to ever play again.",
    "timestamp": 1728856800
  },
  {
    "username": "Olimar",
    "rating": 1.0,
    "comment": "Will never play it again.",
    "timestamp": 1576018800
  },
  {
    "username": "pablo_espada",
    "rating": 1.0,
    "comment": "Tiradas supermegadirigido! Basura de juego y encima supermegalargo!",
    "timestamp": 1532556000
  },
  {
    "username": "Hiroheatho",
    "rating": 1.0,
    "comment": "Yeah everybody lets play a game where we can watch the game play itself out for us, we know what's going to happen every game! Yay, fun! You know, if I want to watch the history of Britannia play out before me, I have both the History Channel and the Smithsonian to catch up on British history. I don't need a game to roll it out pretty much the same every time!!",
    "timestamp": 1486422000
  },
  {
    "username": "Bathory",
    "rating": 1.0,
    "comment": "Totaly unbalanced (the purple win 75% of time), no real choices for the players, because the best strategy is writen on the board.\nI simply dont understand the succes of this game.",
    "timestamp": 1097618400
  },
  {
    "username": "derscheid",
    "rating": 1.0,
    "comment": "Wouldn't it be faster just to crunch the numbers, and reduce the entire game down to a single die roll? I'll step into a general's shoes, but this game is more like a straightjacket. Dry as all hell, still boils down to die-rolls, takes a long time, no woman will ever play this, not a game for kids either.\nIf I were going to play a game where I invaded Europe repeatedly, I'd play Vinci instead.",
    "timestamp": 1059688800
  },
  {
    "username": "JuanCudz",
    "rating": 1.0,
    "comment": "Bloody awful game",
    "timestamp": 1022018400
  },
  {
    "username": "AZrugger",
    "rating": 2.0,
    "comment": "Full disclosure, I played as yellow, so obviously my experience was front loaded, but we just got done with an 8 hour game where we only got through 10 rounds. For the last 4 hours I’ve had exactly two guys on the map chilling in Scotland.\n\nIt’s like small world, sure, but nothing happens for hours at a time.\n\nWon’t be revisiting this one.",
    "timestamp": 1749938400
  },
  {
    "username": "HavocIsHere",
    "rating": 2.0,
    "comment": "Too many rules to remember, too long, too random",
    "timestamp": 1684360800
  },
  {
    "username": "Wolfram",
    "rating": 2.0,
    "comment": "No more monster games for me.",
    "timestamp": 1551222000
  },
  {
    "username": "floppi",
    "rating": 2.0,
    "comment": "Nothing for 2017. You don't play a game, the game plays you. Combat system from hell. Never ever again.",
    "timestamp": 1493935200
  },
  {
    "username": "Mike_Rushby",
    "rating": 2.0,
    "comment": "Didn't enjoy being railroaded as a story",
    "timestamp": 1434492000
  },
  {
    "username": "Teproc",
    "rating": 2.0,
    "comment": "Boring, and insanely long for what it is.",
    "timestamp": 1413324000
  },
  {
    "username": "bwridge",
    "rating": 2.0,
    "comment": "Works better as an interactive historical simulation than an actual board game. To guide the game towards historical accuracy it depends on scripted events and defined scoring areas. SO there's not much to do other than what the game tells you you should do. It's like playing EL Grande where each player can only score in certain areas or Caylus where each player's path to victory is pre-defined (\"you build in castle, you build buildings, you use the favor track\"). I might be more tolerant of this sort of gameplay in a shorter game, but Britannia can drag on for 4+ hours. It's just not for me...",
    "timestamp": 1406930400
  },
  {
    "username": "WillBePlayin",
    "rating": 3.0,
    "comment": "Slow, sluggish, lots of small rules here and there.. I feel that this game's been made obsolete by 878 VIkings and I wasn't that fond of that game either. I know there's the history side of it all in this game, but I felt that it was more of a hinderance than a plus to the gameplay. You're quite forced to play certain way and knowing what's going to happen and when is a major factor in this game.\n\nI'd play so many other longer area control games than this, like Warrior Knights, Chaos in the Old World and Forbidden Stars to name a few. Or even 878 VIkings.",
    "timestamp": 1757455200
  },
  {
    "username": "Chief_Chemist",
    "rating": 3.0,
    "comment": "Have Cyberboard and Bruce's old box game.",
    "timestamp": 1694210400
  },
  {
    "username": "Mutiemoe",
    "rating": 3.0,
    "comment": "Classic game of old times, which shows - game design has moved on. I did not have fun playing this.",
    "timestamp": 1613084400
  },
  {
    "username": "ousgg",
    "rating": 3.0,
    "comment": "Awesome thematic drawn-out-ness. Needs playing, but may only see the one play.\n\nTraded with Guillotine and Perudo for Rotterdam and Meuterer",
    "timestamp": 1495058400
  },
  {
    "username": "njesse99",
    "rating": 3.0,
    "comment": "No, no, no, a thousand times no.",
    "timestamp": 1474840800
  },
  {
    "username": "horusz",
    "rating": 3.0,
    "comment": "3-ast adtam a játékra de ez egy kompromisszum. Én nekem ennyit sem ért meg a játék, de valószínűleg igazságtalan a játékkal szemben. Ez egy wargame én pedig eurogame rajongó vagyok, tehát ezért is az alacsony pontszám.\n\nA játékban népekkel játszunk, hogy Angliát meghódítsuk. Én a piros népekkel voltam, értettem, hogy milyen taktikát kell követnem velük, fölényesen nyertem is, de ettől még untam a játékot.\n\nA játék egyetlen előnye - valószínűleg - a történelmi hűség, azaz megpróbálták jól lemodellezni, melyik nép mikor és honnan érkezett Angliába és milyen területeket foglalt el. De minden más a játék negatívuma:\n- igazából csak négy fővel élvezetes\n- hosszú játékmenet. Első játékunk 4 órás lett és gyakorlott játékosokkal sem megy sokkal 3 óra alá.\n- unalmas. Sok a holt idő, míg a többiek lépnek, csatáznak. Van olyan szituáció, amikor semmit nem csinálsz, csak erősödsz és várod, hogy nagyobb csapatod legyen. Volt olyan játékos, aki fordulókra kiesett a népeivel és csak később tért vissza.\n- de leginkább a kockadobálás zavart. Azt mondják ez a hadi szerencsét jelenti. Szerintem egyszerűen hülyeség, az győz aki sok 5-öst és 6-ost dob. Semmivel sem tudod ellensúlyozni a rossz dobásokat. Órákon keresztül kockákat dobálni, köszönöm, de ebből nem kérek.",
    "timestamp": 1388271600
  },
  {
    "username": "recallme",
    "rating": 3.0,
    "comment": "It's way too rules heavy for the gameplay you get.\nI found it too long and atleast two of our 4 players wanted to stop playing at round 10.\nIt's mostly a game about making deals with other players. If you get unlucky and all other players go against you for one or two rounds you game may be finished until your next race may step in. Which means 1 hour in which you just watch the others play.\nVery unsatisfying 7 hour game.",
    "timestamp": 1361919600
  },
  {
    "username": "latschediwes",
    "rating": 4.0,
    "comment": "The game is is designed to create a very specific story. Namely the history of the conquest of Britain from the Roman period, through the Saxon conquest until the Viking Age.\n\nThe rules are refreshingly simple and accessible. The moves are pleasantly quick and there is relatively little waiting time until it is your turn again. The story that the game generates unfolds slowly and steadily. New elements are constantly being added to the game to represent the historical events.\n\nThe central aspect is the individual victory point conditions of the factions that keep changing the course of the game. This ensures that the game progresses as close as possible to the real historical development, describing the advance of the tribes, the conquests, battles and settlement movements including historical people.\n\nThe downside is that the gameplay feels very linear. It is always obvious which areas a particular faction focuses on at what time, what they want to hold and what they want to conquer. This means that the conflicts between the players are predetermined by design - WHAT, WHEN and WHERE are relatively fixed and open information, but there seems to be a little leeway in HOW, but there seems to be some consensus. For example, it was noticeable that the experienced players commented on certain moves with statements like:\n“That is only logical” and\n“This was a classic move,” even if I was just moving a counter from one region to an adjacent one.\n\nThis also means that there seems to be little room for psychology and group dynamics. In my first game, without any prior knowledge of the game or rules, I finished with a large point difference. Luck of the dice was certainly involved, especially in the early battles between the Belgae and the Romans as well as an effective invasion of the Angles. However, it seems to me that the focus is on the obvious victory conditions of my factions had more influence. In other words: It is a more or less trivial optimization task.\n\nAnd ultimately the game takes an awfully, awfully long time. We're talking 4-5 hours if all players are familiar with the game and act quickly (wasn't the case for me) and could otherwise take twice as long. And for this length, Britannia offers too little variety, too few surprises and too little interaction.",
    "timestamp": 1751320800
  },
  {
    "username": "newrev",
    "rating": 4.0,
    "comment": "Just put pieces in the board and roll dice.",
    "timestamp": 1716242400
  },
  {
    "username": "AlexSpielrebell",
    "rating": 3.5,
    "comment": "Games on rails... I don't like the concept that the game forces me to follow history to score points. I played it once and didn't enjoy it at all. In addition it has too many special rules to simulate history, it doesn't felt like an actual game.",
    "timestamp": 1705964400
  },
  {
    "username": "HiTracey",
    "rating": 4.0,
    "comment": "Very clever and evocative game, working best with four players. This assists in corralling the required number, and limits down time once you have.\n\nComplexity - 3/10",
    "timestamp": 1695420000
  },
  {
    "username": "El_Gamero",
    "rating": 4.0,
    "comment": "The game rewards you if you follow exactly what history did, and doesn't if you do anything more or different...",
    "timestamp": 1630274400
  },
  {
    "username": "Pandorzecza",
    "rating": 4.0,
    "comment": "Not for me",
    "timestamp": 1624744800
  },
  {
    "username": "John Rogers",
    "rating": 4.0,
    "comment": "PROS - Components are nice, the history is accurate and entertaining to watch, you get to control multiple armies at once.\n\nCONS - 5hrs+, the dice rolling gets tedious, doing nothing for long bouts of time (the green player for the first 10 rounds).\n\nThe theme and history are great but you need more than kill and hold for such a long game.",
    "timestamp": 1609110000
  },
  {
    "username": "Lendengold",
    "rating": 5.0,
    "comment": "Gereon\n(geschenkt von Anne)",
    "timestamp": 1759356000
  },
  {
    "username": "lexen",
    "rating": 5.0,
    "comment": "I really like the way this one plays out... relive history with a couple of what-ifs... the new FFG is much better rules and components than the AH version (6.5). Wich is around a 7.5 in rating...so my rating is a average of both",
    "timestamp": 1749506400
  },
  {
    "username": "Samuel Vriezen",
    "rating": 5.0,
    "comment": "Holds up better than I thought after many years of not playing. Lots of dice but they do give a nice sense of historical drama.\n\nBut: don’t play it more than once every couple of years - it’s very scripted.",
    "timestamp": 1717279200
  },
  {
    "username": "camustafa",
    "rating": 5.0,
    "comment": "The theme and the execution are very good. This is an exactly 4 player game. Not recommended at all with 3 or 2. Recommend shouting \"blood!\" or \"freeeeedommmm!\" when rolling the dice.\n\nUpdate 2022: This has not aged well. Or maybe I haven't. But I no longer have 8 hours and three other friends who can commit to that length of time. And when we did, it was sort of ... meh!",
    "timestamp": 1702162800
  },
  {
    "username": "pkughost",
    "rating": 5.0,
    "comment": "Played once. Took 10+ hours spanning over two days.",
    "timestamp": 1684015200
  },
  {
    "username": "kps1ny",
    "rating": 5.0,
    "comment": "Sold on BGG 12/15/22.",
    "timestamp": 1671145200
  },
  {
    "username": "Medb49",
    "rating": 5.0,
    "comment": "AH",
    "timestamp": 1667516400
  },
  {
    "username": "thirtybrowns",
    "rating": 5.0,
    "comment": "It's OK but it takes a long time for what it is. At least five hours and that is with people who are getting a move on.",
    "timestamp": 1633212000
  },
  {
    "username": "Born-of-Ashes",
    "rating": 5.0,
    "comment": "Pretty standard dudes on a map game. The art is super bland, a product of the times. The real draw here is the turn structure that has the entire game laid out for you to see and plan around. Takes a game or two to notice and exploit the implications of that order.",
    "timestamp": 1601244000
  },
  {
    "username": "Peerchen",
    "rating": 5.0,
    "comment": "Sigh. So much promise.\nThe premise is cool, but by todays standards the execution is completly clunky. It starts that its virtually impossible to play with any number except 4 - because of components issues, but also because with 5 soem players may sit out huge portions of the game.\nBut mainly: For a game that has the depth of risk, there are just way too many rules that may make the game more historical, but simply dont improve gameplay. The death knell is that it asks players to watch others having interesting decisions for big chunks of the game, just for their moment to shine.\nI think a similiar premise is much better executed in History of the world. A vinci-esk version of this would be much better as well.\nThis game did not age well.",
    "timestamp": 1597442400
  },
  {
    "username": "Khexhu",
    "rating": 5.0,
    "comment": "I use to love this game, especially the Avalon Hill version when I was younger. Maybe it's the playing time now, or something like that. Despite the historical angle, there are likely better wargame treatments of the subject now. And for games where you switch up multiple factions, I'd rather play something like Small World. For some reason I always think of FFG's Game of Thrones 2nd Edition when I look at this board as well.\nStill though, many fond memories.\n\nI realized on my last play how much knowledge you need of the game in order to be good at it. And I've largely forgotten all of that and don't see being able to play it enough to gain that insight back. With a committed group this would be a fine game.",
    "timestamp": 1586296800
  },
  {
    "username": "brumcg",
    "rating": 5.0,
    "comment": "I really enjoyed the history mechanic of this game, very interesting. I'd like to play this again, but it did play pretty long.",
    "timestamp": 1558476000
  },
  {
    "username": "Kklinkk",
    "rating": 5.0,
    "comment": "Cannot stand that system. Might have to give it another try... one day.",
    "timestamp": 1552431600
  },
  {
    "username": "SonyBlack",
    "rating": 5.0,
    "comment": "Disclaimer - I have only played this twice, so mybe my first impression is simply wrong and my concerns about the game come only from not beeing familiar enough with it...\n\nMy main problem was that I fealt like the gameplay was a bit to much \"on rails\" and both games I played fealt really similar to each other. And there was also the issue of a player beeing hopelessly behind (at least it seemed so to us - again, maybe we missed clear opportunitties for him to catch up), but having to wait for a rather long game to finish.\n\nSo I'm not relly that interested in giving it anoher shot, but if our group wants to play it again I'll join and maybe I'll revisit this rating later.",
    "timestamp": 1503957600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "I have a fondness for the AH edition. This is a game I was drawn to for years. I played it back in the day, but never all that much. I like having this on my wargame shelf.\n\nNon-essential",
    "timestamp": 1757541600
  },
  {
    "username": "Barbarrodja",
    "rating": 6.0,
    "comment": "Esta muy bien, pero se nota que es un juego viejo con demasiadas reglas y excepciones a las reglas.",
    "timestamp": 1747864800
  },
  {
    "username": "Javajoesworld",
    "rating": 6.0,
    "comment": "Had and played this game in High School, would love to play it again as a very different gamer. Also would like to find a cheap used copy to have for nostalgia sake.",
    "timestamp": 1735254000
  },
  {
    "username": "Geoboffin",
    "rating": 6.0,
    "comment": "A child of its time.",
    "timestamp": 1729720800
  },
  {
    "username": "chrisgledhill",
    "rating": 6.0,
    "comment": "Worth waking up at the end to see who's won.\n\nĜenro: civilizado reludinda.",
    "timestamp": 1717970400
  },
  {
    "username": "echelon",
    "rating": 6.0,
    "comment": "An admirable and accurate historical simulation which I enjoyed playing during the 1990's. It may never get a replay due to its lengthy nature.",
    "timestamp": 1713304800
  },
  {
    "username": "deiv",
    "rating": 5.5,
    "comment": "A wargame somewhat \"scripted\"... Hammer of the Scots, a similar game, is much better.",
    "timestamp": 1707260400
  },
  {
    "username": "Celtic",
    "rating": 6.0,
    "comment": "An awkward game to play without the 'right' numbers and I never quite got them together at the right time. While I still wouldn't mind a game I think this may feel a bit old fashioned these days; though that's not necessarilly all bad.",
    "timestamp": 1707174000
  },
  {
    "username": "rendesm",
    "rating": 6.0,
    "comment": "Too long for a Risk like game, but fine in every other aspect.",
    "timestamp": 1695938400
  },
  {
    "username": "Goblin_Magnus",
    "rating": 6.0,
    "comment": "4 C",
    "timestamp": 1692396000
  },
  {
    "username": "rgtft",
    "rating": 6.0,
    "comment": "New version is very nice; they should have kept the Romans purple. I have two copies of the old AH edition and one copy of the 2020 plastic piece edition.",
    "timestamp": 1685484000
  },
  {
    "username": "bqsfgame",
    "rating": 6.0,
    "comment": "The frontrunner of the series covering the Britanian history.",
    "timestamp": 1660255200
  },
  {
    "username": "nyhotep",
    "rating": 6.0,
    "comment": "Spoilt by all that unique scoring.",
    "timestamp": 1654812000
  },
  {
    "username": "BillNC",
    "rating": 6.0,
    "comment": "Takes forever to play, but A LOT OF HISTORY in it!",
    "timestamp": 1643324400
  },
  {
    "username": "mattlbaumgartner",
    "rating": 7.0,
    "comment": "Fun game, interesting system, some odd quirks",
    "timestamp": 1753135200
  },
  {
    "username": "Weevelby",
    "rating": 7.0,
    "comment": "The entire campaign game can take several hours to complete, but there is a 3 player short game. Each player has a colour which determines which peoples they will control as the centuries roll by. As they wax and wane you have to try to score as many points as possible mainly by conquering provinces through war, then tally up at the end to determine the overall winner. The Red faction often seems to do well? Very interesting and fun though. Reminds me a lot of 'Risk'.",
    "timestamp": 1749679200
  },
  {
    "username": "Marius n Milan",
    "rating": 7.0,
    "comment": "2025\nN",
    "timestamp": 1747951200
  },
  {
    "username": "Von Falkenheyn",
    "rating": 7.0,
    "comment": "Excellent old style strategy game with a historical theme. This little beauty is a remake of the classic Avalon Hill tittle. Whilst the core set of rules is easy to grasp, there are tons of exceptions in the rules which make this more difficult to tackle. Also the game length is considerable, running well over the 4 hour mark. Game satisfaction derived makes this well worth it.",
    "timestamp": 1745272800
  },
  {
    "username": "cadavaca",
    "rating": 7.0,
    "comment": "I love it. The epic sweep of history and all that; really I love the asymmetry and the possibility for canny exploitation of that asymmetry. This is like a more palatable version of Chaos in the Old World, and one that won't end suddenly.",
    "timestamp": 1737327600
  },
  {
    "username": "Rygel",
    "rating": 7.0,
    "comment": "Very good war game with an historically accurate time line.",
    "timestamp": 1731279600
  },
  {
    "username": "jnharr",
    "rating": 7.0,
    "comment": "[tentative rating based on one solo play]\n\nBritannia emulates the history well, but this is a two-edged sword. It makes for a rich narrative, but it also gives it the feeling of a simulation more than a game. It's fun to watch various nations wax and wane, but the VP schedule is so proscriptive and deterministic that it sucks any sense of creative strategy. You must follow the path set out for your nation. This might strike some as overly scripted. Also, the game is very long for what it is: build dudes, move dudes, roll dice, repeat. I'm not sure that's enough to sustain engaging play for 3-4hrs. I'm not sure how I feel about the ability of all players to see the future (\"Oh hey, don't forget that William the Conqueror is showing up in three turns!\"). Seems very gamey to me initially.\n\nAll that being said, the system is fun, but very dicey so makes it hard to take this one too seriously (the mechanics are really just glorified Risk with some historical chrome). It feels quite dated (my first play was in 2023), but I can sense that 'classic' feel to it. Overall impression is mostly positive, but you can tell that it was designed by a historian, not an experienced designer. I think it would take the right group to make this work.",
    "timestamp": 1730934000
  },
  {
    "username": "Military historian",
    "rating": 8.0,
    "comment": "Great game.",
    "timestamp": 1756504800
  },
  {
    "username": "agripa",
    "rating": 8.0,
    "comment": "Played an incomplete session with 4 players several years ago and love it!\n\nAquired a copy of the game (Gibson edition)\nSold the previos Gibsons copy 2024.4\n\nThen purchasing a copy of Avalon Hill.\nI hope in the future to have 4 players playing this great classic again.\n\n2024 Playing a lot on Steam. Very acceptable AI",
    "timestamp": 1755208800
  },
  {
    "username": "adamolanna",
    "rating": 8.0,
    "comment": "Classico di altri tempi, oggi non piacerebbe molto ai più giovani",
    "timestamp": 1754863200
  },
  {
    "username": "mothertruckin",
    "rating": 8.0,
    "comment": "Play with 4. Decent game, if a bit long and dated feeling.",
    "timestamp": 1741215600
  },
  {
    "username": "zeotter",
    "rating": 8.0,
    "comment": "Traded to Noble Knight",
    "timestamp": 1741042800
  },
  {
    "username": "HuckmanT",
    "rating": 8.0,
    "comment": "2025",
    "timestamp": 1738969200
  },
  {
    "username": "robbyjey",
    "rating": 8.3,
    "comment": "This is a great game but it’s for a very specific style of player. You have to be OK with a long (4-5 hour game). You have to be OK with luck being a factor. You should hopefully be historically inclined. You have to be OK with tiny little rules that apply in just one round for just one player, in certain cases, where historical accuracy has taken precedence.\nIf all of that sounds good to you, it’s a great fun time and quite strategic.",
    "timestamp": 1737759600
  },
  {
    "username": "aaronrojo",
    "rating": 9.0,
    "comment": "I would like to try this board game",
    "timestamp": 1756677600
  },
  {
    "username": "Gernial",
    "rating": 9.1,
    "comment": "Die Mutter aller Spiele mit mehr Ausnahmen als Regeln ;-)",
    "timestamp": 1754690400
  },
  {
    "username": "DocGG",
    "rating": 9.0,
    "comment": "An almost revolutionary game for its time.\n\nWe spent evenings and nights playing it when we were students in the eighties, and we really enjoyed it.\n\nThe later FFG version has been slightly improved compared to the Gibson Games edition.\n\nAs far as the game balance is concerned, we always had the impression that it was comparatively very difficult to win with the Romans' color.\n\nBut all in all, a great game!",
    "timestamp": 1737241200
  },
  {
    "username": "Fallooja",
    "rating": 9.0,
    "comment": "Love to play Britannia but it's a 6~ hour commitment (3 game average time)\n\nThe 2 player scenarios are actually quite good if you're itching to play Brit in less than 2 hours with 2 people.",
    "timestamp": 1735772400
  },
  {
    "username": "setropo",
    "rating": 9.0,
    "comment": "Necesito jugar otra partida, ya!",
    "timestamp": 1730502000
  },
  {
    "username": "chargetheguns",
    "rating": 8.5,
    "comment": "Admirable in concept, and stunning components in the latest version, but way too long. Becomes little more than a grating accounting excercise with experienced players. Maybe I'll play it again someday with newbies or as a learning tool for kids. Recently I've discovered the shorter scenarios, which I'd rate higher.",
    "timestamp": 1719784800
  },
  {
    "username": "HerbertML",
    "rating": 9.1,
    "comment": "The new version fromm FFG is new balanced and has some new elements. The changes do not improve the game. Voting for this is 9.1.\n/*#U6*//*stay*/",
    "timestamp": 1719180000
  },
  {
    "username": "HerbertML",
    "rating": 9.8,
    "comment": "One of my favorite Games. I prefer the original Version (Rating 9.8)\n/*#V3*//*stay*/",
    "timestamp": 1759356000
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "used",
    "timestamp": 1751839200
  },
  {
    "username": "superhigi",
    "rating": 10.0,
    "comment": "120 Gran juego sencillo y divertido que refleja mejor que cualquier libro de historia las invasiones de la gran bretaña.",
    "timestamp": 1750802400
  },
  {
    "username": "goodknee",
    "rating": 10.0,
    "comment": "Back Shelf",
    "timestamp": 1750456800
  },
  {
    "username": "blackpawl",
    "rating": 10.0,
    "comment": "2025",
    "timestamp": 1740956400
  },
  {
    "username": "WaywardWarlord",
    "rating": 10.0,
    "comment": "UNPUNCHED",
    "timestamp": 1723068000
  },
  {
    "username": "RonCarlson01",
    "rating": 10.0,
    "comment": "S006\n\nUnpunched",
    "timestamp": 1705705200
  }
]