[
  {
    "username": "TheBrainDrainer",
    "rating": 1.0,
    "comment": "The questions in itself can be interesting, but the rest is very poorly put together. A real pity.",
    "timestamp": 1186869600
  },
  {
    "username": "Hans_Habicht",
    "rating": 2.0,
    "comment": "Terrible game. Like a trivial pursuit in which all the questions are about philosophy and are either completely banal or completely unsolvable.\nTakes far too long, is ugly as hell and falls into the same category as Monopoly or Trivial Pursuit, where after 2.5 hours all players just want this boring ordeal to end - but it stretches on for the next 1.5 hours. Only this time with Habermas and Wittgenstein.",
    "timestamp": 1731711600
  },
  {
    "username": "parrais",
    "rating": 3.0,
    "comment": "An interesting idea but very little fun to play.",
    "timestamp": 1200610800
  },
  {
    "username": "kentonda",
    "rating": 4.0,
    "comment": "More fun than I originally thought it would be. Bought the game from a charity shop, an interest in philosophy is recommend but not essential!",
    "timestamp": 1383951600
  },
  {
    "username": "slaapgraag",
    "rating": 5.0,
    "comment": "1 x gespeeld. Grote dobbelafhankelijkheid meen ik.",
    "timestamp": 1561068000
  },
  {
    "username": "itiswon",
    "rating": 5.0,
    "comment": "Sophie's World is very educational. It is even suitable for someone who study philosophy. The difficulty level of quiz is quite high, so that the game is not proper for family members.",
    "timestamp": 1385593200
  },
  {
    "username": "sucrates",
    "rating": 6.0,
    "comment": "Trivial pursuit, but then aimed at philosophical/religious issues during 6 bygone periods: Mythical Age, Hellenism/Rome, Medieval Period, Rennaissance/Baroc, The Enlightment and 19/20th Century.\n\nEven though it has some weird rules about moving and poorly written rules, they are only 2 pages so it's a minor complaint. Wouldn't play it everyday, but it's actually quite entertaining to bring to the table for the right crowd, when in the right mood.\n\nDiscovered I suck at Philosophic reasoning, too. For me, a question is something to be answered, not to be pondered over from viewpoint to viewpoint. Yes, this might learn any bystanders about how issues can be viewed from multiple sides, plus you can show off how 'smart' you are (seem). But for me, another viewpoint is only to be explored if the first doesn't solve the problem. Ah well, maybe age will bring what I need",
    "timestamp": 1335996000
  },
  {
    "username": "feverdream",
    "rating": 6.0,
    "comment": "Read the book.",
    "timestamp": 1304632800
  },
  {
    "username": "SGart68",
    "rating": 6.5,
    "comment": "Gioco dalla meccanica semplice, ma dalle domande di cultura classica/rinascimentale che mettono in seria difficoltà, a volte.\nOccorre un buon retaggio scolastico, specie su materie filosofiche/umanistiche.",
    "timestamp": 1678921200
  },
  {
    "username": "UxxddxQUXtMATWMrdvSp",
    "rating": 7.6,
    "comment": "57",
    "timestamp": 1457823600
  },
  {
    "username": "mponciano",
    "rating": 9.0,
    "comment": "This isn't a simple trivia game, it's way too specific, philosophic trivia, if you don't know about philosophy this isn't for you.\nThe mechanics are very easy and simple, not a game that shines for the mechanics but for the questions, some of them very complex.",
    "timestamp": 1738796400
  },
  {
    "username": "SophieAmundsen",
    "rating": 10.0,
    "comment": "THE board game for philosophers (as well as history buffs)! Amazing! No complaints",
    "timestamp": 1481065200
  }
]