[
  {
    "username": "rogeracox",
    "rating": 1.0,
    "comment": "I don't see the attraction.",
    "timestamp": 1221775200
  },
  {
    "username": "sdiberar",
    "rating": 2.0,
    "comment": "There's nothing here that wasn't done better in another game. Plus, it's educational. Even better, it's dull dull dull.",
    "timestamp": 1229468400
  },
  {
    "username": "Ambro11",
    "rating": 3.0,
    "comment": "M.",
    "timestamp": 1703977200
  },
  {
    "username": "familygaming",
    "rating": 4.0,
    "comment": "Played 10+ times with 2-6 players. A mediumweight boardgame that has a very simple mechanics. This game is old, and feels a little old, but that doesn't mean it is not a pleasant gaming experience. And don't let the family-friendly theme fool you: those blockade markers can lead to some serious screwage.",
    "timestamp": 1416610800
  },
  {
    "username": "FSTiletto",
    "rating": 5.0,
    "comment": "Mein erster Kramer \n\nFrüher häufig auf dem Tisch aber seit langem in den Keller umgezogen.",
    "timestamp": 1564264800
  },
  {
    "username": "billjazzer",
    "rating": 5.4,
    "comment": "too much \"take that\" for a lite game",
    "timestamp": 1546470000
  },
  {
    "username": "Anne_Claire",
    "rating": 6.0,
    "comment": "rules heaviness: low\nAn oldies where you try to direct some expedition around the world to your animals",
    "timestamp": 1760392800
  },
  {
    "username": "Shrewmaster",
    "rating": 6.0,
    "comment": "Travel, animals and Ravensburger quality. Nuff said. Rarer than some of their games so not the cheapest used buy out there.",
    "timestamp": 1737673200
  },
  {
    "username": "guimel",
    "rating": 7.0,
    "comment": "For trade. Very good condition. English edition.\n\nSuitable for two players. 60 mins. Very light game. Age 10+.\nThis game featured as a tournament competition game in 1990s and has been reimplemented a few times, most recently in 2013. Receives good ranking status on BGG 6.8 - 6.9",
    "timestamp": 1755468000
  },
  {
    "username": "Haqwau",
    "rating": 8.0,
    "comment": "Abenteuer Tierwelt",
    "timestamp": 1754776800
  },
  {
    "username": "redarrows",
    "rating": 9.4,
    "comment": "Pubblicato nel 1985 ed è ancora ai nostri giorni un gioco molto carino (poi se lo paragoniamo con gli altri del suo tempo!) ed molto meglio di tanti nuovi e piace a tutti. Semplice nella spiegazione e nello svolgimento. La tattica prefissata è difficile da imporre, perché può essere stravolta dalle tattiche degli avversari nel corso della partita. Ovviamente c'è la componente fortuna. Bello il fatto di cercare le possibili strade per arrivare agli animali... e dover cambiare tutto alla mossa successiva. Infine ha insegnato a molti l'esistenza di animali sconosciuti. Consigliatissimo!",
    "timestamp": 1754258400
  },
  {
    "username": "jamadrox",
    "rating": 10.0,
    "comment": "Fantastic game for children to learn about almost extinct animals",
    "timestamp": 1756245600
  }
]