[
  {
    "username": "tectactoe",
    "rating": 1.0,
    "comment": "Strategic in the same way that you might find Blackjack or Poker. Like, sure, you can increase your changes of success by careful deduction of the cards, but at the end of the day, the game is still incredibly luck-driven, oftentimes far beyond your control, and almost inevitably turns into damage control and mitigating point loss (unless it's one of those rounds where you get lucky and happen upon all the cards you need), which may very well be by design, but doesn't strike me as particularly clever or even fun. The most interesting aspect is the time crunch—i.e., paying attention to how many card draws are left (including the cards on the display), juxtaposing that with how many card lays you'd ideally like to make, and watching as those two metrics traverse in opposite directions. Mostly, though, my games of this have felt like a bit of a slog despite how quick it plays, which isn't a good sign.",
    "timestamp": 1760479200
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "It's fine! I didn't feel the theme at all at first, but now after many games it starts to feel like some crazy gambles and races. I guess that's the opposite of many (bad) games! But still, it's hard to avoid feeling overly mathematical, and players rarely need to look at what the opponent's doing. I mean, even if you can deduce something, it hardly matters for what you play next. I guess that's why it's popular among eurofans, you barely have to pay attention to others. I liked Battle Line more, because the tension is psychological, rather than the pure logic here.\n\nThe version with Vincent Dutrait artwork is especially goofy because the environments create horizontal panoramas. Which, uh, you'll never see on the table because everything will overlap, there's no horizontal space. It makes me wonder if he played the game even once.",
    "timestamp": 1757282400
  },
  {
    "username": "Pinhead616",
    "rating": 1.0,
    "comment": "Probably seconda game i wanted to throw into garbage.\nI hate this game with all of my heart.",
    "timestamp": 1751666400
  },
  {
    "username": "BayesianKing",
    "rating": 1.0,
    "comment": "Knizia is a master of game designing. However compared to master pieces such as Tigris & Ephrates this game is really luck based. It may happen either you are very lucky and you feel your victory as not mainly due to you or you are very unlucky and even if your opponent play the worst strategy possible you cannot do anything.\nThere should be a mechanics that reduces this, such as avoiding uniform distribution of card colors or an overall card value too low.",
    "timestamp": 1735772400
  },
  {
    "username": "storphid",
    "rating": 1.0,
    "comment": "Highly luck based. Very little strategy.",
    "timestamp": 1697148000
  },
  {
    "username": "Jobul_is_happy",
    "rating": 1.0,
    "comment": "very simple game that depends on only luck\nget tired of playing this game after few rounds",
    "timestamp": 1667430000
  },
  {
    "username": "thuff",
    "rating": 1.0,
    "comment": "The cards in this game and expansion vary greatly in cut, color, texture, and size. When I contacted KOSMOS' customer support with puctures, the most they were willing to do was have me mail them my cards and mail me a set from a different version that didn't match the board, I said no thank you.",
    "timestamp": 1600725600
  },
  {
    "username": "lolapapola",
    "rating": 1.0,
    "comment": "I SUCK AT MATH!",
    "timestamp": 1586642400
  },
  {
    "username": "Pimpmatics",
    "rating": 1.0,
    "comment": "Boring Game",
    "timestamp": 1571608800
  },
  {
    "username": "rekath16",
    "rating": 1.0,
    "comment": "It's a terrible game. Big disappointment. JUNK!",
    "timestamp": 1425769200
  },
  {
    "username": "Beery",
    "rating": 1.0,
    "comment": "I just can't see what there is about Lost Cities that makes people choose such a mediocre game as a favourite. I mean surely there have to be a bunch of better games than this. Lost Cities lacks any sense that the theme is meaningful - this could just as easily be a game about cooking pizza, washing dishes or cycle touring. It lacks depth, and I don't feel it does much more than what a traditional card game like Patience does - all it does is present what amounts to a traditional card game in a nice flashy graphics package - but underneath the make-up it's still basically a variant of Patience.",
    "timestamp": 1398808800
  },
  {
    "username": "Myoman",
    "rating": 1.0,
    "comment": "Everyone but me loves this game. Because of my horribly bad luck, I lose by at least a 150 point margin every time, no matter who I play. Guaranteed.",
    "timestamp": 1334181600
  },
  {
    "username": "magnoguido",
    "rating": 1.3,
    "comment": "Another Knizia game that is excrutiatingly overrated. A simple math game that is determined by and large by randomness and the game is easily broken down in 1 game, such that subsequent games are dictated purely by randomness. The board in the middle is pointless, this game could essentially be played with a normal deck of cards.",
    "timestamp": 1327705200
  },
  {
    "username": "Muttah",
    "rating": 1.0,
    "comment": "Random piece of sh*t...",
    "timestamp": 1267225200
  },
  {
    "username": "streaky2007",
    "rating": 1.0,
    "comment": "I really really hate this game and it makes me angry and miserable every time I play it.",
    "timestamp": 1252706400
  },
  {
    "username": "Simon Mueller",
    "rating": 1.0,
    "comment": "This completely random game plays like Candy Land (draw a card, match colors), only that calculating the points takes as long as one actual play. Would be more fun if you had to convert the results from Polar to Cartesian Coordinate.",
    "timestamp": 1215640800
  },
  {
    "username": "TeknoMerk",
    "rating": 1.0,
    "comment": "lipstick on a rummy pig.",
    "timestamp": 1212703200
  },
  {
    "username": "Smuker",
    "rating": 1.0,
    "comment": "I can't understand why so many gamers like the game. I find it quite boring",
    "timestamp": 1205190000
  },
  {
    "username": "davedanger",
    "rating": 1.0,
    "comment": "Not just light, but the point of a fast game is to utilize time, but you waste most of a game dumping cards.",
    "timestamp": 1102028400
  },
  {
    "username": "browncow",
    "rating": 1.0,
    "comment": "I hate to give a game a one, especially to a game that so many seem to enjoy, but everytime my girlfriend and I try this game we quit out of boredom after about 5 minutes. It just seems so simple and routine.",
    "timestamp": 1098396000
  },
  {
    "username": "SomeGuy",
    "rating": 1.0,
    "comment": "All I can say is BORING!!",
    "timestamp": 1080082800
  },
  {
    "username": "TheGoblin",
    "rating": 1.0,
    "comment": "Two player game without anything to do with the theme, just a luck-based card game, and a boring one, too.",
    "timestamp": 1047596400
  },
  {
    "username": "ihavecheckmate",
    "rating": 2.0,
    "comment": "It's just unfun. The theming is bad, and if you're going to play abstract games, you may as well play chess. Beats me how people rate this high.",
    "timestamp": 1760738400
  },
  {
    "username": "Piston",
    "rating": 2.0,
    "comment": "吹的人无非说这个简练精妙……六七百年前的马穆鲁克老铁们鼓捣出来了扑克牌，今天还是最火的桌游。这玩意则就是一9卡桌游的水平，被不停的吹到现在……也就是沾了90年代蓝海市场的光",
    "timestamp": 1750197600
  },
  {
    "username": "TForever",
    "rating": 2.0,
    "comment": "I ended up hating this game. Very light. I gave it away at a white elephant.",
    "timestamp": 1744408800
  },
  {
    "username": "PeterPink",
    "rating": 2.0,
    "comment": "At first we found the two player version novel, exciting, and \"playable\". After about 7 games of the 5-expedition version, it became clear that there is ...\nA - a first-phase (largely driven by the luck of the draw of the cards)\nB - followed by a middle section ( where one tries to add to one's own expeditions and to hold back cards the opponent wants)\nC - and a final drag home, during which time there's minimal opportunity for any further development of competition or interaction, and it's just a case of \"put one down, pick one up\".\n\nNow, then, am a non-fan of a game I thought I'd love forever ... and another bash at it a few weeks later leaves both my wife and I wondering why on earth it simply cannot last beyond the middle phase. It really is boring at the end, waiting, just waiting for the stock pile to run out.",
    "timestamp": 1677452400
  },
  {
    "username": "unicoherent",
    "rating": 2.0,
    "comment": "lame",
    "timestamp": 1674169200
  },
  {
    "username": "H4wkins",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1670540400
  },
  {
    "username": "Tyinsar",
    "rating": 2.0,
    "comment": "Box cover looks great - but that’s terribly misleading. There’s zero theme here and it’s really just odds calculations. I’d rather make a spreadsheet that plays the game than actually play the game.",
    "timestamp": 1646866800
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "30 Min 2 Players p2 Weight: 1.49",
    "timestamp": 1632002400
  },
  {
    "username": "jaygold14",
    "rating": 2.0,
    "comment": "One of those rare games that actually felt offensive to play.",
    "timestamp": 1618005600
  },
  {
    "username": "gredar",
    "rating": 2.0,
    "comment": "I hate this game. It has so much luck and I often will get low cards and start expeditions and then never get another card of that color or I get high cards that I can't start with because I wouldn't have enough to get to 20 and then I am waiting for those lower cards which don't come. There is a variant on the BGG Forums though that I love and would rate that at a 9. It is the only way I will play this game from now on. When you draw from the deck you draw two cards, pick one to keep and one to discard. Once you go through that pile, you shuffle the discards and play where you only pick up one card (like how the game is normally played).",
    "timestamp": 1604358000
  },
  {
    "username": "Michael Sean",
    "rating": 2.0,
    "comment": "Not worth playing.",
    "timestamp": 1600984800
  },
  {
    "username": "batrias",
    "rating": 1.5,
    "comment": "1.50",
    "timestamp": 1579734000
  },
  {
    "username": "Caresim",
    "rating": 2.0,
    "comment": "I don't really see the appeal of a game, where you bet on whether you will draw a specific colored number card or not. You look at what your opponent is doing but you can't really affect anything they will do, despite the fact that high player interaction is one of the main advantages, that 2 player games allow for. But here, the only moment you will talk is after you have tallied up your score. This game is soooo dry.",
    "timestamp": 1571608800
  },
  {
    "username": "vogella",
    "rating": 2.0,
    "comment": "Colors hard to see, prefer Keltis",
    "timestamp": 1555538400
  },
  {
    "username": "MaxTurbo4600",
    "rating": 2.0,
    "comment": "This was an early purchase in my board game collection, and for some reason I completely misinterpreted what it was about. I think it was before I started reading reviews before picking things up. Anyway, even after getting over my initial issue with how the theme is completely tacked on, this is still just a basic push your luck game with a lot of simple math.",
    "timestamp": 1544914800
  },
  {
    "username": "NoxMortem",
    "rating": 2.0,
    "comment": "Okay. Slightly boring.\n\nUpdate 11.11.18 to 2: Too boring. Never again.",
    "timestamp": 1541890800
  },
  {
    "username": "blondeslovetoshop",
    "rating": 2.0,
    "comment": "Too boring after a few rounds",
    "timestamp": 1541545200
  },
  {
    "username": "Kamiko",
    "rating": 2.0,
    "comment": "Like a really boring solitaire with awfully tedious scoring.",
    "timestamp": 1533333600
  },
  {
    "username": "adrim",
    "rating": 2.0,
    "comment": "The luck factor is too high for a two player game with no theme.",
    "timestamp": 1510009200
  },
  {
    "username": "drbenn",
    "rating": 2.0,
    "comment": "What can I say? I just don't like it.",
    "timestamp": 1483052400
  },
  {
    "username": "OnlyMostlyDead",
    "rating": 2.0,
    "comment": "Whole number rating = game I don't own, but have enough of a play to have an opinion.",
    "timestamp": 1428098400
  },
  {
    "username": "SPLogDog",
    "rating": 2.0,
    "comment": "Lost Cities\n\nPicked it up after hearing good things about it, combined with the limited selection of games designed for two players. At its best, its a coin toss who wins. At its worst, you end up so far behind you'll never catch up. Even when the games were close, I didn't feel there was potential to affect the game outcome. Combine that with a weak theme, and it seems like filler. For the price you should buy a deck of cards and some gin, the fun will last longer that way.\n\nPros: Quick Setup\n\nCons: Weak theme, feels like playing tic tac toe",
    "timestamp": 1353452400
  },
  {
    "username": "Maalkor",
    "rating": 3.0,
    "comment": "Nul",
    "timestamp": 1755900000
  },
  {
    "username": "myrica",
    "rating": 3.0,
    "comment": "Played a number of times before we started logging plays.",
    "timestamp": 1752271200
  },
  {
    "username": "MaxxamusTime",
    "rating": 3.0,
    "comment": "The gameplay is dull.",
    "timestamp": 1750629600
  },
  {
    "username": "dtmoney75",
    "rating": 3.0,
    "comment": "8 Plays\n\nPlayed at: 2",
    "timestamp": 1749852000
  },
  {
    "username": "JamesBgood",
    "rating": 3.0,
    "comment": "\"Lost Cities\" offers simple rules and quick gameplay, making it accessible for casual sessions, but its heavy reliance on luck often leads to frustration rather than enjoyment. Unlike other luck-driven games it lacks the rewarding high-point moments, and its style of game play can feel repetitive and disengaging. Drawing unfavorable cards frequently compounds the sense of unfairness, making this game more frustrating than fun for me, despite its popularity.",
    "timestamp": 1741906800
  },
  {
    "username": "Slatna",
    "rating": 3.0,
    "comment": "For us it was totally boring and we were happy when it was over.",
    "timestamp": 1733871600
  },
  {
    "username": "Scaaat",
    "rating": 3.0,
    "comment": "Played roughly 8-10 times with the gal. It was fun at first but I feel the game is just way too luck driven. Also we played on the mobile app, I could imagine doing score at the end wouldn't be fun to deal with. Still love Reiner this one just struck out sadly.",
    "timestamp": 1733612400
  },
  {
    "username": "bigfranco",
    "rating": 3.0,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "D_Wessman",
    "rating": 3.0,
    "comment": "Destroyed by water damage (roof leak)",
    "timestamp": 1728338400
  },
  {
    "username": "Arowelor",
    "rating": 3.0,
    "comment": "Lost Cities only consists of drawing cards in order to carry out explorations. This game relies too much on luck as it pushes you to take risks and you better draw the cards you need otherwise it's guaranteed frustration. The decision range is almost inexistent, you know wich card you have to play. If you like this style of game but want a little more control and fun, I recommend playing Schotten Totten 2 instead.",
    "timestamp": 1710630000
  },
  {
    "username": "Tjohei",
    "rating": 3.0,
    "comment": "In the first half, you don't have the cards you want, and it't painfull to play bad cards. In the second half, you don't have the time to play the cards you want to, and it's painfull not to be able to play all the good cards.\n\nSold it. Don't ever want to play it again.",
    "timestamp": 1701039600
  },
  {
    "username": "Yokiboy",
    "rating": 3.0,
    "comment": "I had definitely set my expectations too high with this game. To begin with it just fell flat, but after playing some more it's grown on me a bit.",
    "timestamp": 1698444000
  },
  {
    "username": "Romek010",
    "rating": 2.5,
    "comment": "+ karty promo",
    "timestamp": 1697925600
  },
  {
    "username": "darkapplepolisher",
    "rating": 3.0,
    "comment": "Card-counting, the game.",
    "timestamp": 1695333600
  },
  {
    "username": "morrisdata",
    "rating": 3.0,
    "comment": "I may be an outlier but this just was not fun for me. I mean yes it is 2 player solitaire but more exciting than 2 player solitaire. The math at the end to resolve who one could be streamlined, overall I will keep an eye out if the doe other editions or rework I think it has potential but just not very engaging or memorable.",
    "timestamp": 1693260000
  },
  {
    "username": "NightinGale4",
    "rating": 2.5,
    "comment": "Played on BGA. Was excited to try this out after all the hype but realized quickly that it was not my cup of tea, unfortunately.",
    "timestamp": 1684533600
  },
  {
    "username": "jvhemert",
    "rating": 3.0,
    "comment": "Noughts and coffees",
    "timestamp": 1684015200
  },
  {
    "username": "Iskreemman",
    "rating": 3.0,
    "comment": "Not compelling and there are better 2 player card games out there.",
    "timestamp": 1674082800
  },
  {
    "username": "jaydiepie",
    "rating": 3.0,
    "comment": "This is alright but I would rather play Battle Line",
    "timestamp": 1653602400
  },
  {
    "username": "jam3319",
    "rating": 3.0,
    "comment": "Can be fun when the games are tight, but the crazy randomness often gives a huge advantage to one player",
    "timestamp": 1649455200
  },
  {
    "username": "kinnajt",
    "rating": 2.5,
    "comment": "Not my type of game. Very boring to me.",
    "timestamp": 1646694000
  },
  {
    "username": "Puglord",
    "rating": 3.0,
    "comment": "I'm frankly amazed that this game is considered a classic by many. The strategy (if such a word is really applicable to this game) is so basic the average five year old could grasp it, reducing each game to little more than the luck of the draw. It's certainly possible to play this game badly (if you're not very bright...) but it's all but impossible to play it well, as there are basically only poor moves and ok/obvious moves available each turn. To me, this game can best be summed up as feeling like a two player version of the old card game Patience. And that's not a good thing.",
    "timestamp": 1633903200
  },
  {
    "username": "nil_spiel",
    "rating": 3.6,
    "comment": "Hand Management\nMelding and Splaying\nOrdering\nPush Your Luck\nScore-and-Reset Game\nSet Collection\n\nlacks smoothness and elegance of other Knizia-Games. This is rather crude. drawing luck is way too important",
    "timestamp": 1760479200
  },
  {
    "username": "Flatirons",
    "rating": 4.0,
    "comment": "Gave as gift.\nOn BGA premium.\n\nSetup (0-Slow | 4-Quick): 2/4\nEasy to teach (0-Hard | 4-Easy): 3/4\nPlayer Interaction (0-Solitaire | 4-Plenty): 3/4\nDowntime (0-Long | 4-Short): 4/4\nLuck Influence (0-Swingy | 4-None/Counterable): 2/4\nReplayability (0-Barely any | 4-Almost infinite): 1/4\nFun (0-Boring | 4-Heck Yeah): 2/4",
    "timestamp": 1753135200
  },
  {
    "username": "seb_48784",
    "rating": 4.0,
    "comment": "After many plays IRL as a child and 2 on BGA: The game has a cult status for many and is a good example of a game with an elegant, smart design — yet I don’t like it. The reason is that the game is all about avoiding penalties and taking as little damage as possible. Avoidance games like this make me feel uneasy and constrained — not entertained. But fun is the very reason why a game even gets to the table for me.\n\nAs a child, I enjoyed collecting sets and looking at the adventurous illustrations. Today, I know that there are set collection games without penalties, and that the exploration of such regions was often carried out by invaders and raiders.",
    "timestamp": 1751407200
  },
  {
    "username": "ourmove123",
    "rating": 4.0,
    "comment": "Lost Cities is straightforward and easy to learn, though its scoring system may not appeal to everyone.\n\nThe gameplay loop can feel monotonous to some players.\n\nIt's closely akin to a game that could \"almost\" be played with a standard 52-card deck, highlighting its simplicity.\n\nThere is still enough tension to make the game engaging.\n\nThe 6th expedition significantly makes the game more interesting.",
    "timestamp": 1748728800
  },
  {
    "username": "secondofthenew",
    "rating": 4.0,
    "comment": "There are other lane battlers that I would much rather play. Like most Knizia games, just does not have enough to chew on to continue satisfying my desire to replay.",
    "timestamp": 1748556000
  },
  {
    "username": "wojtolino",
    "rating": 4.0,
    "comment": "Well, I don't like bet cards in this game. I would prefer it to be based on player's decision, if they want to rise bets or not, but here the game tells me if I can or can't do this. Weird, I don't buy that solution.",
    "timestamp": 1736204400
  },
  {
    "username": "BoardGamingCouple",
    "rating": 4.0,
    "comment": "4/5\n\nThis is a fantastic 2P game that holds up well. The theme isn't really there. The new artwork is nice. This game pails in comparison to Arboretum. The board isn't needed. The cards are too big. 200+ plays.\n\nHouse rule: Starting hand of 10 cards with 6 suits.",
    "timestamp": 1735254000
  },
  {
    "username": "shtiv",
    "rating": 4.0,
    "comment": "Dated, luck based, frustrating when you lose and not particularly satisfying when you win.\n\nClassics are classics until they're not.",
    "timestamp": 1734476400
  },
  {
    "username": "DaneTheBeast",
    "rating": 4.0,
    "comment": "Played (TTS)",
    "timestamp": 1733439600
  },
  {
    "username": "psrx",
    "rating": 4.0,
    "comment": "This is widely praised, but I find for a supposedly lightweight 1v1 that isn't about direct combat, it's a bit too mean-spirited, AP-prone and sluggish.",
    "timestamp": 1729807200
  },
  {
    "username": "ivanelfaker",
    "rating": 4.0,
    "comment": "No nos entretuvo mucho, nos pareció demasiado sencillo y sin chicha",
    "timestamp": 1725660000
  },
  {
    "username": "MiloXCoco",
    "rating": 4.0,
    "comment": "4 OL",
    "timestamp": 1723413600
  },
  {
    "username": "JuliaNasu",
    "rating": 4.0,
    "comment": "Very luck based game for two. It is fun for a one time play but doesn't have to be more often.",
    "timestamp": 1722549600
  },
  {
    "username": "esparver73",
    "rating": 4.0,
    "comment": "Simple card game with cards of different colors.",
    "timestamp": 1715896800
  },
  {
    "username": "Telaz",
    "rating": 3.5,
    "comment": "My rating(50%): 5\nMy “want to play-again” rating(50%): 2\nMy overall rating: 3.5\nPlays: 5+\n\nI can't handle the lucky swings in this game",
    "timestamp": 1713391200
  },
  {
    "username": "Akado",
    "rating": 4.0,
    "comment": "*Update*\nAfter revisiting it again, many years later? I don't enjoy it. It's got strategic thoughts and odds speculation, but the flipluck can mean that one player was never in a position to win, and that's unacceptable to me. If you want odds and luck, play Can't Stop, because someone taking increasingly long odds to try and compete is cool, but the deck saying \"Your opponent drew 7-10 for everything\" is crap.\n\n\n*Original thoughts*\nPlayed a lot and enjoyed it, gave it to family so they could enjoy it as well.\n\nGreat two-player game that's light and easy to play. Will play this for awhile and then pass on to someone else.",
    "timestamp": 1710457200
  },
  {
    "username": "evdm",
    "rating": 4.0,
    "comment": "Sold at Spiel 2023",
    "timestamp": 1701903600
  },
  {
    "username": "WeLuvBGs",
    "rating": 4.0,
    "comment": "A really fun game, especially for couples...the bartering and bluffing can be especially enjoyable! It's a pretty easy game to learn, but each game feels different because you might get a great set of starting cards, or you might be using a different strategy of how you will bid, and so forth. It's got a lot of re-playability for us in that sense, although, once we got into gaming more, we didn't have the interest for it we had before.",
    "timestamp": 1695938400
  },
  {
    "username": "greatredwarrior",
    "rating": 4.0,
    "comment": "As my good friend Joey says, \"It's not a game about winning, but about making the other person lose worse.\"\n\nI've tried it lots of times, but I must be missing something. I always lose, but then again, so does everybody else.\n\nGiven away on G4GG Lottery",
    "timestamp": 1691359200
  },
  {
    "username": "Boo_n_Cass",
    "rating": 3.5,
    "comment": "Only played on Happy Meeple. Too beige for me.",
    "timestamp": 1689199200
  },
  {
    "username": "genji256",
    "rating": 4.0,
    "comment": "I only played 10 games. This is basically an inverted push-your-luck: do you commit early, with higher risks and higher rewards, or do you wait a bit.\n\nMy experience is that committing early makes it a wildly swingy game: some might find it thrilling, I find it frustrating. Committing late, on the other hand, makes the game almost mechanical.\n\nI've had more success with the latter strategy.\n\nOverall, this game disappointed me and I find Schotten-Totten to be vastly superior. I can't imagine choosing Lost Cities if I have the choice between the two.",
    "timestamp": 1687384800
  },
  {
    "username": "bainewedlock",
    "rating": 4.0,
    "comment": "Rating 4 = To someone with a simliar taste like me: Play this game if you don't have anything else to do.",
    "timestamp": 1679180400
  },
  {
    "username": "SteveD.",
    "rating": 5.4,
    "comment": "@ Jeff's 0825",
    "timestamp": 1756504800
  },
  {
    "username": "rexkow",
    "rating": 5.0,
    "comment": "Ok little card game. I play it sometimes during travel.",
    "timestamp": 1756072800
  },
  {
    "username": "Aglar",
    "rating": 5.0,
    "comment": "Meh...",
    "timestamp": 1755381600
  },
  {
    "username": "Ostry",
    "rating": 5.0,
    "comment": "I used to really enjoy it, but now I've had enough. There are definitely better games out there now. Rating goes down to 5 (from 7)",
    "timestamp": 1753826400
  },
  {
    "username": "camidon",
    "rating": 5.0,
    "comment": "I enjoyed this game a few times, but it just seems so monotonous and luck driven. Plus you could play this with a standard deck of cards and save yourself the money. The components looked nice, but it was basically a math exercise in disguise. Don't know why this game ranks so high.\n\nTRADED",
    "timestamp": 1753740000
  },
  {
    "username": "Raoulinho82",
    "rating": 4.5,
    "comment": "P: [2-2] (2) Competitive",
    "timestamp": 1751320800
  },
  {
    "username": "Indypendence",
    "rating": 5.0,
    "comment": "I rated it lower because the game Keltis does it a lot better.",
    "timestamp": 1751320800
  },
  {
    "username": "Elladhan",
    "rating": 5.0,
    "comment": "I have a love / hate relationship with the game. I get why it's a classic and would recommend it to most people. However, it just doesn't fit my personal taste. To me, almost every action I take feels bad, like I always choose between bad options.\nMy girlfriend loves it however so I will have to keep playing it and enjoy the game - to some extend - just because of this fact.",
    "timestamp": 1750888800
  },
  {
    "username": "ElementalDud",
    "rating": 5.0,
    "comment": "Players: 2\nGenre: Drafting\nModes: Versus, One-shot\nComplexity: 1/5\n\nCollection Ranking:\n Condensed Size\n Market Value\n Market Rarity\n Uniqueness in Collection\n Ease of Play\n Fun Factor\n Cool Factor",
    "timestamp": 1750716000
  },
  {
    "username": "Shadowjac",
    "rating": 5.0,
    "comment": "Boyfriend likes it. Not for me, maybe with a few more plays.",
    "timestamp": 1750197600
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "The game doesn't hold it's play value over extended periods of time.\nI used to like this game a lot but there seems to be something lacking.\nI don't get a satisfied feeling when I finish playing like I do when\nI play something like Can't Stop or Power Grid.\nMy mom’s favorite game.",
    "timestamp": 1745272800
  },
  {
    "username": "Bergonzini",
    "rating": 5.5,
    "comment": "Sencillo y rápido juego para dos, apenas tienes tiempo de pensar y todo depende de la suma de las expediciones.",
    "timestamp": 1744495200
  },
  {
    "username": "DuneImperium",
    "rating": 5.0,
    "comment": "Basic boring card collector",
    "timestamp": 1744063200
  },
  {
    "username": "DanKill",
    "rating": 5.0,
    "comment": "Easy, fun, small",
    "timestamp": 1742770800
  },
  {
    "username": "CMagex",
    "rating": 5.0,
    "comment": "Remove-I have better 2 player games and don't play them enough",
    "timestamp": 1742338800
  },
  {
    "username": "Laslow",
    "rating": 5.0,
    "comment": "Csak a netes változatával játszottam, de nem tudom elképzelni, hogy mitől lenne ez egy 7 pont feletti játék az átlag szerint. Oké, egyszerű, pillanatok alatt megtanulható, ez nyilván előny. De utána? Annyira mechanikus az egész! Szökőévente egyszer kerülök döntési helyzetbe, egyébként mindig egyértelműen adott, hogy mit érdemes cselekedni, és ezzel az a baj, hogy nem én irányítom a játékot, hanem az irányítja magát, felhasználva engem, mint sima laplerakó robotot. A játékosok sincsenek hatással egymásra, több játékonként jött csak elő egyszer, hogy érdemes volt felhúznom a másik által kidobott valamelyik lapot, vagy neki az enyémet. Ez így szinte nulla interakció, de nem ez a legfőbb baj a játékkal, hanem amit írtam: mindig könnyedén eldönthető, hogy melyik lapot érdemes lerakni, és így a játékos egyszerű statisztává degradálódik...\n\nUpdate:\nAdtam neki egy nagy esélyt: megvásároltam most, hogy leakciózták rendesen. És bejött! Furcsa, de most érzek igazi döntési helyzetet szinte minden játék alatt, sőt, elég sokszor, már-már folyamatosan, de amikor meg úgy jön ki, hogy egyértelmű mit kell raknom (mert mondjuk van valamelyik színből 7-8-9-10-esem, és sorban rakhatom le őket), az meg szimplán jó érzés, hogy összejött a dolog. Szóval nekem most nagyon bejön ez a játék, határozottan szívesen játszom vele, alig várom, hogy mikor vesszük elő ismét!\n\nUpdate: De túl sokat kell számolgatni. 5 pont.",
    "timestamp": 1741906800
  },
  {
    "username": "nburrrzy",
    "rating": 5.0,
    "comment": "Just ok - the best strategy is pretty clear so it becomes a luck game",
    "timestamp": 1740870000
  },
  {
    "username": "ncc1701jv",
    "rating": 5.0,
    "comment": "Fun two player game that I'm just terrible at.",
    "timestamp": 1738537200
  },
  {
    "username": "Resyrev",
    "rating": 5.0,
    "comment": "L: 7",
    "timestamp": 1736118000
  },
  {
    "username": "Hummerb35",
    "rating": 5.0,
    "comment": "on the fence",
    "timestamp": 1735858800
  },
  {
    "username": "ruri11",
    "rating": 5.0,
    "comment": "==[Bought for kids]==\n\nSimple game. Not that much puzzles involved. So don't expect too much. Probably kids will enjoy it.",
    "timestamp": 1734130800
  },
  {
    "username": "Peekstrom",
    "rating": 5.0,
    "comment": "Played on BGA",
    "timestamp": 1732489200
  },
  {
    "username": "MadeInLo",
    "rating": 5.0,
    "comment": "Preferiría jugar a otros juegos antes pero si lo juegas alguna vez está entretenidillo, le falta más opciones al juego.",
    "timestamp": 1731279600
  },
  {
    "username": "IvanGrimm",
    "rating": 5.0,
    "comment": "I think it was a bad play and the game probably deserves a higher score but I won't change it until it proves itself",
    "timestamp": 1726869600
  },
  {
    "username": "Hymn_of_Limbo",
    "rating": 4.5,
    "comment": "IMHO Box Quote: \"Schotten Totten with water wings and three training wheels!\"\n\nJust enough of a game to be interesting, and I mean just barely. But for that reason is inviting and makes for some fun with just about anyone. With nothing to over analyze there's room for banter.\n\nThis game has the most overrated decision space I know of. A match between any two sober mammals will be determined by the deck and ends with a little chore (scoring).\n\n(10+ Plays)",
    "timestamp": 1725314400
  },
  {
    "username": "kvarclovag",
    "rating": 5.0,
    "comment": "Lórumszerű, és túl sok benne a szerencse.",
    "timestamp": 1723327200
  },
  {
    "username": "canis_artis",
    "rating": 5.0,
    "comment": "Played the required 3 games, it felt like two-handed solitaire.\n\nGot it for Knizia and Dutrait.",
    "timestamp": 1721772000
  },
  {
    "username": "Bevr",
    "rating": 5.0,
    "comment": "I don't think I get the appeal of this game. I feel like I need to play it more, but don't feel any motivation to.\n\n\n\nOn another note, something that doesn't affect my rating at all, I feel like the art for this game is amazing and beautiful but feels pointless. The gameplay isn't influenced by the art or vice versa. It feels like the art could be simplified in a similar style to an Oink Game and nothing would be lost besides eye candy. It just feels bizarre.\n\nOn top of that, the game board feels completely unnecessary. It seems to only be there to encourage where players place their columns and discards and nothing more. Maybe to inflate the price and production cost.",
    "timestamp": 1719612000
  },
  {
    "username": "gidorah",
    "rating": 5.0,
    "comment": "12.2022\n\nGAMEPLAY\nLost Cities is a 2P lane-battler. The choices are to either discard a card or play a card from hand to a lane, making sure that cards are arranged in ascending order. Then, draw a new card either from the deck or a discard pile. By committing to a lane, you’re starting at -20 VP so you need to make sure you can get it in the black to earn points.\n\nTHOUGHTS\nLost Cities is dead simple, making for a solid game to play with family or a something casual for the pub. It’s a game where distractions or interruptions won’t matter much to the flow, but you can also play as competitively as you like. The multiplier cards add a fun twist, especially if a player ends up multiplying a negative score. But, otherwise, Lost Cities asks players to manage their hands well and be smart about discarding at the right moment. Simple and smooth, but with enough to think about to keep players engaged.",
    "timestamp": 1715119200
  },
  {
    "username": "Antch007",
    "rating": 5.0,
    "comment": "Mediocre and overrated. Totally depending on the card luck. No brain power required",
    "timestamp": 1714860000
  },
  {
    "username": "NUNON4",
    "rating": 5.0,
    "comment": "W\n\nL 2",
    "timestamp": 1710025200
  },
  {
    "username": "data00",
    "rating": 5.0,
    "comment": "────────────────────────────────────────────────────\n2인 일반인 게임 추천에 가장 많이 추천됐지만\n매우 치열한 게임이고 딱히 재미를 느끼지 못해 저는 안 좋아하는 게임(로스트 시티와 패치워크).",
    "timestamp": 1708988400
  },
  {
    "username": "Sportomax",
    "rating": 5.0,
    "comment": "Cards",
    "timestamp": 1705532400
  },
  {
    "username": "Leonardo",
    "rating": 5.0,
    "comment": "Good probability game but thats it, Ive played it alot and used to rate it higher",
    "timestamp": 1703458800
  },
  {
    "username": "DeafFatalBruno",
    "rating": 5.0,
    "comment": "very simple game, works well, but limited replayabilty.",
    "timestamp": 1702940400
  },
  {
    "username": "Stjena",
    "rating": 5.0,
    "comment": "It's a traditional card game disguised as a board game. That could be said for some other card games, but this game offers literally nothing else (aside from the artwork); the theme is completely tacked-on, the strategy is on par with other card games and the board is superfluous. And yet for such a simplistic game, the box is also needlessly oversized.\n\nA 5 or 6 with traditional cards (with either 4 or 5 suits), a 4 for the official box. There are way better 2p games nowadays to spend your money on.",
    "timestamp": 1702335600
  },
  {
    "username": "Lisa_a_random_nerd",
    "rating": 5.0,
    "comment": "2 players, parents",
    "timestamp": 1702162800
  },
  {
    "username": "Maxplanck12",
    "rating": 5.0,
    "comment": "Not the worst way to kill a few minutes, but there are so many other games in this filler category that are better that I'm not sure why I would pick this at any juncture.",
    "timestamp": 1701298800
  },
  {
    "username": "Neeby",
    "rating": 5.0,
    "comment": "Not my favorite 2 player but not bad.",
    "timestamp": 1699830000
  },
  {
    "username": "Hotspurious",
    "rating": 5.0,
    "comment": "Digital",
    "timestamp": 1699484400
  },
  {
    "username": "jollster725",
    "rating": 5.0,
    "comment": "I don't know what it is about this game, but I am horrendous at it. My wife loves it and that's why I have it in our collection. I have two negative lists of games that go as follows:\n- \"On my list\" -> will never play again\n- My \"eh\" list -> I'll only play these games if someone feels passionate about playing them.\n\nThis game goes on my \"eh\" list. If my wife wants to play it badly, I'll play it. But I'll never choose to play this on my own.",
    "timestamp": 1698012000
  },
  {
    "username": "halbert82",
    "rating": 5.0,
    "comment": "Molt depenent de l'atzar.",
    "timestamp": 1695160800
  },
  {
    "username": "SydB1",
    "rating": 5.0,
    "comment": "og2",
    "timestamp": 1694296800
  },
  {
    "username": "theclay",
    "rating": 5.0,
    "comment": "Ok card game.\n\nEasy to learn and teach.",
    "timestamp": 1692568800
  },
  {
    "username": "whitecatplays",
    "rating": 6.0,
    "comment": "Go play with someone you love.",
    "timestamp": 1760738400
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "Simple rules, quick turns and I initially suspect some depth. There is a sense of suspension - at least compared to similar card games. It is by no means heads-down only, i.e. the known cards have an influence on your own decisions. Nevertheless, you are primarily focused on the future result and there is not much conversation in between.\n\n-----\n\nAfter a couple of plays, I think it's a solitair-like card game and simply not particularly interesting. It is obvious that it is more nuanced than just placing as many cards as possible in a row. Based on one's own (color) strategy and the choice of the opponent, there are options that lead to interesting and sometimes exciting developments. Nonetheless, it remains a dry and mathematical race for victory point maximization and damage minimization.\n\nI just see too many better options for interesting and exciting two-player games, ranging from short card games to skirmish games and wargames.\n\n-----\n\nI want to revisit this game in the next months.",
    "timestamp": 1760306400
  },
  {
    "username": "Djakra",
    "rating": 6.4,
    "comment": "Light game for 2, where the rules give a tense but lucky drive to your game. The best thing is the timing mechanism that forces you to decide what kind of cards to wait and what other to place down or discard. Luck can instantly boost your position or save you from a disaster, or condamn you to a strong negative column. Better to bet on 4 lines. Less tactic than Shotten Totten, which I prefer.",
    "timestamp": 1759788000
  },
  {
    "username": "DiceLord",
    "rating": 6.0,
    "comment": "Card game",
    "timestamp": 1759788000
  },
  {
    "username": "mondauge",
    "rating": 6.0,
    "comment": "Good design, but not all that interesting to play. Think I need a bit more content that piling up numbered cards.",
    "timestamp": 1759442400
  },
  {
    "username": "ValerianofEternia",
    "rating": 6.0,
    "comment": "Pros :\n• Push-your-luck elements with a good dose of tension\n• I can play it with anyone\n• It’s addictive and quick\n\nCons :\n• The luck of the draw can be frustrating\n• Final scoring takes a bit too long\n• The variant with an extra color drags out the game without making it more engaging\n\nConclusion :\nA tense and accessible two-player game.",
    "timestamp": 1759096800
  },
  {
    "username": "GibberishTea",
    "rating": 6.0,
    "comment": "In my mind this system has been surpassed by Air, Land & Sea",
    "timestamp": 1758837600
  },
  {
    "username": "dthipp",
    "rating": 6.0,
    "comment": "Sleeves: GameGenic Lost Cities Magenta",
    "timestamp": 1758751200
  },
  {
    "username": "Alaena",
    "rating": 6.0,
    "comment": "I heard about this and downloaded the app. I played it a bunch then was done with it. It's an abstract game.",
    "timestamp": 1758232800
  },
  {
    "username": "Reflex777",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1758060000
  },
  {
    "username": "xlimxz",
    "rating": 6.0,
    "comment": "It's kinda like playing chess, maybe a little less fun. Although it's good for two players while we're waiting for others to arrive/ be done with another game",
    "timestamp": 1757887200
  },
  {
    "username": "boardgamerscientific",
    "rating": 6.0,
    "comment": "2-player only, Own Digital version, Digital version (iOS app, BGA), Too random",
    "timestamp": 1757541600
  },
  {
    "username": "kytheguy",
    "rating": 6.0,
    "comment": "Tense hand management game that plays super quick on BGA. It's also nice it does the scoring for you, that is one downside to the IRL version.\n\nI've played it 23 times and will continue to play it. It feels like a fresh puzzle every time I play.",
    "timestamp": 1757368800
  },
  {
    "username": "kaepone",
    "rating": 5.5,
    "comment": "Good two player duel, just not a ton of depth.\nAn \"oldie but a goodie\" but sold because I wouldn't pick it off the shelf when there are a lot of better 2p games.",
    "timestamp": 1756332000
  },
  {
    "username": "Tina_T",
    "rating": 6.0,
    "comment": "2024.\nSolid.",
    "timestamp": 1755727200
  },
  {
    "username": "Sto21",
    "rating": 6.0,
    "comment": "Feels very dry, I prefer Jaipur",
    "timestamp": 1753394400
  },
  {
    "username": "ueyinnafesh",
    "rating": 6.0,
    "comment": "크니치아는 단순한 겜의 심리전에 도가 텄다 싶음. 깊이는 얕다. 딱 생각하는 정도의 재미.",
    "timestamp": 1752789600
  },
  {
    "username": "ozsoffy",
    "rating": 6.0,
    "comment": "A bit of chancing strategy by cards in hand and what the other player played.\n\nNice.\nGood filler for 2 players.\nI didn’t play the purple game.",
    "timestamp": 1752357600
  },
  {
    "username": "thierrydms",
    "rating": 6.0,
    "comment": "⭐️ 2 | Enkel voor 2 spelers",
    "timestamp": 1751839200
  },
  {
    "username": "WillBePlayin",
    "rating": 6.0,
    "comment": "One of Knizia's classics. It's okay.",
    "timestamp": 1751839200
  },
  {
    "username": "CotB",
    "rating": 6.0,
    "comment": "Rankings\n98th Best Game 2021\n135th Best Game 2022\n108th Best Game 2023\n114th Best Game 2024",
    "timestamp": 1751320800
  },
  {
    "username": "VioletSquirrel",
    "rating": 6.0,
    "comment": "[checked out - tried]\nnot for me\n\nnot fun or challenging to me, I mean, it's just about putting some numbers in some columns\nyeah we might invent strategy there and try to win, but it leaves me with a feeling 'what is exactly purpose here'\n\nI like more meaty games, so that I actually have a feel that I'm fighting / putting some effort\n\nlike 7 wonders duel HAS meat I'm looking for, even though it's also quite simple game\n\nupdate 26 apr 2025: bought to try in person, tried in person, very different game when you're looking your opponent, might want to repeat this and update rating\n\nmay 2025: yup, let's say it's average game for me, ok in small doses",
    "timestamp": 1750975200
  },
  {
    "username": "Silas98",
    "rating": 6.0,
    "comment": "Nice game",
    "timestamp": 1750888800
  },
  {
    "username": "Regai",
    "rating": 6.0,
    "comment": "On of the better Knizia games I've played. The wife loves it (of course she always wins). The risk/reward mechanism is compelling.",
    "timestamp": 1749938400
  },
  {
    "username": "ayukene",
    "rating": 6.0,
    "comment": "Original, 2 players, 30 min",
    "timestamp": 1749160800
  },
  {
    "username": "shanev316",
    "rating": 6.0,
    "comment": "It’s okay. Yes, it’s tense. Yes, I’m sure there’s some strategy there. But it’s much more of a push your luck game than I expected. For a tense, “keep cards from your opponents” game, I MUCH prefer Arboretum. For a Knizia card game, I prefer Battle Line or Schotten Totten, which seem to have much more strategic decisions and even more bluffing.",
    "timestamp": 1748642400
  },
  {
    "username": "thorbot",
    "rating": 6.0,
    "comment": "Themeless card-layer for two. It shows its age clearly. Dr. Knizia is a master of simple games with deeper strategy but this one feels rather mundane while playing. We both desired a little more interaction-I do not see this surviving the cull.",
    "timestamp": 1748469600
  },
  {
    "username": "JoeMaldonado",
    "rating": 6.0,
    "comment": "2",
    "timestamp": 1748210400
  },
  {
    "username": "BenedictRedmond",
    "rating": 6.0,
    "comment": "Nice two player game.",
    "timestamp": 1746309600
  },
  {
    "username": "DoubleMintDave",
    "rating": 6.0,
    "comment": "Fun but gets old quickly.",
    "timestamp": 1744840800
  },
  {
    "username": "yoyomanhihi",
    "rating": 6.3,
    "comment": "Fun small 2 players game. However, I wouldn't buy it as I think schotten totten is very similar, but feels more directly interactive and feels more like a real duel.",
    "timestamp": 1744668000
  },
  {
    "username": "darkfinale",
    "rating": 6.0,
    "comment": "Game is simple to teach and to play. However after a while card games are just not my thing.",
    "timestamp": 1744495200
  },
  {
    "username": "jcoopersd",
    "rating": 6.0,
    "comment": "Brilliant in its simplicity. That said, I would only choose to play this if I was teaching it to a non-gamer or passing time on BGA. It's a bit too chance-y for my taste.",
    "timestamp": 1744322400
  },
  {
    "username": "zgabor",
    "rating": 6.0,
    "comment": "Egyszerű, de nagyszerű, gyors és kellemes kikapcsolódás. Utazáshoz szinte mindig elvisszük.",
    "timestamp": 1743717600
  },
  {
    "username": "MaxxoBass",
    "rating": 6.0,
    "comment": "Lost Cities ist ein relativ einfaches Kartenspiel, das ein gewisses Maß an strategischen Entscheidungen und taktischen Wendungen bietet. Es gibt jedoch nicht viele tiefgehende, unvorhersehbare Elemente im Spiel.",
    "timestamp": 1743631200
  },
  {
    "username": "tbrofromspace",
    "rating": 6.0,
    "comment": "Reviewed",
    "timestamp": 1743631200
  },
  {
    "username": "kyhre",
    "rating": 6.0,
    "comment": "I have a wonderful memory of playing this with friends on the train from Paris to Marseilles. Then I got the app. I think it’s promising and I was glad to find a battered chinese copy in a thrift store almost a decade later. I threw away the broken box and put the cards in the box of Lost Cities: Rivals. It fits both games nicely. : )",
    "timestamp": 1743458400
  },
  {
    "username": "Gabrielbacon",
    "rating": 6.0,
    "comment": "Simple & elegant intro game for 2. So quick & easy to learn. Turns play very quick - it's not crunchy or thinky at all but there is just enough strategic choice & timing to keep it light & interesting. Good relaxing filler game that anyone can pickup & multiple plays reveal a limited amount of depth. Doesn't have a ton of staying power, but it's comfortable, non-intimidating and familiar.\n\nAfter playing a dozen or so times we did grow out of the game. The score keeping is a bit messy & there just isn't enough there to keep us asking to play it. I actually prefer the roll and write version of this game - it has staying power as a light dice game and is just more fun than the card version.",
    "timestamp": 1743202800
  },
  {
    "username": "dosxtres",
    "rating": 6.0,
    "comment": "2",
    "timestamp": 1741906800
  },
  {
    "username": "Moneycopy",
    "rating": 6.0,
    "comment": "Easy light couple game. Not complex but thinkable.",
    "timestamp": 1741561200
  },
  {
    "username": "themikeman",
    "rating": 6.0,
    "comment": "BGA: It's good, but sits in a landscape of so many 2p games. The mechanics of them may be different, but the feel at the end of the game is similar. Plus, point counting is not fun for a game like this.",
    "timestamp": 1740610800
  },
  {
    "username": "Carlcast",
    "rating": 6.0,
    "comment": "Un buen juego para 2. Reglas simples, rápido de explicar y de jugar.\n\nTiene un toque a juegos clásicos de baraja de cartas (tipo cinquillo) pero con una vuelta de tuerca que hace que sea mas entretenido y actual. Estrategico, pero peca de azar.",
    "timestamp": 1740265200
  },
  {
    "username": "SteamMan66",
    "rating": 6.0,
    "comment": "A pretty fun game with the racko mechanic",
    "timestamp": 1739487600
  },
  {
    "username": "hiimjosh",
    "rating": 6.0,
    "comment": "An absolute gem of a two player game. Lost Cities has jsut gotten better for me as time has gone on. It is very easy to teach new players yet there are some interesting and subtle tactics that experienced players can apply too\n\nEDIT: This game just gets better the more competitive it gets. A true classic.\n\nVery few card games have this kind of tempo gambling aspect. I don't just mean the fact that you can play investment cards, but I mean when do you start to ramp your rows. If you do it too soon, then I can possibly slow the game down and try to eek out more points than you. If you do it too late, then I can try and rush the end game by trying to cut corners to pressure you.",
    "timestamp": 1738537200
  },
  {
    "username": "Legionnair3M",
    "rating": 7.0,
    "comment": "DEVIR",
    "timestamp": 1760911200
  },
  {
    "username": "Technarius",
    "rating": 6.5,
    "comment": "It's a good game but IMHO it's not as cool as Battle Line and Hanamikoji, so i will play it less often.\nStill, this game is different enough do stay in the collection.",
    "timestamp": 1760565600
  },
  {
    "username": "HoserBelow",
    "rating": 6.8,
    "comment": "BGA",
    "timestamp": 1760479200
  },
  {
    "username": "YoLYcmqZ",
    "rating": 7.0,
    "comment": "Thoughts: Tried playing online; got beat badly.\n\nTag(s): Card Game, Duel, Push-Your-Luck\nBest Player Count: {2}\nRating: 7, +0.0\nOwn: Physical, BGA",
    "timestamp": 1760392800
  },
  {
    "username": "Shinako",
    "rating": 7.0,
    "comment": "sleeves: Mayday Premium\n\nOwned digitally: iOS",
    "timestamp": 1760306400
  },
  {
    "username": "Ateckentrup",
    "rating": 7.0,
    "comment": "Classic 2 player game, simple rules but deep. I prefer Patchwork (more interesting) and Air Land and Sea (quicker).",
    "timestamp": 1760047200
  },
  {
    "username": "Figaro123",
    "rating": 7.0,
    "comment": "The \"theme\" is basically nonexistent but it's a fun fast 2p game",
    "timestamp": 1759874400
  },
  {
    "username": "jackycola",
    "rating": 7.0,
    "comment": "Super für 2 Spieler, die Auslage in der Mitte macht es spannender und taktischer als zb Keltis.",
    "timestamp": 1759874400
  },
  {
    "username": "yxd20250823",
    "rating": 7.0,
    "comment": "益智类游戏，规则很简单，算分游戏",
    "timestamp": 1759701600
  },
  {
    "username": "bambixel",
    "rating": 6.5,
    "comment": "Sleeved\n2 Player",
    "timestamp": 1759615200
  },
  {
    "username": "AnalogSignal",
    "rating": 7.0,
    "comment": "2 players only",
    "timestamp": 1759528800
  },
  {
    "username": "argoforg",
    "rating": 7.0,
    "comment": "We're gonna say this one is a win; we don't have a whole lot of Kinizia games, and this is one I wanted to try out, so when we found it inexpensively it was an easy add to our collection.\n\nThe gameplay is pretty easy to pick up, and I like it well enough that I won't turn down playing it, and it doesn't take long to play, so serious plus there. But I do feel like this is another game that falls into the \"so themeless that it might as well just be called 'Cards'\" category. That drops my rating slightly, but overall, Lost Cities is a fun, short game that I think we'll play every so often.",
    "timestamp": 1759183200
  },
  {
    "username": "dotneko",
    "rating": 7.0,
    "comment": "en Málaga",
    "timestamp": 1759183200
  },
  {
    "username": "peterlevi",
    "rating": 7.0,
    "comment": "(shrink)\n\nSeveral quick plays on BGA. Quick enjoyable filler, plays very smooth. Not sure how deep it will be though. There is definitely some non-trivial luck of the draw element. In some ways reminds me of Mandala, which is of comparable length and complexity.",
    "timestamp": 1759183200
  },
  {
    "username": "felipe1982",
    "rating": 7.0,
    "comment": "I much enjoy 2 player games. The large cards and board of Lost Cities make this a challenging. \"pocket\" or travel game. However the decisions are delicious and the strategies and tactics are deep. There is a level of psychology as you try to outwit your opponent. The game can be taught in 10 minutes, and there are websites or apps which can assist with scoring.",
    "timestamp": 1758837600
  },
  {
    "username": "DiceMind",
    "rating": 6.5,
    "comment": "BGA: 7/10",
    "timestamp": 1757887200
  },
  {
    "username": "Dumkirk",
    "rating": 7.0,
    "comment": "PnP - Redesign",
    "timestamp": 1757800800
  },
  {
    "username": "esayitch",
    "rating": 7.0,
    "comment": "1) Go on lucrative expeditions by melding cards.\n2) Every turn, you play a card (numbered 2-10) to one of your expeditions or to its corresponding color's discard stack, and draw a card either from the draw pile or from one of the 5 discard stacks. You may only play cards to expeditions in ascending order. 3 wager cards for each color can be played before any number card has been played in that expedition. These double, triple, and quadruple your score in that expedition. Starting an expedition costs 20 points, so if you don't think you can overcome this deficit, don't start that expedition!\n3) I loved: How quick it plays, how the simple rules allow for creative moves (throwing a low card into a discard pile from an expedition you intent to double down on in order to entice a player to start it, or throwing a low card in order to entice a player to stop waiting for wagers). This in addition to the player-controlled tempo of the game, and the satisfaction from unloading all of your cards in the last few turns to overturn the score. Great little filler.\n4) Could be improved: Not necessarily a con, but the game does have a considerable luck element (which is much more pronounced than its sibling, Schotten Totten).\n5) A great, super-fast filler. The reviewer who said this is the espresso of games was very accurate in their description. I am late to the party on this, having only recently started playing this on BGA. Suffice to say, I am hooked.",
    "timestamp": 1757800800
  },
  {
    "username": "GypoNolan",
    "rating": 7.0,
    "comment": "This game isn't as light as the bgg rating makes it out to be. There's quite a bit of strategy involved regarding the early game information battle, long-term hand management, the push your luck aspects, and manipulating the pacing and end game timer. For those reasons and the somewhat tedious/anticlimactic end game score counting, I actually consider Battle Line to be the better game for new players/non gamers. Lost Cities is also not great for new players because of how crushing the scores can be. Losing a game 105 to -23 won't feel very good for them. As a game for gamers, I do like this, although I'm not a huge fan of the theming which is not as bad as The Quest for El Dorado but still has some exploitative colonial undertones. The artwork is nice though. Ultimately I really appreciate the hidden depth of this game but it doesn't spark joy as with my other favorite Knizia two player favorites.\n\nEdit: over 1000 BGA plays. Was at one point ranked top 5. It's just got way too much luck of the draw and not enough strategy. Kinda sick of it. Maybe there's some super deep bluffing strategy that I'm not capable of as I'm somewhat risk averse when I don't see the upside.",
    "timestamp": 1757282400
  },
  {
    "username": "les_",
    "rating": 7.0,
    "comment": "Featured on Keep or Cull? (2024).",
    "timestamp": 1757196000
  },
  {
    "username": "Vampes",
    "rating": 7.0,
    "comment": "Not Sleeved",
    "timestamp": 1757023200
  },
  {
    "username": "Gumstep",
    "rating": 7.0,
    "comment": "Battle Line may be better, but this ain't no slouch. The timing management at the end is brilliant.",
    "timestamp": 1756936800
  },
  {
    "username": "Grape_Deuce",
    "rating": 8.0,
    "comment": "Zatu Games\n\nWe have played this way more than tracked on here. Cracking little head-to-head game. Much more competitive than it first seems!",
    "timestamp": 1760911200
  },
  {
    "username": "fazermozg",
    "rating": 7.5,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "Hinmatt",
    "rating": 8.0,
    "comment": "Lost Cities is an easy to understand card game for two players. You want to place cards of the same color in ascending order - you are allowed to leave gaps, which cannot be filled later on - in your half of the playing area. But if you start a color, you'll get negative 20 points which you have to beat with that color to get positive points out of it. You can also play betting cards for the respective colors, which will multiply your points if you succeed in getting positive points. Otherwise, it will multiply your negative points.\nThe game is very much about risk management. You have to think about which cards you can still get and which cards you want to play in the common middle area to buy some time while also giving your opponent the opportunity to take them.\nThe game is easy to understand but has a good strategic element as well. Very nice two-player game.\nThe only thing I dislike is the counting of the points at the end of the game. That requires doing some math.",
    "timestamp": 1760652000
  },
  {
    "username": "Harveymcglenn",
    "rating": 8.0,
    "comment": "Very nice hand management. You will get a dozen plays of finding new little strategic quirks.",
    "timestamp": 1760565600
  },
  {
    "username": "Vazerum",
    "rating": 8.0,
    "comment": "Such a good light 2p game that I can enjoy with casual and more serious gamers alike.\n\n2p\nJess",
    "timestamp": 1760220000
  },
  {
    "username": "aronske417",
    "rating": 7.5,
    "comment": "Despite how luck-based this game is, it continues to hold steady as a solid 2-player game.",
    "timestamp": 1760133600
  },
  {
    "username": "totalhenshin",
    "rating": 8.0,
    "comment": "I think it's \"easier\" to make a good complex game than a good simple one. You can just layer systems in a complex way that can give that Skinner Box-like dopamine fix at fairly frequent intervals in a complex game. In a simple game, the core mechanism has to be compelling and stand up to repeated plays without growing wearisome. Few games exemplify this better than Lost Cities. The game is happening not just by what card your opponent plays (or is conspicuously not playing), but also on their face when they draw cards. You yourself are going to need an Alka-Seltzer after practically every turn as you try to deduce which paths you should keep hoping for and which you should give up on AND which cards you absolutely cannot let your opponent have. It's just so good. There is obviously luck in the card draw, but a better player will consistently win in this game, and that isn't because of luck. It's just a solid design.",
    "timestamp": 1759960800
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "see keltis",
    "timestamp": 1759960800
  },
  {
    "username": "elucidarian",
    "rating": 7.5,
    "comment": "If you like solitaire and wished it were a game for two, then you're probably sharing the designer's thoughts and will enjoy this. Lost Cities may act as a good step in turning a non-gamer into a tabletop enthusiast.",
    "timestamp": 1759442400
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "A fun game, with tactical push-your-luck elements and a pleasant aesthetic. The best part is the tiny Kosmos box.",
    "timestamp": 1759356000
  },
  {
    "username": "GrandPseudonym",
    "rating": 7.5,
    "comment": "1v1\nBest with 2\n~30 Minutes\nLightweight\nCompetitive\nEuro\nGateway\nCardplay",
    "timestamp": 1759356000
  },
  {
    "username": "Ideology",
    "rating": 7.8,
    "comment": "Mostly Online Play",
    "timestamp": 1759269600
  },
  {
    "username": "RavenousCake",
    "rating": 8.0,
    "comment": "Sleeved. Sleeve Kings \"Lost Cities\"",
    "timestamp": 1759096800
  },
  {
    "username": "Pantegana",
    "rating": 8.0,
    "comment": "Very enjoyable 2p game, easy to teach and always with a good dose of tension.\nEasy to jump in and the choice to use the 6th expedition adapts the game length to your preference.\n\nIt could suffer quiet a bit from luck, because even the best strategy can be thwarted if the cards just do not fall your way, and a decision to take or not a card from the deck can influence the rest of the game (as in most card games), but here the time factor is often vital.\n\nWith my wife we enjoy it, but I see how playing always with the same person can become too easy to foretell the strategy. Will update score once played more.\n\nThe game box suffers from the Splendor syndrome. It's literally a deck of (oversized/tarot) cards. It could be sold as a deck of normal-size cards, instead you get a 7 wonders duel/Kingdomino size box.\nBut if you want to travel, you can just get the deck with you…\n\nOn the other hand, kudos for the great artwork of the new edition, it really gives you a feeling you are progressing toward your destination and see how far you make it, that much your expedition was worth. They tried it on the first edition, but this time the result is stunning. This is great attention to detail, in a game that offers little possibility to do it.",
    "timestamp": 1758837600
  },
  {
    "username": "Abraham_tellez",
    "rating": 7.5,
    "comment": "The tension is big in this one!",
    "timestamp": 1758751200
  },
  {
    "username": "kwalzl",
    "rating": 8.0,
    "comment": "6B",
    "timestamp": 1758664800
  },
  {
    "username": "noboardom",
    "rating": 8.0,
    "comment": "2-Player, Hand Management, Set Collection\n\nFavorite Mechanics:\n- Having to always play a card, either on your side or in a shared card pool\n- Tension of holding onto a card your opponent needs but losing a spot in your hand",
    "timestamp": 1758664800
  },
  {
    "username": "stofke",
    "rating": 7.5,
    "comment": "R003",
    "timestamp": 1758492000
  },
  {
    "username": "Table43",
    "rating": 8.0,
    "comment": "It's an excellent game, the luck with drawing the handshake cards early just never totally worked for me. I actually prefer the roll and write version.\n+Sixth Expedition promo pack",
    "timestamp": 1758405600
  },
  {
    "username": "nhmc",
    "rating": 7.5,
    "comment": "Clever games (as usual for Knizia), but the end game scoring is a bit of a drag.",
    "timestamp": 1758405600
  },
  {
    "username": "AdvocatvsDiaboli",
    "rating": 7.5,
    "comment": "(I play this with a tarot deck - you need one with visual differentiation between the suits)",
    "timestamp": 1758405600
  },
  {
    "username": "TowersAlez",
    "rating": 8.0,
    "comment": "Casa",
    "timestamp": 1758060000
  },
  {
    "username": "GMTLover",
    "rating": 9.0,
    "comment": "My wife and I love the long version.",
    "timestamp": 1761083640
  },
  {
    "username": "P3te",
    "rating": 9.0,
    "comment": "14 €",
    "timestamp": 1761058560
  },
  {
    "username": "Jalanaga",
    "rating": 9.0,
    "comment": "(2)",
    "timestamp": 1760652000
  },
  {
    "username": "deadlybrew",
    "rating": 9.0,
    "comment": "I could play this game for hours. Probably.",
    "timestamp": 1760565600
  },
  {
    "username": "salkind",
    "rating": 8.5,
    "comment": "I'm not sure I've seen any other game get so much out of so few rules",
    "timestamp": 1760220000
  },
  {
    "username": "pibastro28",
    "rating": 9.0,
    "comment": "Immortale",
    "timestamp": 1760047200
  },
  {
    "username": "wooloo1",
    "rating": 9.0,
    "comment": "Lost Cities is a staple in our \"tapas gaming nights\", along with Azul, Ganz Schon Clever, and any number of other quick playing, well trodden favorites. We aren't good at it, but we always have blast.",
    "timestamp": 1759874400
  },
  {
    "username": "btasam",
    "rating": 8.5,
    "comment": "There was a moment when I saw through the luck-driven expedition exercise and discovered much to my surprise, a fascinating game of skillfully outplaying your opponent with limited information. Whenever you see this for yourself, you might just smile, too.",
    "timestamp": 1759183200
  },
  {
    "username": "Dice Mage",
    "rating": 9.0,
    "comment": ">50",
    "timestamp": 1758578400
  },
  {
    "username": "woelfman",
    "rating": 8.5,
    "comment": "A great press-your luck/set-collection filler game by Dr. Knizia. Simple rules and easy to learn/teach for new gamers but seems to remain a favorite of experienced gamers as well. A little more math is involved than some other filler games, which is not necessarily a bad thing (and certainly shouldn't scare anyone away).",
    "timestamp": 1758146400
  },
  {
    "username": "Napattack",
    "rating": 8.8,
    "comment": "1.48\n2\n30 (690)\n#71",
    "timestamp": 1758146400
  },
  {
    "username": "kwhite1",
    "rating": 9.0,
    "comment": "P",
    "timestamp": 1758060000
  },
  {
    "username": "ATravelman",
    "rating": 9.0,
    "comment": "Kul spel, lätt att lära sig reglerna fast man inte spelat på länge.",
    "timestamp": 1757109600
  },
  {
    "username": "The_Humungus",
    "rating": 8.5,
    "comment": "After 50 plays AB rating 8.5\nMy Wife and I play this together a lot! Such a fast and simple game with just the right amount of depth. Every game features us both grunting, sighing, and laughing at the ridiculous situations we get ourselves into. Every card draw feels like the shortening of a burning fuse creating a surprising amount of tension. It feels like the perfect 2 player game.",
    "timestamp": 1756764000
  },
  {
    "username": "murzim",
    "rating": 9.4,
    "comment": "Old collection\n\nMy favorite short 2-player game from one of our favorite game designers: Reiner Knizia. Easy rules, short playing time and although it has a big luck factor, as most card games do, it requires a lot of tactical decisions to be made because starting an expedition costs 20 minus points. Are you going to wait one more round or are you going to put your card in the middle, maybe helping your opponent, or are you going to start to explore anyway, knowing that you're next card drawn will be the card you needed but cannot play anymore now... so easy but so frustrating! A cool card game that we always take on holidays with us!\n\nWe also own Keltis, based on the same principle, but that is less forcing you to play your cards as Lost Cities does.\n\nPERSONAL NUMBER 5",
    "timestamp": 1756677600
  },
  {
    "username": "kilianbognar",
    "rating": 9.0,
    "comment": "Counting made fun.",
    "timestamp": 1756332000
  },
  {
    "username": "Bort",
    "rating": 9.0,
    "comment": "A classic. Often referred to as a great casual \"couples game\" and I agree 100%.",
    "timestamp": 1755986400
  },
  {
    "username": "Erundino",
    "rating": 9.0,
    "comment": "A Very much deserved \"classic\" badge: elegant and fun!\nProbably will never stop playing\n\nEdit: 10 --> 9.0\nAt some point, most(not all) of the choices start to get more obvious.\nStill light and engaging , but not a 10 (now this place belongs to Hanamikoji for me)",
    "timestamp": 1755554400
  },
  {
    "username": "IL1584",
    "rating": 9.0,
    "comment": "Solo N/A | Multi 9/10 | 2 players only\n\nFantastic 2 player game for how short the rules are. Takes 3 minutes to learn but still has reasonable depth.\n\nI bumped this from an 8.5 to a 9 because it has the 6 expedition side as well which is of course very similar, but it adds another small layer and variation to keep it fresh a little longer. Also, the more I've played this, the more I've enjoyed the strategy going deeper each time. Length of the game being 30 minutes is perfect for a quick 2 player game.",
    "timestamp": 1754949600
  },
  {
    "username": "dakotamassie",
    "rating": 9.0,
    "comment": "Knizia is so hit or miss\nBut this is by far one of his best games\nVery tactical and fun\nDosen't overstay it's welcome even after 3 rounds",
    "timestamp": 1754949600
  },
  {
    "username": "Pandante",
    "rating": 9.0,
    "comment": "Another Knizian classic, with infinite replayability because it derives so much of it's fun from your opponent's playstyke. It's a really a fast back and forth trying to read your opponent and push your luck to create the best expeditions. The rules don't make some interesting plays immediately apparent, e.g., controlling the speed at which the deck runs out, using the discard as a risky temporary hold and many other subtle tactics. It's super fun!",
    "timestamp": 1754863200
  },
  {
    "username": "Daniel50",
    "rating": 8.5,
    "comment": "Excellent game. We prefer the longer game with six expedition colors. This is quickly becoming one of our most played games.",
    "timestamp": 1754776800
  },
  {
    "username": "jeeves",
    "rating": 10.0,
    "comment": "11",
    "timestamp": 1760565600
  },
  {
    "username": "Olympian78",
    "rating": 10.0,
    "comment": "Schiphol Airport (Amsterdam), late 2025",
    "timestamp": 1760306400
  },
  {
    "username": "AnaMariaAlvarez",
    "rating": 10.0,
    "comment": "Viciante!",
    "timestamp": 1759874400
  },
  {
    "username": "Ddyraw",
    "rating": 10.0,
    "comment": "Just a perfect card game! Great for family and gamers.",
    "timestamp": 1759356000
  },
  {
    "username": "scottdarrington",
    "rating": 9.5,
    "comment": "What else can you ask for from a single deck of cards? Where else can you find such simple, tense, ingenious card play? Absolute, stone-cold, perfection.\n\nUpdate: The Dutch version is fantastic. I used to tepidly defend the tarot-size cards of the English versions, but man, standard-size cards are just so good and make for a box I can literally slip into my pocket, something this game really deserves. I've got a new standard wedding gift.",
    "timestamp": 1757628000
  },
  {
    "username": "NotTasty",
    "rating": 10.0,
    "comment": "\"Psychological warfare\" as one has promptly put it. This game taps the sweet spot in my brain for numbers and strategy, so I typically win",
    "timestamp": 1757628000
  },
  {
    "username": "greggles1983",
    "rating": 10.0,
    "comment": "Could be my favourite game of all time, so easy to play but tough decisions. The meta that develops from the hand management over lots of plays is top tier.\nGood online and in person.\nWould love to see a new edition with a smaller form factor",
    "timestamp": 1757628000
  },
  {
    "username": "nzandrewh",
    "rating": 9.5,
    "comment": "The game I have played most over the years with my wife. She normally wins.",
    "timestamp": 1757282400
  },
  {
    "username": "IntoChaos",
    "rating": 10.0,
    "comment": "Ich liebe es, meine Frau nicht",
    "timestamp": 1754344800
  },
  {
    "username": "Kuri77",
    "rating": 10.0,
    "comment": "Recommended by Actualol as a great couple game",
    "timestamp": 1754172000
  },
  {
    "username": "cannoneer",
    "rating": 10.0,
    "comment": "Brilliant. Great quick-moving card game with lots of angst-filled moments. Wonderful fun.\n\nI have played at least 1000 hands of this on iOS (mainly against the computer) and I still really love it, especially on that platform where the scoring arithmetic is taken care of.\n\nThis and San Juan are the two games I'm actually afraid of wearing out.",
    "timestamp": 1751493600
  },
  {
    "username": "Laingy",
    "rating": 10.0,
    "comment": "Love this Knizia classic!",
    "timestamp": 1751320800
  },
  {
    "username": "ArmanC",
    "rating": 10.0,
    "comment": "By far the most exciting 2 player game I've played with my partner. Very short & quick to setup and play; definitely made it onto our \"board games to trav with\" list! Would recommend for couples!",
    "timestamp": 1751234400
  },
  {
    "username": "bfonvill",
    "rating": 10.0,
    "comment": "2 player",
    "timestamp": 1749160800
  },
  {
    "username": "Mease19",
    "rating": 10.0,
    "comment": "Good time killing game. Also good to gateway game from \"standard\" 52 card games.",
    "timestamp": 1745704800
  },
  {
    "username": "Hardini",
    "rating": 10.0,
    "comment": "PnP",
    "timestamp": 1745532000
  },
  {
    "username": "argaille",
    "rating": 10.0,
    "comment": "Addictive.",
    "timestamp": 1745272800
  },
  {
    "username": "FRANCJR22",
    "rating": 10.0,
    "comment": "Fantastic 2 player game. I love that its so easy to explain, yet has enough depth to keep me engaged and play many times in a row.\nCurrently obsessed with it. Might go down as time passes by.",
    "timestamp": 1745013600
  },
  {
    "username": "dalembertian",
    "rating": 9.5,
    "comment": "Amazing game by Reiner Knizia, and one of my favorites of all time: super simple to teach and play, and yet provide some excrutiating decisions as cards never come as expected. Combines a push-your-luck aspect with a lot of strategy, and I also love how it allows for an implicit \"agreement\" between players at the end, when the cards are running out: it's up to them to accelerate of decelerate the last steps! I now have the new edition, with the 6th expedition/color, but I miss the old artwork...",
    "timestamp": 1744668000
  },
  {
    "username": "sarhanto",
    "rating": 10.0,
    "comment": "For what it is, easily one of the best games around.\n\nOutstanding tension -- push your luck combined with quickfire odds calculations.\n\nRuns quickly.\n\nOnly two criticisms: theme is pointless; and, given the theme is pointless, the card numbers should be mirrored so you don't have to put the cards right-side up.",
    "timestamp": 1743458400
  },
  {
    "username": "mihaha",
    "rating": 10.0,
    "comment": "Darilo za Tika.",
    "timestamp": 1742770800
  },
  {
    "username": "Card",
    "rating": 10.0,
    "comment": "Best with 2 (2) 30 mins, Age:10, 1.48 [$20]",
    "timestamp": 1742425200
  }
]