[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "At the very least, I'm glad it's not a spinoff of Modern Art. The downside is there's no auctions and no speculation.... well, it hardly has anything to do with the art, and it's very slow. It's for people who hate Modern Art and want its opposite. It's more like Equinox, trying to bet on where these categories will land, though less clever and more simple (which I prefer for a betting game). I guess the problem is it's too complex for how simple it really is? Play all except one card, and the order that information comes out helps people place bets, but the most boring bets pay the least. The dramatic bets pay a huge sum of points, but aren't actually exciting to witness. There's a little life to it, but it just didn't add up to anything.\n\nNow that I think about it, it's the mirror image of Royal Turf: slow and convoluted and too hard to use groupthink (or punish it). Everyone instantly understands how to rank racing horses, nobody understood how to rank artwork categories. The original release didn't even have artwork (probably better for the theme) but that doesn't mean it's a good betting game. Of which Knizia has dozens.",
    "timestamp": 1750370400
  },
  {
    "username": "ezrapoundit",
    "rating": 2.0,
    "comment": "This is literally gambling for victory points, and the art is racist. I feel like Reiner Knizia was payed to slap his name on the front of the box. Truly, this game is awful.",
    "timestamp": 1397426400
  },
  {
    "username": "Bankler",
    "rating": 3.0,
    "comment": "Bored after a few games",
    "timestamp": 1216159200
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "More betting than bluffing. I'd rather play Perudo for a similar vibe",
    "timestamp": 1734735600
  },
  {
    "username": "Anyone for cricket",
    "rating": 5.0,
    "comment": "Slightly repetitive game of bluff, chance, manipulation and gut instinct (Members Only).",
    "timestamp": 1679698800
  },
  {
    "username": "icheyne",
    "rating": 5.0,
    "comment": "Forgettable",
    "timestamp": 1679698800
  },
  {
    "username": "Table43",
    "rating": 6.0,
    "comment": "I'm not a fan of Modern Art as I don't prefer evaluation auctions. Here this feels similar yet more geared towards probability with the cards in play, similar to Modern Art the Card Game. The production from insert to art and card quality if fantastic. It plays perhaps one round longer than I'd prefer.",
    "timestamp": 1753480800
  },
  {
    "username": "jens_hoppe",
    "rating": 6.0,
    "comment": "Dry, somewhat repetitive. Hidden depths, perhaps?",
    "timestamp": 1724191200
  },
  {
    "username": "gabdewulf",
    "rating": 6.8,
    "comment": "Quick public night game",
    "timestamp": 1752962400
  },
  {
    "username": "jaceycole",
    "rating": 8.0,
    "comment": "8.5 - 2 plays, 5 and 4 players - This game is a blast! Not the most strategic, but filled with tons of great moments. Pulling off a high scoring bid feels great. There's room to feel clever, manipulating the score track to maximize your points, hedging your bets, solidifying guaranteed scores, locking key positions easy. Just a fun game. Only complaint is that both games played a little long. 5 rounds total. I think in the future I might just play 4 rounds and call it.\n\n8.0 - 3rd play, 4 players - Tried doing a hard cap at 4 rounds, which didn't work as well as I hoped. The incentive structure significantly changes when you know for sure it's the last round. Fun game, but not quite enough thinkiness to elevate it to a top 50 game.",
    "timestamp": 1735858800
  },
  {
    "username": "palkotoxin",
    "rating": 9.0,
    "comment": "Wishlist: 3D insert? sp.",
    "timestamp": 1747087200
  },
  {
    "username": "no_where_dense",
    "rating": 10.0,
    "comment": "This is one of my favorite Knizia games and one of the most frequently played game I have. Mixture of Liar's Dice and Flinke Pinke makes very clever game of disclosing information.",
    "timestamp": 1243548000
  }
]