[
  {
    "username": "merichards",
    "rating": 1.0,
    "comment": "I got this game as free extra through a Kickstarter and it is very disappointing, nothing like as good as Alhambra itself.",
    "timestamp": 1642114800
  },
  {
    "username": "mokujin141",
    "rating": 2.0,
    "comment": "It's Alhambra without the tiles. That should make it better in theory but somehow it makes it worse.",
    "timestamp": 1714687200
  },
  {
    "username": "Solid",
    "rating": 3.0,
    "comment": "Originality (0.5/1.0)\nTheme (0.0/0.5)\nPure Fun (0.0/1.0)\nReplayability (0.0/1.0)\nStrategy/Luck Ratio (0.5/0.5)\nScalability (0.25/0.5)\nParity (0.25/0.5)\n\nOverall 1.5/5.0",
    "timestamp": 1440194400
  },
  {
    "username": "bigfranco",
    "rating": 3.6,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "Lord Oren",
    "rating": 5.0,
    "comment": "Nederland",
    "timestamp": 1716328800
  },
  {
    "username": "trixits",
    "rating": 4.6,
    "comment": "X",
    "timestamp": 1676329200
  },
  {
    "username": "OregSamm",
    "rating": 6.0,
    "comment": "4,5 / 5,0",
    "timestamp": 1738018800
  },
  {
    "username": "ShiannLin",
    "rating": 6.0,
    "comment": "1998 Fairplay À la carte Runner-up",
    "timestamp": 1733785200
  },
  {
    "username": "akapastorguy",
    "rating": 7.0,
    "comment": "The only problem with the original Stimmt So! (which I own) is that the scoring track is on the outside of the board where you draft stocks and money from. Otherwise, it's brilliant.\n\nAnd don't get me started on how the SdJ-winning retool Alhambra messed up a perfectly good game with the wall mechanism.",
    "timestamp": 1760392800
  },
  {
    "username": "RedwoodCroft",
    "rating": 7.5,
    "comment": "A good representation of the original",
    "timestamp": 1755727200
  },
  {
    "username": "Jmarkmoss",
    "rating": 8.5,
    "comment": "Totally surprised when picked this up on a whim. Have never played original game. Wonderful set collection game. SHARPLY!\n\nStill love this one 01/10/23\n\nPlayed once or twice this fall w/ Mom. Remembered she really liked it. This is my kind of set collection. Bumping from 9 to 10 12/18/23",
    "timestamp": 1707087600
  },
  {
    "username": "Kweevnidny",
    "rating": 10.0,
    "comment": "There was once a game called Al Capone which was a card game released by a small self publishing company called db spiele. It was worth every penny I paid for it and was a hit among all game groups that I took it to. Then came Alhambra by Queens which transposed some of the mechanics of Al Capone onto tiles and added the mechanic of tessalating those tiles; to the few of us that played Al Capone Alhambra was not an advancement or even a better game. Now many years down the line after a number of Alhambra expansions (not all were enhancements I can assure you) and the release of the dice game comes yet another variant on a theme, Alhambra the card game. However closer examination reveals it to at long last be a slightly rethemed release of the original game Al Capone. It is an excellent game, and the only (minor) rule changes they have made have been for the better. My advice if you can get only one of the Alhambras get this one, and if you jave more than one verson, make sure this is one of them.",
    "timestamp": 1454367600
  }
]