[
  {
    "username": "arthurcucumber",
    "rating": 1.0,
    "comment": "It falls on the wrong side of luck and frustration and there is also no way to stop someone from running away with the victory. Extremely tedious as it far out stays its welcome.",
    "timestamp": 1730329200
  },
  {
    "username": "Iron_ravenstorm004",
    "rating": 1.0,
    "comment": "I hate this game with a passion. I will go home and skip game night just so I can avoid this game.",
    "timestamp": 1692828000
  },
  {
    "username": "jboy666",
    "rating": 1.0,
    "comment": "pnp",
    "timestamp": 1653429600
  },
  {
    "username": "rabid_schnauzer",
    "rating": 1.0,
    "comment": "A purposeful exercise in futility. This game is comical to watch, but just frustrating to play.",
    "timestamp": 1646694000
  },
  {
    "username": "Robin_Graves",
    "rating": 1.0,
    "comment": "My best turn was when I chose my moves randomly... no game here...",
    "timestamp": 1580943600
  },
  {
    "username": "ljhms",
    "rating": 1.0,
    "comment": "Just kill me.",
    "timestamp": 1577574000
  },
  {
    "username": "Tigerherz",
    "rating": 1.0,
    "comment": "I'm so happy ... finally a game that isn't absolutely not my Cup of tea ... maybe fun as a Party game",
    "timestamp": 1518562800
  },
  {
    "username": "whitearmy",
    "rating": 1.0,
    "comment": "Totally Random,with 6 or more players,Chaos Theory in front of your eyes.",
    "timestamp": 1511046000
  },
  {
    "username": "cookiemonster83",
    "rating": 1.0,
    "comment": "I just can't stand this game. Can take forever to do the same random stuff again and again.",
    "timestamp": 1491429600
  },
  {
    "username": "RoN_Rancor",
    "rating": 1.0,
    "comment": "This is the worst game I have ever played. Loathe doesn’t begin to describe how I feel about this game.Before I continue, note that I am not talking about component quality and all that – that stuff was fine. This is only a review of the game itself.This game is a frustration simulator.So you’re looking at this game and it sounds kinda fun. You play as little robots roaming around doing a relay race, fighting each other and trying to collect flags before everyone else. Sounds fun, if a little boring due to there not being a story or even much of a theme, right?Well, then you start playing it and realize that the main point of the game is frustrating your opponents. Ok, I guess that’s fine – other games have done that and it can be pretty amusing right? At least it will be a fun mindless way to watch components going at it on the board, right? Wrong. The game is in no way mindless. You have to carefully plan out 5 turns in advance on a constantly shifting board full of hazards and other players, where any one mistake can essentially take you out of the race entirely. But you think, ok, well even if it is kinda frustrating and I have to plan out that far in advance, at least I know what I’m going to be able to do – at least we are all capable of the same moves, right? Wrong. You get a random assortment of cards to build your turn out of, and whatever the deck pukes out at you is what you have to deal with to do your carefully planned and maneuvers through a randomly changing landscape where any minor mistake can take you out of the game. Fine, you might think, there are plenty of games where dealing with randomness is part of the fun. At least in those games, everyone is equal under the eyes of the randomness gods, right? Wrong again! Depending on the setup, you might start out something like 20 spaces further away from the first flag than other players. In a game where you move -1 to 3 spaces at once, and is a race, and has random card draw, and heavy planning, and take that.Ok, you think, but at least the other players are all in the same boat – it’s not like there’s yet another layer of the rich get richer going on, right? Wrong again. There are cards, which while difficult to acquire, give player powers so ridiculously powerful that they can just completely change the whole game, and make it nearly impossible to beat them.Ok, but there can’t be anything else wrong with it right? Right? Wrong, unless you like losing your turn and watching everyone else play. A lot. Fall off the edge of the map? Lose the rest of your turns for the round. Somebody kills you? Lose the rest of the turns for the round. Someone has a special remote control power card that takes over your vehicle? Lose your turn for the rest of the round AND watch as someone else pilots your robot for you. Make one tiny mistake? Get stuck on a conveyor belt that takes you so far away from where you are going that you might as well not play anymore.Let’s say things aren’t going great for you – you made a mistake and went off course, and while everyone else is working on flag 2, you still need to get to flag one. So you almost make it back when… someone kills you. Now, if you’d ever actually gotten to flag 1 your could respawn there – a little behind but not out of the pack. But you never got to flag 1. So you have to go back to where you started. You know, that spot 20 spaces further away from flag 1 than some of the other players. Oh and that’s after losing all your actions for the rest of the round.You think, fine, well, whatever, at least it’ll be over and you can do something else after. Depending on how much time you have, wrong again. This thing is going to take 2 hours. 2 hours of random upon random upon hateful take-that upon uneven starting positions upon random and you are going to lose turns all the time.Oh, and lest we forget, on top of all that, you can get cards “locked” so that you never get to choose which command to enter for certain points along your program until you either die or skip your entire turn again.Maybe it’s just me though – the other players in the group seemed to like it a lot. Maybe I’m just a sore loser who just doesn’t “get” it. Honestly though, I never blamed the actions of the other players. The game itself is a frustration simulator, so when someone kicks you in the balls when you are down, that’s really how the game is supposed to work. They might even be doing it by accident.One of the players in the game said that it was a great simulation of programming. He and I are both programmers, and I would have to strongly disagree, unless when he programs the following conditions are true: 1. You only ever have access to 5 - 9 keys on the keyboard at any one time. Many times this includes the arrow keys. No mouse.2. Those keys change every 5 minutes. You always know what the keys are, but you have to deal with what you have.3. The cursor moves randomly across the page due to powers you have no control over but if you are very careful and thoughtful you can predict.4. You are competing with other people that have various parts of the program already done before you start. 5. If you mess up, the program you are working on shuts down and it only autosaves every 20 minutes, and only then if you’ve reached some kind of minimum checkpoint.6. At random you have to sit there and do nothing for 5 minutes.7. Sometimes the keys get stuck and they will keep pressing on their own no matter what you do.8. The keyboard spins around in circles.9. You can’t get up for 2 hour stretches. Ok so maybe that is better than actual programming 10. And finally, someone keeps coming up behind you and slapping you upside the head.",
    "timestamp": 1491343200
  },
  {
    "username": "pad9",
    "rating": 1.0,
    "comment": "I hate this game with a passion.",
    "timestamp": 1462053600
  },
  {
    "username": "SamuraiBudgie",
    "rating": 1.0,
    "comment": "An 'acquaintance' insisted this was one of the best board games ever made.\n\nIn his defence most of Germany once believed electing Hitler wasn't the worst idea.\n\nI kept reminding myself of that fact to keep my sanity relatively intact as I felt my entire world crumble around me during an extended session of what I feel is a torturous example of what the blackest minds of human society can construct.",
    "timestamp": 1446246000
  },
  {
    "username": "smorange",
    "rating": 1.0,
    "comment": "I hate this game. To begin, simultaneous programming isn't my favourite genre. I find it tedious. It fits the theme, except I don't care about the theme if the game isn't much fun, and RoboRally isn't. There's way too much downtime which is only exacerbated by the need to miss a turn every so often, sometimes twice in a row, and there may be nothing you can do about it. That's a lot of sitting and watching other people play. It's too chaotic to hold my interest and too long for me to enjoy the ride. And it's awfully boring once you know who's (not) going to win. As with demolition derbies themselves, I'm bewildered by RoboRally's following.",
    "timestamp": 1443736800
  },
  {
    "username": "tod_13",
    "rating": 1.0,
    "comment": "Chaotic and pointless boredom.",
    "timestamp": 1442786400
  },
  {
    "username": "Svengaard",
    "rating": 1.0,
    "comment": "The game is very unforgiving if you make any mistakes. Way too dependent on luck as a bad draw or another player can screw you over for many turns. Weapon upgrades are random and totally unbalanced.\nBest part of the game is if you get fed up you can just kill yourself.",
    "timestamp": 1427925600
  },
  {
    "username": "dozy",
    "rating": 1.0,
    "comment": "I must have played this game wrong. Bought this game based on ratings/reviews, played it once, immediate regret. Must play with someone who's confident in the rules (though they seemed pretty straightforward).",
    "timestamp": 1407967200
  },
  {
    "username": "muzfish4",
    "rating": 1.0,
    "comment": "Possibly the worst game I have played in the last 5 years.\n\nIt should be fun but the mechanics, theme and actual gameplay combine to a ticket to Dullsville.\n\nNot so much a game as an exercise in tedium.",
    "timestamp": 1392850800
  },
  {
    "username": "bodybuilder",
    "rating": 1.0,
    "comment": "very special theme that drew me to buy it, but playing it is so boring! slow, monotonous, and the components are not good, especially the board which tends to curl",
    "timestamp": 1377295200
  },
  {
    "username": "gobruno",
    "rating": 1.0,
    "comment": "Just suffered through 90 minutes of complete boredom. Too much luck, no real skill needed. I'll play anything, but this was the first game where I almost walked out in the middle.",
    "timestamp": 1340402400
  },
  {
    "username": "RodZ",
    "rating": 1.0,
    "comment": "I have played this game only once and that is enough for me. I really dont like this game and cant rate it lower than 1.\n\nI would prefer to be repeatedily kicked in the balls whilst having all my teeth pulled out with rusty pliers than play this game again.",
    "timestamp": 1336514400
  },
  {
    "username": "sixthecat",
    "rating": 1.0,
    "comment": "Some people get a kick out of oh your robot went way off course....ahh ha ha ha, and now you can't do anything useful for 30 minutes ah ha h...vomit.",
    "timestamp": 1331766000
  },
  {
    "username": "SCOBYBryant",
    "rating": 1.0,
    "comment": "A clunky game about getting randomly and repeatedly shafted that also takes an hour and a half. Though I will admit performing a series of turns while getting zapped by a laser beam because somebody rammed you is pretty hilarious, it's not reason enough to brave the chaos.",
    "timestamp": 1324594800
  },
  {
    "username": "cymric",
    "rating": 1.0,
    "comment": "What a depressing pile of crap. Clearly intended for the same people who manage to derive enjoyment from playing the same boring and mindless game for hours and hours and hours and then some more. (Think Risk or The Great Dalmuti with house victory rules.) Chaotic, random, annoying. If you're ever forced to play this title, make sure to commit suicide ASAP to get the point across to the others.\n\nWhy a 1? Because there truly is no point to this game. There is no way you can think of clever tactics or strategies, this is just meaningless card drafting, organising them, and then watching your robot crash and burn thanks to the actions of other players.",
    "timestamp": 1272924000
  },
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "Blecch!",
    "timestamp": 1242338400
  },
  {
    "username": "Toynan",
    "rating": 1.0,
    "comment": "I don't like ! That's it !",
    "timestamp": 1237071600
  },
  {
    "username": "Jdurand",
    "rating": 1.0,
    "comment": "I don't overly mind bad or mindless games; though I feel this is one of the worst games I've ever played. I suppose children would love this game due to the silliness factor. However the game mechanics are so random that I feel you may as well just submit your moves at random and see what happens. Game play takes forever and all you do is move around in a semi random direction (cards direct movement, there's alot of turn cards) hoping that you get to the flags and not in the pits. I will never suggest this game to anyone (child or adult) and will walk out of a games day if the game is brought out.",
    "timestamp": 1230850800
  },
  {
    "username": "bballgod34",
    "rating": 1.0,
    "comment": "I can't understand why people enjoy going in circles and not getting anywhere for an hour fun.",
    "timestamp": 1215295200
  },
  {
    "username": "grid",
    "rating": 1.0,
    "comment": "Absolutely HATE this game. I cannot stand it. The theme would get a 10, but the game mechanics make it unplayable.",
    "timestamp": 1210456800
  },
  {
    "username": "candoo",
    "rating": 1.0,
    "comment": "Three hours of my life wasted that I'll never get back. Sitting on a dentist's chair rotating left and right would be less painful. This really rates a zero on this scale.The very worst \"game\" I have ever tried.\n\nThe RoboRally experience resonated a certain visceral reaction, mainly one of vomitting.\n\nPure dreck.",
    "timestamp": 1210284000
  },
  {
    "username": "realitytrip",
    "rating": 1.0,
    "comment": "There are no words to describe how much I hate this \"game\".....",
    "timestamp": 1203462000
  },
  {
    "username": "red_gamster",
    "rating": 1.0,
    "comment": "I wish I'd fallen into the chasm rather than my robot. The selection of movement cards is repetative and playing them out tedious in the absolute extreme. Never again. Played it twice: one board and giant six board game. Both reduced me to committing robot-suicide just to get out of the game. My wife was the same. It is just so tedious.\n\nOthers seemed to enjoy it though - in fact, they were enthralled. If they gave it a 10, I wouldn't argue the point, as I can see why it has its fans.\n\nUltimately, however, this is the first game I've played in which I would threaten murder with a lead robot and a slingshot if subjected to it again.",
    "timestamp": 1175551200
  },
  {
    "username": "Nekrataal",
    "rating": 1.0,
    "comment": "horrible game, probably the game that we like less !",
    "timestamp": 1168642800
  },
  {
    "username": "resisobilus",
    "rating": 1.0,
    "comment": "Has plenty of opportunity to go nowhere - absolutely nowhere",
    "timestamp": 1141945200
  },
  {
    "username": "Numskull",
    "rating": 1.0,
    "comment": "I've played games that were worse from a purely technical standpoint, but on a gut level, no game has aroused as much loathing and revulsion in me as this ultra-chaotic, headache-inducing nightmare. The special weapons are unbalanced, there's a colossal runaway loser problem, you can sit and rotate all day long because you never get dealt any move cards, and it's well within the realm of possibility for a player to get eliminated 20 or 30 minutes into a game that goes on for another hour, or more. The only blessing is that you can legally commit suicide and remove yourself from the agony. There is absolutely no way I will ever play this again.",
    "timestamp": 1122156000
  },
  {
    "username": "sumo",
    "rating": 1.0,
    "comment": "If I could go lower than 1, I would. A truly awful game.",
    "timestamp": 1104620400
  },
  {
    "username": "landrobot",
    "rating": 1.0,
    "comment": "I'd rather never play ANY games again, than be forced to experience this nightmare fueled game.",
    "timestamp": 1094421600
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\nOE 1994. outdated version. there have been many rules improvements since this came out.\n\n3/5\n4E 2016. this is the second newest version. do not buy this version. it is good fun and works well but the components are poor and the newer version is so much better with better support.\n\n4/5\n5E 2023. This is the best version of the game. Plays 3-8P. Has the new updated and streamlined rules which work the best for the game. The new artwork and components are great. This version has a ton of expansion support. Great wacky family fun, that is quite random and frustrating. The expansions aren't needed, but do add several new board mechanisms (easy on the rules) and a few new cards. All in all, still a solid modern classic wacky racing game. This game is best with a small board & fewer checkpoints.",
    "timestamp": 1735254000
  },
  {
    "username": "UncleFester",
    "rating": 2.0,
    "comment": "Very Frustrating",
    "timestamp": 1718488800
  },
  {
    "username": "Garnett11",
    "rating": 2.0,
    "comment": "Pointless",
    "timestamp": 1705532400
  },
  {
    "username": "Entropology",
    "rating": 2.0,
    "comment": "Along with Catan, one of my original adult games. Fond memories. Also like Catan, I'll be shocked if I ever touch it again.",
    "timestamp": 1700434800
  },
  {
    "username": "Tygrone",
    "rating": 2.0,
    "comment": "Played once. Probably our group was too drunk but i think nobody understood any more what was going on after 1h of play.\n\nDon't think programming games are for me",
    "timestamp": 1695247200
  },
  {
    "username": "mcdeans",
    "rating": 2.0,
    "comment": "Very chaotic. If it was a short game it might be acceptable, but overstays its welcome.",
    "timestamp": 1680818400
  },
  {
    "username": "bainewedlock",
    "rating": 2.0,
    "comment": "Rating 2 = To someone with a simliar taste like me: Don't waste your time with this.",
    "timestamp": 1679180400
  },
  {
    "username": "JustinRRizzo",
    "rating": 2.0,
    "comment": "Completely random, and not in a pleasant way. You can get hands that you cannot do anything with. Would rather play Mechs vs Minions.",
    "timestamp": 1675378800
  },
  {
    "username": "jdmofo",
    "rating": 2.0,
    "comment": "I hate this game. After an hour you can be back to square one through no fault of your own. Literally.",
    "timestamp": 1673046000
  },
  {
    "username": "kyleglyn",
    "rating": 2.0,
    "comment": "2  Jan 2020 - 3 plays\nA slow and frustrating race where often the best thing to do is to play as boring as possible.",
    "timestamp": 1667343600
  },
  {
    "username": "Board_All_The_Time",
    "rating": 2.0,
    "comment": "The game that taught me to utterly hate programmable movement. Random chaos can be fun in a short game. This is not that game.",
    "timestamp": 1661292000
  },
  {
    "username": "deductionfun",
    "rating": 2.0,
    "comment": "Way too chaotic and more frustrating than fun.",
    "timestamp": 1658354400
  },
  {
    "username": "Board Game Greek",
    "rating": 2.0,
    "comment": "The most frustrating programming game I have ever played. Do not play this if you have hypertension. I absolutely hate the way you are basically triple punished when plans go awry. If you enjoy the chaos of watching all your plans go wrong, well, this is your game. Not for me.",
    "timestamp": 1656280800
  },
  {
    "username": "Ideology",
    "rating": 2.0,
    "comment": "Avalon Hill Version 2005",
    "timestamp": 1642546800
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "45–120 Min 2–8 Players p2 p3 p4 p5 p6 p7 p8 Weight: 2.43 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "garrettt331",
    "rating": 2.0,
    "comment": "So frustrating.",
    "timestamp": 1612134000
  },
  {
    "username": "Hummel150",
    "rating": 2.0,
    "comment": "The chaos of unintended programming wears thin quickly because early turns are same as later turns. The game can drag forever if players keep screwing (accidentally or intentionally) because nobody is any closer to the end-game trigger. Funny becomes frustrating rapidly which is a massive problem to a possibly long game.",
    "timestamp": 1601589600
  },
  {
    "username": "Davidalurie",
    "rating": 2.0,
    "comment": "Played once (or a third of once) at Golden Axe. OK, but bland",
    "timestamp": 1577919600
  },
  {
    "username": "kevan",
    "rating": 2.0,
    "comment": "Far too much chaos getting in the way of the programming and bluffing, here - a random hand of cards each round, and interaction with other robots is always more accidental than strategic. Twin Tin Bots is a much better take on the genre.",
    "timestamp": 1560204000
  },
  {
    "username": "DelialFallen",
    "rating": 2.0,
    "comment": "I never enjoyed myself playing RoboRally. I just don't get the appeal.",
    "timestamp": 1548716400
  },
  {
    "username": "GoldenRule",
    "rating": 2.0,
    "comment": "Although I like programming games, this is not a game for me",
    "timestamp": 1548370800
  },
  {
    "username": "Kyur",
    "rating": 2.0,
    "comment": "Literally an exercise in frustration.",
    "timestamp": 1537740000
  },
  {
    "username": "Dynastico",
    "rating": 2.0,
    "comment": "A game where the new player asks \"Why aren't you guys trying to get the flags?\" when everyone else is spinning in circles because all they have been drawing is turn cards.",
    "timestamp": 1527631200
  },
  {
    "username": "Odysseus77",
    "rating": 2.0,
    "comment": "If Pacific Rim was a boardgame, this would be it. Just terrible.",
    "timestamp": 1508623200
  },
  {
    "username": "hxbx",
    "rating": 2.0,
    "comment": "2-8 players, better with more. I really liked this game at first, now I don't. I just don't think there's enough strategy to keep me interested & I find the effort required to play with lots of players not worth the amount of enjoyment. There are better games to play. Traded.",
    "timestamp": 1504562400
  },
  {
    "username": "Bastwood",
    "rating": 2.0,
    "comment": "It's a programming game, they said. And since I am a programmer by vocation, I'm destined to like it, right? Wrong. Robo Rally is among the most annoying board games I've played. This is not programming; This is the equivalent of debugging with the slowest and ugliest tool possible while someone keeps punching you in the face. Shift+F11.",
    "timestamp": 1503871200
  },
  {
    "username": "CowStriker",
    "rating": 2.0,
    "comment": "Hated it, will not play again.\nMechanics and components are not good enough to keep me coming back for repeated plays. It's hard enough to program actions without everything getting stuffed up on me from someone else's actions.\n\nReminds me too much of Space Alert and I didn't enjoy that one either.\n\nI would much rather play Mechs Vs Minions over this for sure.",
    "timestamp": 1489359600
  },
  {
    "username": "Byrdie",
    "rating": 2.0,
    "comment": "Hmm. I don't like the idea of rating the game itself as bad, but aye experience of it was. As someone with a non-verbal learning disorder, I am not the sort of person to be playing that game. yikes.",
    "timestamp": 1488582000
  },
  {
    "username": "csibu",
    "rating": 2.0,
    "comment": "3 órás, 8 fős játék után azt mondom: nagyon jól indult, nagyon nagy reményekkel vágtam neki és hatalmas csalódás lett belőle. Az első 30-40 perc izgalmas, vicces. Még mindenkinek van 7-9 kártyája, még mindenki nagyjából egy helyen van, ha valaki \"meghal\", visszatérve nem érzi azt, hogy annyira le lenne maradva. Ha még ugyanennyit játszva véget ért volna (bár így is nagyon rosszul álltam), akár 2-3 ponttal is többet kapott volna. Ehelyett a következő 2 óra azzal telt, hogy egymásra vártunk, nehézkes volt a játék, aki meghalt nagyon messze a többiektől éledt újra. Óriásian befolyásolta a játék kimenetelét a kézben lévő lapok...\n\nAmi a legnagyobb hibája a játéknak: nincs eldöntve, hogy partijáték, aminek izgalmasnak, szórakoztatónak és gyorsnak kellene lenni, vagy inkább stratégia játék, aminél fontos szerepet játszik, hogy mit lépnek a többiek, de ha jó játékos vagy, meg tudod nyerni. Nos ezek semelyike nem illik a RoboRallyra. A kártyák szerencsefaktora hatalmas, akár köröket kihagysz rossz kártyákkal, sőt sok esetben \"öngyilkosságot\" követsz el velük... Ha ki akarsz kerülni a rossz helyzetből sokat kell agyalnod rajta, hogy milyen sorrendben játszd ki a kártyákat, ami alatt a többiek csak várakoznak, és zavaró, hogy mindenki rám vár, dehát mit tudok tenni, ha nem jó sorrendet állítok fel, kiesek, meghalok...Amennyiben 1 órás lenne, ezeket a hátrányokat elnézném neki, sőt élvezném is, de 3-4 órát (3 óra volt az elsőből a 2. pontba eljutnia az első játékosnak!!!!) rászánni egy ilyen szerencsefüggő játékra, nagyon sajnálok...\n\nA hangulat, a robotfigurák, a viszonylag hamar elsajátítható szabályok előnyére válnak a játéknak, de ennyi.",
    "timestamp": 1478905200
  },
  {
    "username": "ricope",
    "rating": 2.0,
    "comment": "(almost) no control over your action",
    "timestamp": 1471816800
  },
  {
    "username": "YamiLyon",
    "rating": 2.0,
    "comment": "I've played it once and I'll never play it again. You're manoeuvring your robots on auto-pilot 'till Lady Unfortunately decided that another played had to bump you in a hole or a laser beam so you would have to start all over again. Bad, bad, bad and frustrating.\n\nUPDATE: Changed my rating from a 3.5 to a 2. Played it once more after all because there was no other game going on. Sigh... Less than 30 minutes in I regretted it... You're simply way too dependent on the cards you get dealt. And you get fewer cards as your wounds stack up, making it only worse. Some people may find that amusing, I found it extremely frustrating. I'm not a control freak by any means, but come on... Not being able to cross conveyor belts because you only get cards that let you turn or take 1 step? Wasted turn, huzzah! And you can't do anything about it. Not good in a racing game. Will absolutely never play this again.",
    "timestamp": 1457218800
  },
  {
    "username": "bgplay01",
    "rating": 2.0,
    "comment": "I don't like games that you have (relatively) absolutely no controls over your character",
    "timestamp": 1450998000
  },
  {
    "username": "falconoidner",
    "rating": 2.0,
    "comment": "Bad game",
    "timestamp": 1447455600
  },
  {
    "username": "tjshields",
    "rating": 2.0,
    "comment": "Bad programming in parallel to create pratfalls.",
    "timestamp": 1444946400
  },
  {
    "username": "LyrixDanica",
    "rating": 2.0,
    "comment": "I hate this game. It's frustrating to the brink of ragequitting for me.\nThe blind movement. The miscalculations. A simple mistake can delay your entire game plan with several turns. Just not my cup of tea.",
    "timestamp": 1421190000
  },
  {
    "username": "Domin",
    "rating": 2.0,
    "comment": "Hourglass is a no-no. If not using it, its a 4. Still it's too much of a brainburner for such chaotic game.",
    "timestamp": 1420326000
  },
  {
    "username": "Dday27",
    "rating": 3.0,
    "comment": "Over stays its welcome. Was fun in the beginning but was begging for someone to end the game by the end",
    "timestamp": 1753740000
  },
  {
    "username": "Desiderata",
    "rating": 3.0,
    "comment": "I really struggle with games of this type. And it's not just that I'm not good at them--after all, it could be a lot of fun to just watching your robot fail miserably. I enjoy Tales of the Arabian Nights and Galaxy Trucker, both of which can be painfully punishing and both lack any sort of agency. But with Robo Rally, you have to do the brain-burning part which is required to program your cards. Then you have certain terrain features that throw a huge wrench into not just your plans, but also your ability to even comprehend what will happen even if no other robots' actions inerfere. It took me almost the entire game to finally understand how the conveyor belts affect your movement and facing--the rules are needlessly complicated. And while there is no player elimination (at least in this version), you will have turns that are completely wasted where you did abosultely nothing.\nPerhaps it would be a little bit better if players had different objectives to pursue. As it is, with every player chasing the same objective, whoever manages to get there first and get out ahead will likely leave the remaining players in the dust to fight amongst themselves--which is what happened in our game. There is no catch-up mechanism. In fact, there is a strong positive loop bc the player in the lead who hasn't been damaged still draws all their cards and keeps their special ability. The other players have fewer cards to work with and possibly have lost their unique ability.\nOverall, I just struggle to find anything fun with games that require this much spatial reasoning.",
    "timestamp": 1745186400
  },
  {
    "username": "floppyzedolfin",
    "rating": 3.0,
    "comment": "too long.",
    "timestamp": 1739401200
  },
  {
    "username": "mqstout",
    "rating": 3.0,
    "comment": "Not good. Filled with feels bad. A game never ends.",
    "timestamp": 1713045600
  },
  {
    "username": "Sethenstien",
    "rating": 3.0,
    "comment": "A fun idea for a game that is just awful to actually play. Takes forever to play even the simplest map and it's so easy to just have your progress destroyed or waste a round.",
    "timestamp": 1708470000
  },
  {
    "username": "Trebor1415",
    "rating": 3.0,
    "comment": "I thought I'd love this game until I played it at a con and lost all three robots in four turns. I was the only player to go out.\n\nImmediately after I said, \"I will never play Robo Ralley again.\"",
    "timestamp": 1691964000
  },
  {
    "username": "John Rogers",
    "rating": 3.0,
    "comment": "Far too chaotic for my taste. It would be better if it was shorter; however, the chaos makes the game longer.",
    "timestamp": 1680386400
  },
  {
    "username": "Gola",
    "rating": 3.0,
    "comment": "Seven plays. Just not my type type of thing. I don't get caught up in thematic stuff the way some do, and when you boil it down it's a long light game. I could see myself enjoying it if it were thirty minutes, but after two hours it just gets...well...boring. I've played with just one board, though, and that wasn't too bad. Probably want to keep the player count down too, as things can get too clogged up.",
    "timestamp": 1672441200
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "So, er, *this* is the pet project that Richard Garfield was so adamant to see published that he created Magic: The Gathering just to get in the good graces of a publisher, huh. My inner Garfield fanboy kept me interested in RoboRally longer than I should have been, but it's hard to turn a blind eye on a bunch of issues that simply don't meet my modern standards:\n\n• RoboRally is unpredictably chaotic. Like, \"you're trying to (re)program a command line with your random hand of cards against other players' random hidden-until-the-last-second plays\" level of chaotic.\n• Now as a counterpoint, that players play cards simultaneously and face down is probably a boon when it comes to fluidifying the game. But that's because oh boy does the whole thing suffer from a sluggish pace. Between the constant brain burn of the planning phase and the fine print of the priorities when it comes to the execution of command lines, what we're essentially having here is a video game (which would no doubt feature some helpful \"show me the current prospect consequences\" UI) that got slowed down to an analog use-your-brain-to-parse-everything slog for no good reason.\n• The game tends to develop an early runaway leader (or loser). This gets even worse if the race track is not meticulously crafted to have competitors cross paths as often as possible.\n• The entire fun of the game occurs when problems happen to you. In other words, the more you're winning, the more it's a result of boring decisions with no interference.",
    "timestamp": 1672095600
  },
  {
    "username": "schrifterz",
    "rating": 3.0,
    "comment": "I heard there is a limit to the number of \"lifes\" each playe has. Have played without it and the game didn't end. The problem is that you can play this game for hours without making any progress.",
    "timestamp": 1654293600
  },
  {
    "username": "Turtlewhisperer",
    "rating": 3.2,
    "comment": "Not a bad game, but all too much like my work.",
    "timestamp": 1616454000
  },
  {
    "username": "mazzyfred",
    "rating": 3.0,
    "comment": "No, just no.",
    "timestamp": 1607468400
  },
  {
    "username": "afafard",
    "rating": 3.0,
    "comment": "Please no!",
    "timestamp": 1589839200
  },
  {
    "username": "THE SANDWICH",
    "rating": 3.0,
    "comment": "Just not a big fan of programming games.",
    "timestamp": 1586296800
  },
  {
    "username": "SethMakesGames",
    "rating": 3.0,
    "comment": "Very boring movement game, felt heavily random but not a great gateway game either",
    "timestamp": 1571522400
  },
  {
    "username": "blewballoon",
    "rating": 3.0,
    "comment": "I played this in a large group and it was chaotic and difficult to tell what was going on. It can feel frustrating to plan your moves out incorrectly and just have to wait and watch yourself fail.",
    "timestamp": 1565301600
  },
  {
    "username": "mgreen02",
    "rating": 3.0,
    "comment": "A rating given on it's accessability to anyone. The concept is easily grasped yet difficult to execute. Clever, if a little random maybe.",
    "timestamp": 1552345200
  },
  {
    "username": "bearhugsde",
    "rating": 2.5,
    "comment": "It's a nice game, but I hate it. Have played it many many times in the 90ies and never won it. I hate you, RoboRally!",
    "timestamp": 1547679600
  },
  {
    "username": "Lagomorph",
    "rating": 3.0,
    "comment": "Too much luck and randomness for my taste. The board was also kind of ugly.",
    "timestamp": 1546383600
  },
  {
    "username": "Simon J",
    "rating": 3.0,
    "comment": "Was not impressed by my first play. The rulebook quality was not good, and I kept drawing hands that let me achieve nothing.",
    "timestamp": 1541458800
  },
  {
    "username": "CurryBento",
    "rating": 3.0,
    "comment": "Too random for its own good.",
    "timestamp": 1540767600
  },
  {
    "username": "ConAir",
    "rating": 3.0,
    "comment": "Hate games where memory is a key factor or can heavily affect your game.",
    "timestamp": 1540767600
  },
  {
    "username": "RobGuilliman",
    "rating": 3.0,
    "comment": "Ok, the chaos in kind of part of the game, but not for me.",
    "timestamp": 1539727200
  },
  {
    "username": "Magritte",
    "rating": 3.0,
    "comment": "Minus: 3 - 4 - 5 - 8 - 10 - [-2]",
    "timestamp": 1534975200
  },
  {
    "username": "Dennis Murray",
    "rating": 3.0,
    "comment": "I really dislike both programming games and any game where you plan something and then sit for a while to see how your plan goes. I find the whole thing boring more than anything.",
    "timestamp": 1531951200
  },
  {
    "username": "slicke",
    "rating": 3.0,
    "comment": "¤ Sälj\n¤ 2-8 spelare\n¤ Inte sleevat",
    "timestamp": 1511132400
  },
  {
    "username": "Sprawl",
    "rating": 3.0,
    "comment": "I played this with 8 people and it took almost 7 hours. While there were things I liked about it - mostly the planning and visualization of my long term route and my individual turn), this game is un-playable unless you put some sort of time restriction on the participants.\n\nThe boards also have graphics which show when certain hazards are active, and these graphics are difficult to see. Additionally, with so many option cards and such a variety of obstacles there are way too many excursions rules (and then to the internet) to figure out what happens when Option Card Z meets up with Obstacle Q.\n\nThere aren't many games that I wouldn't play again, but I can't see another session of this in my future (certainly not without time restricting the moves). The ideal time restriction for this game would involve something like a chess clock that would give everyone, say, 20 minutes total for all their turns. That way, if you were in a complicated situation you could take a little longer to plan the possibilities, but you'd have to make it up later.",
    "timestamp": 1510527600
  },
  {
    "username": "Urtho",
    "rating": 3.0,
    "comment": "Induces analysis paralysis too easily. Hard to always see that the cards you play go the way you wanted them to go.",
    "timestamp": 1510527600
  },
  {
    "username": "musicalanarchy",
    "rating": 3.0,
    "comment": "Really not into programming games, personally.",
    "timestamp": 1503525600
  },
  {
    "username": "sneakingfart",
    "rating": 3.0,
    "comment": "A random mess, which can be fun at times. The randomness from beeing pushed and hit is ok, but once that combines with random cards resulting in lots of turns where doing absolutely nothing usefull ends up beeing purely frustrating.",
    "timestamp": 1498428000
  },
  {
    "username": "guardianz",
    "rating": 3.0,
    "comment": "ick.",
    "timestamp": 1482966000
  },
  {
    "username": "jmconyer",
    "rating": 3.0,
    "comment": "I've played this once with members of our gaming group, will do all I can to avoid in the future...",
    "timestamp": 1481151600
  },
  {
    "username": "back2b",
    "rating": 3.0,
    "comment": "Negative points:\n- Overstays it's welcome even on a small map.\n- Runaway leader problem",
    "timestamp": 1480719600
  },
  {
    "username": "jackbarnard",
    "rating": 3.0,
    "comment": "I know I'm missing the point here, but this game is just too chaotic - I always end up praying someone will manage to perform their actions without molestation just so we can play something else.",
    "timestamp": 1479769200
  },
  {
    "username": "Sassycat",
    "rating": 3.0,
    "comment": "A game this long should NOT be this random. I love the ideas in theory, it's just there's SO much downtime, you can easily get screwed by randomly drawing the wrong cards, and as an added cherry there's player elimination, so you might end up sitting out the rest of a 2 hour game.",
    "timestamp": 1474495200
  },
  {
    "username": "BrunoDeVries",
    "rating": 3.0,
    "comment": "This is one of those games that manage to get non-gamers invested in plotting their moves. A great feat.\n\nA pity though that it's a game I wouldn't mind not ever playing again.",
    "timestamp": 1474408800
  },
  {
    "username": "Dana_MathEd",
    "rating": 4.0,
    "comment": "My husband loves this game but I do not. I dislike how much other players impact your routes. One of my least favorite games.",
    "timestamp": 1753308000
  },
  {
    "username": "fabericus",
    "rating": 4.0,
    "comment": "5 plays",
    "timestamp": 1752012000
  },
  {
    "username": "DetroitJohnny",
    "rating": 4.0,
    "comment": "Didn't enjoy this game as much as other friends did.",
    "timestamp": 1738710000
  },
  {
    "username": "OthelloKeys",
    "rating": 4.0,
    "comment": "Good programming game, but can get bogged down.",
    "timestamp": 1728424800
  },
  {
    "username": "zaxxon555",
    "rating": 4.0,
    "comment": "Rather forseeable, no fun back then.",
    "timestamp": 1728079200
  },
  {
    "username": "Zafin",
    "rating": 4.0,
    "comment": "Don't buy this game. It wasn't fun.",
    "timestamp": 1721599200
  },
  {
    "username": "Tbirdmg",
    "rating": 4.0,
    "comment": "Maybe a great family/kids game, but the play is entirely too slow, too redundant, and takes FOREVER. If there were a design that catalyzed the process and limited games to under an hour, I'd give it another try. As it stands, RoboRally is just multiple rounds of chaotic bump 'n play with everyone haphazardly celebrating when someone's robot falls into the pit.\nAgain, RoboRally is good clean fun, but both the tactical and strategic play are very limited. You're just moving around for the fun of it, and that may result in actually winning....\nCurrently: big pass.",
    "timestamp": 1705705200
  },
  {
    "username": "n3rdx1000",
    "rating": 4.0,
    "comment": "I really want to like RoboRally but it's too hard for me. I'm constantly zigging when I meant to zag and end up sitting in lasers.",
    "timestamp": 1702940400
  },
  {
    "username": "poisonivy",
    "rating": 4.0,
    "comment": "Interesting game that's sort of a logic puzzle -- you are racing your robots to flags while trying to avoid other robots and lasers while using rotating gears and conveyor belts to your advantage. Easy rules, but we found it a little difficult to get the hang of how to best use the cards to get where you want to be.\n\nI think it will be more fun once we have a few more plays under our belts and can think about disrupting other people's plans in addition to just trying to move the right way.\n\nDespite losing the first game, D gave this a nine.",
    "timestamp": 1700348400
  },
  {
    "username": "jtakagi",
    "rating": 4.0,
    "comment": "The theme isn't too bad, and I kind of like the little robots. I don't usually play too many of these types of games. I can see how enjoyment can vary greatly depending on the players, as this game isn't for everyone. I wouldn't want to have too many players, and the player elimination is a major downside to this game. I don't mind the randomness of the card draw - you have to make the best of what you're given. I'm not too good at these types of games, but don't mind playing every once in a while.",
    "timestamp": 1695074400
  },
  {
    "username": "Eckberger",
    "rating": 4.0,
    "comment": "German version. Hurrah! But they made a great game worse.\n1. No player boards (what the f.... - why?)\n2. No option cards (why?)\n3. Only 4 robots. You have to buy the addon to externd to 8 players. Grrrr!\n4. Rule changes .... all robots start at the same place. What a nonsens!",
    "timestamp": 1692741600
  },
  {
    "username": "Danzo",
    "rating": 4.0,
    "comment": "Fairly fun party game. Once someone takes the lead, they tend to run away with it for the rest of the game. For me, treating it as a party game, this doesn't kill the fun of navigating the map as long as course is short, but others may find this a problem.\n\nThe one problem I have with RoboRally is the constant shuffling and dealing of cards. This doesn't normally bother me in a card game like Hearts, so I'm not sure why it does in RoboRally: perhaps it's the frequency, perhaps it's due to having to work around the huge player mats and course boards, or perhaps it's the feeling that the shuffling and dealing is repeatedly interrupting a single continuous race, whereas in Hearts it punctuates distinct rounds.",
    "timestamp": 1691704800
  },
  {
    "username": "krit1789",
    "rating": 4.3,
    "comment": "Programming for robot movement. Not my favorite mechanism/theme.",
    "timestamp": 1685311200
  },
  {
    "username": "astomps",
    "rating": 4.0,
    "comment": "it is better than a 4 but not in my plays",
    "timestamp": 1681250400
  },
  {
    "username": "Stylemys",
    "rating": 3.5,
    "comment": "I'd rate this one a hell of a lot higher if I could ever get other people to play it with me. That said, it'd just be okay even then. The run away leader issue in this game makes the 2nd half utterly infuriating and boring sometimes.",
    "timestamp": 1674514800
  },
  {
    "username": "Nurks",
    "rating": 4.0,
    "comment": "this game is no fun for me. I hate this. compared to Colt Express, this game is not for me.",
    "timestamp": 1672700400
  },
  {
    "username": "brianckabat",
    "rating": 4.0,
    "comment": "It lasts too long even only using one board.",
    "timestamp": 1671663600
  },
  {
    "username": "tang tang",
    "rating": 4.0,
    "comment": "The bad card draw problem is a turn off",
    "timestamp": 1664661600
  },
  {
    "username": "The_Crimson_King",
    "rating": 4.0,
    "comment": "Like so often, a brilliant theme is ruined by a game that is made mainly of flaws. Robo Rally suffers from a severious runnaway leader problem. The chaos produced by the different robots pushing each other, jammed progam slots etc. is cool, but the game drags for far too long to be justified by a good laugh every now and then, and since a player that gets ahead is hard to get caught up again, the game's often decided early, which takes out any tension.\n\nColt Express does the chaos through action programming thing far better, tighter, shorter, funnier, and produces more laughter will still giving more illusion of control to the players.",
    "timestamp": 1663884000
  },
  {
    "username": "JoshuaStarr",
    "rating": 4.0,
    "comment": "Random. Which is what it's meant to be, but just can't get into it.",
    "timestamp": 1654984800
  },
  {
    "username": "Mattias",
    "rating": 4.0,
    "comment": "Simple logic game with nice theme. Can be played by all ages.\n\nAll models painted.",
    "timestamp": 1651528800
  },
  {
    "username": "brw12",
    "rating": 4.0,
    "comment": "1 play:\n\nI get with this game is trying to be, but its basic design is fundamentally flawed.\n\nPlayers focus should fundamentally be about tactically navigating the obstacles and other players, and finding delight and horror in the unexpected results of their carefully laid plans--er, programs. It's a great premise.\n\nBut instead, because the results of the execution are entirely make or break, and the game is structured with nether wiggle room nor time pressure, players and up having to focus on tediously analyzing every sequence of moves. This is especially glaring when it comes to rotating conveyor belts, since the specific sequence of when you reach a square and when it turns you has such a profound impact. That means that instead of racing across the stage in a state of flow, the game continually grinds to a halt so that players don't experience frustrating, pointless mistakes of anticipating the precise order with which different pressures are applied.\n\nI don't have a clear fix, but if this were my game, I would continue to develop it and experiment with elements of chance and error correction so that there is still depth of tactics and risk of failure, but less danger of being tripped up by an edge case of the order with which events are executed within a turn. I think you should also completely get rid of turning conveyor belts.\n\nI would also do some work to expand the range of boards and scenarios. Currently, the very simplest boards would take a group of three players more than an hour of painstaking move execution to get through. Why not have a few radically simple starter boards?\n\nA promising game, just not really a finished one.\n\nLightness (1)-Heaviness (5) rating: 3",
    "timestamp": 1645225200
  },
  {
    "username": "StorytellerP",
    "rating": 4.0,
    "comment": "A not very interesting and frankly frustrating puzzle that takes way too long. There are no minor setbacks, just catastrophic failures. Almost impossible to play any strategy.",
    "timestamp": 1629237600
  },
  {
    "username": "Rag136",
    "rating": 4.0,
    "comment": "This is alright, i don't like programmable movement",
    "timestamp": 1624917600
  },
  {
    "username": "tdjohnst2",
    "rating": 4.0,
    "comment": "Meh. Game moves too slow for me. So many better games out there. Unfortunately, this is one of the only games my 10 year old likes!",
    "timestamp": 1609455600
  },
  {
    "username": "chuft",
    "rating": 4.0,
    "comment": "This seemed like a really cool idea for a game - I had played a similar 1991 Macintosh computer game a few years before this came out, called Robosport (https://en.wikipedia.org/wiki/RoboSport) but no one I played Roborally with, including me, actually enjoyed it. It has a serious runaway leader problem, and the random actions once you are damaged make the game increasingly one of pure process with little decision making. Sold off long ago because it just sank when actually played.",
    "timestamp": 1595628000
  },
  {
    "username": "marcuslind1",
    "rating": 4.0,
    "comment": "Programming is an interesting challenge, even if your plans are often sabotaged by the chaos that happens once all players execute their programming - something that you can plan for to some extent. However, the wacky gameplay and overall destruction will get tiresome pretty fast, so I recommend small maps and maps where you have to move back and forth, for a more laid back party game. Larger maps will lead to dragging game time and people playing just to finish. Plus you might get eliminated and have to wait for the rest of the group.\n\nThis edition seems better than the 2016 one which adds even more random elements and chaos.",
    "timestamp": 1594504800
  },
  {
    "username": "Mestremuten",
    "rating": 4.0,
    "comment": "Rating:\n3/5\nProduction value:\n1/4\nIs the game in my collection/Love to have?:\n0/1",
    "timestamp": 1594418400
  },
  {
    "username": "ewokracoonbreder",
    "rating": 4.0,
    "comment": "Huge meh. I don't find this game very fun and neither have the people I've played with. I don't understand the appeal. It's a long game and crazy punishing. When you add all the fun sounding rules it just gets too complicated for what it is.",
    "timestamp": 1592344800
  },
  {
    "username": "plysbjorn",
    "rating": 4.0,
    "comment": "Chaotic! A short track played at a brisk pace can be a reasonably fun diversion. Not overly attracted though.",
    "timestamp": 1584918000
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "random robots",
    "timestamp": 1583103600
  },
  {
    "username": "stormseeker75",
    "rating": 4.0,
    "comment": "This \"game\" is tedious. You have to hope to draw good cards. If you don't, you're screwed and end up doing nothing. The worst sin a game can commit is turns in which nothing happens. That happens a lot in this game. I would prefer not to play this ever again.\n\nReceived in trade from DKahnt summer 2009",
    "timestamp": 1577833200
  },
  {
    "username": "LupusX",
    "rating": 4.0,
    "comment": "This game is fun for 10 minutes. It simply drags on for too long and it feels like a lottery. If one person manages to get ahead they will be able to finish the game undisturbed.",
    "timestamp": 1576018800
  },
  {
    "username": "gixmo",
    "rating": 4.0,
    "comment": "Good with not too many people, other way it becomes boring",
    "timestamp": 1574982000
  },
  {
    "username": "Wight1984",
    "rating": 4.2,
    "comment": "Guide robots around a maze by programming five moves in a go. Watch everything go wrong as other robots bump into you and mess up your plan. Fall down pits, be dragged along by conveyor belts and be hit by lazers. The programming is a lot of fun but actioning that programming can be a bit slow... especially with more players (which is a shame: more players, more chaos!)",
    "timestamp": 1572127200
  },
  {
    "username": "juuzzom",
    "rating": 4.0,
    "comment": "Programming is kind of fun but the randomness of the card draw can be brutal. Unfortunately the game vastly overstays its welcome even when playing with just one board and if you happen to fall behind it really kills any excitement that there may have been.",
    "timestamp": 1569103200
  },
  {
    "username": "garry_rice",
    "rating": 5.0,
    "comment": "Preprogram your robot to move on a board with conveyers, lasers, etc. Shoot other players and try to make it to all the checkpoints first. Lots of player interaction but can be quite frustrating if you can't draw the cards you need (or if you draw all turns, etc...).",
    "timestamp": 1759096800
  },
  {
    "username": "m0x50",
    "rating": 5.0,
    "comment": "110\nGameGenic Prime GREEN\nStandard American (57 x 87)",
    "timestamp": 1756936800
  },
  {
    "username": "Elocution Safari",
    "rating": 5.0,
    "comment": "Sold",
    "timestamp": 1752271200
  },
  {
    "username": "inextinguishable",
    "rating": 5.0,
    "comment": "I played it twice, and in neither case my group played it till the end. A game can last indefinitely. While it starts out fun, the fun wears thin after a while.",
    "timestamp": 1751493600
  },
  {
    "username": "Aevin",
    "rating": 5.0,
    "comment": "2-8 players (5+ preferred)",
    "timestamp": 1746568800
  },
  {
    "username": "csw11235",
    "rating": 5.0,
    "comment": "My score on this years ago was 7, but it hasn't aged well for me.",
    "timestamp": 1746396000
  },
  {
    "username": "Destrio",
    "rating": 5.0,
    "comment": "Classic programming race game that adds some complexity through dealing with the board's special movement tiles with some guessing of what your opponents might do. Neat components with painted metal plastic minis. Old school art style with boards, cards, and bots.\n\nDecisions are relatively simple. Turns can be quick but the overall game is rather long. Power cards are not equal but it isn't a high strategy game.",
    "timestamp": 1745704800
  },
  {
    "username": "ryanespin",
    "rating": 5.3,
    "comment": "Box face in poor condition, big smash in the middle of the box. Components inside are unopened and unpunched.",
    "timestamp": 1738450800
  },
  {
    "username": "jidar",
    "rating": 5.0,
    "comment": "I like the idea of RoboRally, but playing it isn't fun.",
    "timestamp": 1737500400
  },
  {
    "username": "muzrobertson",
    "rating": 5.0,
    "comment": "Stupid, stupid, fun.",
    "timestamp": 1736290800
  },
  {
    "username": "galvornman",
    "rating": 5.0,
    "comment": "Wonky robotic arena of chaos!! Fun, but can get long and tedious with big maps and/or lots of bad luck. Player elimination kinda blows too, especially early/mid game.",
    "timestamp": 1729893600
  },
  {
    "username": "OldYronsides",
    "rating": 5.0,
    "comment": "2-8p (best 5-6)\n45-120m",
    "timestamp": 1729288800
  },
  {
    "username": "Yokiboy",
    "rating": 5.0,
    "comment": "I find it too chaotic, and think that there are now much better programming board games.",
    "timestamp": 1728597600
  },
  {
    "username": "ParalyzedAnalyst",
    "rating": 5.0,
    "comment": "It can be funny in a slapstick kind of way, but it can drag on without players making meaningful progress.",
    "timestamp": 1728338400
  },
  {
    "username": "Trevor03",
    "rating": 4.5,
    "comment": "RoboRally has some great ideas and aspects, but very much shows its age. It's a game that's completely on rails, meaning you have to customize and house-rule nearly everything to make it an enjoyable experience.\n\nDon't have too many players or the game will drag.\nDon't have too few players or the game will be boring.\nDon't prepare a full sized course or the game will go too long and there will be a runaway leader.\nDon't prepare too small of a course or the game will be entirely chaos.\nDon't play a full game, just stop when someone gets far enough ahead since no one will catch them anyway.\nDon't play by the rules as written, play this custom variant instead.\n\nSometimes older designs have enough charm, elegance, or other elements where you can look past their shortcomings, but I can't see many instances where I'd want to play this again.\n\nFor a much better programming game, try Mechs vs Minions (co-op). For a better chaotic game, try Galaxy Trucker or Thunder Road Vendetta.",
    "timestamp": 1718056800
  },
  {
    "username": "Stas",
    "rating": 5.0,
    "comment": "Last played : May 2008",
    "timestamp": 1710630000
  },
  {
    "username": "SSims",
    "rating": 5.0,
    "comment": "Not ideal with 2P (which I knew wouldn't be), but looking forward to trying with more. Bought this mainly because was on sale and regarded as a classic.\nPlayed a 4P game which was much better. My wife is not overly keen on this so probably won't hit the table often.",
    "timestamp": 1706482800
  },
  {
    "username": "jatang",
    "rating": 5.0,
    "comment": "My sister, who's not a gamer, loves this game and requests that we play it for her birthday. All the mistakes make her laugh, whereas they make me incredibly frustrated. My husband, who is a gamer as well as a programmer, rates it a 10, which I can understand as it is unique and well-developed.\n\nI prefer to avoid the board effects. It's nerve-wracking enough that I don't wind up where I intend to go simply because of bad programming, so trying to take advantage of the conveyers adds an extra dimension of awful. On top of that, the other players can mess with your plans and sometimes you don't get useful cards.\n\nI am so glad I only have to play it once a year!",
    "timestamp": 1706396400
  },
  {
    "username": "copperkeys",
    "rating": 5.0,
    "comment": "If I’m going to play a programming game, it’s going to be Lords of Xidit. However, this game is definitely easier to explain and to gauge winning status while playing.",
    "timestamp": 1705359600
  },
  {
    "username": "bigchocolate69",
    "rating": 5.0,
    "comment": "Frustrating game that is time consuming when people are picking their moves and once someone gets ahead they tend to avoid conflict from other robots. Has some funny moments when someone goes off-course or uses the wrong card, but not enough to want to play this game.",
    "timestamp": 1704150000
  },
  {
    "username": "pokewom",
    "rating": 5.0,
    "comment": "2 3 4 5 6 7 8",
    "timestamp": 1701730800
  },
  {
    "username": "GeorgW",
    "rating": 4.5,
    "comment": "It's a silly and fun game that is a bit too slow to be really excellent.\n\nPros:\nThe boards and your annoying hand do a great job of challenging you to think differently and make lemonade out of lemons.\n\nThe other players will also throw a wrench into your plans, even with a lower player count which I was worried about!\n\nThe simple fact is that mistakes are funny and the game does a good job of letting you make mistakes both due to your own stupidity and the actions of your opponents.\n\nIt's rare to have games that play up to 8 and while it may be too chaotic and slow at that player count, it's nice to have the option.\n\nThe robot names and personality are great and shows that thought and care has been put into the game...\n\nCons:\nThough the components aren't great. The robots are unpainted in this edition, the boards are paper thin and the art just isn't very vibrant or interesting.\n\nAlso, it has player elimination. You can get really screwed over in this game and it has a bit of a tendency to kick you when you're down. You sort of need to be okay with that going into the game and just appreciate the chaos of it all.\n\nThe game can be very long and it's easy to make mistakes with which card triggers first, leading to re-dos and further time. Again this is mitigated by knowing it going in and choosing a track of suitable length.",
    "timestamp": 1700434800
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "Very good fun game of chaos. Way too long. I would prefer smaller maps which makes it crowded and quick",
    "timestamp": 1700175600
  },
  {
    "username": "Lemem",
    "rating": 5.0,
    "comment": "RoboRally is perhaps the golden child of chaos, loved and equally despised by many. I find the programming to be enjoyable, the execution not so much.",
    "timestamp": 1699484400
  },
  {
    "username": "juriel1",
    "rating": 5.0,
    "comment": "Closet 3 shelf 2 -Sleeved\nNot for everyone.... sometimes 2 players are way better than others and then its hard to catch them",
    "timestamp": 1694556000
  },
  {
    "username": "Rysiuvg",
    "rating": 5.0,
    "comment": "Gifted to Jasper",
    "timestamp": 1692741600
  },
  {
    "username": "grabben",
    "rating": 5.0,
    "comment": "No strategy here, but it can be fun to disrupt others plans.",
    "timestamp": 1690322400
  },
  {
    "username": "unluckyprimes",
    "rating": 5.0,
    "comment": "FallCon",
    "timestamp": 1688853600
  },
  {
    "username": "exparrot",
    "rating": 4.5,
    "comment": "I apparently cannot tell my left from my right.\n\nThis game is ok but a little too long. I will only play a three flag maximum and no grabbing the flag from one square away!\n\nGifted to friends with children (2023)",
    "timestamp": 1678230000
  },
  {
    "username": "Pianoworm",
    "rating": 5.0,
    "comment": "Party Game!",
    "timestamp": 1676242800
  },
  {
    "username": "Victoria_hermit",
    "rating": 5.0,
    "comment": "Chaotic advanced planning of movement that I can never get right. Fun if you are in the mindset to enjoy being frustrated. Wears out really fast.",
    "timestamp": 1667602800
  },
  {
    "username": "Elocution Safari",
    "rating": 5.0,
    "comment": "Controlled chaos. Do yourself a favor and make this game as short as possible. Use a single board and very few flags. This game will wear out it's welcome and have a runaway leader problem if you let it. The mechanics of this game are engaging and thrilling until they turn on you and become repetitive and frustrating, this takes about thirty minutes for me.\n\nEWC 2022 VFM $20.",
    "timestamp": 1657663200
  },
  {
    "username": "adambadura",
    "rating": 5.0,
    "comment": "2022-05-08 (rate 5):\n\nI was interested in the game because I like the mechanic, the theme seemed fine, and [person=14] as the designer attracted me as well. Also, I had the impression this is a well-established classic in its category.\n\nHowever, after a few games, I grew skeptical. With a little number of players, the board was too empty. With more players, the moves were too chaotic. While lack of control was an immense impression.\n\nIn the end, I decided there are other games with the mechanics ([boardgamemechanic=2953]) that I like more and got rid of this one.",
    "timestamp": 1651960800
  },
  {
    "username": "a_traveler",
    "rating": 5.4,
    "comment": "Played several times with various expansions and variant rules. What the game is, and how it feels like, is determined a lot by these, so it's hard to give a rating for just the base game. Love the concept, sometimes love the gameplay, but in the end, I feel there's too few truly meaningful decisions over the course of the average game for this game to really shine. Mostly you're just trying to see the most optimal pattern in your set of cards given your position on the board (which just takes time), hoping you didn't make any mistakes, and only once or twice per game do you get to second guess your opponents. Those are the moments when the game shines, but it's too little for the amount of time a game can take. Gets significantly better with more players, as then there's more chances of more of these moments, and the added chaos makes the game more fun.",
    "timestamp": 1648249200
  },
  {
    "username": "lrdrichter",
    "rating": 5.0,
    "comment": "Could see this game getting a little long with more than four people.",
    "timestamp": 1647903600
  },
  {
    "username": "tscox87",
    "rating": 5.0,
    "comment": "Played the cheap and nasty production. Programmed actions are fun, and the unpredictability of it all was fun but wouldn't go back for more",
    "timestamp": 1644966000
  },
  {
    "username": "mnemonicuz",
    "rating": 5.0,
    "comment": "A random and chaotic programming game.\n\nIt's a fun distraction and the results can be hilarious.\n\nIt's too chaotic for me to enjoy it greatly though.",
    "timestamp": 1644274800
  },
  {
    "username": "kplatte",
    "rating": 5.0,
    "comment": "Hysterically unpredictable to play for a turn or two but games are long and grow frustrating due to the difficulty in achieving more than modest gains across large boards.",
    "timestamp": 1643324400
  },
  {
    "username": "Joshuaaaaaa",
    "rating": 5.0,
    "comment": "What a bizarre game...and by bizarre, of course I mean \"thoroughly enjoyable.\" I had a blast with my first game of this, even though I did miserably, miscalculating moves, getting shoved where I didn't want to go, and getting shot up. More! More!",
    "timestamp": 1641682800
  },
  {
    "username": "deef2",
    "rating": 5.0,
    "comment": "Takes too long for the randomness of the game.",
    "timestamp": 1636671600
  },
  {
    "username": "Zangzabar",
    "rating": 5.0,
    "comment": "For a race game, this is slower than most, but I've not found a better game for a family. The amount of laughter and frustration that comes out is worth it.\n\nMy father-in-law loves this. Not really being a game player, he really took to this with a gusto.",
    "timestamp": 1635372000
  },
  {
    "username": "Lunatic Calm",
    "rating": 5.0,
    "comment": "Fun at the time but damn the powers are wildly unbalanced and if you have a player who can't quite 'get it' its just painful for them and everyone watching them.",
    "timestamp": 1628719200
  },
  {
    "username": "Malachi",
    "rating": 5.0,
    "comment": "Interesting game. Can run a little long and is a little on the random side with the cards.\n\nBlargh! Randomness!\n\nBased on 3 plays.",
    "timestamp": 1627768800
  },
  {
    "username": "enemyoftheworld",
    "rating": 5.0,
    "comment": "Meh.",
    "timestamp": 1623189600
  },
  {
    "username": "Cthulhu1",
    "rating": 5.0,
    "comment": "Though there is no denying this is a fun classic game, I was very, very disappointed with the quality of the components. It's shameless for Hasbro to advertise the figures as 'pre-painted' when they in fact have only a thin wash of black applied to them. And speaking of thin, the cardstock used for the counters, boards and cards is cut-rate.",
    "timestamp": 1621634400
  },
  {
    "username": "Sir Pent",
    "rating": 5.0,
    "comment": "Crazy programming game for lots of players who want to laugh at the chaos. It's most fun when strictly following the time limits although that strangles strategy and maximizes mayhem.",
    "timestamp": 1620165600
  },
  {
    "username": "sbsimp1",
    "rating": 5.0,
    "comment": "NK2",
    "timestamp": 1619042400
  },
  {
    "username": "Papathunder",
    "rating": 5.0,
    "comment": "Cute; but never quite did it for me.",
    "timestamp": 1617746400
  },
  {
    "username": "Kromlek",
    "rating": 5.0,
    "comment": "Neat mechanics, game just goes on way too long for what it is, mod cards don't come out often enough, must play with the variant where everyone starts with a mod.",
    "timestamp": 1608764400
  },
  {
    "username": "Cinful",
    "rating": 5.0,
    "comment": "Keep - Collection\nA great game, but a VERY long game. If you don't put a timer on the \"setup\" portion of each turn it gets ridiculus. Regardless expect the game to take two to four hours to complete depending on how many flags you put out. The expansions are neat, but just add complication to an already complex game.",
    "timestamp": 1605222000
  },
  {
    "username": "jcatroui",
    "rating": 5.0,
    "comment": "Un peu long",
    "timestamp": 1604876400
  },
  {
    "username": "Born-of-Ashes",
    "rating": 5.0,
    "comment": "This type of game was ok a decade ago when you didn't mind playing one game all night, but now I actually want to get a few in each meeting. The programming is nice, but can drag with an AP player and then they get bent out of shape when you push them off their perfectly designed path. The damage system feels like it kicks you when you're down. Once robots are spread out there is little you can do to hinder or catch the leader.",
    "timestamp": 1599775200
  },
  {
    "username": "FranklinTV",
    "rating": 5.3,
    "comment": "Eight years unplayed on the shelf - - its definitely has reach the board game event horizon. Would rather play Mechs & Minions anyway for programming experience. Donated to YX (Rating 5.267, Aug 20)",
    "timestamp": 1598392800
  },
  {
    "username": "sgosaric",
    "rating": 4.5,
    "comment": "Initial rating after 1 play: 6 players, one simple room. Said to be a short game and it was 'just' 90 minutes. (Rule explanation took some time).\n\nThe game is of that wacky *things go boom* and *plans go down the drain* type. Problem is that it moves slow - mostly because of constant need to check initiative order all the freaking time. Probably one only needs to check the move orders (and not turn orders). Interaction is there, but everything seemed so chaotic that the impression is more one of chaos than intentional interaction (then again we had that kind of room). With other maps, fewer players and so forth my impression may change - I read interaction gets more pronounced once everyone gets the flow of the game and understands how programming work. So, we'll see.",
    "timestamp": 1597615200
  },
  {
    "username": "Zuras",
    "rating": 5.0,
    "comment": "Some people love this game. I am not one of them, as the prospect of getting ones plans constantly foiled turns out not to be entertaining for me.",
    "timestamp": 1594504800
  },
  {
    "username": "HardCore",
    "rating": 5.0,
    "comment": "just like programming.",
    "timestamp": 1589666400
  },
  {
    "username": "ankpoeten",
    "rating": 5.0,
    "comment": "Bombed in my play group, but I think I like it.",
    "timestamp": 1587506400
  },
  {
    "username": "Unfinished",
    "rating": 5.0,
    "comment": "It's robots! Moving across a booby-trapped map! There are lasers and drills and battering rams, oh my! What could go wrong?\n\nWell . . . quite a bit, actually. For my money, RoboRally does so very many things right - fantastic art, great design, lots of variety and replay value - but then stumbles into a major, if not exactly fatal, flaw.\n\nOne of my most important metrics in evaluating a non-cooperative game - and I recognize many others may simply not feel this way - is how well it engages the player(s) who is losing the worst. Does the last place player feel the compulsion to press on, grasping at the slim chance of victory, or out of sheer enjoyment? Or do they just feel like participation is a waste of time?\n\nRoboRally falters badly on this score. Simply put, if you get off to a bad start in this game (which can happen due to your own incompetence, opponent machinations, or random chance), you might as well pack it up. I've never played a game that is more punishing for its lagging players, with the possible exception of Diplomacy. Moreover, because you simply respawn upon dying, you can never simply die with dignity (or hilarity).\n\nWhen a game of RoboRally is going well, it can be tremendous fun - it is intense without being tense, competitive without being hostile. But when it goes badly, which happens all too often, there is too broad a \"spread\" between the front of the line and the back of the pack to make it enjoyable. That flaw bars RoboRally from the ranks of the regular favorites.",
    "timestamp": 1582153200
  },
  {
    "username": "NORTHwoodsHARDY",
    "rating": 5.0,
    "comment": "Works best with more than 2 players.",
    "timestamp": 1580943600
  },
  {
    "username": "cetequ",
    "rating": 5.0,
    "comment": "fun, but very random. Hard to make real decisions, because it is almost impossible to predict what other people will be doing because of the card draws.",
    "timestamp": 1580252400
  },
  {
    "username": "ct5150",
    "rating": 5.0,
    "comment": "Fun game of pre-programmed movements that fall apart when the action starts and others start smashing into you. AND shooting at you. I don't know if I need to own this, but I would like to play again.",
    "timestamp": 1579561200
  },
  {
    "username": "viranga",
    "rating": 5.0,
    "comment": "The games go longer than I'd like. I only really play this game if that's what other people are playing.",
    "timestamp": 1575932400
  },
  {
    "username": "benfairbank",
    "rating": 5.0,
    "comment": "With Nick B?",
    "timestamp": 1575586800
  },
  {
    "username": "Rodge",
    "rating": 5.0,
    "comment": "A silly little game, where kingmaking can be a thing. I don't really see this as being a serious game, more of a slapstick fun little one.\n\nI might play this in the future, but not going to rush to do so.",
    "timestamp": 1573513200
  },
  {
    "username": "Hornauer",
    "rating": 5.0,
    "comment": "Fun game, but be careful how big you make the track, it can take forever! Even with 3 players, 4+ hours are not uncommon when you overdo it with placing the checkpoints too far apart. Fun game though, but please, use the laser variant!",
    "timestamp": 1570831200
  },
  {
    "username": "petza55",
    "rating": 5.0,
    "comment": "-Action programming is not my cup of tea. A lot of luck and guessing.\n-A bit too long for what it is too.",
    "timestamp": 1568584800
  },
  {
    "username": "FreezenFire",
    "rating": 5.0,
    "comment": "TOO LONG!\nTraded.",
    "timestamp": 1566511200
  },
  {
    "username": "mellchia",
    "rating": 5.0,
    "comment": "Hilarious game. Great play with noncompetitive players.",
    "timestamp": 1563487200
  },
  {
    "username": "saturatedpig",
    "rating": 5.0,
    "comment": "Awesome idea, would play again. Just not my go to",
    "timestamp": 1557612000
  },
  {
    "username": "Flavorman2000",
    "rating": 5.0,
    "comment": "Rated a 6 but only played once. Admittedly I made some miscalculations on a couple of turns that really destroyed my chances, but it was a rather chaotic game, we played with the higher player count of 7, seemed like other players were constantly forcing you into sub-optimal situations. There were quite a few times were basically I had no options either because I couldn't get the cards I needed so I was just turning in circles or ramming into a wall. I would try this one again and I'm thinking it probably plays better in the 4-6 player range.",
    "timestamp": 1554242400
  },
  {
    "username": "Micker",
    "rating": 5.0,
    "comment": "I love playing this game; I'm a bit of a geek for the Robot Wars TV show, and this definitely gives me those vibes. I also love the absolute chaos in this game; you can meticulously plan your move out, only to have it completely thwarted by an opponent, of often even by your own miscalculation.\n\nUnfortunately though, I struggle to recommend it; Colt Express manages to implement the same core mechanic and provide the same feeling while playing, but in a game which is much shorter, much less fiddly to set up, and much more easily accessible to new players. Sadly I can't see any reason for buying RoboRally over Colt Express, as the latter just does everything that little bit better.\n\nI'm still going to hold on to this game on my shelf for those few occasions when I have a group of people who are all extremely familiar with Colt Express and want a new challenge, but I know those times are going to be few and far between.",
    "timestamp": 1543100400
  },
  {
    "username": "Cheezah",
    "rating": 5.0,
    "comment": "Messy....better without all the cards",
    "timestamp": 1542322800
  },
  {
    "username": "elucidarian",
    "rating": 6.0,
    "comment": "With games like this, it's best to vet your opponents, and don't invite those who are lacking good spatial visualization, as their programming can lead to feelings of frustration at unintended positioning, even when not interacting with other robots. With the right attitude, they may laugh it off, but that's not the same as enjoying the game.\n\nGood players will estimate degrees of success stemming from possible outcomes; anticipating the chosen path of other players' robots is vital to avoid having your robot's program interrupted. You should also embrace the potential for such interaction. When it occurs, sometimes with disastrous results, you're usually faced with two options: determine whether there is sufficient time to pursue your previous goal, or go on the offensive and set back the lead player, preferably the one that pushed/redirected/exploded you off the board.\n\nSome players can't see these tactical aspects beyond the haze of \"too random\" mechanics. Perhaps, if they muddle through a few plays, their perspective will change. Consider assessing these things before you sit down with new players.",
    "timestamp": 1759442400
  },
  {
    "username": "flennetar",
    "rating": 6.0,
    "comment": "Jkoy",
    "timestamp": 1759010400
  },
  {
    "username": "SvenFu",
    "rating": 6.0,
    "comment": "Chaotic and (almost) totally random, yet for some reason we've always had a real blast with this one. Bring out the beers and peanuts and have a good laugh!",
    "timestamp": 1757196000
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "too chaotic for me",
    "timestamp": 1755295200
  },
  {
    "username": "elrabin",
    "rating": 6.0,
    "comment": "Can be fun with the right group in the right mood. But the fun has nothing to do with the race itself, and has more to do with people getting pushed off course, locked into programs that make them move erratically, and getting rotation directions wrong. I don't know if I've ever had this game actually play out as a race - usually it's just a lot of chaos in the beginning until someone manages to get away and finish the race solo.",
    "timestamp": 1754344800
  },
  {
    "username": "tommaas616",
    "rating": 6.0,
    "comment": "Utter chaos",
    "timestamp": 1752098400
  },
  {
    "username": "wolvehunde",
    "rating": 6.0,
    "comment": "Long sessions with some gamers turn into a bad game session. definitely an acquired taste. Best with 3-4 on smaller maps with the right group. The game is all about chaos with no to little control over the environment and other players actions. It only gets played maybe once a year. Better programming games out there now.",
    "timestamp": 1750284000
  },
  {
    "username": "djnesq",
    "rating": 6.0,
    "comment": "Programmed movement games generally don't sit well with me. I guess that's because, in most of them, no matter how well you program, your plans can be thwarted in unpredictable ways. RoboRally probably is the one that I've most enjoyed of those that I've played.",
    "timestamp": 1748469600
  },
  {
    "username": "Astronica",
    "rating": 6.0,
    "comment": "It is a really fun, engaging, chaotic and entertaining game. But it feels too long for the randomness and silliness. I would have enjoyed very much more if it had lasted about half as much as it did, its frustratingly fun but drags a bit.",
    "timestamp": 1747605600
  },
  {
    "username": "bobjohnson",
    "rating": 5.6,
    "comment": "+ Simple, chaotic, exciting. Simultaneous card play.\n- Too long for what it is. The player who gets out in front has a much easier time than those who are unlucky and stuck in the middle of the pack.",
    "timestamp": 1746482400
  },
  {
    "username": "lisapc",
    "rating": 6.0,
    "comment": "Keep",
    "timestamp": 1745100000
  },
  {
    "username": "dosxtres",
    "rating": 5.5,
    "comment": "+",
    "timestamp": 1741906800
  },
  {
    "username": "infinitepeaks",
    "rating": 6.0,
    "comment": "Love the concept on this but in execution often slows to a crawl. Timer can help but wish it were a little tighter.",
    "timestamp": 1741474800
  },
  {
    "username": "AutoGrifo",
    "rating": 5.9,
    "comment": "** UPDATE: Sold in 2019. ** Bought this on a whim based on a recommendation, and the seemingly positive reviews I saw online. It could be fun if you like to throw your arms up in the air and just go with whatever happens, laughing in the chaos of it all. But if you like to plan everything, and get frustrated when you lose control, then this game is not for you. It feels random and whimsical. Didn't work with people I know.",
    "timestamp": 1740265200
  },
  {
    "username": "martybjsg",
    "rating": 6.0,
    "comment": "An old family favorite. The programmer in me has always enjoyed the chaos caused by bugs in the bots.\n\nPart of the rating is nostalgia at this point. The game really can be frustrating at times - especially when you draw cards that don't provide any ability to move whatsoever.\n\nI am not likely to play this much more - after _lots_ of plays.\n\nOnly have played in recent years with Armed&Dangerous",
    "timestamp": 1733612400
  },
  {
    "username": "oddbod",
    "rating": 6.0,
    "comment": "WotC edition, includes metal figures and the two expansions listed below",
    "timestamp": 1731625200
  },
  {
    "username": "Alex740",
    "rating": 6.0,
    "comment": "if at the end of the 5 cards everyone moves their own piece according to the conveyor belts and gears they tend to move what the intended rather than what the gears and conveyor belt say. This is true for card movement as well (e.g. people want to turn clockwise but they played a left turn card).\nIf all moves are made one at a time so that others can check its done right, the game moves too slowly.",
    "timestamp": 1726610400
  },
  {
    "username": "emmaak",
    "rating": 6.0,
    "comment": "I mean, it's silly and frustrating, which are two things I appreciate in games. If you're into programming; can laugh it off if you fail immensely (and stupidly) and, if you don't mind player elimination as in returning as a ghost with the only objective to ruin for everyone, you'll probably have a great time with this one. Oh, and the art of the 1994 version really adds to the charm!",
    "timestamp": 1726437600
  },
  {
    "username": "BoomDooger",
    "rating": 6.0,
    "comment": "Chels: 4\nAnt: 8\n\nChels hates this, don't let her rating lie to you. A frustratingly hilarious game of twisting and turning, misplacing your program by a single card or losing a single digit in your calculation that sends you flying off the board or into lasers. A delight for some, a chore for others.",
    "timestamp": 1725314400
  },
  {
    "username": "NormandyWept",
    "rating": 6.0,
    "comment": "A fun light-hearted romp around an obstacle course, with plenty of facepalming as your programmed actions go off course from the actions of others.\n\nDesigning the right map can be a challenge - don't do something too long as the game never ends. Things are also best when robots are forced into each others' path, driving up the interaction and chaos.",
    "timestamp": 1721685600
  },
  {
    "username": "ToBakai",
    "rating": 6.0,
    "comment": "Siehe 2016er Version.",
    "timestamp": 1720216800
  },
  {
    "username": "Zenfire",
    "rating": 6.0,
    "comment": "Some kind of programming game. I dont remember much, but it felt too random. No one really liked the game back in the days, even though it was quite hyped around that time (maybe because of R.Garfield). Still quite unique and good for such an old game. Got culled from the collection. Sold.\nPlayed: 1 or 2 times.",
    "timestamp": 1718402400
  },
  {
    "username": "mixmixmix",
    "rating": 6.0,
    "comment": "I played a few solo games of this before teaching my friends. I found the game to be far too lucky to table with friends. As neat as the idea of colliding into others in mid programming might be, once someone is ahead they just perfectly program themselves to victory.",
    "timestamp": 1716933600
  },
  {
    "username": "Anonymous Apathy",
    "rating": 6.1,
    "comment": "I was a bit disappointed with this one. I'm a huge Garfield fan, and I've had my eye on this classic for a long time. Not fun enough with fewer players, but not enough control with more.\n(traded for Shogun at PP Con 2024)",
    "timestamp": 1716242400
  },
  {
    "username": "Pessoatukan",
    "rating": 6.0,
    "comment": "Too long.",
    "timestamp": 1707346800
  },
  {
    "username": "TriangularCube",
    "rating": 6.0,
    "comment": "Cannot be found",
    "timestamp": 1706914800
  },
  {
    "username": "juanitogan",
    "rating": 6.0,
    "comment": "Matt's Mods:\n1. Everybody gets an option card when each successive flag is touched for the first time (assuming it was touched in the correct order by the touching robot).\n2. Note that faster moves have higher priority, so only compare priority numbers when players play the same move; and only compare when it really matters.\n\n*** It sounds like I may need to play earlier editions (2nd ed) of this, with earlier/more-complex boards, to fully appreciate it. My 2005 ed (3rd ed) may not cut it.",
    "timestamp": 1706223600
  },
  {
    "username": "mikey384",
    "rating": 6.0,
    "comment": "Very fun! But can be a lengthy game.",
    "timestamp": 1705878000
  },
  {
    "username": "gregor1863",
    "rating": 6.0,
    "comment": "I love the theme and components, but struggle mightily at this game. It is a lot of fun though in a large group environment as there is a lot of chaos. I hope all of the great expansions are reprinted someday.",
    "timestamp": 1703890800
  },
  {
    "username": "DanielBeaver",
    "rating": 5.5,
    "comment": "Very unique and cool. The simultaneous action selection allows the game to scale up to high player counts without significant downtime creeping in. Though I dig the mechanics, but it can be a bit tedious, and it is overly chaotic.",
    "timestamp": 1701298800
  },
  {
    "username": "MamaGoat",
    "rating": 6.0,
    "comment": "Plays best at 5+. It's a random game with little strategy. I prefer playing the scenarios (capture the flag, etc) better than the standard first player to all checkpoints win. It helps eliminate the runaway leader problem some have stated.\nWe also have house rules (when you land on a hammer, draw 3, pick 1), etc.",
    "timestamp": 1699830000
  },
  {
    "username": "iNano78",
    "rating": 6.0,
    "comment": "A great \"programming\" game that can be quite chaotic as other robots interact with yours. Has an unfortunate runaway leader issue... but that can be reduced somewhat through flag placement.\n\nPurchased a used copy on ebay, July 2012. I painted our robot minis.",
    "timestamp": 1697580000
  },
  {
    "username": "Ellogeyen",
    "rating": 6.0,
    "comment": "2-4 plays (2019)",
    "timestamp": 1696802400
  },
  {
    "username": "Stevemould",
    "rating": 6.0,
    "comment": "Chaotic but entertaining. Can certainly drag on, but I'm getting better at building shorter tracks.",
    "timestamp": 1686002400
  },
  {
    "username": "tibbles",
    "rating": 5.5,
    "comment": "Owned this for over 20 years, still fun to pull out for an occasional play despite showing its age in randomness and some mechanics. I like action programming and this game is the classic action programmer.",
    "timestamp": 1683410400
  },
  {
    "username": "SteveD.",
    "rating": 6.0,
    "comment": "Sold Hoopla 2023 $18.75",
    "timestamp": 1682805600
  },
  {
    "username": "AfarOca",
    "rating": 6.0,
    "comment": "JUGADORES: 5 - 6\nTIEMPO: 20 - 120\n\nPARTIDAS GANADAS/PERDIDAS\nAlvaro 2/0\nOca 0/2\nFina 0/2\nEmilio 0/2\nAlba 0/2\nNavir 0/2",
    "timestamp": 1682287200
  },
  {
    "username": "rynelf",
    "rating": 6.0,
    "comment": "--Oct2005-- Very very random. Frustrating for the little ones. Amusing - but perhaps only trivially so - for me. Will likely make it to the table only occasionally.\n--Oct2007-- Heh; and the little ones grow up, too! My now-5 year old finds it very amusing.",
    "timestamp": 1680559200
  },
  {
    "username": "cmdrsils",
    "rating": 6.0,
    "comment": "Cull",
    "timestamp": 1678316400
  },
  {
    "username": "NOOCX",
    "rating": 6.0,
    "comment": "A crazy cult game by Richard Garfield. When it's working out it's great, but often it does not and then it's slow and drags forever. I'm rather bad at it, but that's part of the fun. Smaller maps are better.",
    "timestamp": 1675810800
  },
  {
    "username": "Stjredux",
    "rating": 6.0,
    "comment": "Significant dishing on box top. Missing one robot and one robot card, but not the missing card that goes with the missing robot.",
    "timestamp": 1674860400
  },
  {
    "username": "artistterry",
    "rating": 6.0,
    "comment": "loft",
    "timestamp": 1674514800
  },
  {
    "username": "solsang",
    "rating": 6.0,
    "comment": "Requires much thinking and risk of waiting, really do use a timer, could be fun with simpler boards or house ruling simplyfying some things",
    "timestamp": 1673046000
  },
  {
    "username": "Chronnox",
    "rating": 6.0,
    "comment": "This one is ok, but does not get played a lot.\n\n*STORAGE*",
    "timestamp": 1672354800
  },
  {
    "username": "Disseasse",
    "rating": 6.0,
    "comment": "Lots of fun to play. Takes a decent amount of concentration to make sure your robot does what you want it to do. Lots of fun when opposing robots interfere with each other. Huge replay value and lots of different ways to set up the game",
    "timestamp": 1672182000
  },
  {
    "username": "cypar7",
    "rating": 6.0,
    "comment": "Very little luck, for the luck-phobic players. Nice minis, expandable board and cards. Really like the theme and the mechanic of programming your turns ahead of time, in secret, then finding out whether it works the way you planned.\n\nBruce 6, Beth 10",
    "timestamp": 1668812400
  },
  {
    "username": "thufir",
    "rating": 6.0,
    "comment": "Good game when playing with many robots on a small map. (wich makes unforseen results and that is good for this game)",
    "timestamp": 1665439200
  },
  {
    "username": "marge2",
    "rating": 5.8,
    "comment": "8p",
    "timestamp": 1660860000
  },
  {
    "username": "Luds",
    "rating": 6.0,
    "comment": "(Steph, Meeplemart.com, 2011-10-14)\n\nRoboRallye is a chaotic game of programmation that I used to enjoy quite a bit, however after not playing a few years and revisiting it it seems I'm done with the game. A single turn or someone pushing you and you're game is over. Can be fun if everybody gets rocked, but that never happens and a runaway leader just takes the game easily.\n\n(Sold on 2019-09-08)",
    "timestamp": 1660255200
  },
  {
    "username": "roast_chicken",
    "rating": 6.0,
    "comment": "The first programmed action game I ever played. Love the mechanic, but found the game rather tedious.\n\nRicochet Robots is not quite similar enough for this to be fair, but I vastly prefer that to this.",
    "timestamp": 1659823200
  },
  {
    "username": "street",
    "rating": 6.0,
    "comment": "You try to get from point A to point B to point C by programming 5 moves ahead into your robot in a game turn, but when somebody shoves you off your course, things can get quite exciting...Add lasers, conveyor belts, rotating gears, fatal pits, special weapons and other gadgets and you have RoboRally. Gave around 7 instead of 8 because the game probably doesn't last very long in the long run.",
    "timestamp": 1658959200
  },
  {
    "username": "SteveGibson",
    "rating": 6.0,
    "comment": "If you are lucky you will actually finish a game with your robot intact.",
    "timestamp": 1658872800
  },
  {
    "username": "Inconmon",
    "rating": 6.0,
    "comment": "Need to upgrade to new edition which is much better",
    "timestamp": 1655071200
  },
  {
    "username": "realityfoible",
    "rating": 6.0,
    "comment": "This isn't a game about winning. This is a game about silly damage control. The most common thing you'll hear at our table is, \"Nah, I've got this. Next I'm going to... wait, what? Why did I? NO!\"\n\nTip: Roborally almost ALWAYS turns into a longer slog than you think it will. Try playing with only three objective flags.",
    "timestamp": 1653602400
  },
  {
    "username": "enduran",
    "rating": 6.0,
    "comment": "Is there a cooperative way to play?",
    "timestamp": 1652738400
  },
  {
    "username": "infeneris",
    "rating": 6.0,
    "comment": "Very chaotic and plays best with many players but it also takes a while to play a full game. I find variants that speed up the game a must. The high chaos really pushes some people away from this.",
    "timestamp": 1651269600
  },
  {
    "username": "ToKo007",
    "rating": 6.0,
    "comment": "Test",
    "timestamp": 1649800800
  },
  {
    "username": "onlysmith",
    "rating": 6.0,
    "comment": "A game NOT to be taken too seriously.\nA fun programming game where everything will indeed go wrong for you.\nJust sit back, laugh and enjoy the chaos!!",
    "timestamp": 1649368800
  },
  {
    "username": "Penguinised",
    "rating": 5.5,
    "comment": "Ended up winning the game while having absolutely no control over what was happening. I'm all for chaotic games, but for how long this one is I wish I had a bit more choice",
    "timestamp": 1649109600
  },
  {
    "username": "brentont",
    "rating": 5.8,
    "comment": "would like to play this more often. just caotic fun.",
    "timestamp": 1648162800
  },
  {
    "username": "SeerMagic",
    "rating": 5.5,
    "comment": "One of the earliest games I played. I use to hate programming. I think I'd probably like it more now.\n\n Fun theme\n Lots of boards\n\n Way too long\n Way too random",
    "timestamp": 1647644400
  },
  {
    "username": "ncjeff",
    "rating": 6.0,
    "comment": "Bumping to a 6. Found it to be more fun with more players (5 vs 3). Also better using the turn timer to speed play.\n\nAn OK family style game. Found that by the end of the game the novelty had worn off and I was looking forward to it being over. Would probably play again if the opportunity arose but can see hitting my lifetime cap on replays pretty quickly. Maybe a good game for after the main event when you've got more time than for a filler.",
    "timestamp": 1647126000
  },
  {
    "username": "Kash000",
    "rating": 6.0,
    "comment": "Gave it to my brother Nadim",
    "timestamp": 1646348400
  },
  {
    "username": "bk86",
    "rating": 6.0,
    "comment": "Brett",
    "timestamp": 1645657200
  },
  {
    "username": "LesPatatas",
    "rating": 6.0,
    "comment": "2 Players: 1 Game\n3 Players: 1 Game\n5 Players: 15+ Games\n\nStatus: Keeper",
    "timestamp": 1642978800
  },
  {
    "username": "cogstockeros",
    "rating": 6.0,
    "comment": "The chaos that ensues when playing this game with a group really makes the game. When everyone is trying to get to the same space and you keep pushing people around there is no telling where your robot is going to land. Plus we find the theme amusing.\n\n\nThis game can go on for hours but if the lightning ball special rule is added, it makes the game more and more chaotic. It needs the right group of people.",
    "timestamp": 1642719600
  },
  {
    "username": "smallfurrygames",
    "rating": 6.0,
    "comment": "This is a game we usually only play with people who have good spatial/logical abilities. While 2+ skilled players can have a good showdown, it can be challenging for some players, especially if they fall behind early. Then it feels like they'll never catch up.",
    "timestamp": 1639695600
  },
  {
    "username": "Zeph!",
    "rating": 6.0,
    "comment": "Two minute rule essential",
    "timestamp": 1639350000
  },
  {
    "username": "arcweldx",
    "rating": 6.0,
    "comment": "Excruciating to play at high player counts, the randomness and length become a killer.",
    "timestamp": 1638918000
  },
  {
    "username": "Freppa",
    "rating": 6.0,
    "comment": "Chaotic and fun! Most of the time. Sometimes goes on a little too long.",
    "timestamp": 1636930800
  },
  {
    "username": "sajrainwater",
    "rating": 6.0,
    "comment": "Family Collection",
    "timestamp": 1633471200
  },
  {
    "username": "mi_de",
    "rating": 6.0,
    "comment": "Fun game, wish it played a little more quickly. A slow player totally ruins the experience. Fun with several of the expansions. Needs to be played fast an furious or it gets a bit tortuous.",
    "timestamp": 1632520800
  },
  {
    "username": "AlBundy4td",
    "rating": 7.0,
    "comment": "2nd hand find at Goodwill -05 version. Fun programing race game that has a lot a mayhem. Could be one the kids play with their friends as its pretty easy to teach and grasp the concept. Have Mechs vs Minions which is similar but more bling to it. looking for a pragamming game, this one may be it.",
    "timestamp": 1760047200
  },
  {
    "username": "akinfantryman",
    "rating": 7.3,
    "comment": "Lots of chaotic fun....requires a large group that can relax a little. Also, every turn you are trying to program your robot to react to different board situations. Some players see this as very little variability in the turns. (Every time programming...) I love it, but not every group/person will. 30Sept2013\n\nI miss this game, passed along when I left AK.",
    "timestamp": 1759874400
  },
  {
    "username": "Mutiemoe",
    "rating": 7.0,
    "comment": "Really cool game about programming.",
    "timestamp": 1759874400
  },
  {
    "username": "rkfan",
    "rating": 7.0,
    "comment": "Played 2025.",
    "timestamp": 1757196000
  },
  {
    "username": "Archimicarus",
    "rating": 6.5,
    "comment": "Programmed actions with such incremental actions lead to a bloated play time. Other than that, this is a delightful and ridiculous game teeming with Richard Garfield energy. Could stand to incorporate a mechanism to iron out variance in card quality (some kind of market to draw cards from instead of drawing blind) but the variance is the point. It's no tournament game but it's a fun time.",
    "timestamp": 1755727200
  },
  {
    "username": "GeminiWeb",
    "rating": 7.0,
    "comment": "I like the problem solving aspect of this, combined with the fun of the chaos, especially when you get pushed and watch your robot head off in the wrong direction!",
    "timestamp": 1754863200
  },
  {
    "username": "PikaPomelo",
    "rating": 7.0,
    "comment": "Many people really don't like this game and more than any other game I've played it seems like publishers are determined to keep reworking the rules to make it appeal to newer audiences.\n\nThat said, I have a good time with it. The \"racing\" is a decent premise, but just trying to puzzle out the movement and seeing everything fall apart is the real fun of the game.\n\nDon't take it too seriously and stop before people get bored.",
    "timestamp": 1754085600
  },
  {
    "username": "bnordeng",
    "rating": 7.0,
    "comment": "This kind of game is right up my alley and I really enjoyed my first few plays of it. I doubt that I will buy it because I highly doubt that, when I am the person bringing the games, the people I play with will be interested. So, I'll just play it with others who own it already. It IS fun if you enjoy the idea of programming something and can deal with the chaos of it not working as planned.\n\nOn second thought, this game doesn't seem like it's right up my alley with all of the craziness. But, I've enjoyed it every time I've played. It's fun to program your bot and watch the mayhem ensue. I look forward to playing it more which won't be difficult since I acquired it in a trade.",
    "timestamp": 1753308000
  },
  {
    "username": "onewheeled",
    "rating": 7.0,
    "comment": "One of my first games, and one that sowed my love of chaos in games. But it's just too long and arbitrary, even with a single board. In my final play most of the players felt like they weren't in control in an un-fun way. Sold.",
    "timestamp": 1751148000
  },
  {
    "username": "meshuggi",
    "rating": 7.0,
    "comment": "high quality boards - not just thin+cheap cartonage-'paper'-stuff - also the graphics are higher quality, brings much more flair to the game than the newer reissues =])..",
    "timestamp": 1750975200
  },
  {
    "username": "RandaPrince",
    "rating": 7.0,
    "comment": "RoboRally can take a Very Long Time to play. It's not a good game to play with what we call \"optimizers\" -- friends who have to find the absolute best combination of moves and will sit there forever deciding. The robot miniatures are cute.\n\nEDITED TO ADD: We had only played the original edition from 1994. We played the newer edition this weekend and I liked it much better. The new upgrade cards (and the fact that upgrades are easier to get) makes a big difference. The damage management system makes an even bigger difference.",
    "timestamp": 1750111200
  },
  {
    "username": "tiagoluchini",
    "rating": 7.0,
    "comment": "$25",
    "timestamp": 1748124000
  },
  {
    "username": "WhiteSeal",
    "rating": 7.0,
    "comment": "2-8 spelers (best 5/6)\n12+",
    "timestamp": 1746828000
  },
  {
    "username": "KatydidWonders",
    "rating": 7.0,
    "comment": "2-8",
    "timestamp": 1745877600
  },
  {
    "username": "GameplayerOfTitan",
    "rating": 7.0,
    "comment": "Some of the most fun I've ever had playing a board game. I would recommend Tron Legacy as a background soundtrack.",
    "timestamp": 1745186400
  },
  {
    "username": "BenRon",
    "rating": 7.4,
    "comment": "YES",
    "timestamp": 1745013600
  },
  {
    "username": "Optimal_Math",
    "rating": 7.0,
    "comment": "This thing has some SERIOUS cult fans out there! I'm not one, but certainly worth a play. I know people that say this is the best board game ever created. Sold to them, haha.",
    "timestamp": 1744927200
  },
  {
    "username": "The_Humungus",
    "rating": 7.0,
    "comment": "Played more than 10 years ago with a group. Chaotic and fun.",
    "timestamp": 1744581600
  },
  {
    "username": "serginator",
    "rating": 7.0,
    "comment": "Anita's collection (Navalguijo)",
    "timestamp": 1744063200
  },
  {
    "username": "HarryFlashmanKBE",
    "rating": 7.0,
    "comment": "So far everyone I've introduced this to loves it! The rules are easy to grasp, but oh the hilarity and chaos when something goes wrong!",
    "timestamp": 1740870000
  },
  {
    "username": "PolarDad",
    "rating": 7.0,
    "comment": "Elemental coding. Robots. Seems fun at first but wears on me after a few rounds. Still enjoy it but the game seems to have greater potential. RoboRally drags which lowers my enjoyment and rating. Component quality stinks. Modular boards came out of the box warped. Frustration runs high when another player's accidental move ruins your entire round but that is a main part of the game. Just wish the game progressed quicker. Large boards take forever to move across. Forget about playing with multiple boards. Really want to like this game more. My family seems to like it more than me.\n\nLast played 2025",
    "timestamp": 1740783600
  },
  {
    "username": "SteamMan66",
    "rating": 7.0,
    "comment": "A fun programming game that lets you choose the length of the game quite good",
    "timestamp": 1739574000
  },
  {
    "username": "HuckmanT",
    "rating": 7.0,
    "comment": "2025 Here's the thing with Roborally... We probably played this about 50 times in the mid 1990's, and just got burnt out. It's a wonderful game, and the expansions make it much better. Somehow, though, I'm still kind of tired of it. Huh.\nNote: With the expansions (particularly Grand Prix and Armed & Dangerous), this is an \"8\" for me.\nUpdate 08/08: Traded my Roborally expansions to Jim Ginn for a bunch of new games. I will miss them, but his kids are gonna love them!",
    "timestamp": 1738969200
  },
  {
    "username": "jaluth",
    "rating": 7.0,
    "comment": "Chaotic, fast, fun. I played this one loads back in the mid-90s, but avoided getting the expansions - the ones that I tried added unnecessary complexity.",
    "timestamp": 1738796400
  },
  {
    "username": "atillaanddale",
    "rating": 6.5,
    "comment": "There are just better versions of similar things now.",
    "timestamp": 1738364400
  },
  {
    "username": "ricky3350",
    "rating": 7.2,
    "comment": "NV Collection",
    "timestamp": 1738278000
  },
  {
    "username": "AlexSpielrebell",
    "rating": 6.5,
    "comment": "Fun game, the programming is cool, different tactics are possible. It looks chaotic at start, but its pretty good to handle. Don't expect a tactical game.",
    "timestamp": 1737241200
  },
  {
    "username": "Phantomwhale",
    "rating": 7.0,
    "comment": "Part of Roborally collection",
    "timestamp": 1735686000
  },
  {
    "username": "Quayde",
    "rating": 7.0,
    "comment": "All time classic that works best with conscientious or enforced fast pacing. Keep the tracks short!",
    "timestamp": 1732230000
  },
  {
    "username": "Rygel",
    "rating": 7.0,
    "comment": "I like this game. My second favorite race game. Great silly, stupid fun. I like that it holds up to 8 players, because more players means more craziness. Easy to learn and can be played by non-gamers. Can go kind of long though.\n\nGot in 2005 and sold. Got again in 2015.",
    "timestamp": 1731452400
  },
  {
    "username": "LordTengil",
    "rating": 7.0,
    "comment": "A solid classic. Great fun for a while. But after you \"crack\" it, there is not much left. If you have kids around 10-15 years, this is great.",
    "timestamp": 1730070000
  },
  {
    "username": "sanderkerel",
    "rating": 7.0,
    "comment": "Great game with the right people, the right route, if you are in the right mood. But it can be boring if these conditions are not met.",
    "timestamp": 1726092000
  },
  {
    "username": "Tinyish",
    "rating": 7.0,
    "comment": "I've heard this referred to as \"the divorce game\" by some people, including my wife.\n\nThere is no time limit for deciding on your play and so if you don't house-rule one and you have the wrong sort of player at your table then everyone else is going to get bored waiting for them. Aside from that, visualizing five turns ahead tends to be hard for a lot of people. It is easy to make mistakes that will ruin everything, assuming the other players don't do that for you.\n\nIf you're playing with very smart people then this can be a fun game.",
    "timestamp": 1724796000
  },
  {
    "username": "Navidad",
    "rating": 7.2,
    "comment": "Avalon Hill edition ~2010",
    "timestamp": 1724450400
  },
  {
    "username": "Camy_1968",
    "rating": 7.2,
    "comment": "Manejas robots con cartas de dirección,complicándose con disparos entre ellos o casillas de movimientos o muros infranqueables,divertido",
    "timestamp": 1722808800
  },
  {
    "username": "Phantomwhale",
    "rating": 7.0,
    "comment": "#Expansion\n\n(stored with older version)",
    "timestamp": 1721858400
  },
  {
    "username": "DeadFrog",
    "rating": 8.0,
    "comment": "the gold standard for programming games; always a TON of laughing...",
    "timestamp": 1760911200
  },
  {
    "username": "ldd23",
    "rating": 7.5,
    "comment": "Spoken for in BGG.Con Math Trade",
    "timestamp": 1760220000
  },
  {
    "username": "Aftonkatt",
    "rating": 7.9,
    "comment": "programming race game",
    "timestamp": 1760133600
  },
  {
    "username": "Pum_",
    "rating": 7.8,
    "comment": "Best with many players. Crazy wacky fun. Not to be taken seriously. Skilfully craft your move and then watch it all go to hell as other robots bump into you. An ironical hoot!",
    "timestamp": 1759788000
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "A solid game. It's obvious why it's been touted as a classic for so long (although MtG probably has better legs). I really liked the programmed aspects of the game, which I found rewarding when I succeeded and educating when I failed. There's probably more chrome tacked on than is necessary and the game can run longer than desired, but a fun time for a wide range of player numbers.",
    "timestamp": 1759356000
  },
  {
    "username": "Canthor",
    "rating": 8.0,
    "comment": "Excellent game.",
    "timestamp": 1758751200
  },
  {
    "username": "cdefrisco",
    "rating": 7.5,
    "comment": "Loads of fun! I immediately went looking for expansions (not that you need them) and found they were all OOP. I suspect, down the road, I will be generating my own boards to add some spice.\nThe first game I played 2-person with my 10yr. old. He caught on to the gameplay immediately and it ended up being a very close game. We've played with 7 people, one board and 3 flags. Very fun (mayhem). The ages of the players ran from 44 down to 10 with two Moms in the mix. Everyone agreed that it was fun and \"most\" wanted to play again.",
    "timestamp": 1758578400
  },
  {
    "username": "Indy500sr",
    "rating": 8.0,
    "comment": ".compleet\nEAN 653569066811\nIJL1",
    "timestamp": 1757196000
  },
  {
    "username": "revloc06",
    "rating": 7.5,
    "comment": "I love this game, and we will play it occasionally. The problem is the time sink. It just takes too long. I know part of why it takes so long is because we don't play it enough, but that's the catch. We don't play it enough => we don't want to play it. :-) Still a good game though.",
    "timestamp": 1756504800
  },
  {
    "username": "aadepizol",
    "rating": 8.0,
    "comment": "Chaotic but very funny",
    "timestamp": 1755986400
  },
  {
    "username": "ConnerCP",
    "rating": 7.5,
    "comment": "sell",
    "timestamp": 1754431200
  },
  {
    "username": "mighty_scoop",
    "rating": 8.0,
    "comment": "u",
    "timestamp": 1752357600
  },
  {
    "username": "Mayaheine",
    "rating": 8.0,
    "comment": "An action-programming classic.",
    "timestamp": 1749765600
  },
  {
    "username": "DMCote",
    "rating": 8.0,
    "comment": "8",
    "timestamp": 1748037600
  },
  {
    "username": "bggmatje",
    "rating": 8.0,
    "comment": "[December 2017]\nFun beer and pretzel party game where you program the movement of your robot to race other robots through a factory. Of course, when someone bumps your robot, all your plans will be messed up, or maybe improved. Lots of funny moments with this one.\n\nGeekMarket: https://boardgamegeek.com/market/product/3742700",
    "timestamp": 1746741600
  },
  {
    "username": "Theryn",
    "rating": 7.5,
    "comment": "Good condition, Mixed with Armed and Dangerous expansion. Missing some life chits (need to use the extra blank chits that came with the expansion if playing with 7-8 players).",
    "timestamp": 1745964000
  },
  {
    "username": "hyde_70s",
    "rating": 8.0,
    "comment": "In some other more joyful time period Richard Garfield's name would be celebrated and mentioned way more often. This kind of game, in which winning is secondary, and the whole point is actually having fun, now seems like some relic of the past.",
    "timestamp": 1745704800
  },
  {
    "username": "Chris Coyote",
    "rating": 8.0,
    "comment": "I love this one! Very chaotic and interactive game.\n\n04/25: still great, but while the boards are of much better qualitativ, the rest is just superior in the 2024 version. Owning the new version, sold the old one.",
    "timestamp": 1745272800
  },
  {
    "username": "DexGeek",
    "rating": 7.7,
    "comment": "Owner: Dex",
    "timestamp": 1744754400
  },
  {
    "username": "oldgoat3769967",
    "rating": 7.5,
    "comment": "A game for player enragement. One can plan out and program your robot perfectly, then a knucklehead will mess up his play: \"oh I didn't mean to play that program card!\". So their robot is now in the way and obstructing you. I burned my copy in total disbelieve.",
    "timestamp": 1741647600
  },
  {
    "username": "RikHavok",
    "rating": 8.0,
    "comment": "2/25\n\nSleeved with Mayday Standard USA Game 56x87 and Ultra Pro Deck Protectors Standard Black",
    "timestamp": 1740351600
  },
  {
    "username": "tragallamps",
    "rating": 8.0,
    "comment": "Best for 5 players.\nBest for 6 players.",
    "timestamp": 1738796400
  },
  {
    "username": "Penthragore",
    "rating": 8.0,
    "comment": "OK",
    "timestamp": 1738364400
  },
  {
    "username": "Blobsquatch",
    "rating": 8.0,
    "comment": "I play that game for so many years now. One of my favorites. It´s fun how it turns to chaos especially with more players involved. Sometimes it´s hard to limit the boards and checkpoints to cut the playtime a bit shorter.",
    "timestamp": 1737586800
  },
  {
    "username": "HiveGod",
    "rating": 8.0,
    "comment": "A great wad of chaos for those who like their games silly and raucous. It helps a bunch to have a solid visual/spatial imagination, but even then things often go horribly wrong. A real hoot if you're into real hoots. And I am.\n\nUPDATE: Replaced with Robo Rally: 30th Anniversary; gave the 2005 copy to Dave.",
    "timestamp": 1737068400
  },
  {
    "username": "hvg3akaek",
    "rating": 8.0,
    "comment": "great game, new edition is not too shabby",
    "timestamp": 1736809200
  },
  {
    "username": "stevepwalker",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1735945200
  },
  {
    "username": "digitalbeachbum",
    "rating": 8.0,
    "comment": "Great game. I love it because SteveD doesn't like it!",
    "timestamp": 1735426800
  },
  {
    "username": "bachrach44",
    "rating": 8.0,
    "comment": "This is a great game. Appropriate for kids and adults, it combines visual thinking and algorithmic thinking. You program a robot to move through a maze full of obstacles and dangers. If your robot moves off course (say it's pushed by another robot, or you miscalculated how fast it would move on a conveyer belt), who knows where it will end up.\n\nThe game is endlessly customizable (to the point where same more sample setups would be useful), and you will never play the same game twice.\n\nThe main problem with this game is that it is fairly unbalanced, and a lot of the features never get used. There are option cards which can add a lot of fun to the game, but they're so hard to get they almost never come up. Also since there is an advantage to being far away from the other players, if anyone jumps out to an early lead, they usually end up keeping that lead and winning.",
    "timestamp": 1734649200
  },
  {
    "username": "zingano",
    "rating": 8.0,
    "comment": "Such fun with a lot of people in the past, not sure it would stand up today. Score is for past me.",
    "timestamp": 1732921200
  },
  {
    "username": "pezboy",
    "rating": 7.5,
    "comment": "KEEP - Will_Teach",
    "timestamp": 1732230000
  },
  {
    "username": "tphon",
    "rating": 8.0,
    "comment": "Sleeved - Sleeve Kings",
    "timestamp": 1731106800
  },
  {
    "username": "aPilgrim",
    "rating": 8.0,
    "comment": "Fun game if you don't take it too seriously. The wrong crowd can scuttle this one. Watch out for the immature or the directionally challenged.\n[5-6]3-8",
    "timestamp": 1730156400
  },
  {
    "username": "LeifWallsby",
    "rating": 8.0,
    "comment": "4-6",
    "timestamp": 1726696800
  },
  {
    "username": "Lecaro",
    "rating": 7.5,
    "comment": "Robo Rally ist ein Rennspiel, in dem man seinen Roboter von Runde zu Runde programmieren muss, ihn damit über das Spielfeld fahren lässt um am Ende schneller als alle Konkurrenten an den aufgestellten Fahnen zu sein.\nDie Spieler erhalten am Anfang jeder Runde eine Anzahl von Bewegungskarten, die sich nach dem aktuellen Schaden des eigenen Roboters richtet. Dann programmieren alle Spieler mit diesen Karten gleichzeitig ihren Zug in die 5 Slots des eigenen Tableaus. Wer das am schnellsten macht, dreht die Sanduhr um und alle anderen Spieler haben noch knappe 30 Sekunden Zeit selbst fertig zu werden.\nIn der zweiten Phase werden die programmierten Karten eine nach der anderen abgearbeitet und die Roboter bewegen sich entsprechend auf dem Spielbrett. Es kann hierbei auch vorkommen, dass sie sich gegenseitig verschieben oder mit ihren Lasern Schaden zufügen, dann kommt die geplante Programmierung ganz schön durcheinander!\nIch finde das Spiel sehr gut. Ein kleines Manko dabei ist aber, dass alle Spieler ihre Karten von einem gemeinsamen Nachzugstapel erhalten und so kann es vorkommen, dass einzelne Spieler nur Rotationskarten, Andere dafür nur Bewegungskarten erhalten und somit eine ganze Runde unspielbar wird, im Extremfall wird man sogar von einem Förderband in ein Loch verschoben, wenn man keine Karten erhält um von diesem herunterzufahren. Wer in ein Loch fällt verliert Eines von drei Lebenspunkten und muss nochmals von Vorne anfangen!\nDie Neuauflage des Spiels soll dieses Manko bereinigen, indem jeder Spieler ein eigenes Kartendeck erhält.\nDennoch ist das Spiel Großartig und ich spiele es jederzeit und immer wieder gerne.",
    "timestamp": 1726437600
  },
  {
    "username": "schlappy",
    "rating": 8.0,
    "comment": "LOVE IT! Completely unique, at least to me",
    "timestamp": 1724623200
  },
  {
    "username": "MrSmith",
    "rating": 9.0,
    "comment": "Best game ever?\nA definition of fun. Best with fewer players\nGame #18 on BGG\nAt least, this is one of the greatest game of all time.\nThe new editions are awful.\n\nUpdate 2025: still one of the best games in my collection. Remember: small races (2 or 3 flags and boards) are more fun",
    "timestamp": 1760652000
  },
  {
    "username": "Ghosting49er",
    "rating": 8.5,
    "comment": "One of the first boardgames that I bought. I just love the chaos, the little robots and all the mistakes players make while playing this with almost always a surprising winner.",
    "timestamp": 1760479200
  },
  {
    "username": "DiceLord",
    "rating": 9.0,
    "comment": "Board game",
    "timestamp": 1759874400
  },
  {
    "username": "KoolerAidMan",
    "rating": 9.0,
    "comment": "2 - 8 players.\nBest: 4 - 6 players.\n\nSleeved.",
    "timestamp": 1756159200
  },
  {
    "username": "midnightfaerie",
    "rating": 8.5,
    "comment": "2025",
    "timestamp": 1752962400
  },
  {
    "username": "goodknee",
    "rating": 8.5,
    "comment": "Back Shelf",
    "timestamp": 1750456800
  },
  {
    "username": "gusnboobs",
    "rating": 8.5,
    "comment": "***",
    "timestamp": 1748037600
  },
  {
    "username": "MananTheMoon",
    "rating": 9.0,
    "comment": "Bought used at 2025 Pax East (Battleground Games)",
    "timestamp": 1747087200
  },
  {
    "username": "moriarty",
    "rating": 8.6,
    "comment": "Great game. I love the programmed instruction (like Gunslinger) ... I feel like the game is perfect, but, I have to acknowledge that at the end of the day it only gets to the table occasionally due to lack of motivation compared to other games. You have to be in the mood.\n\nSo ... rating lowered a bit.",
    "timestamp": 1742079600
  },
  {
    "username": "cgrie1",
    "rating": 9.0,
    "comment": "One of my favorite games! Keep the map to 1 board.\n\nYou absolutely need to vet who you play this game with.",
    "timestamp": 1738537200
  },
  {
    "username": "Alrami",
    "rating": 9.0,
    "comment": "I love this game even when I end in a pit. Quick thinking and orientation with respect the the board and your robot is essential. There is nothing more satisfying than pushing someone else's robot so they drive themselves inti a pit or off the board",
    "timestamp": 1737673200
  },
  {
    "username": "Spartan519",
    "rating": 9.0,
    "comment": "Fun little robot game. Unique mechanics. Cute robots. A fun light game.",
    "timestamp": 1733439600
  },
  {
    "username": "Kisa",
    "rating": 9.0,
    "comment": "Have:\nArmed and Dangerous\nCrash and Burn\nGrand Prix\nRadioactive",
    "timestamp": 1733353200
  },
  {
    "username": "tickbite",
    "rating": 9.0,
    "comment": "Near-perfect! But even when it isn't, it's probably the most fun you can have with a game. When playing, it becomes less important to actually win, just getting close to where you want to be will feel like a huge success.",
    "timestamp": 1732057200
  },
  {
    "username": "tilouboy",
    "rating": 9.0,
    "comment": "Fun and chaotic. Fun despite being chaotic. Fun because it's chaotic. (Own 2016 version which is not the best)",
    "timestamp": 1729980000
  },
  {
    "username": "pdcarlson",
    "rating": 9.0,
    "comment": "Typical cheap-assification of components by HAS-been-BRO so not as good as the original WotC edition, but it's better than not having it at all...",
    "timestamp": 1724018400
  },
  {
    "username": "cintain",
    "rating": 9.0,
    "comment": "WotC 2nd Ed",
    "timestamp": 1722722400
  },
  {
    "username": "Wombolini",
    "rating": 8.5,
    "comment": "Really wish I didn't give this one away, seeing as all that is left is the second edition.",
    "timestamp": 1719352800
  },
  {
    "username": "Vaken",
    "rating": 8.5,
    "comment": "The miniatures have corroded over the years. I had to clean them and paint them to protect them in 2013.",
    "timestamp": 1718316000
  },
  {
    "username": "Petruscaleus",
    "rating": 9.0,
    "comment": "(E)S",
    "timestamp": 1715464800
  },
  {
    "username": "Euroman",
    "rating": 9.0,
    "comment": "Flags MUST be set up in a crossing network, or the early leader will just get further and further ahead without having to worry about the other players.",
    "timestamp": 1707692400
  },
  {
    "username": "jd9849",
    "rating": 9.0,
    "comment": "2-8 players",
    "timestamp": 1707001200
  },
  {
    "username": "tea93",
    "rating": 9.0,
    "comment": "D6",
    "timestamp": 1702162800
  },
  {
    "username": "unicoherent",
    "rating": 9.0,
    "comment": "Obtained 2011 (post x-mas gift to self)",
    "timestamp": 1701212400
  },
  {
    "username": "Minarchist",
    "rating": 9.0,
    "comment": "IMO the best programming game ever. Sooooo many laughs with this one.",
    "timestamp": 1700953200
  },
  {
    "username": "stray_flux",
    "rating": 9.0,
    "comment": "Played 30+ times. This is my all time favorite game. I love the path planning and efficiency involved. I will admit that there is a problem with leader run away; I need to try a couple games with flag shields. (The flavor text for the robots is humorous) Update: official rating down to 9. **UPDATE** This is clearly very chaotic and definitely not enjoyed by all who play it. It's much more fun with people who enjoy it and on a short map. Won't turn down a game but don't suggest it much anymore. 2010/05/25\nExpansions owned:\nArmed and Dangerous\nCrash and Burn\nGrand Prix\nRadioactive",
    "timestamp": 1698012000
  },
  {
    "username": "andycted",
    "rating": 8.7,
    "comment": "5-7 players\nMake or break a great game by planning good or bad maps. Can't be really very fun in 3, barely in 4.\nUse one square and half of busy maps or two squares in sparse maps. Never really managed to have a lot of fun in 3 square maps, for the entire game, besides 7-8 player games",
    "timestamp": 1697234400
  },
  {
    "username": "murzim",
    "rating": 8.8,
    "comment": "second hand\n\nI finally managed to play this one - having played it years before starting to log my plays on BGG - and my son really liked it asking to play again immediately afterwards. Actually he's really good at the programming, much more than I expected him to be.",
    "timestamp": 1697148000
  },
  {
    "username": "BACCHU5",
    "rating": 8.5,
    "comment": "10+",
    "timestamp": 1696629600
  },
  {
    "username": "SevMoun",
    "rating": 9.0,
    "comment": "As long as you're using the right setup and optional rules, this is my favorite boardgame ever.",
    "timestamp": 1696284000
  },
  {
    "username": "Draconum Commander",
    "rating": 9.0,
    "comment": "7players 8players",
    "timestamp": 1694469600
  },
  {
    "username": "Stephen Glenn",
    "rating": 9.0,
    "comment": "Avalon Hill edition",
    "timestamp": 1691964000
  },
  {
    "username": "JayRa",
    "rating": 9.0,
    "comment": "V6",
    "timestamp": 1691359200
  },
  {
    "username": "RaffertyA",
    "rating": 9.0,
    "comment": "Just plain fun with people that will keep the game moving unless there is a player who only wants chaos and isn't playing to win.\n\nOption cards can be very unbalancing.\n\nUpdate: Win some, lose some. Just wish the expansions were reprinted.",
    "timestamp": 1683410400
  },
  {
    "username": "Aingeru",
    "rating": 8.5,
    "comment": "This was my FIRST ONE...\n\nRoboRally (WotC 2nd Ed)\n+ RoboRally - Radioactive (WotC Ed)\n\n*** 2024 NOT PLAYED ***\n### 2022-2011 NOT PLAYED ###",
    "timestamp": 1682978400
  },
  {
    "username": "Oni no board",
    "rating": 9.0,
    "comment": "My only programming game but I love it. The game can mess with your head and make you laugh even when you screw up really bad. Waiting for the newest version to come out in hopefully 2024.",
    "timestamp": 1676242800
  },
  {
    "username": "4McTavish",
    "rating": 10.0,
    "comment": "E1",
    "timestamp": 1759528800
  },
  {
    "username": "Nodens",
    "rating": 10.0,
    "comment": "This is the best game system. It's been around so long now, there is ways to tweak it to absolute perfection. Schadenfreude - the game.",
    "timestamp": 1754517600
  },
  {
    "username": "Ninjipples",
    "rating": 10.0,
    "comment": "This game is so much fun with a group of friends. just absolute chaos.",
    "timestamp": 1749938400
  },
  {
    "username": "Pyroscope",
    "rating": 9.7,
    "comment": "Simple in concept - pass through checkpoints to complete a course... with robots... that you program in all their moves before they resolve... and you might get lasered or shoved into a pit by another player's robot, often not through their own choice...\n\nChaotic fun, as long as you're not someone who has a problem with other players messing up your plans. Though in fairness to the game, you ought to expect this and make your plan for the turn factor in the possibility of being screwed over.",
    "timestamp": 1740178800
  },
  {
    "username": "Rudger",
    "rating": 9.5,
    "comment": "silly chaos, always fun and a great experience (even if you don't win)",
    "timestamp": 1738364400
  },
  {
    "username": "Jelliottatl",
    "rating": 10.0,
    "comment": "Easily my favorite game.\n2024 Update: my original version was destroyed by Hurricane Helene’s Floods. :-(",
    "timestamp": 1735513200
  },
  {
    "username": "Lou_Crazy",
    "rating": 10.0,
    "comment": "My box was destroyed, I only have the miniatures left",
    "timestamp": 1725573600
  },
  {
    "username": "jbetz45453",
    "rating": 9.9,
    "comment": "A very fun and slightly chaotic game where your best laid plans could be foiled by the cards you get or the other players at times.There can be a bit of a runaway leader problem here but using a decent map setup can help increase the interaction a bit and eliminate some of that.",
    "timestamp": 1725228000
  },
  {
    "username": "brockneil",
    "rating": 10.0,
    "comment": "3rd Edition?",
    "timestamp": 1712095200
  },
  {
    "username": "redarrows",
    "rating": 9.8,
    "comment": "Una figata pazzesca!!! Geniale! Veloce ed immediato. E' frenetico, caotico/imprevedibile e diverso ad ogni partita. In sostanza bisogna ragionare come dei veri programmatori dotati di logica... finquando qualcun'altro non vi tira lo scherzetto sballando del tutto i vostri piani, oppure \"Ohh No! Mi sono confuso... Dove sto andando?\". Grasse risate e colpi di scena! Adatto a tutti i tipi di giocatori, anche se ovviamente un gruppo di BASTARDI si esprime al meglio. Permette di giocare fino ad otto giocatori. C'è la componente fortuna ma è più che surclassata dalla classe che richiede giocare bene e senza prevedibilità. Componenti molto belli (bellissime miniature), la varietà degli scenari, sono tutti elementi che lo rendono unico e dalla longevità infinita. Che cosa altro dire? Può risultare un po' antipatico quando non escono le carte... macchissenefrega! Una pecca, chi rimane indietro difficilmente recupera. Peccato che sia difficile da reperire la miglior edizione, quella della Avalon Hill con sfondo nero. Mito e Leggenda.",
    "timestamp": 1710370800
  },
  {
    "username": "Woopah",
    "rating": 10.0,
    "comment": "1st Ed, bought in 94… wife and I still play, at least, monthly.\nStill looking to get all the expansions (own RADIOACTIVE)",
    "timestamp": 1704236400
  },
  {
    "username": "Misiolak",
    "rating": 10.0,
    "comment": "Once you play in Eternal Team RoboRally League at London BoardGame Club, you will never have enough - 90% of luck, 90% of skills",
    "timestamp": 1701990000
  },
  {
    "username": "Meatballz4k",
    "rating": 10.0,
    "comment": "great game and one of my favourite games of all time. Highly recommend this game and all expansions, but keep in mind the different versions of the game and their different rules. I added some home made rules to make the gameplay a bit better. There are so many modes and maps to play and thanks to the online community and printingservices you can create your own or get rare old ones for cheaper.\n\nIn my opinion the most fun and best game of the many hundreds I've played so far. Every game is an absolute blast",
    "timestamp": 1672354800
  },
  {
    "username": "Corky12",
    "rating": 10.0,
    "comment": "Super clever and entertaining game with nothing but strategy to power it.",
    "timestamp": 1669244400
  },
  {
    "username": "luckyduck322",
    "rating": 10.0,
    "comment": "Gamers Garage Sale",
    "timestamp": 1662933600
  },
  {
    "username": "elephantman13",
    "rating": 10.0,
    "comment": "An old favorite of mine.",
    "timestamp": 1657922400
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "used - normal wear",
    "timestamp": 1643065200
  },
  {
    "username": "Aack",
    "rating": 10.0,
    "comment": "The classic programming game of robotic mayhem.",
    "timestamp": 1639263600
  },
  {
    "username": "gimodude",
    "rating": 10.0,
    "comment": "Inventory",
    "timestamp": 1637362800
  },
  {
    "username": "Gentlementle",
    "rating": 10.0,
    "comment": "I know this game has gotten some heat because the new edition was a bit naff, but it is bloody lovely.",
    "timestamp": 1637103600
  },
  {
    "username": "sirpip",
    "rating": 10.0,
    "comment": "Great game for people with analytical minds and good spatial awareness. It's great to see people mess up or plans go wrong and watch the bots get destroyed!",
    "timestamp": 1635458400
  },
  {
    "username": "Flo00",
    "rating": 10.0,
    "comment": "+ Boards from\n- Avalon Hill edition 2005\n- Armed and Dangerous\n- Crash and Burn\n+ Radioactive",
    "timestamp": 1634940000
  },
  {
    "username": "woodwheels",
    "rating": 10.0,
    "comment": "Love playing this game with a group of programmers. Given how easy it is to get the robot off kilter and into the wrong direction it's always fun to watch your buddies struggle with such 'simple' programs. Add more cards to each sequence to make it a little harder.",
    "timestamp": 1630015200
  },
  {
    "username": "jwanders1",
    "rating": 10.0,
    "comment": "Simultaneous robot programming and chaotic* execution game\n\n*except when Dan manages to write fault tolerant code",
    "timestamp": 1629496800
  },
  {
    "username": "juicer",
    "rating": 10.0,
    "comment": "Fun with up to 8, but it does get a little hectic with that many people. Great mechanisms for damage and movement.",
    "timestamp": 1620770400
  },
  {
    "username": "Quitch",
    "rating": 10.0,
    "comment": "You'll need to design around runaway leader, and you'll probably want to introduce a timer to keep things moving, but God this is just plain, good fun. I recommend letting kids design your courses and adults place your flags.",
    "timestamp": 1620165600
  },
  {
    "username": "BadXmpl",
    "rating": 10.0,
    "comment": "Best boardgame ever.",
    "timestamp": 1614207600
  },
  {
    "username": "Wiikinger",
    "rating": 10.0,
    "comment": "2-8\nBest: 5-6",
    "timestamp": 1601848800
  },
  {
    "username": "Dr Burdie",
    "rating": 10.0,
    "comment": "Box big",
    "timestamp": 1601157600
  },
  {
    "username": "Kavu81",
    "rating": 10.0,
    "comment": "Me encanta. Lo saco ha mesa siempre que puedo",
    "timestamp": 1596405600
  },
  {
    "username": "MrAtoni",
    "rating": 10.0,
    "comment": "Max 8 spelare\n\nSigned by Peter Bergting (Cover art illustrator)",
    "timestamp": 1586296800
  },
  {
    "username": "dpbernath",
    "rating": 10.0,
    "comment": "Played on Dice Tower Cruise 2020",
    "timestamp": 1580338800
  },
  {
    "username": "guard_of_darkness",
    "rating": 10.0,
    "comment": "One of the most fun games to play!\nEveryone who plays it, gets hooked.\nI am so happy to have to original METAL robots!",
    "timestamp": 1577401200
  },
  {
    "username": "SigsPerry",
    "rating": 10.0,
    "comment": "I love this game with a timing device. To easy if your not pressured somehow. First player to finish programming presses the button on our gameclock and the rest have 5 sec. to finish. Evens out the great disadvantage of having locked registers.",
    "timestamp": 1569448800
  },
  {
    "username": "SHUX",
    "rating": 10.0,
    "comment": "**SU&SD Recommends**\nhttps://www.shutupandsitdown.com/games/roborally/",
    "timestamp": 1568152800
  },
  {
    "username": "Cyliss",
    "rating": 9.5,
    "comment": "Awsome game! I don't get to play it nearly enough. Move your robot through a set of flags using personaly selected movement cards. Avoid board hazards and try not to get shot by other players.",
    "timestamp": 1567116000
  }
]