[
  {
    "username": "Pandorzecza",
    "rating": 1.0,
    "comment": "Not worth it",
    "timestamp": 1627596000
  },
  {
    "username": "l111",
    "rating": 1.0,
    "comment": "Pantry",
    "timestamp": 1613516400
  },
  {
    "username": "darkfinale",
    "rating": 2.0,
    "comment": "Uninteresting after a while. Feels so random with the card draws. Not worth replaying.",
    "timestamp": 1744495200
  },
  {
    "username": "Scaaat",
    "rating": 2.0,
    "comment": "Played on yucata, best part was I was allowed to quit. Not nearly enough depth for an area control game. I'm assuming this has a set strat for best outcome. Game can probably be decided midway through second round if I were to guess, honestly bad design for 2 p game.",
    "timestamp": 1736204400
  },
  {
    "username": "Quadenstein",
    "rating": 3.0,
    "comment": "I always loose this game when playing with my wife. She is definitely the better islander.",
    "timestamp": 1753826400
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "Nice look on table and gameplay appeals to my abstract brain, but there is something off in this mix of Go, hand management and drafting from the common market. It appears the dominant strategy is to hoard cards then unleash an explosive attack on an opponent's island to destroy their bridges, rather than attack their bridges piecemeal. This leads to slow tempo play waiting upon the market, as luck of the draw becomes critical to securing the right card for your explosive attack. Would play it again but I don't see this worth long term investment.",
    "timestamp": 1751839200
  },
  {
    "username": "Nodens",
    "rating": 4.0,
    "comment": "Maybe better than my rating, but so what? I don't like abstract two player games much.",
    "timestamp": 1757023200
  },
  {
    "username": "PfrBraun",
    "rating": 4.0,
    "comment": "Kahuna – oder: Relative Hilflosigkeit. Eines vorneweg: Dieser Bericht ist unfair! Verfasser ist sich bewusst, dass es online weitere Regeln zu finden gibt, auch Schifffahrt ermöglichen und so eine weitere Ebene ins Spiel bringen. Das nämlich relativiert die relative Hilflosigkeit. Aber was soll man auch erwarten, wenn man sich Inselpriestern hingibt (selbst, wenn man einen spielt). Das machtvolle Verschlingen der Brücken und Mehrheitssteine ist schon wirklich großartig. Und wo das Spiel hin und her wogt, da ist es einfach faszinierend dabei zu sein. Trotzdem stimmen der Glücksanteil beim Nachziehen über drei Durchgänge mit dem nötigen Rechnen nicht richtig überein. Es ist sicher ein Qualitätsmerkmal der Kosmos 2-Spieler-Reihe, dass der Glücksanteil spürbar ist und sein soll. Aber beim direkten Aufeinandertreffen von zwei Personen sollte es sich am Ende nicht so anfühlen, als hätte doch der Kartenstapel gewonnen. Es ist gewiss Geschmackssache, wie sehr sich einer daran stört – aber man ist doch in den dramatischen Momenten relativ hilflos. Da die Karten ja aber letztlich das einzige Spielelement sind, über das verfügt (bzw. schamaniert) wird, häng ich doch ziemlich am Tropf. Insgesamt sei den Inselpriestern gesagt: Ab und an könnt Ihr Euch mal herausfordern. Aber so richtig Laune macht der repetitive Kampf im Brückenbaugewerbe nicht.",
    "timestamp": 1756504800
  },
  {
    "username": "CannonFodderTed",
    "rating": 4.5,
    "comment": "I really wanted to like this one. The mechanics seemed really good. I don't think it's a bad game. Played it a couple times with my son, who was 9 years old at the time and it just kind of fell flat. Maybe my expectations were just too high for what this game is. To be fair, I think I would have had a better experience playing this with an adult as I am not sure he grasped the strategy needed very well. I will have to play this one some more with adult gamers to see if my rating changes....but for now it earns one \"meh\" and one \"eh, let's play something else\".",
    "timestamp": 1746482400
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "This is all about locking up corners to form unassailable networks of island fortresses. With cards and sticks.",
    "timestamp": 1742857200
  },
  {
    "username": "bm6262",
    "rating": 5.0,
    "comment": "Simple card and area control game with chances for big swingy moves.",
    "timestamp": 1742079600
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √ - Played this on the app, and so didn't feel the need to keep the game",
    "timestamp": 1724968800
  },
  {
    "username": "StupidRatCreature",
    "rating": 6.0,
    "comment": "Digital Version",
    "timestamp": 1760565600
  },
  {
    "username": "optimo65",
    "rating": 6.0,
    "comment": "8 €\nEtelämeren saarien valloitusta kahdelle",
    "timestamp": 1760220000
  },
  {
    "username": "Zachfromohio",
    "rating": 5.5,
    "comment": "Good area control for 2 players. Plays really quick",
    "timestamp": 1754604000
  },
  {
    "username": "gyroscope1045",
    "rating": 6.0,
    "comment": "Sleeved 59x92 (24)",
    "timestamp": 1753394400
  },
  {
    "username": "paimon616",
    "rating": 7.3,
    "comment": "간단하고 재미있다. 이따금 티타임용 게임으로 딱 좋다.",
    "timestamp": 1760652000
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 4002051687618\nIJL3",
    "timestamp": 1757196000
  },
  {
    "username": "pumaman123",
    "rating": 7.7,
    "comment": "Sehr gute App",
    "timestamp": 1759096800
  },
  {
    "username": "shannyn_north",
    "rating": 8.0,
    "comment": "ThinkerThemer, Chris says Nani's fav game",
    "timestamp": 1755813600
  },
  {
    "username": "BaltazarXXX",
    "rating": 9.0,
    "comment": "Played about a dozen games. Great game for two in a small package. The rules are simple, but the game requires strategic thinking, and there is a lot of combinatorics. When I read the rules, the game didn't look promising, but it turned out to be an excellent game. The only drawback is that the cards are of very poor quality (too thin).",
    "timestamp": 1750629600
  },
  {
    "username": "AMERICANBOYBAND",
    "rating": 9.0,
    "comment": "Comments\nHas a fascinating narrative arc. Like Ethnos, I love how each phase feels different from one another: the sprawling mad dashes of the first phase, the heated battle of the second phase, and the tense stalemate of the third phase. All that for a score like 1-0.",
    "timestamp": 1745532000
  },
  {
    "username": "zasizo",
    "rating": 10.0,
    "comment": "A 2024-es év egyik érdekes társasjáték felfedezése ez a lassan 30 éves, mégis friss mechanizmusú, kétszemélyes, területvezérlő játék.\n\nKár, hogy a Kosmos kiadótól sem a Kahuna, sem a Targi nem lett soha Magyarországon kiadva, miközben mindenképpen a legjobb kétfős játékok közé tartoznak.\n\nA tábla szép és hangulatos.\nEredetileg fekete-fehér hidak és korongjelölők vannak benne, ezt én lecseréltem. A piros és narancs színű, az eredetivel teljesen azonos fomájú és anyagú hidak élénkebbek a táblán, így jobban láthatók. Az unalmas korongokat meg piros és narancs fa meeple templomokra cseréltem. Nálam tehát templomok jelölik a trópusi szigetek elfoglalását. Apróság, de kellemesebb a megjelenés a kék-zöld szigvilágban.\n\nA lényeg persze, hogy stratégiai és taktikai döntések terén a játéknak erős a gondolkodásigénye.\n(Túlzott töprengésre hajlamos játékosoknál persze le tud ülni a játékmenet, mivel a játék ritmusa az, hogy lapokat húzogatjuk fel, majd jön egy-egy olyan kör, amikor meg 4-5 lapot is kijátszunk egyszerre, hogy láncolatban átmozgassuk velük a birtokviszonyokat.\n\nA JÁTÉKMENET:\nEgy-egy szigetkártya kijátszása lehetővé teszi, hogy hidat helyezzünk el az adott sziget körül valahová, ha pedig a hidak többsége már a miénk a sziget körül, birtokba vehetjük a szigetet is a jelölőnklel.\nMinden szigetlapból kettő van, és a kártyák háromszor fognak elfogyni a játék során. Ilyenkor jön a 3 pontozó kör egyike, és ekkor lesz fontos, hogy a szigeteket melyik játékos tulajdonolja éppen többségben.\nAzonban ebben a játékban semmi nem örökérvényű, és az ellenfelünk bármikor leveheti valamely hidunkat, ha egyszerre játssza ki az általa összekötött két sziget kártyákát, vagy csak az egyikét, de azt két példányban.\nAmint pedig lekerül egy híd, lehet, hogy az adott színű hidak többsége is megszűnik a sziget körül, akkor pedig a szigetre rakott jelölő is lekerül vele. Ugyancsak levehetjük az ellenfél hídjait a sziget körül, ha épp elfoglaljuk azt a szigetet.\n\nA szerencse szerepe nem elhanyagolható a játékban,\nde ezt felülírja a tudatosan összegyűjtött kártyák célirányos használata, mivel egy megfelelő kártyalánc kijátszásával az ellenfél többségi jelenléte is a visszájára fordítható akár egyetlen kör alatt. Ezáltal pedig egyáltalán nem hivatkozhatunk a rossz lapjárásra és a szerencsére. Viszont jól kell gondolkodni játék alatt, és lehetőleg figyelni, hogy az elmúlt körökben mely lapok voltak kijátszva, mert azok a pontozókörig már nem térnek vissza\n\nEnnél dinamikusabban változó asztalképet, ennél mozgalmasabb változásokat az erőviszonyok terén nem is kívánhatnánk. És mindez egy egészen egyszerű kis játékban. Na, ettől olyan zseniális a Kahuna.",
    "timestamp": 1760133600
  },
  {
    "username": "Undecent",
    "rating": 10.0,
    "comment": "Un excellent jeu à deux qui est devenu un des classique des duos. Si vous aimez les échecs ou les dames, vous adorerez ce jeu. Le format de la boîte s’emmène facilement en vacances. Si vous n’avez pas ce classique dans votre ludothèque, vous devez l’acheter!\n\nhttps://undecent.fr/2020/03/28/kahuna/",
    "timestamp": 1755640800
  }
]