[
  {
    "username": "Rekos",
    "rating": 1.0,
    "comment": "It makes no sense to ever make a boat. It just results in losing a game",
    "timestamp": 1482274800
  },
  {
    "username": "aolimpi",
    "rating": 1.0,
    "comment": "Yawn. Glad to get rid of this.",
    "timestamp": 1422054000
  },
  {
    "username": "Neso91",
    "rating": 2.0,
    "comment": "220927 It makes Catan a little bigger but lacks innovation. A must to try, though. A first step to Expansions",
    "timestamp": 1708470000
  },
  {
    "username": "mkirara",
    "rating": 2.0,
    "comment": "A classic I guess, but I hate the luck element that comes with dice games.",
    "timestamp": 1701730800
  },
  {
    "username": "gwsharkerik",
    "rating": 3.0,
    "comment": "Moves too slow. Not enough happening.",
    "timestamp": 1759788000
  },
  {
    "username": "Tob1One",
    "rating": 3.0,
    "comment": "Plusy:\n+ statki\n\nMinusy:\n- cena a zawartość\n- więcej tego samego - czyli dalej LOSOWOŚĆ gra pierwsze skrzypce",
    "timestamp": 1709506800
  },
  {
    "username": "ikreb",
    "rating": 4.0,
    "comment": "We didn’t like the addition, some things in the maps make us question a lot and didn’t make sense to us.",
    "timestamp": 1759183200
  },
  {
    "username": "sunflowercari",
    "rating": 4.0,
    "comment": "90 minutes\n3-4\nMedium light\n10+",
    "timestamp": 1730934000
  },
  {
    "username": "StrongbowGold",
    "rating": 5.0,
    "comment": "Top",
    "timestamp": 1760738400
  },
  {
    "username": "akinfantryman",
    "rating": 5.1,
    "comment": "My least favorite Settlers expansion. It expands the size of the board, and the time played, for almost no increase in decisions/complexity/variety.\n\nOf course this is my family's favorite. :-(\n\n\nThat said, I HEARTILY recommend this to anyone who really likes base Settlers and just wants to change things up a bit. It's great for that.",
    "timestamp": 1758578400
  },
  {
    "username": "mjhm",
    "rating": 5.0,
    "comment": "in wpg",
    "timestamp": 1758319200
  },
  {
    "username": "Nicolas Weiss",
    "rating": 5.0,
    "comment": "Seefahrer gets a lot of praise for balancing Catan's wares, as wool (arguably the least valuable resource of vanilla Catan) is now necessary for the brand new shipping routes. And to that I have to ask: what the flippity heck? Look, I do understand that in the world of non-interactive modern Euros with Multiple Paths To Victory™, balance is of paramount importance, because players have near-zero leverage to curb underpowered or overpowered game elements. But maybe that by reflexively applying that logic to all of gaming without stopping to think about it for a minute, we're entering brain rot territory. What would balanced resources in Catan achieve? Making them all equally attractive? What is *the point* of that? Did you not notice that the game 1) has a randomised setup that will make some resources more or less scarce on a game to game basis anyway, modulating their value anyway outside the realm of perfect balance and 2) gives its players the freedom to decide of their starting position and decide for themselves what is worth what?\n\nSo, the main attraction is the bunch of scenarios involving a larger playing space. There are bound to be some that you like better than others, it's mostly down to taste, you don't have to play them all, and there is a final fully randomised map to ensure the expansion with all its material is as replayable as the original. However, I prefer the tightness of the original island, and frankly don't find that the extended setup, playing field and play time are worth the hassle. Ultimately, I wouldn't mind playing Seefahrer if asked, but it's certainly not the new default Catan experience you can never come back from, as many of its fans have been claiming.",
    "timestamp": 1747000800
  },
  {
    "username": "Azacan1977",
    "rating": 6.0,
    "comment": "N.º Jugadores: Mejor 3 / OK 4",
    "timestamp": 1753999200
  },
  {
    "username": "shruthony",
    "rating": 5.5,
    "comment": "A: 6\nS: 5",
    "timestamp": 1753221600
  },
  {
    "username": "swampcandy",
    "rating": 6.0,
    "comment": "Not required like C&K feels, but good if you find yourself wanting a larger game and an exploration feel.",
    "timestamp": 1746914400
  },
  {
    "username": "Gwydion19",
    "rating": 6.0,
    "comment": "Didn't feel like it added all that much to base Catan. Every once in a while it's a nice mix up to the regular game but it hardly ever comes off the shelf anymore.",
    "timestamp": 1737068400
  },
  {
    "username": "millsyboy",
    "rating": 7.0,
    "comment": "A good expansion. It adds some variety without adding much complexity.",
    "timestamp": 1761077700
  },
  {
    "username": "PBandJellyfish",
    "rating": 7.0,
    "comment": "@SC",
    "timestamp": 1760824800
  },
  {
    "username": "mikistcro",
    "rating": 8.0,
    "comment": "Good expansion, makes the game a bit more interesting since there are now boats you can use to reach new islands to build your settlements. There is a couple of scenarios to choose from and some new rules to follow that in combination give variety in the game of Catan.",
    "timestamp": 1760565600
  },
  {
    "username": "Ahhhfreakout",
    "rating": 8.0,
    "comment": "5th edition, 2nd printing.",
    "timestamp": 1760479200
  },
  {
    "username": "hanvelsing",
    "rating": 9.0,
    "comment": "Takes a bit longer, but adds additional avenues for skill expression",
    "timestamp": 1760652000
  },
  {
    "username": "Beanreaper",
    "rating": 9.0,
    "comment": "Was skeptical at first but feel like it adds just enough to keep the spirit of the orginal buy expanding on it just enough to keep my interest.",
    "timestamp": 1760565600
  },
  {
    "username": "wooloo1",
    "rating": 10.0,
    "comment": "My preferred way to play Catan. Opens up the map. Balances the value of sheep. Minimal additional rules load. Longer playtime but not too much.",
    "timestamp": 1759960800
  },
  {
    "username": "TeamSOLUNE",
    "rating": 10.0,
    "comment": "Amazing. Though it takes forever to set up",
    "timestamp": 1757887200
  }
]