[
  {
    "username": "Double Dan",
    "rating": 1.0,
    "comment": "This game uses my least favorite genre (area-influence). Combine that with the fact the game just did not work. The mechanics seemed broken to me. I'm hoping we missed something in the English translation. I can't believe a game could be this bad. We had to scrap our game in progress. I rarely rate a game a 1, but this one deserved it.",
    "timestamp": 1153519200
  },
  {
    "username": "Ragnarok77",
    "rating": 1.0,
    "comment": "where are the bishops?\nwhere is the interactions between players?\ni don't like the mechanics",
    "timestamp": 1101337200
  },
  {
    "username": "Bil Anton",
    "rating": 1.0,
    "comment": "I just don't like it.",
    "timestamp": 1078268400
  },
  {
    "username": "imoo",
    "rating": 2.0,
    "comment": "邦題：　王と枢機卿",
    "timestamp": 1447369200
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "* Played 10+ times. Heavy strategy. Quick, which is good, but is quite dry. My opinion has improved slightly, but I still think the map is to limited for extended replay. (Certain alliances are always worth gunning for.) Tense game though.",
    "timestamp": 1416697200
  },
  {
    "username": "davedanger",
    "rating": 2.0,
    "comment": "As bad as China. Luck in card draw & luck in player's\nscrewing choice. Utter crap. Decreasing choices like Puerto Reeko, no theme, no real player interaction.\nZZZZZZZZZZZZZ.",
    "timestamp": 1345500000
  },
  {
    "username": "Bagherra",
    "rating": 3.0,
    "comment": "the game is okay but group can make a huge difference.",
    "timestamp": 1745272800
  },
  {
    "username": "haraggan",
    "rating": 3.0,
    "comment": "You spend an hour putting pieces of wood on a board. At the end of the hour you get points for how well you put the wood on the board. There is strategy, but it seems to me it's strategy attached to a pointless and colourless task. Only an Adam Sandler movie, I think, would be a less pleasant use of my leisure time.",
    "timestamp": 1630274400
  },
  {
    "username": "jcb231",
    "rating": 3.0,
    "comment": "I just don't like it, and I can't even fully articulate why. It's just...meh...not good. I don't have any fun playing it at all.",
    "timestamp": 1191967200
  },
  {
    "username": "Pandorzecza",
    "rating": 4.0,
    "comment": "Dziwna",
    "timestamp": 1624744800
  },
  {
    "username": "malts_y",
    "rating": 4.0,
    "comment": "王と枢機卿",
    "timestamp": 1553295600
  },
  {
    "username": "ratbulogg",
    "rating": 4.0,
    "comment": "It comes down to drawing duplicate cards. First player needs some compensation too.",
    "timestamp": 1525212000
  },
  {
    "username": "oursino",
    "rating": 5.0,
    "comment": "Pour matheux qui aiment calculer la meilleure combo permettant de gagner un max de points … Attention aux joueurs qui réfléchissent trop, ça devient long.",
    "timestamp": 1744840800
  },
  {
    "username": "hoonga",
    "rating": 5.0,
    "comment": "3인 영향력 게임의 고전.",
    "timestamp": 1680818400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "I highly prefer Han as it is more developed with more avenues of scoring, but still relatively slim. But Web of Power is still a joy to play.\n\nI am very tempted to get this for the European map, and import Han rules in this game.\n\n==================\n\nOriginal comment from Han:\n\nThe best light area control game in my collection. It even fired Ethnos. The scoring is very cute and novel, but gives you interesting choices, as it prevents players from just monopolising the board.\n\nThe multiple ways of scoring is brilliant. You have to think of one action which allows you to advance yourself on multiple scoring avenues.\n\nA masterpiece design from Schacht. I will keep this forever.",
    "timestamp": 1672095600
  },
  {
    "username": "hippiephysicschick",
    "rating": 5.0,
    "comment": "free/gift",
    "timestamp": 1667602800
  },
  {
    "username": "Deeevorce",
    "rating": 5.0,
    "comment": "A bit too abstract. Sold",
    "timestamp": 1578178800
  },
  {
    "username": "dr glaze et al",
    "rating": 5.0,
    "comment": "[Schacht] Dry? Maybe.. yet a great little 40-minute game for 3 or 4. Simple turn decisions move the game along quickly, and scoring makes game less cutthroat than many similar ones. More and more seeing Schact as a great designer... very few simple rules yet delicious decisions you must make to steer your way through the game.",
    "timestamp": 1552777200
  },
  {
    "username": "lexen",
    "rating": 6.0,
    "comment": "I feel that china is an improvement...\nI like the china board and bits a little better but think something got lost with the 4 cards face up pile...",
    "timestamp": 1749506400
  },
  {
    "username": "getareaction",
    "rating": 6.0,
    "comment": "Rating based on one play.",
    "timestamp": 1739833200
  },
  {
    "username": "hiimjosh",
    "rating": 6.0,
    "comment": "(Played at 3p and 4p; stick to 3)\n\nA little less good than I was expecting (after playing Han). It’s different. Playing this made me realize a couple of things which I actually appreciated more in Han (port towns, a little bit more agency). I like both. Web of Power is a bit more elegant, but I think Han has a touch more to think about.",
    "timestamp": 1738537200
  },
  {
    "username": "SkyGlad",
    "rating": 6.0,
    "comment": "Good game, though honestly can take a little long for what it is. But I appreciate the simplicity of the area control and network building in it. I wonder about whether the card system could be better, but its simplicity works well together with the simplicity of the other two mechanisms.",
    "timestamp": 1734908400
  },
  {
    "username": "lulu35",
    "rating": 6.0,
    "comment": "!3-5J\n=Kardinal&König (reimpl vy China , Han )\nonline x3 (http://www.onlinebrettspiele.de/kuk/ against AI)",
    "timestamp": 1732575600
  },
  {
    "username": "ebweb",
    "rating": 6.0,
    "comment": "7 euro",
    "timestamp": 1704409200
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Solid game which has multiple prints that did mot ever catch fire",
    "timestamp": 1759615200
  },
  {
    "username": "ousgg",
    "rating": 6.8,
    "comment": "Excellent, tight area control with less need for one-upmanship than El Grande. It took a long time for this one to get onto my radar, but I'm glad it did.",
    "timestamp": 1754776800
  },
  {
    "username": "Ephorus",
    "rating": 7.0,
    "comment": "What I like:\n- Somehow I really grok the map. Very beautiful to my eyes and better than the other iterations of this game.\n- The scoring alternatives make this game amazing.\n- Fast turns, usually low AP.\n\nWhat I dislike:\n- Drawing luck is definitely present in this game. Sometimes having the right cards is crucial and it's brutal if one keeps getting access to unwanted cards. Some turns in which one can lay only one monastery can really make one miserable. This should affect everyone, but of course I had it much worse than my opponents haha.",
    "timestamp": 1751580000
  },
  {
    "username": "Board22gamer22",
    "rating": 7.6,
    "comment": "R 7.3, w 2.3\nPlayer 2x, with Kirou, 11.10.2025, got from Ludothek gratis. Cool, easy to learn, interdependent, requires thinking but elegantly simple.",
    "timestamp": 1760220000
  },
  {
    "username": "adamolanna",
    "rating": 8.0,
    "comment": "Bellissimo, secondo me è strategico al punto giusto, sempre vario, interessante.",
    "timestamp": 1755122400
  },
  {
    "username": "warlock000",
    "rating": 8.0,
    "comment": "Fast and fun! A very pure area majority game with simple, yet clever scoring. It has a decent amount of randomness, but I didn't mind it at all as it keeps things light. It's quick and engaging, you can finish a 3-player game of Web of Power in less than 30 minutes.",
    "timestamp": 1752703200
  },
  {
    "username": "greenlotus284",
    "rating": 8.5,
    "comment": "極めて美しいゲームデザイン。",
    "timestamp": 1759442400
  },
  {
    "username": "cannoneer",
    "rating": 9.0,
    "comment": "Only one play of a game that has been a grail game for me for over 20 years. I finally picked it up for $60 plus shipping, and it was worth every single penny. Just an incredible experience in streamlined, efficient design where every decision is fraught with immense import. Absolutely fantastic.",
    "timestamp": 1756418400
  },
  {
    "username": "lorna",
    "rating": 9.0,
    "comment": "The game I have played the most. My favorite board game for 3.",
    "timestamp": 1748901600
  },
  {
    "username": "silenceisgolder",
    "rating": 10.0,
    "comment": "My favorite version of one of my favorite board game systems. The restriction created by 2-card market makes the game a bit more lucky and harder to control, but also more fun. When you can't always count on playing a wild to get two pieces down, the single-piece plays (to open a region or bolster an Advisor majority) require less tempo sacrifice which adds a layer to the tactics.",
    "timestamp": 1745791200
  },
  {
    "username": "RX13000",
    "rating": 10.0,
    "comment": "Franchement il est au top. Je n'ai pas CHINA ou HAN mais j'ai IWARI car il est très beau mais je joue toujours à celui là. à 2 il fonctionne très bien il faut prendre la variante 2 joueurs de IWARI. 3 joueurs maximum pour Kardinaal & Koning car la carte est trop petite si non.",
    "timestamp": 1683583200
  },
  {
    "username": "skeuri",
    "rating": 10.0,
    "comment": "Excellent. Simple yet engrossing. Very high turn-angst. The entire game can change with just one move.",
    "timestamp": 1673996400
  }
]