[
  {
    "username": "vinayplusj",
    "rating": 1.0,
    "comment": "Deserves the bad ratings",
    "timestamp": 1731366000
  },
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "An perfect upchucking for the mentally disturbed.",
    "timestamp": 1696197600
  },
  {
    "username": "JoeHandle",
    "rating": 1.0,
    "comment": "Wannabe \"edgy\" '90s shite.",
    "timestamp": 1652220000
  },
  {
    "username": "p00q",
    "rating": 1.0,
    "comment": "Just \"Mean: The Game\" for no reason.",
    "timestamp": 1649109600
  },
  {
    "username": "Pandorzecza",
    "rating": 1.0,
    "comment": "Not for me",
    "timestamp": 1630447200
  },
  {
    "username": "jqxz4fun",
    "rating": 1.0,
    "comment": "One of the stupidest things I have ever been talked into buying. A game about bullying kids in a school ground and stealing their money. I'm embarrassed that I bought it. Not funny at all.",
    "timestamp": 1615935600
  },
  {
    "username": "stiivburns",
    "rating": 1.0,
    "comment": "The art and theme literally disgust me. Rules are obscure.",
    "timestamp": 1579647600
  },
  {
    "username": "sburns",
    "rating": 1.0,
    "comment": "The game play is meh, but the rules, graphic design, and ergonomics are disgraceful. That would make it a 3. But the theme and art are straight disturbing. Beat it. Just beat it.",
    "timestamp": 1544223600
  },
  {
    "username": "doctor poo",
    "rating": 1.0,
    "comment": "Not a game. It's trying to be rock/paper/scissors but nothing on the cards imply what beats what. It is not intuitive. You must have the rules open at all times and, even then, your choices are unimportant. Awful. Just. Awful. Blah.",
    "timestamp": 1468274400
  },
  {
    "username": "TheForgottenTaxi",
    "rating": 1.0,
    "comment": "It is really disturbing how much I hate this game. Games shouldn't make you feel this kind of thing. It's just a game and yet...\n\n...and yet it's a random, vapid, uninspired design that looks absolutely hideous to boot. And yet otherwise intelligent (non-gamers) I know love it because \"It's about Catholic school girls beating each other up! Isn't that funny?\" And you know, it might be, if that theme came at across at all in either the graphic or game design! And to top it all off, why the hell don't the cards just say what they do on them? You expect me to memorize things to play this terrible game?!",
    "timestamp": 1446764400
  },
  {
    "username": "Boltana",
    "rating": 1.0,
    "comment": "No real game here.",
    "timestamp": 1430258400
  },
  {
    "username": "bosworthdelajive",
    "rating": 1.0,
    "comment": "After playing this 2-player I'm not impressed, and it'd probably be worse with more people. I'm sure it takes the right group to make fun, but given that right group I think there are more fun games you could play.",
    "timestamp": 1401141600
  },
  {
    "username": "MrMonkey",
    "rating": 1.0,
    "comment": "Got it cheap on sale, poorly designed. No reminder/rule text on cards so memorization is required to play meaning constant searching through rules. The concept behind the game is solid, however with poor implementation it will never be played.",
    "timestamp": 1393801200
  },
  {
    "username": "krakrs",
    "rating": 1.0,
    "comment": "Stupid. Stupid. Stupid.",
    "timestamp": 1393542000
  },
  {
    "username": "mmychal",
    "rating": 2.0,
    "comment": "This is a great game-between-games or a game you play when one of your bigger strategic gaming sessions ends early. No, there isn't much strategy but the gameplay is quick and can get the adrenaline going when it's down to a few people at the end. Another game not for those needing a lot of strategy but this is one of the most social games I've played. It encourages banter and a lot of laughing around the table as we all talk trash to each other when playing.",
    "timestamp": 1749592800
  },
  {
    "username": "TeChNoWC",
    "rating": 2.4,
    "comment": "Where do I start. Lunch Money expects you to bring the game to a framework which it provides, which is akin to Fluxx but without anything interesting. There are some strategic choices, which is it's only saving grace, but I have almost nothing else good to say. Small hand size, luck of the draw, no idea what opponents have, requires the user to 'make shit up' to actually deliver the theme, and the components, so bad. There is no reference on the cards as to what they do, other than some limited symbology (name, number and colour/type) but to know what anything does, you are constantly checking the rules or asking an experienced player (and who would ever want to play it that much that they would know). Light card games are meant to be accessible, not forcing players to constantly rules check. The art is pretty lame, the quotes are somewhat interesting but I am really not feeling the theme. Oh and the worst part about the components? They couldn't even bother to provide you with counters. Most games go out of their way to provide even non-critical components so you are getting value for your money, but Lunch Money doesn't even provide you with it's titular components - nope, no lunch money to be seen. But it's alright, you can provide. So what are we paying for?",
    "timestamp": 1629496800
  },
  {
    "username": "brumcg",
    "rating": 2.0,
    "comment": "I like this as a quick filler; the theme is crass, but can be humorous.",
    "timestamp": 1558476000
  },
  {
    "username": "valar12",
    "rating": 2.0,
    "comment": "It's a lifeless game, but I can't manage to trade it to anyone.",
    "timestamp": 1528668000
  },
  {
    "username": "wolfgang dostmann",
    "rating": 2.0,
    "comment": "GOF 2013. I kill you, you kill me.",
    "timestamp": 1471125600
  },
  {
    "username": "pjr86",
    "rating": 2.0,
    "comment": "Strange theme. Mindless gameplay. 30 minutes of my life I'll never get back.",
    "timestamp": 1447110000
  },
  {
    "username": "Wormaap",
    "rating": 2.0,
    "comment": "Please don't ever make me play this again. The theme is meant only to shock, artwork is hideous, rules are obfuscated and card design is terrible. Why do I need to look up what a card does in the rule book, while there is plenty of space on the card itself? Because the designer chose ugly artwork over a playable game, that's why.",
    "timestamp": 1438552800
  },
  {
    "username": "noradrenalin",
    "rating": 2.0,
    "comment": "Basically, this game really sucks. The artwork is really nice, though - so I use the cards as pretty bookmarks.",
    "timestamp": 1422140400
  },
  {
    "username": "ptarth",
    "rating": 2.0,
    "comment": "Random Filler that takes too long for what it is. Draw and play, repeat.",
    "timestamp": 1404338400
  },
  {
    "username": "AdmiralCrunch",
    "rating": 2.0,
    "comment": "(B&L Own)\n\nWeird game where you play kids battling on a playground. The artwork and theme are a bit disturbing. Wasn't very impressed with the gameplay either. Not interested in playing it again.",
    "timestamp": 1388617200
  },
  {
    "username": "mentis",
    "rating": 2.0,
    "comment": "Horrible theme with mediocre game play.",
    "timestamp": 1362956400
  },
  {
    "username": "dancingdanslc",
    "rating": 2.0,
    "comment": "Dark and boring, I don't know what happened to it and I don't care...",
    "timestamp": 1362178800
  },
  {
    "username": "asta",
    "rating": 2.0,
    "comment": "Simply awful. Can't think of a single redeeming feature of this game. Oh wait... the small box would take up little space in a landfill.",
    "timestamp": 1350770400
  },
  {
    "username": "boomtron",
    "rating": 2.0,
    "comment": "I hate the game, as it was just endless take that, and I hated the functionality of the cards, and I hated the theme. Ugh.",
    "timestamp": 1335736800
  },
  {
    "username": "EmeraldYam",
    "rating": 3.0,
    "comment": "10 years on... Objectively a pretty crap game with a very crap theme, but one of the first non-traditional card games I discovered back in college. Wouldn't touch it now, though.",
    "timestamp": 1717624800
  },
  {
    "username": "SeanC",
    "rating": 3.0,
    "comment": "Pointless.",
    "timestamp": 1665007200
  },
  {
    "username": "Kellbot",
    "rating": 3.0,
    "comment": "I remember really liking this in high school, but the lack of useful information on the cards makes it unplayable if you're with folks who haven't played it before. Would love to see a re implementation with better card information.",
    "timestamp": 1581807600
  },
  {
    "username": "eimative",
    "rating": 3.0,
    "comment": "Why such a sad Ameritrash game had the honor of being the game we took to Europe (many many years ago) and got played in the cafeteria of Paris' Pompidou is truly tragic. It is the epitome of style over substance, yet to that end I gave it a slightly higher rank for badass theme and artwork.",
    "timestamp": 1549753200
  },
  {
    "username": "markbesada",
    "rating": 3.0,
    "comment": "(1/19) 3.",
    "timestamp": 1548802800
  },
  {
    "username": "dragonmilk",
    "rating": 3.0,
    "comment": "Mechanics beyond wretched\n\nGuess the cards look ok though",
    "timestamp": 1507327200
  },
  {
    "username": "Werbaer",
    "rating": 3.0,
    "comment": "4 for gameplay. -1 for theme.",
    "timestamp": 1467669600
  },
  {
    "username": "DmitriSmekhov",
    "rating": 2.9,
    "comment": "A bunch of people in my gaming circle somehow think this game is worthwhile. Even the seasoned players had to regularly look up what certain cards do and figure out which cards you can even play at a specific time. It's not bad enough to be good in a kitchy way (unlike John Waters movies). It's just not a good game.",
    "timestamp": 1443564000
  },
  {
    "username": "Overexposed",
    "rating": 3.0,
    "comment": "Do not want. Way too much to remember that should be written right on the cards.",
    "timestamp": 1427752800
  },
  {
    "username": "Ilthuain",
    "rating": 2.5,
    "comment": "Cool art. Dumb game.",
    "timestamp": 1417042800
  },
  {
    "username": "mikee385",
    "rating": 3.0,
    "comment": "It sounds like a fun filler game at first and, in fact, was very well received in our gaming group. But during the game, the stronger players often team up to eliminate the weaker players, which results in a number of people simply waiting around for a new game to start. When it got down to two players, it took a ridiculous amount of time for the game to end, as both players would hoard the blocking cards and simply block all their opponent's attacks. The creative aspect of the game is also fun at first, but quickly fades like our excitement for this game. This one hasn't hit the table in a long time and probably won't anytime soon.",
    "timestamp": 1405548000
  },
  {
    "username": "R Taylor",
    "rating": 3.0,
    "comment": "Neal Owns",
    "timestamp": 1401573600
  },
  {
    "username": "Fuwjax",
    "rating": 3.0,
    "comment": "a novel game. some find it offensive, the rest, boring.",
    "timestamp": 1398722400
  },
  {
    "username": "cbdarden",
    "rating": 3.0,
    "comment": "Really boring, meh theme.",
    "timestamp": 1377036000
  },
  {
    "username": "muzrobertson",
    "rating": 4.0,
    "comment": "Nostalgia keeping a bad game from rating downwards.",
    "timestamp": 1736463600
  },
  {
    "username": "Rygel",
    "rating": 4.0,
    "comment": "Quick and easy card game of friend stomping. Always played with the Sticks & Stones expansion.\n\nGot in 2006",
    "timestamp": 1731366000
  },
  {
    "username": "Kallipygian",
    "rating": 4.0,
    "comment": "I like the banter that comes with it, but the constant referencing of rules can be kind of tiresome. There's no actual gameplay text on the cards, so you have to know the rules by heart in order to rounds to go more quickly.",
    "timestamp": 1731366000
  },
  {
    "username": "kevinj",
    "rating": 4.0,
    "comment": "A good filler, also good if you have multiple decks for large numbers playing in teams. I've played this with up to 12 and it can get quite raucous, especially if you insist on people accomanying each action with an appropriate playground insult.",
    "timestamp": 1698706800
  },
  {
    "username": "Morph Mode",
    "rating": 4.0,
    "comment": "Used to play a lot with the NoVA crew in 99-early 2000s. But the game had some problems and hasn't held up well. I can't even remember the last time I played. The container is all busted and some cards are probably missing so I just pitched it. Thanks for the memories and humiliations Lunch Money.",
    "timestamp": 1653256800
  },
  {
    "username": "Stexe",
    "rating": 4.0,
    "comment": "I can see how some people would find the theme and artwork to be disturbing and tasteless. However, I quite enjoy the artwork (the theme is meh). The dark atmosphere seems more like demon children of darkness than people picking on each other for lunch money... but either way the game is pretty blah. Not much involved besides knowing when to hold cards and when to go all out. Since it is an FFA, politics are heavily involved and the game is less about the actual game, and more about getting people to not attack you.\n\nNot my type of game, regardless of the theme.",
    "timestamp": 1643842800
  },
  {
    "username": "Erotectic",
    "rating": 4.0,
    "comment": "Not a fan of the total take-that nature of this one.",
    "timestamp": 1612566000
  },
  {
    "username": "eblack",
    "rating": 4.0,
    "comment": "2-4",
    "timestamp": 1587938400
  },
  {
    "username": "Beyak",
    "rating": 4.0,
    "comment": "BURNED IN FIRE, OCTOBER 2017",
    "timestamp": 1556056800
  },
  {
    "username": "Teppolainen",
    "rating": 4.0,
    "comment": "A free-for-all, number based 'fighting' card game. Reminds me a bit of Steve Jackson games - add modifier on modifier, make difficul & overly complicated combinations of the cards to carry out the best possible attacks, only to have them cancelled by your opponents time and time again as the game drags on and on. The theme and artwork didn't get me at all, either.",
    "timestamp": 1551913200
  },
  {
    "username": "savagec",
    "rating": 4.0,
    "comment": "Completely imbalanced, take that game. If that is what you are into...great.",
    "timestamp": 1527976800
  },
  {
    "username": "Iocaine",
    "rating": 4.0,
    "comment": "2-4 players. In deck box with the expansion, DO not have orig box.",
    "timestamp": 1522360800
  },
  {
    "username": "Majestic One",
    "rating": 4.0,
    "comment": "It's aiight. The premise is clever, a brawl for your money. Battle using cards and vicious attacks and defenses. However the art is dark and difficult to follow and the text can be a nightmare. Rules are simple but the rule book is challenging.",
    "timestamp": 1519254000
  },
  {
    "username": "thieslo",
    "rating": 4.0,
    "comment": "This game was a lot of fun initially, but only if you have decent story tellers in the group. If you have a group that just tells you what they played and leave it at that this game is very simple and not very enjoyable.",
    "timestamp": 1514847600
  },
  {
    "username": "Kiyote",
    "rating": 5.0,
    "comment": "Gen Con 2005",
    "timestamp": 1739919600
  },
  {
    "username": "Fysst",
    "rating": 5.0,
    "comment": "Tony",
    "timestamp": 1710630000
  },
  {
    "username": "USSAwesome",
    "rating": 5.0,
    "comment": "Twenty years ago I used to play Lunch Money all the time, unaware that a golden age of board games was silently blooming all around me, offering far more colorful and interesting options. It’s a “take that” combat card game that features player elimination. There are two primary types of cards: offense and defense. Successful play requires a balance of both, since an opponent will defend themselves and, if possible, reverse the attack. Every player starts with 15 health counters (not provided - I always used pennies), which are lost to the center of the table when damage is taken. Health can be recovered by playing First Aid cards. There are “Humiliation” cards in the deck which function as trumps - they can only be countered by other Humiliation cards. The instructions encourage you to accompany these cards with a verbal description of the degrading attack you are dishing out, but I was never interested in this sort of forced creative narration. Play moves very quickly around the table, and occasionally a back and forth tussle can burn through quite a few cards before someone breaks the stalemate. The game makes pretty good thematic sense, especially some of the more complicated combos and attack cards with lasting effects. However, adding a tasteless “Pimp Slap” card was a rotten decision, and one that does not conjure up images of a scuffle between grade school girls. The artwork is awful, and the muted colors make differentiating card types a real chore. I would love to see this game redone with a more cartoony, playful aesthetic that focuses on the absurd humor of the theme. Then again, I wouldn’t buy a copy because Lunch Money is a one-note game that gets stale as quickly as a peanut butter sandwich in an open baggy.\n\nUpdate: Sold on October 17, 2022. I would be embarrassed to teach this game. It’s nothing more than a college memory now, like buying import CD singles at the local record store, playing marathon sessions of Perfect Dark on Nintendo 64 or, to a far lesser extent, studying for a blue book essay exam.",
    "timestamp": 1666044000
  },
  {
    "username": "frankinla",
    "rating": 5.0,
    "comment": "Card game; disturbing graphics. Haven't tried yet. Cards creep out my wife who won't play it. Have heard from a friend that it's a fun game, which prompted me to buy it.",
    "timestamp": 1664920800
  },
  {
    "username": "Sky Knight X",
    "rating": 5.0,
    "comment": "Run-of-the-mill 'take that' card game with unique theme and artwork.",
    "timestamp": 1638918000
  },
  {
    "username": "Procyon_lotor",
    "rating": 5.0,
    "comment": "Small game",
    "timestamp": 1638054000
  },
  {
    "username": "AceXT",
    "rating": 5.0,
    "comment": "Barely existent game kept only somewhat afloat by cutesy-spooky style.",
    "timestamp": 1627596000
  },
  {
    "username": "animeinme",
    "rating": 5.0,
    "comment": "Fun little game of back and forth once both players understand the rules.\n\nNot recommend to introduce to new board gamers.\n\nUnfortunately the set up is annoying because you need to get a bunch pennies/loose change to actually make the game work well. Otherwise I would probably play it more often.",
    "timestamp": 1621461600
  },
  {
    "username": "gar0u",
    "rating": 5.0,
    "comment": "Played a lot of this in college.",
    "timestamp": 1620338400
  },
  {
    "username": "repthrd",
    "rating": 5.0,
    "comment": "One of the first games I ever got when working at the Comic shop...not sure I ever played it.",
    "timestamp": 1611788400
  },
  {
    "username": "nosprings",
    "rating": 5.0,
    "comment": "Didn't realize it was this old! Was a staple amongst my friends in high school. We all had recurring characters and played where we left off in between drama rehearsals.\n\nInfuriating that the cards do not list special rules, but having an actual game was never really the focus.\n\nAhhhh miss those days!",
    "timestamp": 1605394800
  },
  {
    "username": "Unfinished",
    "rating": 5.0,
    "comment": "If you are a Catholic school refugee, or ever had to deal with hostile cliques in junior high, this game will provide some much needed catharsis. Otherwise, it is an amusing enough card game that can be hilarious with an enthusiastic group or drop-dead boring for anyone else.",
    "timestamp": 1582153200
  },
  {
    "username": "partangel",
    "rating": 5.0,
    "comment": "shelf wear - some box fading",
    "timestamp": 1581894000
  },
  {
    "username": "ksaarto",
    "rating": 5.0,
    "comment": "This was fun in the 90s, but its way too complex now. Needs a frickin flow chart to play this right.",
    "timestamp": 1561068000
  },
  {
    "username": "JankyToys",
    "rating": 4.5,
    "comment": "I just randomly found my copy and was taken back to college when we used to play this a fair amount. The game itself is nothing special, a quick brawler that can be fun. The graphic and card design, however, is TERRRRRIIIBBBBLLLLEEEE. Certain cards only work against other cards, others can only be used as part of combos, and NONE of this information is printed on the cards. We had to make cheat sheets for it, and even with those the game is slowed the game down immensely whenever someone needs to check a card, which is frequently. This game would probably never hit the table except that we discovered that Playing with real money (even just quarters or dimes) makes the tension, interaction, and fun level greatly (and thematically) amplify. Would I just play this? Nope. Would I play it in the right company with a stack of one dollar bills? Definitely. So with real money and the right company this would get a 6. Otherwise it gets like a 3. So I'm giving it a 4.5 as the middle ground.",
    "timestamp": 1545174000
  },
  {
    "username": "ironsoap",
    "rating": 5.0,
    "comment": "Kind of a meh game, mechanically, it's far more enjoyable than it ought to be by virtue of it's incredibly dark (offset just the right amount with some cheekiness) theme. It's even better when the players can role-play with it a little. If it were a bit quicker moving it would make for a nice warm-up game to something spooky, as it stands it's more of a quick pick-up-and-play in between sessions at a convention and not much else.",
    "timestamp": 1538431200
  },
  {
    "username": "Thegreatrob",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1536184800
  },
  {
    "username": "jellypantz",
    "rating": 5.0,
    "comment": "A classic darkly themed silly little take-that card game.",
    "timestamp": 1516489200
  },
  {
    "username": "discoking7",
    "rating": 5.0,
    "comment": "Once you stop chuckling over the flavor text, you realize how boring the game is.",
    "timestamp": 1512514800
  },
  {
    "username": "Astral_Complex",
    "rating": 5.0,
    "comment": "It's lunch money. I have a fondness for this game from my college years. It is not a good game though. Pretty boring stuff. Just the nostalgia factor.",
    "timestamp": 1485903600
  },
  {
    "username": "toothygrim",
    "rating": 5.0,
    "comment": "A fun game. Too bad they didn't see fit to put card effects ON the cards or this would get a higher rating.",
    "timestamp": 1485471600
  },
  {
    "username": "Petrov_101",
    "rating": 5.0,
    "comment": "The cards are creepy... but not a fan of \"take that\" games. If you just want to trade blows, this game can be entertaining tho. I'm not usually in the mood for that type of game but can be convinced to play if others are clamoring to.",
    "timestamp": 1483225200
  },
  {
    "username": "TaijiJohn",
    "rating": 5.0,
    "comment": "Sold at Pacificon 2016.",
    "timestamp": 1473112800
  },
  {
    "username": "roguefrog",
    "rating": 5.0,
    "comment": "A game with creepy art I no longer really play.",
    "timestamp": 1442527200
  },
  {
    "username": "afrikaner",
    "rating": 5.0,
    "comment": "Lo tuve y lo vendí",
    "timestamp": 1422313200
  },
  {
    "username": "DarthHenryAllen",
    "rating": 4.5,
    "comment": "I'm really disappointed that there is not more information printed on the cards. Reminder text, symbols, and/or keywords on the cards (like Magic: The Gathering, Bang!, and many other card games) would have REALLY helped this game. In terms of gameplay; hand management, tactics, and perhaps diplomacy have their roles but chaos and luck seem to be the dominating factors in deciding the winner. The satisfaction comes not from out strategizing or maneuvering your opponents but from pimp slapping them and putting them in head locks.\n\nWith the right group (and perhaps the right beverages) not looking for a competitive game this should be good for some laughs as long as you have printed up good cheat sheets to make looking up card rules quicker. It might get better once the learning curve is over come and the rules can be set aside during play but this would have been much easier (and more likely) if a little extra information had been included on the cards.",
    "timestamp": 1405202400
  },
  {
    "username": "darker",
    "rating": 5.0,
    "comment": "Take-that game that's almost over the top in its mean-spiritedness. Neither balanced nor fair, but that certainly seems in keeping with the theme/feel. Overall, though, I prefer Hex Hex.",
    "timestamp": 1403128800
  },
  {
    "username": "Zakoiki",
    "rating": 5.0,
    "comment": "With the right group this game is lots of fun.",
    "timestamp": 1399327200
  },
  {
    "username": "DexGeek",
    "rating": 6.2,
    "comment": "Owner: Katie",
    "timestamp": 1744754400
  },
  {
    "username": "GamerLibrarian24",
    "rating": 6.0,
    "comment": "A light card game of elementary school bullying, lol.",
    "timestamp": 1735772400
  },
  {
    "username": "LisArtist",
    "rating": 5.5,
    "comment": "Quick and classic take that game with striking imagery. Not a lot of brain power required and good with a beer. Questionable premise, and questionable use of a minor's image - nigh inappropriate, but if you can roll with other nigh inappropriate games you will get through this one (Cards Against Humanity) when an old-timer dusts it off. It's not a game you spend an afternoon on. It's a one and done game.",
    "timestamp": 1678834800
  },
  {
    "username": "Yokiboy",
    "rating": 6.0,
    "comment": "Awesome game to unleash some of your pent-up aggression towards your gaming buddies! \n\nIf everyone is into \"roleplaying\" out the moves it is just brutal fun. Once we start playing this it is hard to stop playing, and we usually end up playing game after game after game...",
    "timestamp": 1678575600
  },
  {
    "username": "haraggan",
    "rating": 6.0,
    "comment": "Really nice looking; works best if you have very animated friends because the gameplay itself is simple and formulaic.",
    "timestamp": 1630274400
  },
  {
    "username": "celtwolf",
    "rating": 6.0,
    "comment": "Combat",
    "timestamp": 1611442800
  },
  {
    "username": "Felicity",
    "rating": 6.0,
    "comment": "Little girls betting the snot out of each other, excellent. Players can get knocked out quick but since games go for 10 - 15 minutes its not normally much of a problem, good filler game. Our group has great fun with this one although having to refer back to the rules every now and then to check on playable cards and reactions can be annoying.",
    "timestamp": 1608505200
  },
  {
    "username": "Eoin Corrigan",
    "rating": 6.0,
    "comment": "Fun, once in a while.",
    "timestamp": 1598738400
  },
  {
    "username": "Mikee_C",
    "rating": 6.1,
    "comment": "complete",
    "timestamp": 1585004400
  },
  {
    "username": "Zombiegod",
    "rating": 6.0,
    "comment": "Not a bad slugfest, but Kung Fu Fighting does it better, and has the description of what does what on the cards.",
    "timestamp": 1583708400
  },
  {
    "username": "LordSmada101",
    "rating": 5.5,
    "comment": "Get into the game, talk smack and really get into the game. Enjoy it! Its priceless",
    "timestamp": 1578524400
  },
  {
    "username": "Scorpion0x17",
    "rating": 6.0,
    "comment": "Sold Dec 2019 via BGT&CUK.",
    "timestamp": 1576364400
  },
  {
    "username": "charlest",
    "rating": 5.5,
    "comment": "Jesus hates you...and so do I.",
    "timestamp": 1572217200
  },
  {
    "username": "Drugo",
    "rating": 6.0,
    "comment": "Civita",
    "timestamp": 1565474400
  },
  {
    "username": "pete_darby",
    "rating": 6.0,
    "comment": "need to play more",
    "timestamp": 1559772000
  },
  {
    "username": "ARMed_Pirate",
    "rating": 6.0,
    "comment": "A lovely little violent free-for-all brawler.",
    "timestamp": 1554328800
  },
  {
    "username": "sabode",
    "rating": 6.0,
    "comment": "Remember enjoying, but it's been 12+ years since I last played.",
    "timestamp": 1534197600
  },
  {
    "username": "BoSsRoSs",
    "rating": 6.0,
    "comment": "I played this game a long time ago and really enjoyed the whole idea of it, However I think the art direction is strange and ironic (although I think that is what they were aiming for) and I find the rules to be a little over zealous for something so simple.",
    "timestamp": 1531692000
  },
  {
    "username": "u8nogard",
    "rating": 5.5,
    "comment": "Interesting game to play when I was younger; but now I just have to be in the right mood. Not the same excitement factor",
    "timestamp": 1526508000
  },
  {
    "username": "marrog",
    "rating": 6.0,
    "comment": "I played this pretty much to death as student and not much since. We do own it though and I keep thinking I should get it out with a few folk and see if it stands the test of time.",
    "timestamp": 1520204400
  },
  {
    "username": "Braelun",
    "rating": 6.0,
    "comment": "Includes Sticks and Stones expansion",
    "timestamp": 1514329200
  },
  {
    "username": "CheeseDemon",
    "rating": 6.0,
    "comment": "Minor wear and tear.",
    "timestamp": 1511218800
  },
  {
    "username": "adularia25",
    "rating": 6.0,
    "comment": "I love this game. Beating the snot out of people with disturbing cards - what's not to love? No one expects me to win either - which just makes this game all the sweeter to play. Oh, the crazy combos you can throw...",
    "timestamp": 1509490800
  },
  {
    "username": "orbital_uk",
    "rating": 6.0,
    "comment": "Play with friends with good imaginations and low morals and you will have the biggest laughs.",
    "timestamp": 1506117600
  },
  {
    "username": "kemueld",
    "rating": 6.0,
    "comment": "Dark. Violent. Great Brawl.\nAlthough the combos can be a bit of hassle to remember, the game plays fairly fast.",
    "timestamp": 1497909600
  },
  {
    "username": "KaientaiDX",
    "rating": 6.0,
    "comment": "Only played a couple of times, but willing to give it another chance.",
    "timestamp": 1495490400
  },
  {
    "username": "MobyNostromo",
    "rating": 6.0,
    "comment": "A head smashing, ironic romp through old school brawls.",
    "timestamp": 1493935200
  },
  {
    "username": "Thejaso04",
    "rating": 6.0,
    "comment": "Fun to try and beat each other up.",
    "timestamp": 1492293600
  },
  {
    "username": "GothPunkGeek",
    "rating": 7.0,
    "comment": "Integrates with Beer Money\n\nHad added \"Sticks And Stones\"",
    "timestamp": 1733526000
  },
  {
    "username": "hecatonchires",
    "rating": 7.0,
    "comment": "A violent street fight. Much better when you remember to bring counters.",
    "timestamp": 1677020400
  },
  {
    "username": "K0rnput1968",
    "rating": 7.0,
    "comment": "Bought it as I have a weak spot for the compagny. And I like the bullying theme. ? Just a fast little card game.",
    "timestamp": 1675206000
  },
  {
    "username": "DestinyCutie",
    "rating": 7.0,
    "comment": "Beat people up?",
    "timestamp": 1670799600
  },
  {
    "username": "Reyne49",
    "rating": 7.0,
    "comment": "Better than I expected! I purchased this one for the cool and creepy ‘theme’/images! But game play is actually quick and fun. Definitely won’t be for everyone, but it actually does feel like you are having a school yard fight with a bully!",
    "timestamp": 1645138800
  },
  {
    "username": "Odd24_7",
    "rating": 7.0,
    "comment": "The closest you'll get to a school yard fight. Fast paced. Light.",
    "timestamp": 1632434400
  },
  {
    "username": "jedijundi",
    "rating": 7.0,
    "comment": "Played a lot years ago, have but no longer played.",
    "timestamp": 1578006000
  },
  {
    "username": "oneshallstand",
    "rating": 6.7,
    "comment": "Amazed at the number of people on here that can memorise complete rule systems, but balk at a handful of cards that they have to memorize. Personally, after a single game I've never had anyone struggle and this game has hit the table with many groups as a warm up game or filler over the years. Yes, there's an element of randomness in the cards and yes, some of the cards are overpowered, but that's part of the challenge. A fun game, with some good options that get's a lot of ragging on here.",
    "timestamp": 1571608800
  },
  {
    "username": "ThueEriksen",
    "rating": 7.0,
    "comment": "AAAAARRRRHHHH KICK ASS!!! NOW!! Hilarious beat'emup cardgame...",
    "timestamp": 1563660000
  },
  {
    "username": "Aiolar",
    "rating": 7.0,
    "comment": "SELLING\n\nFantastic if you get into the game, the smack talk, and the storytelling. Boring otherwise.",
    "timestamp": 1557093600
  },
  {
    "username": "lsamadi",
    "rating": 7.0,
    "comment": "It was fun back when I first found it, but now I have no desire to play. (2005)\n\nUpdate 2017 - Some 12 years later I bring it out and it fits the filler bill quite well, although I need player aids to help everyone remember the interactions. Amusing and fun. Wishing I had the expansion.",
    "timestamp": 1503957600
  },
  {
    "username": "Tevish Szat",
    "rating": 7.0,
    "comment": "Box",
    "timestamp": 1497304800
  },
  {
    "username": "JimboThulu61",
    "rating": 7.0,
    "comment": "This game has to be played with the right group. Brutal playground beatings to steal each others' lunch money. In a society where bullying is coming into focus as being so destructive, this game is not for the politically correct.",
    "timestamp": 1494540000
  },
  {
    "username": "skrybble",
    "rating": 6.5,
    "comment": "A really beautiful game -- the art/photography is haunting. Creepy and brutal flavor text. A good filler or finisher.",
    "timestamp": 1488063600
  },
  {
    "username": "paimon616",
    "rating": 8.0,
    "comment": "2002년 당시 충격을 준 작품.",
    "timestamp": 1759788000
  },
  {
    "username": "Kisa",
    "rating": 8.0,
    "comment": "Includes Sticks and Stones",
    "timestamp": 1733353200
  },
  {
    "username": "jwilhm",
    "rating": 8.0,
    "comment": "Save",
    "timestamp": 1725832800
  },
  {
    "username": "LanternMedia",
    "rating": 8.0,
    "comment": "Had this for years and loved it when i first got it, but havent played it in almost a decade.",
    "timestamp": 1648418400
  },
  {
    "username": "Tacit Ronan",
    "rating": 7.5,
    "comment": "Lunch Money is hilarious most of the time. It’s fun collecting other people’s lunch money in an amusing but sadistic way, leaving them feeling battered and bruised. Best played with drunks and peeps that aren’t easily upset. Can at times be frustrating when you get the feeling everyone’s out to get you, however it’s over quite quickly and game is swingy so the tables will be turned... eventually.",
    "timestamp": 1607036400
  },
  {
    "username": "RowSkin",
    "rating": 7.5,
    "comment": "Connor borrowed",
    "timestamp": 1604790000
  },
  {
    "username": "Monky7",
    "rating": 8.0,
    "comment": "Steep learning curve, but once everyone's got the rules down, it's a fast paced brawl. Great for groups of 4+, trash-talking is a must.",
    "timestamp": 1564092000
  },
  {
    "username": "DuffmanGaming",
    "rating": 8.0,
    "comment": "Hilarious fun for creative gregarious people.",
    "timestamp": 1556661600
  },
  {
    "username": "MarlonMichaels",
    "rating": 7.5,
    "comment": "One of my favs. A brutal fight game. Never ceases to startle new players with its nasty fighting. I suspect that lends to lower ratings here. In reality the violence is extreme and well done. Sorry, it's true. It's not for everyone and some at Thanksgiving might be offended but...if you want a \"screw your neighbor\" game (with a roundhouse kick to the head) than this game is for you. The negative: the rule sheet needs to be in front of you for the first several games. The card colors are a little too similar though not bad. I'm a pacifist with a sense of humor and I love this violent game.",
    "timestamp": 1505253600
  },
  {
    "username": "amanshu",
    "rating": 8.0,
    "comment": "An initially steep learning curve, but once you get past it this is a very fun game.",
    "timestamp": 1502661600
  },
  {
    "username": "zumby65",
    "rating": 8.0,
    "comment": "I love this game it is great. The fun pvp attack combined with the detailed story telling and creepy cards, absurdly fun. Always a hit around the table",
    "timestamp": 1493935200
  },
  {
    "username": "Bigcubfanjim",
    "rating": 8.0,
    "comment": "Creepy graphics, but awesome game play!",
    "timestamp": 1490396400
  },
  {
    "username": "pullerbudz",
    "rating": 8.0,
    "comment": "One of my first game buys. Played the heck out of it in high school, still enjoy playing it. It is another game that is best if the storytelling is incorporated into it.",
    "timestamp": 1485990000
  },
  {
    "username": "brennanr",
    "rating": 8.0,
    "comment": "Quick fun. Still play it despite owning from release. Suffers from player elimination but as long as game is quick this is ok. Hence house rule:\n* only go through the deck once, winner is player on highest health at that point.",
    "timestamp": 1485385200
  },
  {
    "username": "lastalchemist",
    "rating": 9.0,
    "comment": "Comments:\nOne of the best card games ever made, bar none. Does it need a theme? No. Do you need to roleplay to have fun playing this game? No, but some find it makes the experience better. At it's core Lunch Money is a simple game of beat the crap out of everyone else. Card combos are what you are looking for, and the ability to be versatile and think long term can be really big plusses in this game.\n\nA big drawback to the game though is the lack of instructions on cards for what each card can and can't do. Honestly it makes the game unfun for most first time players (especially playing against those who do know what they do). I wish Atlas would just buck up and make a deluxe version of the game with cards that have instructions for play, they would probably find a lot more willing customers that way.\n\nViva Lunch Money!\n\nExpansions Owned:\nLunch Money: Sticks and Stones\nBeer Money",
    "timestamp": 1419807600
  },
  {
    "username": "Neon Samurai",
    "rating": 9.0,
    "comment": "Love this. Imagination required. Awesome easy to play card game.",
    "timestamp": 1401400800
  },
  {
    "username": "Thelegitsandman",
    "rating": 9.0,
    "comment": "This is a must have in any gaming collection",
    "timestamp": 1393887600
  },
  {
    "username": "HellsKitch",
    "rating": 9.0,
    "comment": "6",
    "timestamp": 1343253600
  },
  {
    "username": "jormungandr",
    "rating": 9.0,
    "comment": "Never had any problem teaching this to new players or getting them into the swing of things - it's a good lightweight game. I think the suggestion to take out the choke and headlock cards is a good one; they're much more complicated than anything else in the game and are rarely played (they're just not that good). Plays well with 3-5, gets a little awkward past that (even with multiple sets shuffled together). Probably played it a hundred times or more back in the day.",
    "timestamp": 1271973600
  },
  {
    "username": "vhirvela",
    "rating": 8.5,
    "comment": "I hope time has given this special nostalgia bonus. I realy really loved this one. But I have heard it was broken? I allways roleplayed this and it was really really fun...some cards were somewhat complicated.",
    "timestamp": 1256598000
  },
  {
    "username": "manolovila",
    "rating": 9.0,
    "comment": "Really very nice Art Work! I'll give 10 points when they'll write the rules and the cards in Spanish",
    "timestamp": 1127944800
  },
  {
    "username": "thanesgames",
    "rating": 9.0,
    "comment": "A great game, but you need at least 4 players to make it interesting",
    "timestamp": 1116885600
  },
  {
    "username": "MonkeyArcher",
    "rating": 9.0,
    "comment": "This is a fun little game, and after you play a couple games, you can develop a feel for the strategy needed to punish everyone else who is playing. Maybe a little violent, but that is a large part of its charm. And drunks can play along with everyone else, which is a good thing in my (unfortunate) playing circles.",
    "timestamp": 1107730800
  },
  {
    "username": "Preacher67",
    "rating": 9.0,
    "comment": "Lunch money is one of my all time favorite card games. A must for every player who likes good story telling during play.",
    "timestamp": 1100041200
  },
  {
    "username": "Mithroch",
    "rating": 9.0,
    "comment": "Omigod is this fun! 8 year old Catholic school girls...there is nothing more vicious.",
    "timestamp": 1058997600
  },
  {
    "username": "Hrothgarrr",
    "rating": 9.0,
    "comment": "The *best* game about little girls beating each other up for lunch money ever. Only play this game with friends who have a sense of humor.",
    "timestamp": 1054072800
  },
  {
    "username": "FinbarSaunders",
    "rating": 9.0,
    "comment": "Disturbing and distateful game in many ways. I love it.",
    "timestamp": 1053036000
  },
  {
    "username": "kgnunn",
    "rating": 9.0,
    "comment": "There's nothing better than a good pimp slap.",
    "timestamp": 1039820400
  },
  {
    "username": "Blix",
    "rating": 10.0,
    "comment": "Replayable Chaos\nGroup Dependent",
    "timestamp": 1743890400
  },
  {
    "username": "LauraK",
    "rating": 10.0,
    "comment": "Regularly play with 5-6 people and it works well, particularly when you get in-character with descriptions and petty rivalries.",
    "timestamp": 1581894000
  },
  {
    "username": "meaniemogg",
    "rating": 10.0,
    "comment": "This was bought the moment it hit the shelves, very well played cards. Family & Friends love it, as it is semi-mindless to play but fun. We invoke a few house rules to make games less chaotic.",
    "timestamp": 1513551600
  },
  {
    "username": "crash501",
    "rating": 10.0,
    "comment": "I got this game as a beta back in the day and spread it like wildfire through my city. I have no idea where it is now however. I rate this at 10 because for me it was the beginning of all gaming \"beyond Monopoly.\"",
    "timestamp": 1419548400
  },
  {
    "username": "AnalogGamer",
    "rating": 10.0,
    "comment": "The Hobbesian rites of the playground. Of course you can't resist.",
    "timestamp": 1301695200
  },
  {
    "username": "KerryB",
    "rating": 10.0,
    "comment": "The best game I played of this was with three nuns (two of them teachers and one a grade school principal). They loved it!",
    "timestamp": 1172790000
  },
  {
    "username": "siggelsworth",
    "rating": 9.8,
    "comment": "Too much fun. Every year I get this back out and get a handful of people hooked on it.",
    "timestamp": 1132354800
  },
  {
    "username": "GrandpaDave",
    "rating": 10.0,
    "comment": "A fun, fast bizzare card game.",
    "timestamp": 1121551200
  },
  {
    "username": "eman_p",
    "rating": 10.0,
    "comment": "yeah, Fight!",
    "timestamp": 1102114800
  },
  {
    "username": "Rookiegamer29",
    "rating": 10.0,
    "comment": "Best card game i have played \" havent played money \"",
    "timestamp": 1097013600
  },
  {
    "username": "Perdurab00",
    "rating": 10.0,
    "comment": "Game has a bad reputation, but why? 50% of board games are about fighting. This is one of the most fun.",
    "timestamp": 1053208800
  },
  {
    "username": "Queex",
    "rating": 10.0,
    "comment": "Always a crowd pleaser at our games meetings. The only game that is never not played for want of eager players.",
    "timestamp": 1043103600
  },
  {
    "username": "Hjallti",
    "rating": 10.0,
    "comment": "The best 'in between' game I know. It's fast, fun but mean, and I had great times with it!",
    "timestamp": 1037142000
  },
  {
    "username": "zhindumoi",
    "rating": 10.0,
    "comment": "I have always loved this game! It is best with many people, but three can get very intereting. Love the art, love the play, it is all good.",
    "timestamp": 1029189600
  }
]