[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "After playing Knizia's Money, I'm really not sure if I want to go back to this one. Sure it has some differences, but the general auction flow is immediately more lively in Money (which ironically feels more thematic despite how boring that theme is). Katzenjammer still has the rummy system, but I'm not even sure if it's that good at it, I can think of many better twists on rummy/mahjong. What does this have? I guess it has cats, that's all.",
    "timestamp": 1750629600
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "* Played 3 times. Fluffy. Neat artwork, but the game is an utter wash for me. I feel like I am doing next too nothing. No tension in the mechanic.",
    "timestamp": 1416697200
  },
  {
    "username": "imoo",
    "rating": 3.0,
    "comment": "邦題：　酔いどれ猫のブルース",
    "timestamp": 1447369200
  },
  {
    "username": "RalfMalf",
    "rating": 4.0,
    "comment": "I quite liked this at first but hoarding cards is a problem. If one person does it then they win. If everyone does it then the game goes on for ages. Don't need to play this again.",
    "timestamp": 1677452400
  },
  {
    "username": "krit1789",
    "rating": 4.8,
    "comment": "Auction and set collection. One of Knizia's mediocre games.",
    "timestamp": 1668466800
  },
  {
    "username": "OGNOG",
    "rating": 5.1,
    "comment": "Probably OG. (Rating non-indicative of game quality.)",
    "timestamp": 1649109600
  },
  {
    "username": "Gola",
    "rating": 6.0,
    "comment": "Six plays, twice with three, four times with two. Players bid cards to win more cards via peculiar bidding rules, after which they can turn in melds for points. There are jokers as well, and the catch is that the player with the most jokers—even unused jokers in hand—will lose five points. A very interesting little game that requires thought, though there's a lot of luck involved too. Playing just one round is unsatisfying, as it's over too quickly; I enjoyed it more when playing multiple rounds and tallying score.",
    "timestamp": 1741215600
  },
  {
    "username": "_The_Inquiry_",
    "rating": 6.0,
    "comment": "Prior to 2020: 3 plays",
    "timestamp": 1740783600
  },
  {
    "username": "guimel",
    "rating": 7.0,
    "comment": "For trade. Very good condition. No in game text requirement. German edition with the title Katzenjammer Blues. Print out of English rules in the box.\n\nSuitable for 2 players. 30 mins. Very light game. Age 10+.\nGreat artwork. Bidding and set collection. Players need not to be fearful of gaining the penalty of having used more Jokers than opponents. Sometimes it is better to play boldly to gain the mice before other players, even if it results in a penalty. Great for travel as has a very small sized box and is good for play in limited space. Visually very apealing.",
    "timestamp": 1759528800
  },
  {
    "username": "ciceroni",
    "rating": 8.0,
    "comment": "Way more interesting than it appears at first sight. Also a rare auction game that works well at 2p but probably should not be played by more than 3p or maybe 4p.",
    "timestamp": 1760479200
  },
  {
    "username": "ChimBlade",
    "rating": 9.0,
    "comment": "6 unique cards make 1 incredibly unique card game. The definition of elegance, simplicity, and less is more. It shows its age with a few unwritten rules that if not abided by can lead to a frustrating experience. Its also pretty much a 2-3 player game, 4 works, and 5-6 sounds like a bad time. Absolutely due for a reprint with some updated rules.\n\nUpdate: Bitewing gave it the reprint with updated rules it deserved! Woohoo!",
    "timestamp": 1707865200
  },
  {
    "username": "MisterCranky",
    "rating": 10.0,
    "comment": "I like almost every Knizia card game that I've ever played, and this is the best of the bunch.",
    "timestamp": 1064786400
  }
]