[
  {
    "username": "darkfinale",
    "rating": 1.0,
    "comment": "A bit frustrating to play, due to apparent king-making and choices where you are giving someone the win. Not very satisfying.",
    "timestamp": 1744495200
  },
  {
    "username": "barry_015",
    "rating": 1.0,
    "comment": "Take my rating with a grain of salt...I played with a group that all seemed to send the negative points my way (like I'm a threat or something)...and then I never have any fun in the game as the catch up mechanic is so poor (even if I wasn't a target)",
    "timestamp": 1522447200
  },
  {
    "username": "rabesandratana",
    "rating": 2.0,
    "comment": "I felt like I had no control. I don't know if there is a strategy or only luck. The components for the french version are good looking",
    "timestamp": 1726264800
  },
  {
    "username": "moramis",
    "rating": 2.0,
    "comment": "Frustrating card game. I was never able to grasp any control over what happened to me. I think it might be possible, but it did not agree with my brain.",
    "timestamp": 1544310000
  },
  {
    "username": "Udai",
    "rating": 3.0,
    "comment": "I feel out of control.",
    "timestamp": 1684360800
  },
  {
    "username": "fizzle",
    "rating": 3.0,
    "comment": "Yes, it's a mean card game. Screwing the other players is your bread and butter here. No, it's not random. Not at all. I'd even argue that you have too much control, just not over your own pile but those of the other players (I'll agree that this is not necessarily helpful for your own score, though). And unlike many other games of this kind you need neither panache nor finesse to screw the other players here which makes the whole exercise pretty pointless.\n\nIn some ways, The Little Prince: Make Me a Planet is the spiritual successor to this game, using a very similar drafting mechanic but doing away with the undefensible tearing down of other people's score piles.",
    "timestamp": 1424991600
  },
  {
    "username": "benshever",
    "rating": 4.0,
    "comment": "A chaotic, whimsical experience. Lots of table talk which just isn’t my thing.",
    "timestamp": 1581894000
  },
  {
    "username": "sukhi729",
    "rating": 4.0,
    "comment": "초심자와도 즐길 수 있는 간단한 게임. 하지만 아기자기한 일러스트와는 반대로 생각해야 할게 정말 많다. 분명 내가 가지고 있는 내 카드가 아닌데, 상대방에겐 잘 보여야하고, 저걸 가져가면 상대방에게 득이 되는건 아닐까... 하면서 고민할 요소가 많다. 약간의 굽신모드가 섞여 있어서 건조함을 환기시킨건 맘에 들었지만 개인적으로는 임팩트가 부족했던 게임.",
    "timestamp": 1549580400
  },
  {
    "username": "fabericus",
    "rating": 5.0,
    "comment": "2x 3-player games\n1x 5-players games\n\nReally nasty. Very nasty. Only nasty. I'd rather play No Merci in the same category.",
    "timestamp": 1683669600
  },
  {
    "username": "rynelf",
    "rating": 4.5,
    "comment": "--Mar2007-- First impressions: chaotic and fun, if slightly scripted. My rating is a bit soft at this point - but it looks like the sort of thing I'd enjoy if I played it only occasionally.",
    "timestamp": 1680559200
  },
  {
    "username": "jarmoaulu",
    "rating": 5.0,
    "comment": "Boring. (Dec 2016)\nNot so boring. (Dec 2021)",
    "timestamp": 1640646000
  },
  {
    "username": "Nomohr",
    "rating": 5.0,
    "comment": "2€",
    "timestamp": 1598220000
  },
  {
    "username": "DDG13",
    "rating": 6.0,
    "comment": "3 à 6 / 30 m\nCartes-Collection",
    "timestamp": 1756245600
  },
  {
    "username": "Yokiboy",
    "rating": 6.0,
    "comment": "A fun card game bidding card game, where you want to offer up as crappy a card as possible to the other players, in order for them to tempt you with the best possible card, just so they don't get stuck with your crap. The player whose card you pick is next to pick one, and so on.",
    "timestamp": 1728597600
  },
  {
    "username": "Terry Egan",
    "rating": 6.0,
    "comment": "Another German bean game??? Don't they grow anything else? I like this one better than its more famous cousin ... UPDATE: While initially liking this one when it came out, I replayed it in 2022 and felt time had just passed this one by. Not enough decisions or control for players. Rating dropped from 7 to 6 and placed on trade pile.",
    "timestamp": 1673305200
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "My most recent play of this game was just about the perfect table for this sort of game. The play is “around the table” as opposed to “on the table”.\n\nThe bidding to get the suit and exact card you hope to draft is very odd. I think it is much more about fathoming the other players intentions, and the finding the right card to bid that might navigate the competing opinions between you and the opening card bid.\n\nA lot of game in your head, if you go there. Or, a lot of mayhem if you don’t try to parse how it will go…",
    "timestamp": 1662415200
  },
  {
    "username": "Mind4u2c",
    "rating": 7.0,
    "comment": "ROATAN",
    "timestamp": 1756072800
  },
  {
    "username": "Enthousiaste",
    "rating": 7.0,
    "comment": "Once you get how to play it becomes nasty! Avoid the nicht die bohne cards!",
    "timestamp": 1740783600
  },
  {
    "username": "kevinwho",
    "rating": 7.5,
    "comment": "Beautifully vicious. Deliciously evil. Oh, fun too.",
    "timestamp": 1578351600
  },
  {
    "username": "tsune08",
    "rating": 8.0,
    "comment": "2018年11月購入　￥1,700",
    "timestamp": 1543186800
  },
  {
    "username": "faidutti_ludotheque",
    "rating": 9.0,
    "comment": "Un jeu de cartes avec des haricots. Cela vous rappelle quelque chose? Le succès de Bohnanza a inspiré Amigo qui nous sort plusieurs jeux de cartes sur le même \"thème\". Nicht die Bohne est de loin le meilleur du lot, meilleur même que Bohnanza.\n\nL'idée de départ n'est pas neuve: les joueurs cherchent à prendre des cartes qui, en fin de partie, leur rapporteront des points. Mais sur cette base, Horst-Reiner Rösner a installé deux systèmes très originaux qui font de Nicht die Bohne l'un des jeux de cartes les plus originaux et les plus vicieux.\n\nPremier système: la prise des cartes. Les cartes qu'un joueur a en main sont celles qu'il ne pourra en aucune manière avoir. En effet, à chaque tour, tous les joueurs jouent une carte face cachée, et elles sont révélées simultanément (enfin, pas exactement, mais on ne va pas rentrer dans les détails). Le premier joueur choisit ensuite l'une des cartes jouées par les autres joueurs, celui dont la carte a été choisie en prend une autre à son tour, et ainsi de suite, le dernier devant obligatoirement prendre la carte du premier joueur, et devenant premier joueur pour le tour suivant. Cela n'a l'air de rien comme cela, mais c'est diaboliquement vicieux et permet parfois, vous le découvrierez très vite, de contraindre un joueur à prendre la carte dont il ne voulait pour rien au monde.\n\nSecond système, le score. Outre des cartes ayant, classiquement, des valeurs de 1 à 10 dans quatre couleurs différentes, certaines cartes sont des multiplicateurs affectant l'ensemble des cartes de même couleur prises par ce joueur. Il y a donc des multiplié par 2 - plutôt bien- , des multiplié par 0 et, surtout, des multiplié par moins un - plutôt gênant. Bien sûr, moins par moins de la même couleur font plus, ce qui permet parfois de se sortir d'une situation embarassante.\n\nNicht die Bohne est un excellent petit jeu de cartes vicieux, rapide et amusant, qui soutient aisémenr la comparaison avec Bohnanza, 6 nimmt ou Coloretto.\n----\nA card game about beans… Doesn't this remind you of something? Bohnanza was a hit, and Amigo is trying to make it again with a few expansions and other stand alone bean card games. Nicht die Bohne is the best of all, even better, I think, than Bohnanza.\n\nThe basic idea is nothing new: players are collecting cards and these cards score points. But on this very light and classical basis, Horst Reiner Rösner has implemented two very clever systems, and has made with Nicht die Bohne one of the most vicious little card games.\n\nFirst system: the card taking. The cards a player has in hand are the cards he'll never score. Each turn, all players play a face down card, and they are simultaneously revealed (well, not exactly, but I won't detail all rules here). The first player chooses one of the other players' card. The player whose card he has taken now chooses another one, and so on, till the last player takes the card of the first player and becomes the first player of the next turn. It looks childish, but believe me, it isn't, and you'll soon find out how you can hinder opponents with making them take the one card that they absolutely didn't want.\n\nSecond new system: the score. Some cards have numerical values, from 1 to ten, in four different colors. But the other cards are multipliers affectring all cards of the same color: multiply by two, multiply by zero and, last but not least, multiply by minus one. Of course, minus by minus in the same color makes plus, and this may help getting out from an embarassing situation...\n\nNicht die Bohne is a neat and nasty fast paced little card game, on par with Bohnanza, 6 nimmt or Coloretto - which means very, very good.",
    "timestamp": 1693692000
  },
  {
    "username": "rayzg",
    "rating": 9.0,
    "comment": "Nov: 2009. On your first play, the game seems way too chaotic and counter-intuitive. But once players have figured out how to exploit the simple mechanics of the game, they will start finding it very easy for all players to decide to royally screw someone one over. However, being screwed over really only affects your score, not your ability to play, which means if you're screwed over one turn, you can simply screw someone over the next.",
    "timestamp": 1531346400
  },
  {
    "username": "skrebs",
    "rating": 10.0,
    "comment": "I love this game and would like to find a reasonably priced copy in the US. I made my own copy using a Five Crowns deck, but it's just not the same.",
    "timestamp": 1660428000
  },
  {
    "username": "tragallamps",
    "rating": 10.0,
    "comment": "No doubt: my favorite cardgame.\nBest for 4 players.",
    "timestamp": 1347746400
  }
]