[
  {
    "username": "postkarma",
    "rating": 1.0,
    "comment": "Rating = 'almost good', LOL... it is a mindless luck fest. A kid's party game at best. Thanks, somebody, for the room tile and board scans... They will come in handy for a good dungeon crawler. To each 'their' own. Or, maybe it's just me. Pretty box.",
    "timestamp": 1607554800
  },
  {
    "username": "dkearns",
    "rating": 1.0,
    "comment": "Pointless, frustrating, and futile. Mercilessly abuses the elegant rock-paper-scissors mechanic. Even the worst dungeon crawl game you can think of is a work of genius compared to this mess. No one wins. No player interaction and do decisions to be made. Simply awful. UPDATE. Watched the new FFG version being played at Gencon and I had forgotten DQ's biggest sin: it is slow as hell. God watching this was a bore. Anything this utterly random and punishing should be brisk and not the tedious, cumbersome, and plodding chore it is.",
    "timestamp": 1369519200
  },
  {
    "username": "Big Bad Lex",
    "rating": 1.0,
    "comment": "Unfortunately on 26-11-2009, BGG were instructed to remove all uploaded files all all GW games. Even those files with no copyrite material.\n\nThe games might be OK but the company attitude to it's customers is definitely broken. All my GW game ratings are reduced to '1's until GW mend their piss poor attitude to their client base and files are allowed to be reinstated..",
    "timestamp": 1259190000
  },
  {
    "username": "mnv_iii",
    "rating": 1.0,
    "comment": "Ugh, I can't believe people actually played this. There are 26 turns to the game, and it takes 20 turns (if everything goes right) to go to the dragon cave and back. That is, assuming that your path (which you pick up randomly) doesn't lead you astray... and assuming that you actually survive the dragon, who can simply roast you if you pick (randomly) the wrong tile. And assuming that you are still alive all the nasty (random) encounters and survive the (/rock-paper-scissors) combat.\nSo basically there is nothing to winning this game except being extremely lucky. Takes about 45 minutes to play. Why not just roll a die and get it over with?",
    "timestamp": 1146002400
  },
  {
    "username": "Mattias",
    "rating": 1.0,
    "comment": "Too simple and scripted. No significant decisions for the players to make.",
    "timestamp": 1102719600
  },
  {
    "username": "howwy",
    "rating": 2.0,
    "comment": "Used to play it quite a bit when I was a teen. Don't really feel like playing it anymore.",
    "timestamp": 1313704800
  },
  {
    "username": "Luke the Flaming",
    "rating": 2.0,
    "comment": "[Played once]\n\nTotally random and lacking interaction with the other players.\nIt was already a boring exercise twenty years ago.",
    "timestamp": 1282773600
  },
  {
    "username": "hrdkor",
    "rating": 2.0,
    "comment": "Don't like dungeon/maze discovery games.",
    "timestamp": 1207260000
  },
  {
    "username": "dr glaze et al",
    "rating": 1.5,
    "comment": "oh my god what a waste. This Games Workshop loser takes the already unsuccessful \"move-and-roll-the-dice-and-do-whatever-the-space-says\" mechanism and adds some twists: you get hosed and die several times every game. Oh yeah, and it also includes a novel tile-laying mechanism for the dungeon tunnels that assures that you will never actually make it to the dragon's lair in the middle of the board and have any chance of winning. Lovely way to get-screwed-by-the-game-mechanism twice before even considering your opponents. For true masochists only.",
    "timestamp": 1148335200
  },
  {
    "username": "Lars Vogt",
    "rating": 2.0,
    "comment": "Just a boring game - the combat system is especially dull...",
    "timestamp": 1126216800
  },
  {
    "username": "Raoulinho82",
    "rating": 3.0,
    "comment": "P: [2-4] (4) Competitive",
    "timestamp": 1751493600
  },
  {
    "username": "jormungandr",
    "rating": 3.0,
    "comment": "Not really my cup of tea. There's a point where randomness ceases to be interesting for me and this game is well inside that zone.",
    "timestamp": 1731193200
  },
  {
    "username": "jaffawahha",
    "rating": 3.0,
    "comment": "Boring",
    "timestamp": 1652565600
  },
  {
    "username": "RandallPeek",
    "rating": 3.0,
    "comment": "This was so random and arbitrary it didn’t feel like the players had much agency at all.",
    "timestamp": 1612393200
  },
  {
    "username": "brumcg",
    "rating": 3.0,
    "comment": "I remember enjoying this, but it could play brutal too.",
    "timestamp": 1558476000
  },
  {
    "username": "Yokiboy",
    "rating": 4.0,
    "comment": "Love the theme, but this just plays itself, roll some dice, flip some tiles, but there are no tough decisions.",
    "timestamp": 1728338400
  },
  {
    "username": "B_Moores",
    "rating": 4.0,
    "comment": "Its not really a game is it.",
    "timestamp": 1684015200
  },
  {
    "username": "marksansby",
    "rating": 4.0,
    "comment": "Bought from a carbooty. Kept for a bit. Then given to a charity shop.",
    "timestamp": 1683583200
  },
  {
    "username": "alchemyocelot",
    "rating": 4.0,
    "comment": "Nostalgia value. My intro to dungeoneering.",
    "timestamp": 1669244400
  },
  {
    "username": "CoolCop",
    "rating": 4.0,
    "comment": "Borrowed from a friend. Unforgiving and highly random mechanics. Back in the days I thought it was awesome, but it hasn't aged all that well.",
    "timestamp": 1541458800
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "A much better version of Dungeon",
    "timestamp": 1742857200
  },
  {
    "username": "rynelf",
    "rating": 5.0,
    "comment": "--Feb2010-- A beer & pretzels game if ever there was one. This one is silly and random; filled with \"now you die!\" events; an experience game, rather than a game of strategy. I think I would have loved it as a teenager. Now it's amusing in small doses, but would quickly become tedious if played more than occasionally.",
    "timestamp": 1680559200
  },
  {
    "username": "Khan3",
    "rating": 4.5,
    "comment": "V",
    "timestamp": 1668380400
  },
  {
    "username": "attlia",
    "rating": 5.0,
    "comment": "My first fantasy game ever. Beer and Brezel game. Was fun back then.",
    "timestamp": 1666044000
  },
  {
    "username": "slojdordie",
    "rating": 5.0,
    "comment": "Undantag",
    "timestamp": 1651010400
  },
  {
    "username": "StormKnight",
    "rating": 5.0,
    "comment": "Sometimes game set up can be longer than the playtime...you can walk in and fall into a bottomless pit in the first turn! Good for laughs, and a lot of tension and excitement towards the end as you race to escape. Needs some house rules to keep someone from just sitting next to the entrance tower and winning by being the only survivor.\n\nThe big problem is the constant reference checking required and the utter inconsistency of the rules.\n\nPainted: 9/? (inc. heroes)\n+dungeon crawl+",
    "timestamp": 1623794400
  },
  {
    "username": "ilgoga",
    "rating": 5.0,
    "comment": "Walk in one room, get 20 gold and run out could land you the win in this one. Extremly hard and combat sucks, but still a classic.",
    "timestamp": 1597788000
  },
  {
    "username": "myopia",
    "rating": 5.0,
    "comment": "Played it as a teenager but didn't have the same impact on me as other games like talisman. Features a lot of rolling and press your luck which young players generally cheat at",
    "timestamp": 1551654000
  },
  {
    "username": "vacuumdude",
    "rating": 5.0,
    "comment": "Has nostalgia value and dying in hilarious ways has its charm, but this is ultimately a pretty bad game with almost no real decisions. There are better dungeon crawlers out there these days.\n\nHave to give it some props for respecting the player's time though, unlike many other early \"Ameritrash\" games that just had no built in pacing mechanism and hence took forever.",
    "timestamp": 1530136800
  },
  {
    "username": "Jyrki",
    "rating": 5.0,
    "comment": "On one side, it's one of the most idiotic games ever made.\nOn the other, seeing pathetic crybabies complain that they died in the first turn is so much fun!",
    "timestamp": 1508796000
  },
  {
    "username": "Zombiegod",
    "rating": 6.0,
    "comment": "Probably showing its age now that I've experienced a few hundred more games with a fantasy setting.\n\nBoils down to a game of Rock, Paper, Scissors, with random tile and card draws, and a push your luck mechanism.\n\nI bought this game the first week it was released, and still play it to this day.\n\nGreat storyline possibilities. But it's easy to win by walking into the dungeon, Searching a few times, grabbing one piece of gold and Exiting. While others are never going to make it out after getting near the middle.\n\nCreated Cyberboard version.",
    "timestamp": 1757714400
  },
  {
    "username": "adamw",
    "rating": 5.5,
    "comment": "It really looks fun. It sometimes plays fun. But you can die in less than 5 turns. Then you wait until everyone else finishes. That's not fun. Still, it screams good theme and is representative of the good quirky dungeon material of the 80's. And that's why I have it. But I really don't want to play it. But then again, sometimes I do.",
    "timestamp": 1753740000
  },
  {
    "username": "KatydidWonders",
    "rating": 6.0,
    "comment": "1-4",
    "timestamp": 1745877600
  },
  {
    "username": "JDKenada",
    "rating": 5.5,
    "comment": "Any game that has a 15% chance of success is pretty good in my books!",
    "timestamp": 1732748400
  },
  {
    "username": "Fysst",
    "rating": 6.0,
    "comment": "Tony",
    "timestamp": 1710630000
  },
  {
    "username": "moonfrog",
    "rating": 6.0,
    "comment": "Solo-ready. Redesigned.",
    "timestamp": 1710198000
  },
  {
    "username": "Biker1999",
    "rating": 6.0,
    "comment": "Not an easy game to survive but still fun.\n\nUpdate: Sold.",
    "timestamp": 1709334000
  },
  {
    "username": "tommaas616",
    "rating": 6.0,
    "comment": "Swinging Blade...ouch!!!! This game is so random that we had to house rule it. Crazy chaotic fun.",
    "timestamp": 1705014000
  },
  {
    "username": "Morn82",
    "rating": 6.0,
    "comment": "Kick ass Swedish game.",
    "timestamp": 1700780400
  },
  {
    "username": "davebo",
    "rating": 6.0,
    "comment": "a",
    "timestamp": 1694210400
  },
  {
    "username": "watsh",
    "rating": 7.0,
    "comment": "pas vendu ?",
    "timestamp": 1757196000
  },
  {
    "username": "guimel",
    "rating": 7.0,
    "comment": "Not for trade. Solo play option. Great as time limited. Keep",
    "timestamp": 1753308000
  },
  {
    "username": "mrsuitcase",
    "rating": 7.0,
    "comment": "EO 3P 4P",
    "timestamp": 1748210400
  },
  {
    "username": "dcpepp",
    "rating": 7.0,
    "comment": "The game kills you so often, it’s fun!",
    "timestamp": 1739401200
  },
  {
    "username": "fefe2000",
    "rating": 7.0,
    "comment": "Sincèrement débile. Complètement injuste. Zéro stratégie. Beaucoup de parties au compteur, et deux gagnées seulement. Un beau jeu d'apéro qui fait comme s'il n'en était pas un. Acheté en Ecosse, un peu cher, mais aucun regret.",
    "timestamp": 1735254000
  },
  {
    "username": "Tachaalex",
    "rating": 8.0,
    "comment": "A little old and used but still really good. My first RPG, dungeon crawler board game, and I absolutely love it. I've had it for about 3 years, I had bought it second hand.",
    "timestamp": 1731279600
  },
  {
    "username": "touchthepeacock",
    "rating": 8.0,
    "comment": "The game that got me into \"adult\" board games. My dad showed it to me when I was ~10 years old, and I'd never seen anything like it before.",
    "timestamp": 1729980000
  },
  {
    "username": "John Tenzer",
    "rating": 8.0,
    "comment": "Dungeon Quest (or \"Drachenhort\" in German) is one of these little unknown gems GW put out in collaboration with a german partner company, that actually worked!\n\nWhile it wasn't fair all of the time due to the randomized draw of the room tiles, how to deal with the situation the player encounters was all in that players hand.\n\nWould he open the closed door and potentially trigger a trap, or search for a secret passage way? Fight or flee from the ork she stumbled upon? Try to draw another two treasure cards and hope the dragon still keeps sleeping? Would greed prevail and kill him?\n\nAll while facing the dreadful time counter running down the timer and a sudden death when too slow to flee the castle!\n\nDungeon Quest is easy to access, tense, immersive and fun. It doesn't take too long to finish amd provides plenty of replayability thanks to the randomised board and the rings.\n\nIt's one of these classics that I could play over and over again.",
    "timestamp": 1703199600
  },
  {
    "username": "jvincentp",
    "rating": 8.0,
    "comment": "A little fiddly for what it is, but I love how ruthless this game is. Your mileage may vary, but seeing one character after another fall prey to this death machine is great fun if you have any capacity for schadenfreude.\n\nOwn two copies and printed board modified for eight player games.",
    "timestamp": 1694988000
  },
  {
    "username": "grunherz",
    "rating": 8.0,
    "comment": "has a few separated counters",
    "timestamp": 1687384800
  },
  {
    "username": "JayTaylor210",
    "rating": 9.0,
    "comment": "I really enjoyed the game! Getting in and out was so much a challenge for this game. We have had total player kills in several of our games. Timing was good even if you didn't die. There was always something for someone to do to help out.",
    "timestamp": 1744236000
  },
  {
    "username": "D_Davis",
    "rating": 9.0,
    "comment": "An all-time favorite.\n\nSo much death.",
    "timestamp": 1742770800
  },
  {
    "username": "Catalagamer",
    "rating": 9.0,
    "comment": "Punched, complet, never played and in good condition considering its age.I'm selling it along with the expansións Heroes (with painted miniatures) and Catacombs.\nThe price of the pack is €450. I don't separate the pack.\nI can send those who are really interested photos of the game and the expansions.",
    "timestamp": 1714082400
  },
  {
    "username": "validcat",
    "rating": 9.0,
    "comment": "Love this game!",
    "timestamp": 1691013600
  },
  {
    "username": "Zpacequark",
    "rating": 9.0,
    "comment": "See my comment on the 2022 Kickstarter version of this game to see my thoughts on it.",
    "timestamp": 1685397600
  },
  {
    "username": "Zimmel24",
    "rating": 10.0,
    "comment": "The original classic and deadly dungeon delve",
    "timestamp": 1760047200
  },
  {
    "username": "rooninzen",
    "rating": 10.0,
    "comment": "Excelente. Colocación de losetas, tirada de dados y goblins con esteroides. El juego no le tiembla la mano a la hora de acabarte. Puedes escapar con el botñin si administras bien tus cartas, impides que te roben los jugadores y la suerte está de tu lado (pasó 2 de 10 partidas). Mucha rejugabilidad y con el dragón más hostil que hayas encontrado.",
    "timestamp": 1737414000
  },
  {
    "username": "CryptLord",
    "rating": 10.0,
    "comment": "21/12/2024",
    "timestamp": 1735513200
  },
  {
    "username": "threarah",
    "rating": 10.0,
    "comment": "Only one person I know has ever won this game, and they went in a circle, found treasure in a room, then got locked out of going back in by two portcullises. The fun isn't the winning, it's the epic death stories and terrible luck along the way.",
    "timestamp": 1678057200
  },
  {
    "username": "szurla",
    "rating": 10.0,
    "comment": "A2",
    "timestamp": 1663797600
  }
]