[
  {
    "username": "Esyhpe",
    "rating": 1.0,
    "comment": "Heureusement que la boîte était en metal, j'ai pu m'assomer avec.",
    "timestamp": 1736463600
  },
  {
    "username": "Noizeemama",
    "rating": 1.0,
    "comment": "Go Fish meets War with a bit of a twist.",
    "timestamp": 1713909600
  },
  {
    "username": "fuge67m",
    "rating": 1.0,
    "comment": "This game sucks ass.\nLiterally the absolute worst game I have ever played. Garbage extreme.",
    "timestamp": 1634076000
  },
  {
    "username": "glanfam",
    "rating": 1.0,
    "comment": "will play anything but this\nboring, slow, tedious, devoid of fun\nwould rather watch paint dry",
    "timestamp": 1618869600
  },
  {
    "username": "playl3oii",
    "rating": 1.0,
    "comment": "Sold for more shelf space.",
    "timestamp": 1607554800
  },
  {
    "username": "AlexanderVanhulsel",
    "rating": 1.0,
    "comment": "Wow this is a bad game! I actually prefer doing the dishes over playing this. It takes way too long while being pretty random. The haggling is tedious and simply not fun. To top it off, the artwork doesn't do it for me. Do NOT play this one!\n\nTheme (artwork/story/...)\n0.5/2\nGameplay (smooth play/player interaction/strategy&tactics/depth)\n0/5\nFun factor (can you afford a smile during play?)\n0.5/3",
    "timestamp": 1583794800
  },
  {
    "username": "yuius",
    "rating": 1.0,
    "comment": "I don`t accept that it`s a good trading game.\nToo obvious Trading matter.",
    "timestamp": 1537048800
  },
  {
    "username": "bohnanzahater",
    "rating": 1.0,
    "comment": "Hate this game very very very very very very very very much ???????????????????? waste of time",
    "timestamp": 1517007600
  },
  {
    "username": "Hoss Cartwright",
    "rating": 1.0,
    "comment": "Disgraceful. Another example of somebody who clearly knows that Bonanza is the name of my show and used--\"stole\" the name to generate clicks for people hoping that they made another game about our family. The cute thing is they changed the spelling so people wouldn't complain. Well they still complain. If you make a game about the Ponderosa then you can use \"Bonanza\" or whatever bogus spelling you care for.",
    "timestamp": 1419462000
  },
  {
    "username": "sharkatt",
    "rating": 1.0,
    "comment": "Makes Boggle look interesting.",
    "timestamp": 1366754400
  },
  {
    "username": "SCOBYBryant",
    "rating": 1.0,
    "comment": "Quotes Overheard from Bohnanza Pros\n\n\"If you gift me a Blue Bean now, I will surely gift you a Chili Bean later.\"\n\n\"Light diffraction is making my coin stack look larger than it really is. It's okay to trade with me!\"\n\n\"Should I buy a third bean field? I dunno, CAN I buy a third bean field?\"\n\n\"You gifted me a Coffee Bean because it ruins your setup, and I just drew Stink Bean and Wax Bean, both of which I need. PRO SKILL.\"\n\n\"What is that? A Garden Bean? That thing looks crazy! If I take this bean he will murder me while I sleep!\"",
    "timestamp": 1337896800
  },
  {
    "username": "sweetiepi",
    "rating": 1.0,
    "comment": "Not sure why this gets such great reviews. Maybe I need to give it a second chance.",
    "timestamp": 1337292000
  },
  {
    "username": "ilovekatusha",
    "rating": 1.0,
    "comment": "Check out how many people on the geek own this game! You get to give your wife a black eye and she smiles!\n\nI hate the reliance on others playing the game in the same spirit that you are...success depends greatly on your game group.",
    "timestamp": 1233183600
  },
  {
    "username": "rhianna_",
    "rating": 1.0,
    "comment": "Why isn't zero a rating number???",
    "timestamp": 1224885600
  },
  {
    "username": "CrimsonFox",
    "rating": 1.0,
    "comment": "Biggest waste of time I have ever played. You don't so much as play this game as watch this game go by. There is nothing to do in this game. You simply watch cards go by. Eventually someone tells you you've lost. Perhaps if there was a robotic arm to flip your cards for you while you do something else this game would be fun...then again...what's the point. Total crapola.",
    "timestamp": 1172185200
  },
  {
    "username": "weeb",
    "rating": 1.0,
    "comment": "Three words: Stupid Bean Game",
    "timestamp": 1081461600
  },
  {
    "username": "The Mad Duke",
    "rating": 1.0,
    "comment": "One step down from Gin Rummy. Mechanics uninspired. Dumb theme. No fun. One of the only games I have ever given away.",
    "timestamp": 1076194800
  },
  {
    "username": "lowkeyloki",
    "rating": 2.0,
    "comment": "i wouldnt mind it in the right group maybe, but it has always led to fighting when i played it and people being left out. the trades never feel fair, and it's impossible to measure whether someone will benefit from the trade more than you. the rest of the game plays itself, I just don't have any fun with that part. a 45 minute game that can turn into hours from people discussing.",
    "timestamp": 1756159200
  },
  {
    "username": "mr_ben_jen",
    "rating": 2.0,
    "comment": "worst game ever. something about beans.",
    "timestamp": 1748469600
  },
  {
    "username": "MartiN8029",
    "rating": 2.0,
    "comment": "niektoré texty na kartách považujem za nevhodné do slušnej spoločnosti...\n\n[nepotrebujeme v našej zbierke]",
    "timestamp": 1748383200
  },
  {
    "username": "Grugal",
    "rating": 2.0,
    "comment": "I just couldn't see anything good in this game, the worst: trades totally ruin the game.",
    "timestamp": 1747000800
  },
  {
    "username": "MrBigos",
    "rating": 2.0,
    "comment": "I felt like every turn I have only one move. Sometimes two, game played for me, very annoying.",
    "timestamp": 1739487600
  },
  {
    "username": "Ahikar",
    "rating": 2.0,
    "comment": "Demasiado dependiente del grupo, no le vi la gracia de ninguna de las formas.",
    "timestamp": 1719352800
  },
  {
    "username": "asfhgwt",
    "rating": 2.0,
    "comment": "I hate the \"card order / can't rearrange your hand\" mechanic.",
    "timestamp": 1715810400
  },
  {
    "username": "Gia187",
    "rating": 2.0,
    "comment": "Neen , Neen, neen, nooit.\n\nNa 3x te spelen zijn er iets meer mogelijkheden,maar het blijft wel wat langdradiger.\nHet spijtige blijft wel het onderhandelen. Dit blijft soms wat grijs en ofwel is het te agressief ofwel te lief.",
    "timestamp": 1710716400
  },
  {
    "username": "GamechangerWithHoney",
    "rating": 2.0,
    "comment": "No progress at all during the game. How did Rosenberg Design Agricola ( masterpiece) and this???",
    "timestamp": 1647039600
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "45 Min 2–7 Players p2 p3 p4 p5 p6 p7 Weight: 1.68 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "JoeyPickle",
    "rating": 2.0,
    "comment": "Fabulous game, terrible edition - some really racist card art.",
    "timestamp": 1631397600
  },
  {
    "username": "Theory_5_Games",
    "rating": 2.0,
    "comment": "My wife likes it okay. I really don't enjoy it.",
    "timestamp": 1612652400
  },
  {
    "username": "ray hughes",
    "rating": 2.0,
    "comment": "One of the most boring games I have ever had the misfortune to play. The theme and the card design is excruciatingly bad. Hate it.",
    "timestamp": 1565128800
  },
  {
    "username": "WillBePlayin",
    "rating": 2.0,
    "comment": "It just doesn't click with me. At times I can't resist the urge to shuffle the cards in my hand which you can't do. The game mechanics are really restrictive and other players can really decide on who will win or lose so a lot of \"kingmaking\" in this I feel.\n\nAlso a bit too long for it's own good too. Could be just the gaming groups fault, dunno. For some odd reason I do keep winning each game that we play Bohnanza even though I don't like the game.",
    "timestamp": 1562623200
  },
  {
    "username": "kineticmonkey",
    "rating": 2.0,
    "comment": "How do you rate a game series that has good mechanics, is fun to play, but has arguably racist artwork? It's just not okay, it makes me squirm inside, and it makes me not want to play an otherwise good game.",
    "timestamp": 1550617200
  },
  {
    "username": "Pr1l",
    "rating": 2.0,
    "comment": "This is the single most awful game I had the displeasure to play in my life.",
    "timestamp": 1542754800
  },
  {
    "username": "Jehublue",
    "rating": 2.0,
    "comment": "Slowest-moving game I have ever played.",
    "timestamp": 1524607200
  },
  {
    "username": "Destrio",
    "rating": 3.0,
    "comment": "It goes rather long for a simple trading game. The hand management is implemented in a way that's unique though. There are better set collection games out there. The focus is trading and that doesn't interest me. Fiddly since you have to shuffle the deck a couple times well and rather long for what I get in return.",
    "timestamp": 1745964000
  },
  {
    "username": "oursino",
    "rating": 3.0,
    "comment": "Je n'ai pas du tout accroché, mais peut-être est-ce parce que j'ai perdu !",
    "timestamp": 1744840800
  },
  {
    "username": "Pandori3",
    "rating": 3.0,
    "comment": "This is my personal view, but I am not a fan of anything that allows negotiation outside of game play (action).",
    "timestamp": 1739660400
  },
  {
    "username": "PermaFrost88",
    "rating": 3.0,
    "comment": "The beans theme is not great.\n\nThe trading aspect of it feels hollow, and forced.\n\nLuck of the draw is huge here.",
    "timestamp": 1736463600
  },
  {
    "username": "BrieJac",
    "rating": 3.0,
    "comment": "UMN",
    "timestamp": 1735772400
  },
  {
    "username": "dustkan",
    "rating": 3.0,
    "comment": "$5 Sleeved\nFarm beans, harvest crops and trade your way to fortune in this card game classic.\nPlant and Harvest beans in order to earn coins. Utilize your negotiation skills to trade cards for cards from other players and make potential future promises.\nM: Hand Management, Multi-Use Cards, Negotiation, Set Collection, Trading",
    "timestamp": 1733353200
  },
  {
    "username": "rozmiarek",
    "rating": 3.0,
    "comment": "Although it's a decent design I just hate the artwork and the way all bean names were translated in Polish version of the game (Fatso, Drunkhard, Pyromaniac). It may sound silly but that really impacted my experience of the game.",
    "timestamp": 1728252000
  },
  {
    "username": "Ctrlalt",
    "rating": 3.0,
    "comment": "It is a game that is good for kids or people who like minimal complexity, etc. It is unbalanced, boring or lacks any factors that would make me want play it again.",
    "timestamp": 1721685600
  },
  {
    "username": "Ultimatedicer789",
    "rating": 3.0,
    "comment": "We play with completely different rules, because main game isn’t that much fun (original 1/10, our version 10/10 just for that 3/10)",
    "timestamp": 1721426400
  },
  {
    "username": "SYGF",
    "rating": 3.0,
    "comment": "love the idea, but every time I've played it, the negotiation has been less than spectcular. It may be too bare-bones and calculable to really get into the hazyness that good trading games need. Also, there's no way to rejigger your \"engine\" to meed the demand.",
    "timestamp": 1717106400
  },
  {
    "username": "afafard",
    "rating": 3.0,
    "comment": "Ok game where the fun factor highly depends on the players.\n\nI was somewhat forced to play this one to death and my experiences were not that great.\n\nBottom line, this game can be fun but not for me, just seing the box makes me nauseous.",
    "timestamp": 1716415200
  },
  {
    "username": "pvtparts",
    "rating": 2.5,
    "comment": "Always feel like I'm missing something with this title due to the praise it has gotten. I just don't see the fun, the trading usually occurs out of necessity rather than deal-seeking due to the harsh restrictions around hand management and bean play. And the trades usually happen in such low quantities that the differing rarities/values of the beans isn't expressed in them. Willing to be converted on this one.",
    "timestamp": 1706137200
  },
  {
    "username": "Elephantpool",
    "rating": 3.2,
    "comment": "£5 to buy.",
    "timestamp": 1691618400
  },
  {
    "username": "PuellaSilvestris",
    "rating": 3.0,
    "comment": "Verkauft.",
    "timestamp": 1691272800
  },
  {
    "username": "mateoosh92",
    "rating": 3.0,
    "comment": "First impressions",
    "timestamp": 1689458400
  },
  {
    "username": "ColumBuzz",
    "rating": 3.0,
    "comment": "Bohringgg...",
    "timestamp": 1679353200
  },
  {
    "username": "FutureSpec",
    "rating": 3.0,
    "comment": "Unintuitive rules despite how simple they are in retrospect. Tedious. Lots of unpleasant decisions. \"Trap\" 3rd field option. Ugly artwork with difficult to read text. Really didn't enjoy this.",
    "timestamp": 1667775600
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "A bizarrely-themed negotiation game. Some of what it does, like forcing card play and hand order, is interesting, but ultimately does not make it worth it. And, now that I have Chinatown, I never have to worry about playing another negotiation game.",
    "timestamp": 1759269600
  },
  {
    "username": "Tina_T",
    "rating": 4.0,
    "comment": "2024.\nthink the trading element is too big in this game. but maybe i am just bad at it. funny beans though!\n\nRated after fewer than 3 plays.",
    "timestamp": 1757455200
  },
  {
    "username": "game_boy",
    "rating": 4.0,
    "comment": "Can't see what all the fuss is about. Hate always having to explain and police the rules. Yes, you can make a third bean field AT ANY TIME! No ,you CANNOT harvest that one-bean row to save your three-bean row! Aaarrgh!\n\nSold to jame117 in July 2025.",
    "timestamp": 1753912800
  },
  {
    "username": "Tygrone",
    "rating": 4.0,
    "comment": "Quite simple but very boring older game",
    "timestamp": 1752444000
  },
  {
    "username": "Bagherra",
    "rating": 4.0,
    "comment": "a quaint little trading game with a lite hearted feel and fast play time. Highly recommended.",
    "timestamp": 1748642400
  },
  {
    "username": "cubntin",
    "rating": 4.0,
    "comment": "2-7 players",
    "timestamp": 1743289200
  },
  {
    "username": "HairyPotter",
    "rating": 4.0,
    "comment": "Can be fun at times. It takes very little skill to compete in this game.",
    "timestamp": 1743202800
  },
  {
    "username": "dakotamassie",
    "rating": 4.0,
    "comment": "1997 will be remembered for 2 things\nThe year Titanic and bohnanza came out\n\nWhat a horrible year",
    "timestamp": 1741561200
  },
  {
    "username": "CannonFodderTed",
    "rating": 4.0,
    "comment": "Collect sets of beans while arguing with everyone around the table about why your trade of 2 chili beans and a coffee bean is a better trade than their green bean and wax bean. It's not HORRIBLE, but it's also not really that good. It's not one I can see myself owning nor ever pulling out but you end up playing because there's that one guy in the group that loves it so you play it anyway.",
    "timestamp": 1740956400
  },
  {
    "username": "tectactoe",
    "rating": 4.0,
    "comment": "Good fun. Perhaps a bit longer than it needs to be, and very group dependent. Good luck playing this with stubborn people who don't like to trade with others. Very enjoyable with the right types of players, though.",
    "timestamp": 1736722800
  },
  {
    "username": "kasleri",
    "rating": 4.0,
    "comment": "I dont get the appeal.",
    "timestamp": 1735772400
  },
  {
    "username": "Ldayjones",
    "rating": 4.0,
    "comment": "Trading game. I used to really love this game, but it has to have the right people.",
    "timestamp": 1735599600
  },
  {
    "username": "dtmoney75",
    "rating": 4.0,
    "comment": "1 Play\n\nPlayed at: 3",
    "timestamp": 1729548000
  },
  {
    "username": "rabesandratana",
    "rating": 4.0,
    "comment": "I don`t like this game at all. Too restrictive and a lot of frustration and negotiation.",
    "timestamp": 1726264800
  },
  {
    "username": "Laurentiu",
    "rating": 4.0,
    "comment": "Never liked the fact that you had to use your hand in a specific order. Too fiddly.",
    "timestamp": 1724191200
  },
  {
    "username": "OutlanderCDR",
    "rating": 4.0,
    "comment": "quite dislike the trading aspect of the game",
    "timestamp": 1722463200
  },
  {
    "username": "G_Riffy",
    "rating": 4.0,
    "comment": "I could enjoy this more if played with the right people. Every game I'm played to this point everyone freely gives away their cards and wants to the the \"nice guy.\"\n\nThat doesn't quite work in this game, at least not for me. (Ugh.. nice people)",
    "timestamp": 1720216800
  },
  {
    "username": "Esperant0",
    "rating": 5.0,
    "comment": "Manabar",
    "timestamp": 1761004860
  },
  {
    "username": "resolvecherry",
    "rating": 5.0,
    "comment": "Pure trading game with lots of mutually beneficial generosity, almost allergic to shrewd, calculating plays - much more fun and funny if you just go by gut feeling. Unfortunately this also means it has few truly interesting decisions, which is annoying in a game that takes an hour.\n\n4p: Best\n5p: Good",
    "timestamp": 1759615200
  },
  {
    "username": "phonyOldNinja",
    "rating": 5.0,
    "comment": "Ok game, kind feels played out after a few games, although I do get more into it as I'm playing it",
    "timestamp": 1758319200
  },
  {
    "username": "Iraperkins82",
    "rating": 4.6,
    "comment": "6/10: Enjoyable if I'm in the right mood. Probably has to be suggested to me. Likely it will have left my collection - unless it's important to someone in my life.",
    "timestamp": 1758060000
  },
  {
    "username": "shawnmackay1593",
    "rating": 5.0,
    "comment": "I'll almost always pass when invited to play this. I don't like not being to move my cards, losing the best field if I can't play, and trying to negotiate during the game.",
    "timestamp": 1757887200
  },
  {
    "username": "yiechow",
    "rating": 5.0,
    "comment": "Finally, I got to play this game, I meant to buy one when I was in China. Hard to say I like the game, simply because the flow is kind of weird. Combined with negotiation and strategy I don't think it's still a good idea nowadays. And even trade with something is better than you have to give it for free to help opponents to gain points. That's what I called weird. Theoretically, someone can keep receiving cards for free.",
    "timestamp": 1756936800
  },
  {
    "username": "lushchords",
    "rating": 5.0,
    "comment": "An interesting design that has stood the test of time. Although, I don't enjoy card counting so it's not for me.",
    "timestamp": 1756936800
  },
  {
    "username": "steverenothom",
    "rating": 5.0,
    "comment": "not my cup of tea.",
    "timestamp": 1755900000
  },
  {
    "username": "GarcianIII",
    "rating": 4.5,
    "comment": "2/2/2.5/2.5/2.5\n\n11.5/25\n\nGrossly overrated. Poorly written rules. Explaining this to casual players was a headache. Needs a reimplementation.",
    "timestamp": 1753567200
  },
  {
    "username": "Joka61",
    "rating": 5.0,
    "comment": "KS 1997",
    "timestamp": 1752876000
  },
  {
    "username": "GrimThunderbrew",
    "rating": 5.0,
    "comment": "meh",
    "timestamp": 1752876000
  },
  {
    "username": "Mageknight12",
    "rating": 5.0,
    "comment": "Bohnanza has a unique hand management twist, but the trading gets repetitive fast and heavily depends on group dynamics. Without the right players, it quickly turns dull and transactional.",
    "timestamp": 1750456800
  },
  {
    "username": "epgui",
    "rating": 5.0,
    "comment": "I feel like I'm not really getting this game yet. Might need a few more plays.",
    "timestamp": 1748988000
  },
  {
    "username": "Shortbeard",
    "rating": 5.0,
    "comment": "Games are supposed to be fun. \"Hey I have a bean and you have a bean lets trade\" is just not that much fun. Low theme, low fun and a little too dependent on the draw.",
    "timestamp": 1747260000
  },
  {
    "username": "AetasAaM",
    "rating": 5.0,
    "comment": "It seems to be a pretty decent negotiation game, very pure in its form. But, I don't think I like negotiation games, at least not when it's the sole focus. There's not enough to do while waiting for other people to negotiate. With 5 people it was slow with a lot of down time if you didn't have something to negotiate.",
    "timestamp": 1746050400
  },
  {
    "username": "Nicolas Weiss",
    "rating": 5.0,
    "comment": "Bohnanza is a game that is revered in my circles as a timeless classic, from the era where Uwe Rosenberg still designed fun things. And I've been convincing myself for years that I should love it, but when the time comes to pick any game in my library, I always pass on it. I think I'm now ready to part with my copy. Some disorganised notes:\n\n• Complaints about the art style being fugly or the puns being cringe are really overstated. The words they're searching for are \"charmingly old school cartoon\".\n• With the deterioration of my tryhard MTG habits, it's become easier to play games without reflexively shuffling my hand around. However, it turns out that this isn't that much easier for other people either, and the requirement to keep your hand in drawing order isn't really that easily followed by the general audience this game wants to reach.\n• Bohnanza gets its reputation for being a strong negotiation game, but frankly there's very little exchanging of goodwill and future favours, and trades mostly happen when they're mutually beneficial in the optics of a short-term clock. The more flagship outlandish-sounding \"I offer you 2 Saubohne in exchange for nothing\" works as some lightbulb moment, but the fun of the absurdity has worn off by the end of the first session. I find it a great showcase piece for newcomers to modern tabletop games, but far less exciting on repeated plays.\n• Scores and suit depletion are hidden trackable information, and the last stretch of the game really wants players to have forgotten who's currently ahead. Insert my usual grumbles.\n• Without fail, after the second run through the deck, someone at the table who doesn't often play Bohnanza will let out \"Wait, it's not over yet?\".\n\nWould always rather play Catan.",
    "timestamp": 1745445600
  },
  {
    "username": "TMacfarlane26",
    "rating": 5.0,
    "comment": "Not that great of a game. The game is far longer than it should be. This game could use a second edition cutting out around half of the game.",
    "timestamp": 1745100000
  },
  {
    "username": "QUALA0409",
    "rating": 5.0,
    "comment": "A masterpice of german design, Bohnanza is a down to earth game about honest work on the bean farm and negotiation and buisnen on the bean marked. A great game for both advanced and casual gamers. A simple ut beautyfull design and mechanic plus the funny and simplistic ark.",
    "timestamp": 1743890400
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1743717600
  },
  {
    "username": "Sethenstien",
    "rating": 5.0,
    "comment": "The most straight forward negotiation game that I still enjoy. Constant trading to make points with up to 7 people. good party game.\n\nEdit: Gets old with multiple plays and needs a willing group, would reccommend chinatown (waterfall park) instead.\n\n5/10",
    "timestamp": 1742252400
  },
  {
    "username": "Elvatuar",
    "rating": 5.0,
    "comment": "Actually, this is probably really as good as everyone says it is. I played it as a kid and didn't particularly enjoy it most of the time; back then I didn't know why. Now I know it was because it's an abstract card game, and that just doesn't get me inspired. Like the bean theme, though. It's so unusual.",
    "timestamp": 1741993200
  },
  {
    "username": "Xyt4n",
    "rating": 4.8,
    "comment": "I do not care for this game. If its there and we do nit have an alternative, I would play it, but it will not be memorable\n\n+ trading in games is always fun\n- not much to think about\n- - not much to laugh about",
    "timestamp": 1738364400
  },
  {
    "username": "enz0",
    "rating": 5.0,
    "comment": "Fairly garish artwork - the normal edition is recommended over this.",
    "timestamp": 1737932400
  },
  {
    "username": "Grzdyll",
    "rating": 5.0,
    "comment": "One of the best games to be played with children, light and funny. Recommended as a base game, since expansion add unnecessary complication to the rules.",
    "timestamp": 1737932400
  },
  {
    "username": "xPasis",
    "rating": 5.0,
    "comment": "It's fun when played with the right type of people",
    "timestamp": 1736463600
  },
  {
    "username": "Zengoeroe",
    "rating": 5.0,
    "comment": "Too long for what it is.",
    "timestamp": 1736031600
  },
  {
    "username": "minitj",
    "rating": 5.0,
    "comment": "1 партия на пятерых за 50 минут.\nСчитаю что она очень зависима от компании и её уровня игры\\вовлеченности.\nНаша партия мне не понравилась и выглядело всё это тупо, где каждый просто отдавал другому игроку что нужно, а получал в замен какую-то одну нужную себе карту... ну т.е всю игру был какой-то бессмысленный обмен картами 1 к 1, а смысл игры как мне кажется, в том, чтобы заставлять игрока забирать себе \"не нужные карты\" и раньше времени собирать с грядок урожай, до получения какого-то определенного числа очков, поэтому он заинтересован получить одну карту, но обменять её на 2 или даже 3 карты и т.д.\nПоставил 5 баллов т.к игра тут есть и при определенных условиях даже наверное повеселит... но я не хочу быть тем, кто объясняет каждому \"как правильно играть\"",
    "timestamp": 1735945200
  },
  {
    "username": "Hugobossgames",
    "rating": 4.5,
    "comment": "Geluksspel met weinig tactiek",
    "timestamp": 1735426800
  },
  {
    "username": "ruri11",
    "rating": 5.0,
    "comment": "==[Bought for kids]==\n\nInteresting in the beginning. Get to bargain around. But it drags on too long.",
    "timestamp": 1734130800
  },
  {
    "username": "pezboy",
    "rating": 5.0,
    "comment": "SELL - A3 - $20",
    "timestamp": 1732230000
  },
  {
    "username": "Yinzadi",
    "rating": 5.0,
    "comment": "Published by Rio Grande Games\nDesigner is Uwe Rosenberg\nGood substitute for Catan\n\nI'd like it so much better if the aren't weren't ugly.",
    "timestamp": 1725314400
  },
  {
    "username": "MissP1ggy",
    "rating": 5.0,
    "comment": "Fond memories of this one.",
    "timestamp": 1722549600
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A set collection and negotiation card game.",
    "timestamp": 1722290400
  },
  {
    "username": "shlomi",
    "rating": 5.0,
    "comment": "didn't like it, all about growing beans",
    "timestamp": 1722031200
  },
  {
    "username": "rkleopold",
    "rating": 6.0,
    "comment": "!!!!! Goes",
    "timestamp": 1760738400
  },
  {
    "username": "tothgames",
    "rating": 6.0,
    "comment": "I've had a lot of good experiences with this game, especially as a gateway game. The need to keep hands ordered is sometimes just a bit too much for new players, and waiting for your turn to come back around can drag a bit at high player counts.",
    "timestamp": 1759960800
  },
  {
    "username": "Nodens",
    "rating": 6.0,
    "comment": "Way better than it has any right to be.",
    "timestamp": 1757282400
  },
  {
    "username": "WaffleBoi",
    "rating": 5.5,
    "comment": "I'm rarely a fan of negotiation games... so take that into account. But it just felt like I was waiting too long for people to make decisions and then even when it got back to my turn it wasn't that fun.",
    "timestamp": 1756936800
  },
  {
    "username": "fliegen5",
    "rating": 5.5,
    "comment": "25th Anniversary Edition; mid trading game",
    "timestamp": 1756764000
  },
  {
    "username": "Saume",
    "rating": 6.2,
    "comment": "Decent game with some negotiation, though it is slightly longer than your usual filler.\n\nThe main mechanic in this game is that you can't reorder your cards, you must play (plant your beans into your 2 fields) them in the order in which you drew them. But then you also put 2 open cards on the table every turn, which you can give away to other players if they aren't what you're looking for. There's definitely luck, but you can usually manage to make something out of it.",
    "timestamp": 1756764000
  },
  {
    "username": "PraxisLoki",
    "rating": 6.0,
    "comment": "Just could not get to playing it. Maybe one day.",
    "timestamp": 1756418400
  },
  {
    "username": "Jclancy15",
    "rating": 6.0,
    "comment": "Gets some nice table talk going, though the actual decision-making feels pretty procedural.",
    "timestamp": 1756332000
  },
  {
    "username": "destro",
    "rating": 6.0,
    "comment": "Ph",
    "timestamp": 1756245600
  },
  {
    "username": "Fanksen",
    "rating": 6.0,
    "comment": "Posiadane przez stronę poczta planszówkowa od 24.07 - 10.08.2025",
    "timestamp": 1753394400
  },
  {
    "username": "midnightfaerie",
    "rating": 6.0,
    "comment": "2025",
    "timestamp": 1752962400
  },
  {
    "username": "Weirdsalmon",
    "rating": 6.0,
    "comment": "6/10: I liked this game at first, the auctioning/push you luck elements are fun. Set collection but with a little bit of social influence.\n\nFirst thing I didn’t like was the racist imagery amongst the beans. That sort of explains itself. The second thing was the length of the game, it just dragged on too long.",
    "timestamp": 1751925600
  },
  {
    "username": "zardon",
    "rating": 6.0,
    "comment": "Its alright, probably better with more players",
    "timestamp": 1750370400
  },
  {
    "username": "artman_russian",
    "rating": 5.5,
    "comment": "Предыдущая оценка 7 (2011).",
    "timestamp": 1750284000
  },
  {
    "username": "GabiGames",
    "rating": 6.0,
    "comment": "Okay game that our teenagers love to play.\n\n5 euro",
    "timestamp": 1749592800
  },
  {
    "username": "Zenfire",
    "rating": 6.0,
    "comment": "Couples spoil the fun in this game haha.",
    "timestamp": 1749592800
  },
  {
    "username": "Osh kosh 7",
    "rating": 6.0,
    "comment": "Fun little card game. Do not play with people who are sticklers for trading.",
    "timestamp": 1749074400
  },
  {
    "username": "buderix80",
    "rating": 6.0,
    "comment": "Funny game",
    "timestamp": 1748815200
  },
  {
    "username": "larrylurex05",
    "rating": 6.0,
    "comment": "Filler",
    "timestamp": 1748728800
  },
  {
    "username": "dprovencher",
    "rating": 6.0,
    "comment": "15",
    "timestamp": 1748642400
  },
  {
    "username": "meuxy",
    "rating": 5.5,
    "comment": "A set collector game where you trade cards to other players to help complete your sets. Players are unable to shuffle the cards in their hands though.",
    "timestamp": 1747519200
  },
  {
    "username": "WonderCinz",
    "rating": 6.0,
    "comment": "[at Isaac's]\n\nA light card game. At least it's supposed to be. But if you play to win, you have to count cards and play nastily. So there is this conflict in feel between the light fluffy appearance and the possibly cut throat behavior necessary to do well. It's a little jarring.",
    "timestamp": 1747000800
  },
  {
    "username": "AudunAgnar",
    "rating": 6.0,
    "comment": "This actually seems pretty fun woth the roght group and setting!\nBut I have never played it with the right group and setting.",
    "timestamp": 1746223200
  },
  {
    "username": "Sidekicken",
    "rating": 6.0,
    "comment": "You have to be at least 3 players, preferably 4 or more, and it's a bit lengthy for the light weight. Otherwise I would rate it higher.",
    "timestamp": 1745445600
  },
  {
    "username": "Jerkcore",
    "rating": 6.0,
    "comment": "Not usually one for trade negotiations but Bohnanza makes it fun. Maybe because of the anthropomorphic beans...",
    "timestamp": 1744840800
  },
  {
    "username": "D3C6",
    "rating": 6.0,
    "comment": "It's better with a lot of people, but it also gets a way longer.",
    "timestamp": 1744408800
  },
  {
    "username": "Plargyplop",
    "rating": 6.0,
    "comment": "Overstays its welcome a bit.",
    "timestamp": 1744149600
  },
  {
    "username": "bobjohnson",
    "rating": 5.8,
    "comment": "+ Clever fixed-order hand management that requires planning and allows for profiteering.\n- The game can bog down if people get stuck trying to find \"perfect\" trades. Luck in getting a good start to buy a third bean field.",
    "timestamp": 1743717600
  },
  {
    "username": "Mariia_O",
    "rating": 6.0,
    "comment": "Веселый филлер для поездок. Нельзя менять порядок руки.\nМеханика набора сетов.",
    "timestamp": 1743631200
  },
  {
    "username": "Coralouwho",
    "rating": 6.0,
    "comment": "FYI new flower-themed edition, \"Dahlias,\" expected 2023, just a re-theming.\n\n#LetterB\n#Food #Beans\n#WildWest #Western #Cowboys\n#Cards-only\n#BGA",
    "timestamp": 1743544800
  },
  {
    "username": "YlumsGuardian",
    "rating": 6.0,
    "comment": "Old (7.3): A surprise--saw it was a trading game and thought I would hate it; family enjoyed and would play any time.\n\nUpdate (6): SOLD. Just hadn't been played in years. Not a huge negotiation game fan. Still, would play if someone asked.",
    "timestamp": 1743202800
  },
  {
    "username": "Znoxyboy",
    "rating": 6.0,
    "comment": "VG: C2\nFG: X",
    "timestamp": 1743202800
  },
  {
    "username": "FamilyGamer20",
    "rating": 6.0,
    "comment": "Wife received as gift from ex-boyfriend (Hock). 3+ player game limited in play by lack of family size. Working on growing family size.",
    "timestamp": 1738105200
  },
  {
    "username": "pnpbackup",
    "rating": 6.0,
    "comment": "As long as you don't collect too many Dickheads your okay but it is hard not to get them! Hahaha",
    "timestamp": 1738018800
  },
  {
    "username": "BoardGameGumbo",
    "rating": 7.0,
    "comment": "gave to Ian",
    "timestamp": 1761069660
  },
  {
    "username": "CMagex",
    "rating": 7.0,
    "comment": "bunker\n\nUse Everdeck for this - I think I should get the actual game sometime considering it is small and the cards are great",
    "timestamp": 1760911200
  },
  {
    "username": "justinjaeger",
    "rating": 7.0,
    "comment": "The heavy trading element makes this really fun to play with a group. Usually players end up with similar scores so I'm not sure if the strategy isn't that deep or if we're playing too cooperatively",
    "timestamp": 1760911200
  },
  {
    "username": "paulclarke339",
    "rating": 6.5,
    "comment": "A \"humour\" (or at least silly) themed card game where the designer actually bothered to design a good game to go with it.\n\nBohnanza is a clever trading game, I think the rule about not re-arranging your hand is fantastic.\n\nBetter with more players (4 is the minimum I'd want to play it with). I like the theme (farming) but some people may be turned off by the artwork/concept of counting beans.\n\nBought Spring 2005, Sold Feb 2011 after I got bored with it.",
    "timestamp": 1760738400
  },
  {
    "username": "RadicalDog",
    "rating": 7.0,
    "comment": "I like how the game is mostly above the table bartering, very social.",
    "timestamp": 1760652000
  },
  {
    "username": "Robber91",
    "rating": 7.0,
    "comment": "fun party game - lots of negotiating",
    "timestamp": 1760479200
  },
  {
    "username": "purvisa",
    "rating": 7.0,
    "comment": "For some reason this gets less play than we want. It has a small box, so it is easy to overlook, but the planting mechanic makes the timing of decisions particularly consequential for such a simple game. It looks goofy, but as more plays happen, the depth—not great by any means—reveals itself. It is quick, fun enough, and a great bridge between heavier titles.",
    "timestamp": 1759960800
  },
  {
    "username": "bonster20",
    "rating": 7.0,
    "comment": "[two copies different versions]\nGood gateway game. I actually prefer the 2-player game because of the lack of explicit trading (I'm not big on trade/negotiation), though I've never actually played with more than 3.",
    "timestamp": 1759874400
  },
  {
    "username": "elucidarian",
    "rating": 7.0,
    "comment": "Another crowd-pleaser, with great wheeling and dealing. Never discount the seemingly generous player!",
    "timestamp": 1759442400
  },
  {
    "username": "Analytical",
    "rating": 7.0,
    "comment": "[Adult - Weight:Family - Players:2-7 (Best:4) - Size:Mini - Time:Medium]\n\n*Set Collection / Competitive*\n\n*Portable Group Game*\n\nA accessible classic set collection game, which is a little bit to long for the experience.\n\n\nPRO:\n- Supports wide range of people and doesn't need much playing space\n- easy to learn\n- easy to bring to the table\n- needs less shelf space\n\nCON:\n- very luck depended\n- negotiation isn't for everyone\n- basic theme and mechanic doesn't lead to an unique experience\n\nAlternatives: China Town",
    "timestamp": 1759269600
  },
  {
    "username": "mhinto",
    "rating": 7.0,
    "comment": "2-7 players",
    "timestamp": 1759096800
  },
  {
    "username": "Budgetface",
    "rating": 7.0,
    "comment": "Sælg",
    "timestamp": 1759010400
  },
  {
    "username": "canemarrone",
    "rating": 7.0,
    "comment": "This game needs the right group. I've seen people enjoying it a lot, and others get overly aggressive or just \"not getting it\". I like to play it casually.",
    "timestamp": 1758578400
  },
  {
    "username": "stofke",
    "rating": 7.0,
    "comment": "R020",
    "timestamp": 1758492000
  },
  {
    "username": "mjhm",
    "rating": 7.0,
    "comment": "in wpg",
    "timestamp": 1758319200
  },
  {
    "username": "peterlevi",
    "rating": 7.0,
    "comment": "(open)",
    "timestamp": 1758060000
  },
  {
    "username": "AlfaGT",
    "rating": 6.5,
    "comment": "06/2025",
    "timestamp": 1757714400
  },
  {
    "username": "doopcity",
    "rating": 8.0,
    "comment": "Queen & Rook\nHazel House was playing",
    "timestamp": 1761056040
  },
  {
    "username": "wooloo1",
    "rating": 8.0,
    "comment": "Trade beans. Plant beans. Stick your friends with worthless beans. Talk smack about beans. Talk smack about your worthless friends. Fun!",
    "timestamp": 1760824800
  },
  {
    "username": "whitecatplays",
    "rating": 8.0,
    "comment": "I could easily see it become one of my favourites",
    "timestamp": 1760738400
  },
  {
    "username": "paimon616",
    "rating": 8.0,
    "comment": "만화동아리에서 자주 즐겼던 추억이 있다.\n열심히 그림그리다가 힘들때 한 판씩 하면 그렇게 재미있을 수 없었다.",
    "timestamp": 1760652000
  },
  {
    "username": "hanvelsing",
    "rating": 8.0,
    "comment": "Very social, bartering not only encouraged but mandatory, if you like the trading aspect of e.g. Catan you will love this",
    "timestamp": 1760652000
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "Kids 8+\n\nBOHNANZA (3-5 players)\nBOONANZA DE UITBREIDING (3-7 players)\nLADYBOHN\n\nSolo Bohnanza: https://boardgamegeek.com/filepage/269405/bohnanza-solo-vari...",
    "timestamp": 1759960800
  },
  {
    "username": "jorissuurmeijer",
    "rating": 8.0,
    "comment": "I always have a lot of fun playing this game. Love the rediculous trades, fun interactions and also the planning ahead.",
    "timestamp": 1759788000
  },
  {
    "username": "matthan",
    "rating": 7.5,
    "comment": "Wonderful card trading game. Hone your bargaining skills before you play. Plays surprisingly well as a two player.",
    "timestamp": 1759442400
  },
  {
    "username": "MorelliBuendia",
    "rating": 7.5,
    "comment": "Love me some beans. Really fun, light negotiation game.\n\nMogul Scale: 1/A. You cannot change the order of your cards, but the game shines when you realize that negotiating IS the way to mess with that, so you should negotiate everything. Still, I don't think that's enough to push this to a B.",
    "timestamp": 1759442400
  },
  {
    "username": "chrisrowe1989",
    "rating": 8.0,
    "comment": "Farming beans? At first it sounds eh, but this is well designed. Highly recommend.",
    "timestamp": 1759356000
  },
  {
    "username": "mofo83",
    "rating": 8.0,
    "comment": "One of the best-designed little card games of all time, with a genius forced-trading mechanism(s). Always a hit no matter who I introduce it to. (Thrifted x3, traded for, purchased, etc.) - Keeper",
    "timestamp": 1759356000
  },
  {
    "username": "dougfoolery",
    "rating": 8.0,
    "comment": "This game is a hoot! It provides the perfect sandbox for negotiation without being too convoluting. Having to plant beans at the start of your hand, while being unable to rearrange cards really forces you to participate in the cutthroat business of bean trading. It may be group dependent but from my experience most will come to not only embrace but love its chaos and messiness.",
    "timestamp": 1759356000
  },
  {
    "username": "latschediwes",
    "rating": 8.0,
    "comment": "Bohnanza is light, socially oriented, open and satisfying where everyone is always involved and engaged. Easy, cheap, fast, direct, friendly and a lot of talking. The card names are silly... But seriously, what's not to like?",
    "timestamp": 1759269600
  },
  {
    "username": "viridon",
    "rating": 8.0,
    "comment": "+ Simple, but highly engaging trading mechanic\n+ Low rules overhead, decently wide decision space\n+/- Art is hit-or-miss",
    "timestamp": 1759183200
  },
  {
    "username": "jaceycole",
    "rating": 7.5,
    "comment": "Used to play this way back in the day with the Reids.\n\n6.5 - 1 play 4 players recently - Some ability to make clever negotiations, but overall the decision space feels a little static and a little too long.\n\n7.0 - 5 players - This game works better with gamers than family. Play the draw a card after every turn variant.",
    "timestamp": 1759096800
  },
  {
    "username": "BoardgameBriBri",
    "rating": 7.5,
    "comment": "Category: Farming, negotiation\nMechanism: Hand management, negotiation, set collection, trading",
    "timestamp": 1759010400
  },
  {
    "username": "Paoh",
    "rating": 8.0,
    "comment": "FR\nBest 4-5>3-7\n161*56x87",
    "timestamp": 1758924000
  },
  {
    "username": "badiolik",
    "rating": 9.0,
    "comment": "trades, entertainment, and some insult to other players!",
    "timestamp": 1760479200
  },
  {
    "username": "nhmc",
    "rating": 8.5,
    "comment": "This is a masterpiece!\n\nNo downtime and constant player interaction. The game design cleverly rewards trading - it even rewards *giving* cards away. This is in contrast to Catan, where trading is fun when it happens, but to win it feels like refusing trades is always the best decision.\n\nThe standard 3-5 player game is the smoothest and most straightforward version.\n\nUpdate Sep 2025: I still love this so much, but it's hard to get to the table I think due to a combination of weird theme/artwork and the relatively long play time (it's light but still goes for ~40min)",
    "timestamp": 1758319200
  },
  {
    "username": "pumaman123",
    "rating": 8.5,
    "comment": "Very good with 3",
    "timestamp": 1757800800
  },
  {
    "username": "cenealon",
    "rating": 9.0,
    "comment": "2022 Top Games\n2024 Top Games\n2025 Top Games",
    "timestamp": 1757023200
  },
  {
    "username": "Lebro262",
    "rating": 8.5,
    "comment": "great w/ house rules a 5 otherwise",
    "timestamp": 1756764000
  },
  {
    "username": "mitorious",
    "rating": 8.8,
    "comment": "It might look a bit iffy but this is the fastest TTS (Time to shouting game I own). Simple to teach, simple to play but good fun for all ages and skill levels. It's Beanz!",
    "timestamp": 1755900000
  },
  {
    "username": "HerbertML",
    "rating": 8.9,
    "comment": "/*#D2*//*stay*/",
    "timestamp": 1755554400
  },
  {
    "username": "eladnl",
    "rating": 8.5,
    "comment": "Nice and entertaining negotiation game.",
    "timestamp": 1755295200
  },
  {
    "username": "VardaofStars",
    "rating": 9.0,
    "comment": "Super fun game. Simple rules with good decissions. Created a lot of table talk which is always my goal.",
    "timestamp": 1754431200
  },
  {
    "username": "ohlin",
    "rating": 9.0,
    "comment": "Fun and fast bean farming game. Play smart or stupid, you'll have fun.",
    "timestamp": 1752962400
  },
  {
    "username": "docker37",
    "rating": 9.0,
    "comment": "Loaned to Josh - July 2025",
    "timestamp": 1751925600
  },
  {
    "username": "ultimoratio",
    "rating": 9.0,
    "comment": "Update: May 2024\n\nDown to 4 stars. Not as good as other light weight negotiation games like Zoo Vadis or Intrigue\n\n==================\n\nReally tricky hand management rules. But once you get past internalising that rule, it is the best trading game I've played. The mechanics is better than Chinatown and Sideread Confluence. Chinatown is too random at early game and too predictable in the late game. Sidereal Confluence is pretty great, but it's hard to analyse the board state to figure out what people what - therefore, calculate how valuable your excess materials are.\n\nBohnanza is pretty stripped down trading. The planting mechanic gives players an incentive to sell. The board state isn't a bloody mess so you can actually read what people want. And the cards have different values, which makes the trade more complex than a simple 1 for 1 value.",
    "timestamp": 1751839200
  },
  {
    "username": "tuankqch",
    "rating": 9.0,
    "comment": "A RIOT if played with the right people.",
    "timestamp": 1751839200
  },
  {
    "username": "TrueMead",
    "rating": 9.0,
    "comment": "An excellent game, through and through. Honestly, it's only negative is that the bean puns that the German designers infused into each card doesn't translate very well at all. But that doesn't hinder play, in fact it's often a quirky topic of conversation.",
    "timestamp": 1751580000
  },
  {
    "username": "BigG1989",
    "rating": 8.5,
    "comment": "Solid card game, an a really deep amount of game for just a deck of cards. It's a bit long",
    "timestamp": 1751407200
  },
  {
    "username": "germansotelo99",
    "rating": 9.0,
    "comment": "Buen juego de negociación",
    "timestamp": 1751320800
  },
  {
    "username": "SusWells11",
    "rating": 9.0,
    "comment": "Very fun game!",
    "timestamp": 1751148000
  },
  {
    "username": "kanchmoney",
    "rating": 10.0,
    "comment": "My favorite game of all time - easy enough to explain to a casual crowd and gets chaotic (in a fun way) in experienced groups\n\nwe play w/ house rules where instead of forcing yourself to plant whatever you couldn't trade away, you add to the back of your hand",
    "timestamp": 1760565600
  },
  {
    "username": "Dasoogle",
    "rating": 10.0,
    "comment": "Best at 4-5 players. Reccomended at 3-7 players.\n\nInclude all beans at 4-5 players. Remove cocoa and garden beans at 6-7 players.\n\nHouse Draw Rule for 3-5 players: At the end of your turn, draw 5 cards into the back of your hand.",
    "timestamp": 1759701600
  },
  {
    "username": "jatak11",
    "rating": 10.0,
    "comment": "75 kr",
    "timestamp": 1759269600
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "The trades are silly for how backwards they are in this game, but it works because it's player-driven. It's as crazy or tame as players want it to be. What slows it down is explaining all the weird procedure to a turn, do this then that, don't rearrange your hand. So maybe it's a miracle that it's as player-driven as it is. I find it more interesting than most euro trading games like Chinatown, maybe because of the possibility of things going disastrously wrong for a player.",
    "timestamp": 1757800800
  },
  {
    "username": "mawilson4",
    "rating": 9.5,
    "comment": "Goodness, this one hasn't aged a bit, has it? Bohnanza provides fertile grounds for furious negotiations, but importantly, not constant negotiation. This, then, allows for something just as interesting: the meta-game that will emerge as a game progresses, and negotiations include those NOT bargaining for a particular deal, who will try to talk one side or the other out of the proposed deal. In few other games might you consider a trade that helps one player, is neutral to you, but is designed solely to deny a third player a crucial card.\n\nThe result is something magically cooperative AND cutthroat, where the rules are quickly internalized and the game immediately becomes an interpersonal decision space instead of a mechanical one.\n\nThis is also a game where player personalities come out, possibly more so than any other game I've played. Who you're playing with matters intimately, and that's true of the best games.\n\nVarious player counts present varying possible quibbles, but none bother me too much. This is really just Table Talk, The Game, and I love it for that.",
    "timestamp": 1756072800
  },
  {
    "username": "CameronWLucas",
    "rating": 10.0,
    "comment": "Bohnanza shines for a few reasons...\n\n1) It is light enough that it doesn't feel like work.\n\n2) It has interesting decisions and tension\n\n3) The presence of trading and the tension of fixed hand order means that you are engaged in the game on everyone else's turn (which is something most light traditional card games lack)\n\nIn Bohnanza, you can chat with people around the table and just have an overall relaxing yet engaging experience with your friends and family. This absolutely kills games like Uno and Phase 10. Once someone knows the rules, it doesn't feel that much harder. Yet it provides decisions, engagement, and it's not just blind luck!\n\nThe one downside of Bohnanza is it can be a little difficult to teach with non-gamers (the audience that this game shines with). If people give it a chance, they'll get it after once or twice around the table, but it's been a tough sell to even get people to try it in my experience",
    "timestamp": 1754690400
  },
  {
    "username": "ulkoturkulainen",
    "rating": 10.0,
    "comment": "played this as a child. need a group of regulars for play to confirm my rating",
    "timestamp": 1754258400
  },
  {
    "username": "KyberPearl",
    "rating": 10.0,
    "comment": "Very fun! Love the bidding action. Bought used from WA State Gaming Expo. Still in good condition.\n\nCost: $11",
    "timestamp": 1753135200
  },
  {
    "username": "RossBoss629",
    "rating": 9.5,
    "comment": "Love the negotiating necessary for this game. One of the most satisfying games to teach to see when other players have the \"a-ha moment.\"",
    "timestamp": 1752703200
  },
  {
    "username": "capt_neb",
    "rating": 10.0,
    "comment": "All-timer!",
    "timestamp": 1750197600
  },
  {
    "username": "Bogarona",
    "rating": 10.0,
    "comment": "You can play this game with anyone! And why you ask?\nTrading and bartering is in our nature.. and this game shines in it.\nBecause of the way how you play you hand.. you need to trade or give away beans for free if you want the big bucks. Beans have worth, but because of the dynamic gameplay, this changes. How many of a certain bean are already out of the game? How much do I have in my hand? Are others going for the same beans?\nYou can play this cutthroath or casual.. social or to win.\nIt does not matter... you will have a very fun social experience!\n\nThis game is a winner! 10/10 Will never turn down a game of Bohnanza!",
    "timestamp": 1749938400
  },
  {
    "username": "ponchera69",
    "rating": 10.0,
    "comment": "I can play this all my life. Easy, this is the best game on the geek. 4-5",
    "timestamp": 1748469600
  },
  {
    "username": "Tsunamiburgos",
    "rating": 10.0,
    "comment": "Uno de los favoritos de la casa.",
    "timestamp": 1746655200
  },
  {
    "username": "HughCross",
    "rating": 10.0,
    "comment": "The perfect and easiest pure negotiation game. I'm always carrying it with me as it's a small box and has bring me so many good memories. To be fair i always run through the deck 2 times instead of 3 to keep the lenght great for a lean experience.",
    "timestamp": 1746482400
  },
  {
    "username": "Evertore",
    "rating": 10.0,
    "comment": "sleeved",
    "timestamp": 1745964000
  },
  {
    "username": "TrevorJr26",
    "rating": 10.0,
    "comment": "Bohnanza my beloved. It's simply the best boardgame. I've showed this game to basically everyone I've played boardgames with, and everyone loves it. Multiple times people have bought it afterwards. Best in class negotiation and player interaction. Stupid theme and art that you will think is ugly and then come to love. The rules can be tricky to explain if you're not careful, but once you get the knack of it it'll be a 5 minute teach maximum. This can be a filler or it can be the main event. There's an element of luck involved but the best swindler always wins. The game's design guides you into trading in a fun way. You will want to give people good deals to get cards out of your hand, you will drive a hard bargain for the player who is in the lead and you will feel the sweet satisfaction of harvesting 3 garden beans. The German smallest box edition is superior because the bean names are funny to say and no one needs the coffee or a big box. I will never turn down a game of Bohnanza, everyone should own this.",
    "timestamp": 1745445600
  },
  {
    "username": "Durin_the_Deathless",
    "rating": 9.6,
    "comment": "Amazing classic card game that requires very little from players other than enthusiasm and the ability to have fun with the system and not take it too seriously. The negotiation is very freehanded and allows players to make deals that can be ludicrous and hilarious. It's been a hit at every single table I bring it to with people new to the hobby wanting to play repeat rounds or ask to borrow it.\n\nBest at 5 players in my opinion.",
    "timestamp": 1743631200
  }
]