[
  {
    "username": "darthhh",
    "rating": 1.0,
    "comment": "Venía sin las cartas y de los mails escritos no me contestó nadie",
    "timestamp": 1282255200
  },
  {
    "username": "Mozart78",
    "rating": 2.0,
    "comment": "I like the concept of stock market games, so I was seduced by this title. In retrospect, I should have gone for Power Grid or any other number of better market games, as this was terrible! Granted, I only ever played it as a two-player, but I couldn't see this being enjoyable with any number of players. You buy tech until it's too high, then you sell tech and buy something else. You buy that until it gets too high, then you sell it and buy something else. Rinse, repeat, rinse, repeat until the game ends. Sure, there are some special market cards that mess with the basic gameplay, but this is essentially the game. Couldn't get rid of it fast enough.",
    "timestamp": 1491256800
  },
  {
    "username": "BoomDooger",
    "rating": 2.5,
    "comment": "Chels: 2\nAnt: 3\n\nNot one of Knizia's finer outings - while it does bring his characteristic simplicity to the act of buying and selling shares, it just falls flat with little interesting activity. The card play is rather rote and 'take-that', the shifting cubes are clever but insubstantial, and it passes by with little effect.",
    "timestamp": 1754776800
  },
  {
    "username": "Vysetron",
    "rating": 4.0,
    "comment": "Unremarkable stock game that's way too stiff, both in the buy/sell and the cardplay. Not horrible and ends quick, but Knizia has done several better.",
    "timestamp": 1658268000
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "Simple stock buying and selling game.\n\nGot in 2007",
    "timestamp": 1731279600
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "It does what it says on the tin: buy low; sell high. It is a good game, but it lacks some kind of twist that would give the game some layers to go through that would make it deep. That's the sort I'd like to see from these games with a dynamic market",
    "timestamp": 1726696800
  },
  {
    "username": "LittlePegasus",
    "rating": 6.0,
    "comment": "The Motley Fool's Buy Low Sell High",
    "timestamp": 1734476400
  },
  {
    "username": "GTAcademy",
    "rating": 5.5,
    "comment": "最basic 股票低買高賣game by RK, 有d 過份簡單，但game time 都快既。\n過份簡單，有d 乏味，stockpile 甚至1920 Wall street 都好玩d. 不過係1996年game",
    "timestamp": 1711666800
  },
  {
    "username": "BoardGameOmakase",
    "rating": 6.5,
    "comment": "Palmyra was originally published in 1996 and was reprinted as Buy Low Sell High in 2005 by The Motley Fool, a financial consulting firm. A strange partnership indeed. It's kinda like WebMD publishing a slightly re-themed Pandemic.\n\nThe newest 2024 version of Palmyra, this time published by Group SNE brings the game back to its Middle Eastern roots.\n\nPalmyra is a stock market manipulation game, where players use cards to increase or decrease the value of three commodities. The cards are placed on the board and serve as a kind of timeline of events which only gets activated at the end of the round. Players can then pivot and adjust strategies based on what others have played.\n\nI like to think that the game has more depth and more elegance than what I saw after my first play, but it certainly does not feel as smooth or as refined as I had hoped. Knizia certainly has a lot better stock market games. Despite a wonderful production with clean artwork and solid components, I think Palmyra didn't hook me enough to warrant more plays.",
    "timestamp": 1746136800
  },
  {
    "username": "Wrecktangled",
    "rating": 8.0,
    "comment": "I am surprised this doesn't get more love, especially with the Knizia fans like myself. This is basically just Botswana with a little more going on. The benefits are interesting stock manipulations paired with the good hand management. The trade off is math, quite a bit of math. All easy math, but it is a bit tedius to move your marker up and down the score track so much. Still, I quite like it. It hits that perfect amount of simple rules to strategic decisions for me. It plays quick and has some nice player interaction. I will be keeping this.\n\nOH! And it plays well at 2 players. What stock market game plays good at 2 players? Thats a big plus for me.",
    "timestamp": 1747173600
  },
  {
    "username": "Parallelcircuit",
    "rating": 9.0,
    "comment": "Great reimplementation of Palmyra. One of my favourite games, hands down. Scales very well from 2-4 players too!",
    "timestamp": 1429826400
  },
  {
    "username": "ShiannLin",
    "rating": 10.0,
    "comment": "1996 Meeples Choice Award Nominee",
    "timestamp": 1735858800
  }
]