[
  {
    "username": "James_Briggs",
    "rating": 1.0,
    "comment": "This was so awful I practically gave it away at a convention in 1982. It is completely mind boggling how popular its descendants are. I had been coaxed into playing it a few times in the 1990s and 2000s but never again. It is a game that is on permanent veto.",
    "timestamp": 1625263200
  },
  {
    "username": "Slaverzguild",
    "rating": 1.0,
    "comment": "There is a \"right way\" to play the factions in \"Axis and Allies.\" Even when you play properly you just chuck dice and hope for the best. As soon as you're old enough to understand that you're old enough to move on to better games.\n\nIt's so long it can suck up an entire day.",
    "timestamp": 1483484400
  },
  {
    "username": "annemariemcd",
    "rating": 1.0,
    "comment": "Rather die by papercuts than ever play again.",
    "timestamp": 1386198000
  },
  {
    "username": "RonCarlson01",
    "rating": 1.0,
    "comment": "BIG",
    "timestamp": 1382914800
  },
  {
    "username": "comicbookartist",
    "rating": 1.0,
    "comment": "Played once.",
    "timestamp": 1359932400
  },
  {
    "username": "Dr Brian",
    "rating": 1.0,
    "comment": "I've played this twice, once in 1986 and again in 2008. As an avid war gamer (ASL World Champion), it was hard for me to find enjoyment in this one. NEver the less, I tried again in 2008 when some members at the club wanted to play. I'll never make that msitake again. To each his own.",
    "timestamp": 1304287200
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "There are great WWII grand strategic games. There's also \"Risk\". This is neither.",
    "timestamp": 1286661600
  },
  {
    "username": "Boarass",
    "rating": 1.0,
    "comment": "Annoyingly fiddly and not particularly skillful for all that. This game is dated, and badly. The lack of diplomacy makes me wish I were playing Risk -- and that's a bad sign.",
    "timestamp": 1275256800
  },
  {
    "username": "Stratagems",
    "rating": 1.0,
    "comment": "Never have I detested the element of chance so much.",
    "timestamp": 1210629600
  },
  {
    "username": "Salo sila",
    "rating": 1.0,
    "comment": "Deadly dull. Every game was the same. Makes Risk look fun.",
    "timestamp": 1182463200
  },
  {
    "username": "nancycan",
    "rating": 1.0,
    "comment": "Painful just to set up.",
    "timestamp": 1135810800
  },
  {
    "username": "stealium",
    "rating": 2.0,
    "comment": "D",
    "timestamp": 1742252400
  },
  {
    "username": "kataclysm",
    "rating": 2.0,
    "comment": "Takes too long for my tastes. We played all day and never finished.",
    "timestamp": 1739055600
  },
  {
    "username": "junior_gracz",
    "rating": 2.0,
    "comment": "Wonderful times , wonderful memories a lot of fun to be had but..\nCome on, they never really testeed this game. The win conditions may actually never happen!\n\nI played hundreds of hours of this game, and the actual end never happened. Just consensus or concedes or.. out of time (8+ hours)\n\nAxis & allies served as an inspirations for better modern games. It's time has passed",
    "timestamp": 1678230000
  },
  {
    "username": "Gendalm",
    "rating": 2.0,
    "comment": "Good game when it came out, now there are better games; it requires really too much time and I don't like the fixed starting setup of the players.",
    "timestamp": 1672614000
  },
  {
    "username": "Xenophobic_Luddite",
    "rating": 2.0,
    "comment": "I initially bought this game sometime in the late '90s because I must have been suffering from a \"draught\" of new games.\n\nI was hoping it would be something like a cross between Victory in the Pacific, War at Sea, and Hitler's War but with plastic army men.\n\nMy initial displeasure was with the toxic fumes emitted from my box of Chinese plastic when the box was opened, which literally made me nauseated and physically ill (to the point of vertigo).\n\nThe game rules/mechanics came up very short of my expectations, and I now refuse to contemplate playing this game. It reminds me too much of \"Risk\" (another game I despise).\n\nI do however give credit to this game for the fact that it is one of several games that have been \"entry drugs\" for this hobby, and hopefully many of the people who suffered this game went on to find more meaningful board game fare to waste their time on.\n\nFor me, my \"entry drug\" was \"Stratego\" (followed by Tactics II, Panzer Leader, and Squad Leader ... and the rest is history).",
    "timestamp": 1670454000
  },
  {
    "username": "SrFinn",
    "rating": 2.0,
    "comment": "Wonderful times , wonderful memories a lot of fun to be had but..\nCome on, they never really testeed this game. The win conditions may actually never happen!\n\nI played hundreds of hours of this game, and the actual end never happened. Just consensus or concedes or.. out of time (8+ hours)\n\nAxis & allies served as an inspirations for better modern games. It's time has passed",
    "timestamp": 1670194800
  },
  {
    "username": "Pithy_Gamer",
    "rating": 2.0,
    "comment": "More akin to a \"toy\" than a strategy game. Something I simply outgrew.",
    "timestamp": 1667516400
  },
  {
    "username": "Danagonia",
    "rating": 2.0,
    "comment": "Throw dice, see if you win… That is basicly the game.",
    "timestamp": 1628028000
  },
  {
    "username": "Sir Pent",
    "rating": 2.0,
    "comment": "This game is 25% initial setup (out of your control), 25% dice rolling (out of your control), 25% tactical movement strategy, and 25% unit purchasing strategy. So overall, half the game is outside your control, and there is nothing to stop snowballing. Very frustrating for such a long and complex game.",
    "timestamp": 1620165600
  },
  {
    "username": "heli",
    "rating": 2.0,
    "comment": "http://spotlightongames.com/military/mnights/a.html#axis",
    "timestamp": 1593468000
  },
  {
    "username": "lucsavoie9",
    "rating": 2.0,
    "comment": "Too involved for what it is.",
    "timestamp": 1578178800
  },
  {
    "username": "kwhite1",
    "rating": 3.0,
    "comment": "P",
    "timestamp": 1757973600
  },
  {
    "username": "oursino",
    "rating": 3.0,
    "comment": "Trop long à préparer, trop de règles, trop long à jouer, à part ça le principe est pas mal. Un Risk plus évolué. A réserver aux amateurs de petits soldats qui n'ont pas peur des jeux un peu longs.",
    "timestamp": 1744840800
  },
  {
    "username": "Caedwyr",
    "rating": 3.0,
    "comment": "Overly complicated, with some serious balance conditions. This is a game that drags out for far too long and is mostly notable for being a lighter weight war game. Then again, many wargames have questionable balance and mechanics, so this isn't an exception, aside from being pushed as \"Risk but better\" back when it was new at the local game shops.",
    "timestamp": 1717452000
  },
  {
    "username": "shanev316",
    "rating": 3.0,
    "comment": "This is Risk with wayyyyy more rules. Loved it as a kid, but I now realize it's not worth the time investment.",
    "timestamp": 1706310000
  },
  {
    "username": "mduke",
    "rating": 3.0,
    "comment": "This is pretty good for a mass-market wargame, but at this strategic level you will get silly outcomes at times.\n\nNot terrible, but \"strategic WWII game\" is probably the most saturated wargame market there is, and there's no reason to play this.",
    "timestamp": 1706137200
  },
  {
    "username": "SteveTremendous",
    "rating": 3.0,
    "comment": "Upside: First epic boardgame I tried. Gateway past Risk into some great games.\n\nDownside: Takes too long for what it is. Too much luck in a few key aspects. Much better games out there for generating a similar experience.\n\nI'm not likely to play this many more times.",
    "timestamp": 1699570800
  },
  {
    "username": "Wild Admiral",
    "rating": 3.0,
    "comment": "loved it as a kid. my gateway wargame.",
    "timestamp": 1691532000
  },
  {
    "username": "ILoseAtLife",
    "rating": 3.0,
    "comment": "Long, dull, and outdated. You can do better.",
    "timestamp": 1687557600
  },
  {
    "username": "sangdayton",
    "rating": 3.0,
    "comment": "Great game idea and mechanics, it just takes too long for me to play it with anyone in my family.",
    "timestamp": 1684792800
  },
  {
    "username": "grasa_total",
    "rating": 3.0,
    "comment": "One of the many games where playing it once in childhood made me think boardgaming was all about little toys you got to carefully place on a big board for a game that wasn't fun to play and would never end.\n\nRedeeming factor: I internalized who was allied with who in World War II a little younger than I otherwise might of, which I guess is useful?",
    "timestamp": 1655416800
  },
  {
    "username": "GarzandFriends",
    "rating": 3.0,
    "comment": "In the late 90s this seemed like an awesome game but it was impossible to find someone to play with. Even back then there were much better games around.",
    "timestamp": 1650924000
  },
  {
    "username": "mikethemoose",
    "rating": 4.0,
    "comment": "An extremely light WWII board game. Honestly is a step up from say....Risk, but TBH as far as popular light wargames go I don't like the lack of balance, and oversimplification and the dice outcome heavy mechanics.",
    "timestamp": 1745013600
  },
  {
    "username": "OthelloKeys",
    "rating": 4.0,
    "comment": "Enjoyed in its time.",
    "timestamp": 1728424800
  },
  {
    "username": "DSmitty",
    "rating": 4.0,
    "comment": "I used to like the game when I was a kid, but it takes a really long time to set up and play and it just drags on forever.",
    "timestamp": 1705618800
  },
  {
    "username": "Amraam555",
    "rating": 4.0,
    "comment": "Loved as a kid but suffers from predictive play to have a chance. Better with more players (4-5). Lots of battles though.",
    "timestamp": 1698012000
  },
  {
    "username": "Zarel",
    "rating": 4.0,
    "comment": "The mechanics for this game were good for its time. This game is way too long for the enjoyment potential, and it can drag out for hours after it is nearly certain one side will win.",
    "timestamp": 1683669600
  },
  {
    "username": "lexen",
    "rating": 4.0,
    "comment": "gave this one away when I got the revised version wich is alot better!",
    "timestamp": 1680127200
  },
  {
    "username": "stenole",
    "rating": 4.0,
    "comment": "(5P) A team game where you play as an allied country or an axis country during WW II. Build different units and roll to take territory. A little too long for what it is and very strategically solved ahead of time.",
    "timestamp": 1652652000
  },
  {
    "username": "mawilson4",
    "rating": 4.0,
    "comment": "I'd probably play once for nostalgic purposes, but this suffered many of the same problems as Risk, another that I enjoyed and played a bunch as a teen. It was incredibly long, and swingy in a way that would marginalize some players for hours on end. That it had depths not present in Risk made it a novelty at the time. But even then, it sometimes felt as much a burden as a joy.",
    "timestamp": 1646607600
  },
  {
    "username": "adrianfrancies",
    "rating": 4.0,
    "comment": "2-5 players (best at 2, 5)",
    "timestamp": 1637276400
  },
  {
    "username": "Noot",
    "rating": 4.0,
    "comment": "the mother of \"complex\" strategic war games",
    "timestamp": 1635544800
  },
  {
    "username": "Entropology",
    "rating": 4.0,
    "comment": "A classic dice chucker. It doesn't hold up now, but for the time, tons of fun.\n\nI'll also brag just a bit. I was one of the top ranked players in the world when you could play this on PC in the 90's. Can't go back to cardboard once you know the strategies of a 20 round game. Too slow!",
    "timestamp": 1627509600
  },
  {
    "username": "spelledaren",
    "rating": 5.0,
    "comment": "30ish plays?",
    "timestamp": 1759874400
  },
  {
    "username": "Philip Jelley",
    "rating": 5.0,
    "comment": "I won this at a raffle in Milan in 2005, I also won the DBM tournament with four straight victories (10-0, 10-0, 10-0 and 10-0). After a look I wasn't interested in the game, so sold it when I got home.",
    "timestamp": 1756245600
  },
  {
    "username": "abjohnuf",
    "rating": 5.0,
    "comment": "played at UF",
    "timestamp": 1753480800
  },
  {
    "username": "Spada_",
    "rating": 5.0,
    "comment": "12+. War. 2-5 players - Best: 2, 5",
    "timestamp": 1747605600
  },
  {
    "username": "Maxplanck12",
    "rating": 5.0,
    "comment": "Better than risk, but it's not winning any awards.too complicated for the experience it provides.",
    "timestamp": 1745359200
  },
  {
    "username": "KoehnJ",
    "rating": 5.0,
    "comment": "Introductory theatre level combat gaming - too many dice to roll and the outcome is generally predictable.",
    "timestamp": 1745013600
  },
  {
    "username": "beep_beep",
    "rating": 5.0,
    "comment": "Messy, random, poorly balanced, takes forever to play. Is it a great game design? Probably not by contemporary standards. Lots of fond childhood memories, though, and it's still a hoot once in a while. Definitely delivers dramatic moments like no modern Euro ever could!",
    "timestamp": 1744840800
  },
  {
    "username": "Gwar13",
    "rating": 5.2,
    "comment": "medium",
    "timestamp": 1737068400
  },
  {
    "username": "mothertruckin",
    "rating": 5.0,
    "comment": "My uncle taught me this one in 1985 or so (along with RISK) which makes it my first 'hobby' game unless you want to count Dark Tower. I don't find the system compelling. Another factor is that I don't like miniatures in my boardgames. Give me counters, please. That being said, I see why it captured people's imaginations.",
    "timestamp": 1732921200
  },
  {
    "username": "Risktaker",
    "rating": 5.0,
    "comment": "Multi - Classic - WWII - Big Box - MB - Shrink Warp",
    "timestamp": 1732662000
  },
  {
    "username": "OmahaWargamer",
    "rating": 5.0,
    "comment": "It's ok",
    "timestamp": 1727906400
  },
  {
    "username": "Tyson2015",
    "rating": 5.0,
    "comment": "A relative bought me a copy of this for Christmas and I was impressed to a degree. It covered the war in an effective, efficient and engaging way especially for a teenager fascinated by WW2. Over the years my view of the game has declined and I have not played it in years. Tried to introduce it to my own children and they did not like it.",
    "timestamp": 1726610400
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Played at University - it was fun with beers.",
    "timestamp": 1723240800
  },
  {
    "username": "ilikecake",
    "rating": 5.0,
    "comment": "The game that really started me on the road to gaming in general, and wargaming in particular. I've had it since my 12th birthday. Little did my parents know that nearly 25 years later I'd be still into this sort of thing....\n\nThe gameplay is a bit simple for my tastes now, and is totally ahistorical. Really, really wierd things can (and usually do) happen. It is, however, a fun, easy game to get into, and can be used to rope the uninitiated into a game.\n\n(original collection) 2023 move to Cranbrook",
    "timestamp": 1707778800
  },
  {
    "username": "BillJ1967",
    "rating": 5.0,
    "comment": "Ok as an introductory game. However, the game becomes repetitive after a few plays because the main strategies quickly become apparent. I cannot describe how many different games with different players has been determined by what happens on the European German-Russian front.",
    "timestamp": 1682028000
  },
  {
    "username": "Warren Bruhn",
    "rating": 5.0,
    "comment": "Had a great time playing this old game. Obviously has limitations as a wargame, but it was fun.",
    "timestamp": 1678834800
  },
  {
    "username": "DetroitJohnny",
    "rating": 5.0,
    "comment": "Found at an antique shop. Brother-in-law destroyed me at this game a couple of years ago. Guess I'm not that good at this game but would like to try it again.",
    "timestamp": 1672873200
  },
  {
    "username": "lordvoldemort",
    "rating": 5.0,
    "comment": "Tremendous nostalgia value in this game; however, newer versions of A&A especially 2004 Revised replaces the game.\n\nIt suffers from some map problems where Africa is too easily overrun. It also has a strategy that requires you to build infantry for far too long. Tech is very overpowered, especially Heavy Bombers.\n\nI probably would never play this version again. But cannot part with the original editiion because of nostalgia value.",
    "timestamp": 1672786800
  },
  {
    "username": "SewerStarFish",
    "rating": 5.0,
    "comment": "I love WWII grand strategy, this is on the simpler end. To me it just plays slow.",
    "timestamp": 1672527600
  },
  {
    "username": "Steve Sunner",
    "rating": 5.0,
    "comment": "5 unless you are playing as the Japanese and then it's a 9!",
    "timestamp": 1664316000
  },
  {
    "username": "Nate156",
    "rating": 5.0,
    "comment": "I used to play this one a lot as a teen. It was the cause of many table flips and arguments.",
    "timestamp": 1658613600
  },
  {
    "username": "Dgotrek",
    "rating": 5.0,
    "comment": "I got the original Nova Game version and was surprised to see MB pick it up. We played it a lot in the 80s because it was simple, fast, and fun. It was great change of pace between rounds of Third Reich and Squad Leader.\n\nLater in life, I keep running into it and quickly get banned from play because of making mincemeat of neophytes. This isn't so bad because I become the sought after advisor for everyone at the table. Lost in the Great Storage Purge of 2015. I used to love pulling the paper one out to amaze fans of the plastic version.",
    "timestamp": 1658181600
  },
  {
    "username": "mineral2",
    "rating": 6.0,
    "comment": "This was a staple game during my high school years. Better than Risk in that there is a more concrete end goal, and better in that there are specialized pieces with varying cost and offensive or defensive abilities. And it's semi-collaborative, playing as two teams rather than every man for himself.",
    "timestamp": 1760565600
  },
  {
    "username": "Sportsam26",
    "rating": 6.3,
    "comment": "The OG axis and allies. Set the foundation for a great series but subsequent games have made vast improvements",
    "timestamp": 1753394400
  },
  {
    "username": "lhamichelle",
    "rating": 6.0,
    "comment": "Owned for collection purposes - I really have to be in the mood to play straight up war games.",
    "timestamp": 1752530400
  },
  {
    "username": "dLyonBW",
    "rating": 6.0,
    "comment": "Excellent game! I have played later versions and really appreciate the original playing pieces and map.",
    "timestamp": 1750197600
  },
  {
    "username": "Yokiboy",
    "rating": 6.0,
    "comment": "I love A&A, but it's a bit on the long side, and definitely best for just two players. It could work with five as a \"heavy\" beer & pretzels game.",
    "timestamp": 1749074400
  },
  {
    "username": "elschmear",
    "rating": 6.0,
    "comment": "I'm conflicted about this game.",
    "timestamp": 1747951200
  },
  {
    "username": "wread",
    "rating": 6.0,
    "comment": "Collecting",
    "timestamp": 1747951200
  },
  {
    "username": "Bankler",
    "rating": 6.0,
    "comment": "Played a few times in high school (when time was easier), but it's too long for the amount of decision making.",
    "timestamp": 1744581600
  },
  {
    "username": "Aermord",
    "rating": 6.0,
    "comment": "The game is fun enough, but with the high chance element in play, tactical choices matter less.",
    "timestamp": 1739142000
  },
  {
    "username": "DonJunk",
    "rating": 6.0,
    "comment": "Last Verified\nFebruary 8, 2025\n\n~$30 - $60 (some $100+)",
    "timestamp": 1739055600
  },
  {
    "username": "jimok",
    "rating": 6.0,
    "comment": "I played this a ton in college. I've moved on to Euro games, as I'd rather play three or four games in the same time it takes to finish this one, but I still have lots of fond memories of A&A. --- Played this recently for the first time in years. I'd forgotten how much fun it is.\n---\nUpdate, May 2024: Another casualty of the Great Purge of 2023-24.",
    "timestamp": 1738969200
  },
  {
    "username": "Unionbrogan",
    "rating": 6.0,
    "comment": "I have had this game forever. Not all people love playing this game with me.",
    "timestamp": 1737241200
  },
  {
    "username": "Marlydru",
    "rating": 6.0,
    "comment": "R\na few miniatures are missing",
    "timestamp": 1736550000
  },
  {
    "username": "DONALD65",
    "rating": 6.0,
    "comment": "Many of my friends who were causal wargamers moved from risk to this one. It was a natural progression and I followed suit. Liked the game because there were always enough people willing to play the game. It is a fun easy to learn system that gives who some idea about the grand strategy of the war. I liked the game but moved on to other advanced systems.",
    "timestamp": 1735945200
  },
  {
    "username": "AMI_SOLGER",
    "rating": 6.0,
    "comment": "Easy and fun game\nBurned on September 30, 2024",
    "timestamp": 1733698800
  },
  {
    "username": "Frankcastle1978",
    "rating": 6.0,
    "comment": "in Germany",
    "timestamp": 1727992800
  },
  {
    "username": "BenRon",
    "rating": 5.5,
    "comment": "1",
    "timestamp": 1725919200
  },
  {
    "username": "HankScorpio83",
    "rating": 6.0,
    "comment": "$35",
    "timestamp": 1724882400
  },
  {
    "username": "PolarDad",
    "rating": 6.0,
    "comment": "Childhood",
    "timestamp": 1719439200
  },
  {
    "username": "rseater",
    "rating": 6.0,
    "comment": "too long for what it is, but I like parts of it",
    "timestamp": 1719093600
  },
  {
    "username": "thesir",
    "rating": 6.0,
    "comment": "Haven't played it in decades, but I have fond memories",
    "timestamp": 1719093600
  },
  {
    "username": "Flow25",
    "rating": 6.4,
    "comment": "Old time classic that got me into loving the \"dudes on a map\" game. Will always be my core reference game, even though it is quite outdated today ... sadly.",
    "timestamp": 1718748000
  },
  {
    "username": "Live and let dice",
    "rating": 7.0,
    "comment": "One of the defining, if not THE defining game of my childhood/teenager years.\n\nA game I've played countless times, mostly against a friend of mine, and which provided immense fun and has an almost endless replayability factor despite its static starting setup (every time things were starting to shift in favour of one of the two sides, we adopted some new strategy which allowed to even the balance again).\n\n\nIt was great at the time; now... a bit less. Still, if I were to take into account the two expansions I bought back in the day (World War II The Expansion and World War II Expansion 2), which further improved my enjoyment of the game, I'd probably raise my rating by about half an additional point.",
    "timestamp": 1759874400
  },
  {
    "username": "GeologyNut",
    "rating": 7.0,
    "comment": "Classic WWII game!",
    "timestamp": 1757196000
  },
  {
    "username": "Bozok",
    "rating": 6.5,
    "comment": "The original A&A, though I don't like it as much as the newer 1942. The technology research mechanic is too much chance for my tastes.",
    "timestamp": 1756159200
  },
  {
    "username": "adamolanna",
    "rating": 7.0,
    "comment": "L'ho acquistato usato ma in perfette condizioni. Poi l'ho tenuto praticamente immacolato per anni e infine è andato perso nel trasloco. Comunque non sono patito dei wargame per cui...",
    "timestamp": 1755122400
  },
  {
    "username": "goodknee",
    "rating": 7.0,
    "comment": "Home",
    "timestamp": 1750456800
  },
  {
    "username": "Danno77",
    "rating": 7.0,
    "comment": "Own Digital",
    "timestamp": 1743804000
  },
  {
    "username": "acbmml",
    "rating": 6.5,
    "comment": "OH",
    "timestamp": 1743544800
  },
  {
    "username": "Knuckles7173",
    "rating": 7.0,
    "comment": "BUANG",
    "timestamp": 1743544800
  },
  {
    "username": "cubntin",
    "rating": 7.0,
    "comment": "2-5 players",
    "timestamp": 1743289200
  },
  {
    "username": "anton",
    "rating": 7.0,
    "comment": "Still got the grand-daddy of all the A&A games and pull it out for a play whenever gaming buddies stop by.",
    "timestamp": 1740351600
  },
  {
    "username": "Sitnam",
    "rating": 7.0,
    "comment": "Childhood classic that shaped the wargamer I am today.",
    "timestamp": 1739228400
  },
  {
    "username": "WaldoJeffers",
    "rating": 8.0,
    "comment": "5 Players",
    "timestamp": 1760652000
  },
  {
    "username": "dcpepp",
    "rating": 8.0,
    "comment": "What a classic!",
    "timestamp": 1759269600
  },
  {
    "username": "Indy500sr",
    "rating": 8.0,
    "comment": ".compleet\nEAN 032244044236\nIJK1",
    "timestamp": 1758319200
  },
  {
    "username": "snakeboy80",
    "rating": 8.0,
    "comment": "As a teenager this game blew me away. I never knew such a thing could exist. Unfortunately we never got to play a full game, as out time (and patience) was limited to afternoons.\n\nAnyway, it’s a classic. And still good once in a while.",
    "timestamp": 1756764000
  },
  {
    "username": "SilasG",
    "rating": 8.0,
    "comment": "This is and awesome game, yet I'm still very glad a revised edition was published in 2004 because the original had many mistakes or rules which didn't make sense.",
    "timestamp": 1754172000
  },
  {
    "username": "Aition",
    "rating": 8.0,
    "comment": "Klassiek strategisch W.O.II-spel. Het is fijn om vooraf een strategie te bedenken en daarna te kijken hoe die tijdens het spel uitpakt.",
    "timestamp": 1750543200
  },
  {
    "username": "Raynman0013",
    "rating": 8.0,
    "comment": "this is the game that started it all for me. This was the only game that i played the first 18 months in this hobby, multiple times a week. Only occasionally play for nostalgia purposes but fantastic game to learn the concept of counter attacks.",
    "timestamp": 1749247200
  },
  {
    "username": "Gwildar",
    "rating": 7.5,
    "comment": "Can take as long to set up as it can to play",
    "timestamp": 1743116400
  },
  {
    "username": "Ftr91",
    "rating": 7.5,
    "comment": "Risk on steroids in the 80's. Now still enjoyable and relatively easy to bring to the table. Only 2p though",
    "timestamp": 1737932400
  },
  {
    "username": "Bugscheese",
    "rating": 7.5,
    "comment": "I shouldn't like this as much as I do, but a game of this old, with this scope and with this theme that somehow pulls it off is commendable and if I'm in the mood, I'll dive in for the experience.",
    "timestamp": 1737846000
  },
  {
    "username": "Dennis64W",
    "rating": 8.0,
    "comment": "One of my original Boardgame hobby games.",
    "timestamp": 1725487200
  },
  {
    "username": "Arakal",
    "rating": 9.0,
    "comment": "It got pushed aside by the Anniversary Edition.",
    "timestamp": 1755554400
  },
  {
    "username": "K3ytwo",
    "rating": 9.0,
    "comment": "A classic",
    "timestamp": 1751320800
  },
  {
    "username": "Primalwolf",
    "rating": 8.5,
    "comment": "Long. Enjoy the theme. Dice can be cruel at times. Always has fun moments",
    "timestamp": 1750629600
  },
  {
    "username": "ripley3",
    "rating": 9.0,
    "comment": "Partita : Svariate",
    "timestamp": 1747864800
  },
  {
    "username": "MonteesMeeples",
    "rating": 9.0,
    "comment": "I've played this game so many, many, many times in my life. I played it with my Dad, my high school friends, buddies in the military, and now my boys. The game does have it's flaws and limitations, but I find it so comforting and familiar to play.",
    "timestamp": 1737414000
  },
  {
    "username": "kastel",
    "rating": 9.0,
    "comment": "Di",
    "timestamp": 1717797600
  },
  {
    "username": "GunnarM",
    "rating": 9.0,
    "comment": "TB My Dad",
    "timestamp": 1708556400
  },
  {
    "username": "RogueBlade",
    "rating": 9.0,
    "comment": "A great strategy game I have had a lot of fun playing. It takes a bit long though and can tend to be hard to find players to play with, and it isn't as fun to play with fewer players. But I love the strategy, balance, design and appearance of this game, as the idea of developing weapons and the chance you take on that is a fun concept. So if you have the time to finish a game which can easily take 3 to 6 hours to play, this game should be worth your time.",
    "timestamp": 1703804400
  },
  {
    "username": "SidKafizz",
    "rating": 9.0,
    "comment": "Who doesn't have a copy?",
    "timestamp": 1697407200
  },
  {
    "username": "faidutti_ludotheque",
    "rating": 9.0,
    "comment": "Ceux qui suivent la construction de ma \"ludothèque idéale\" vont sans doute être surpris de voir débouler un tel monstre dans une collection de jeux généralement plus légers. Si je n'ai plus aujourd'hui le temps ou la force de m'investir dans l'apprentissage un nouveau monstre, j'ai pourtant beaucoup pratiqué quelques jeux \"lourds\", notamment Warrior Knights, Britannia, Dune, Full Metal Planet et, le seul auquel je joue encore à l'occasion, Axies and Allies.\n\nAu milieu des années 80, Milton Bradley décida de lancer une gamme de jeux pour joueurs, la \"Gamemasters series\". À l'époque, cinq jeux furent publiés. Shogun conte les rivalités des seigneurs de guerre dans le Japon féodal. Fortress America se situe dans un futur proche et fantasmatique où les États-Unis sont attaqués par une improbable alliance russo-nippo-mexicaine. Axies and Allies, moins surprenant, traite de la seconde guerre mondiale. N'ayant jamais vu les deux autres (Broadside and Boarding Parties et Conquest of the Empire), je ne peux vous les décrire. TSR imita bientôt MB avec un superbe jeu de science fiction qui passa injustement inaperçu, Buck Rogers. Tous ces jeux se présentent sous la même forme, une boite énorme abritant un matériel superbe, avec des centaines de pions en plastique moulé et un plateau de jeu de près d'un mètre de côté. Les règles occupent une vingtaine de pages mais restent simples, aérées, avec de très nombreux exemples et schémas.\n\nNous sommes donc dans le monde des grands éditeurs, avec de grands moyens. Le joueur de wargames, ou de Civilization, qui ouvre la boite d'Axies and Allies ne peut qu'être impressionné par la richesse et la qualité du matériel. Au lieu de petits pions en carton couverts de symboles ésotériques, de superbes pièces en plastique représentant l'infanterie, les blindés, l'aviation et la marine, avec des moulages différents pour les différentes armées. Au lieu de vilaines cartes pastel en papier craquant, un superbe et brillant plateau de jeu en carton dur. Sans compter d'innombrables dés, des fiches avec le résumé des règles et quelques informations essentielles pour chaque joueur. Tout est fait pour donner envie de jouer et, à Axis and Allies comme à Full Metal Planète, une grande partie du plaisir est dans la manipulation du matériel.\n\nLes mécanismes, judicieusement présentés dans un livret de règles où abondent schémas et exemples, n'ont rien de révolutionnaire. La carte rappelle le bon vieux plateau du Risk, qui a sans doute servi aux premiers tests; les combats où l'on lance des dés par douzaines ressemblent à ceux des wargames, le système économique est peut-être inspiré de Targui. L'ensemble est pourtant remarquablement cohérent et équilibré.\n\nCinq nations sont en jeu: U.R.S.S., Allemagne, Grande Bretagne, Japon, États-Unis. A cinq joueurs, chacun contrôle l'une de ces puissances, mais l'on respecte les alliances historiques et la victoire sera non pour un joueur, mais pour un camp. Des joueurs alliés peuvent parler, voire s'isoler pour discuter, mais chacun décide de ses mouvements. C'est ainsi que je préfère le jeu. On peut aussi décider laisser les alliances se faire et se défaire librement, mais c'est alors un autre jeu, plus diplomatique et beaucoup plus long. A deux, un joueur joue l'Axe, un autre les Alliés. Des règles pour trois et quatre sont prévues, elles fonctionnent bien, mais pour l'ambiance il est plus agréable d'être deux ou cinq.\n\nSoyons clair: Axis and Allies est un jeu de guerre, mais ce n'est pas un wargame au sens classique du terme, puisque la jouabilité, le plaisir, l'équilibre sont privilégiés sur la précision et la réalité historique. Le jeu dure souvent dix heures, voire plus, mais n'a rien de fastidieux et de répétitif. Des joueurs qui, comme moi, sont habituellement rebutés à l'idée de parties qui excèdent deux ou trois heures, ou moralement gênés à l'idée de \"jouer à la guerre\", ont quand même apprécié ce qui est plus un grand jeu de société tactique qu'une simulation.\n\nAxe et Alliés n'est pas un jeu équilibré. L'expérience montre que les Alliés remportent la quasi totalité des parties, ce qui est certes moralement satisfaisant mais peut nuire à l'intérêt du jeu. C'est pour cela que la plupart des joueurs ont adopté la règle optionnelle interdisant à l'Union Soviétique d'attaquer au premier tour, laissant ainsi l'initiative sur le front de l'Est à l'Allemagne. En outre, il est de bon ton de donner l'Allemagne - dont la situation est difficile - et le Japon - dont le jeu, plus technique, demande une bonne maîtrise des règles de déplacement naval et aérien - aux joueurs plus expérimentés.\n\nAxe et Alliés est un jeu long et riche, mais qui reste suffisamment simple pour se prêter aux variantes. Beaucoup n'ont plus grand chose d'historique, lorsque l'on bouleverse totalement les ressources que rapportent les différents territoires, créant des puissances imaginaires en Inde ou en Afrique, ou, mieux encore, lorsque l'on joue sur la carte de Zargos. MB n'a tout d'abord pas jugé bon de publier des extensions, et de petits éditeurs s'en sont chargé. Presque quinze ans après la parution du jeu de base, Avalon Hill vient de publier deux luxueuses boites, Axies and Allies Europe et Axis and Allies Pacific, qui détaillent les deux principaux champs de bataille de la seconde guerre mondiale en utilisant le même système de base, et prévoit de sortir en 2004 une nouvelle version du jeu de base, ainsi qu'un \"Axis & Allies D Day\".\n\nThose who have had a look at this little ideal game library from its very beginning are probably surprised to see such a monster game here, since my favorite games are usually much lighter. I've no time now to spend learning the rules of a new big, long and heavy game, but I have played some, years ago, mainly Warrior Knights, Britannia, Dune, Full Metal Planet, and the only one I still play from time to time is Axies and Allies.\n\nIn the eighties, MB decided to publish a few gamer's games, the \"Gamemaster's series\". They're trying the same this year with the \"new\" Avalon Hill. Five games were published in the Gamemaster's series. Shogun is a \"heavy Risk\" in mediaeval Japan. Fortress America describes a fantasy america attacked by an unlikely russian-japanese-mexican alliance. Less surprisingly, Axies and Allies is about the 2nd world war. I've never seen the two other ones, Broadside and Boarding Parties and Conquest of the Empire. TSR made one similar game, Buck Rogers. All those games look similar: a very big box with gorgeous components, hundreds of moulded plastic pawns, a board more than one meter wide. The rule booklet has more or less twenty pages, but they are clear, airy, with exemples and schemas, just the opposite of the Avalon Hill 80's philosophy.\n\nSo we are in the world of big publishers and big money. The wargame or Civilization addict who opens the box of Axies and Allies may be surprised by the quantity and the quality of the components. No little cardboard counters, but little plastic pawns for infantry, tanks, planes, ships, submarines, with different shapes and colours for the different countries. No ugly maps badly printed on thin paper, but a gorgeous world map on heavy cardboard. Dozens of dice, player aids on heavy cardboard, everything needed to urge you to play at once. In Axies and Allies, like in Full Metal Planet, the pleasure in manipulating the game components is an essential part of the game.\n\nThe mechanics, cleverly explained in a rule booklet with many examples and sketches, are nothing really new. The map looks like the Risk map, and the first playtests were probably made on a Risk board. The combat system, players throwing dozens of dice, one for each army, is a bit wargamy. The economis system looks very much like Targui. However, as a whole, this is cleverly balanced and highly coherent.\n\nThe five countries in play are USSR, Germany, Great Britain, Japan and USA. With five players, each player plays one country, but the game is played with the historical alliances and will be won by Axis or Allies and not by a single player. Allied players can talk one with another, but each one decides of hos own moves and actions. I think this is the best way of playing A&A. You can also play without fixed alliances, but the game becomes much more diplomatic and can last much longer. With two players, one plays the Axis, the other the Allies. The rules for three or four work, but the game is less exciting than with two or five.\n\nAxis and Allies is a game about war, but it's not a wargame in the traditional sense, since playability, pleasure, game balance are more important than strategy and historical accuracy. The game can last for ten hours, or even more, but is never fastidious or repetitive. Though I feel often a bit uneasy about \"playing war\", I had much fun with this game, wince it's more a big tactical game than a war simulation.\n\nAxis and Allies is not well balanced. The Allies usually win, which is morally satisfying, but not very good for the game interest. That's why most players have decided, though it's not in the rules, that the russian player cannot attack in the first round, giving this way initiative to the german players. It's also clever to give Germany - which starts the game in a difficult position - and Japan - which is technically difficult to play because of its many ships, aircraft carriers and airplanes - to the most experienced players.\n\nAxis and Allies is a long and rich game, but it's still simple enough to give way to many variants. Many are no more historical, when players change the ressource values of the different territories, creating imaginary super powers in India or Africa, or - even worse - when they play on the Zargos map. MB never published any expansion set, but many small publishers did. After almost 15 years, Avalon Hill has recently published two new big box games, Axis and Allies Europe and Axies and Allies Pacific, describing the two main battlefields of the second world war using the same rule system, and plans to publish soon a new edition of the main basic game, as well as a new box, Axis & Allies - D Day.",
    "timestamp": 1693605600
  },
  {
    "username": "SGart68",
    "rating": 8.5,
    "comment": "Uno dei \"grandi\" pesi medio massimi dell'epoca, che ancora oggi sa fare la sua figura.\nMiniature di ottima fattura, con meccanica \"avveniristica\" per l'epoca",
    "timestamp": 1678748400
  },
  {
    "username": "steveeastonwwg",
    "rating": 10.0,
    "comment": "Any game utilizing armies on a map owes something to this compressed testament to the story of World War 2. Modern gamers will complain the game is too light or luck-driven, but it was exactly these elements that stood out from the heavy, rules-drenched wargames of the 70's. This title took wargaming in a fun, accessible direction for the first time ever.\n\nFor myself, I discovered the game in high school. It was a transformative experience--I couldn't believe I would actually be able to move little plastic Sherman tanks or B-17 bombers across a map of Europe, each with their own unique way of playing. Having grown up on generic games like Risk, this game was a revelation of what thematic games could really be like--and the thrill this game gave me is a euphoria I've been chasing ever since.\n\nThank you Larry Harris, for changing my life.",
    "timestamp": 1753912800
  },
  {
    "username": "BJOSEPHLYON",
    "rating": 10.0,
    "comment": "I have played dozens of games but not registered\n\nNO PICS",
    "timestamp": 1752098400
  },
  {
    "username": "mudekk",
    "rating": 10.0,
    "comment": "My first love.",
    "timestamp": 1748210400
  },
  {
    "username": "imdog",
    "rating": 10.0,
    "comment": "played for 40+ years and still counting. best simulation for ww2",
    "timestamp": 1747692000
  },
  {
    "username": "Obi_John_Kenobi",
    "rating": 10.0,
    "comment": "One of my favorite games ever. I've enjoyed playing this game for years and I enjoy every time I get to play it.",
    "timestamp": 1738969200
  },
  {
    "username": "Lebatron",
    "rating": 10.0,
    "comment": "I rate this game a 10 for the sheer love I had for it as a boy. It's not necessarily a 10 in the literal sense, but its place in my heart is what's significant. It's the same reason why I hold Risk and Monopoly in high regard. I adored playing them in my childhood. My rating is a reflection of those feelings from back then, not my current perspective.",
    "timestamp": 1731106800
  },
  {
    "username": "TimberFrame",
    "rating": 10.0,
    "comment": "The Father of all A&A game.\n\nStill to this date, no other version stir me up more than this one.\n\nEven if there is non replay value, any gamer should try it once.",
    "timestamp": 1723672800
  },
  {
    "username": "Rhand",
    "rating": 10.0,
    "comment": "Caveat : This rating is effusively sentimental!\nA seminal game--the grandfather of the hobby for me, all roads lead to ROME with this one. Renegade's Axis and Allies 1942 is the heir apparent, but the original, though long gone from my collection, will always be special.",
    "timestamp": 1721426400
  },
  {
    "username": "raptured",
    "rating": 10.0,
    "comment": "Any strategy enthusiast will love this game. There are so many different ways and options for taking over to gain the capital of the other countries. From land to air to sea, you get to take charge of a country and work with those in your alliances to achieve victory. Each gameplay is different and the best plans are when people work together.\n\nWarning: This is a long game and not for the faint at heart. This is one of those invite friends over on the weekend and play into the super late hours of the morning.",
    "timestamp": 1718143200
  },
  {
    "username": "JR66",
    "rating": 10.0,
    "comment": "Had some epic games that we still talk about",
    "timestamp": 1709938800
  },
  {
    "username": "CapWave",
    "rating": 10.0,
    "comment": "Bellissimo.... il mio primo gioco strategico non si scorda mai :-)",
    "timestamp": 1697580000
  }
]