[
  {
    "username": "Pandorzecza",
    "rating": 1.0,
    "comment": "Stupid",
    "timestamp": 1633212000
  },
  {
    "username": "hal_7297108",
    "rating": 1.0,
    "comment": "Infuriating, painful, and devoid of any real decision making.",
    "timestamp": 1533160800
  },
  {
    "username": "eadred",
    "rating": 1.0,
    "comment": "Very weak.",
    "timestamp": 1513465200
  },
  {
    "username": "normann1974",
    "rating": 1.0,
    "comment": "Possibly the worst game in the world.",
    "timestamp": 1494453600
  },
  {
    "username": "Svengaard",
    "rating": 1.0,
    "comment": "I don't really like games where you could twiddle your thumbs for several turns while other players do all sorts of things, and then when it gets to your turn you have to pass because you do not have any legal moves. You guys go ahead and play this so-called game, I'm going to have a staring contest with my cat.",
    "timestamp": 1427925600
  },
  {
    "username": "Zaki",
    "rating": 1.0,
    "comment": "Worst game, I have ever tried. Steve Jackson games have done it again.",
    "timestamp": 1408399200
  },
  {
    "username": "SnowDragonka",
    "rating": 2.0,
    "comment": "+ fast\n- no brainer",
    "timestamp": 1579906800
  },
  {
    "username": "cmdrsils",
    "rating": 2.0,
    "comment": "Cull",
    "timestamp": 1533592800
  },
  {
    "username": "familywontplay",
    "rating": 2.0,
    "comment": "This is a card game many find funny, but for me it is just annoying and a waste of time.",
    "timestamp": 1529186400
  },
  {
    "username": "fsnam",
    "rating": 2.0,
    "comment": "Was lackluster in it's day, so surprised it still gets played now and then.",
    "timestamp": 1510786800
  },
  {
    "username": "JonathanW",
    "rating": 2.0,
    "comment": "Ugly and boring.",
    "timestamp": 1407189600
  },
  {
    "username": "baddice",
    "rating": 2.0,
    "comment": "What's the point in designing such nice cards with an amusing theme if the game itself is so tedious?",
    "timestamp": 1385247600
  },
  {
    "username": "grasa_total",
    "rating": 3.0,
    "comment": "The cartoons are indelibly brilliant. The game's just awful.\n\nRedeeming factor: Really, they're brilliant.",
    "timestamp": 1655416800
  },
  {
    "username": "LastGentlemanScholar",
    "rating": 3.0,
    "comment": "This game made no sense.",
    "timestamp": 1654034400
  },
  {
    "username": "Donniedarko01",
    "rating": 3.0,
    "comment": "Boring...",
    "timestamp": 1640732400
  },
  {
    "username": "joebelanger",
    "rating": 3.0,
    "comment": "Not too bad. This game has a hair's breadth more substance to it than Fluxx. If you like randomness *and* zombies, than this game will change your life!\n\nThe zombies make this game, but as they say \"Zombies alone don't make a great game.\"",
    "timestamp": 1610406000
  },
  {
    "username": "jarh3ad5",
    "rating": 3.0,
    "comment": "PnP",
    "timestamp": 1608159600
  },
  {
    "username": "zumba",
    "rating": 3.0,
    "comment": "Umm, is this a game or just a (boring) way to spend your idle time?",
    "timestamp": 1572562800
  },
  {
    "username": "jwilhm",
    "rating": 4.0,
    "comment": "Donate",
    "timestamp": 1725832800
  },
  {
    "username": "Almafeta",
    "rating": 4.0,
    "comment": "Lost in robbery.",
    "timestamp": 1576969200
  },
  {
    "username": "Eric Brosius",
    "rating": 4.0,
    "comment": "Silly fun. Well, that's half true. My family enjoyed this for a while (and I had a number of plays before I started recording plays.)",
    "timestamp": 1531605600
  },
  {
    "username": "discoking7",
    "rating": 4.0,
    "comment": "Give me a better game for the money...not so easy is it?",
    "timestamp": 1512514800
  },
  {
    "username": "Whangdoodle",
    "rating": 4.0,
    "comment": "A light-hearted game, humorous production. Somewhat unpredictable gameplay.",
    "timestamp": 1491861600
  },
  {
    "username": "ashild",
    "rating": 3.5,
    "comment": "Played once with 6 players. The game never ended, when someone was close to winning they alway got some new cards and the game went on. Not my type of game with much luck and random things going on.",
    "timestamp": 1485298800
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "kind of dumb game but it was cheap...",
    "timestamp": 1742857200
  },
  {
    "username": "tmarozas",
    "rating": 5.0,
    "comment": "I have to turn the fish.",
    "timestamp": 1581807600
  },
  {
    "username": "OGBRAIN",
    "rating": 5.0,
    "comment": "I remember it being fun. but it otherwise didn't leave enough of an impression. My nephews and niece did enjoy it though.",
    "timestamp": 1563832800
  },
  {
    "username": "robmderrick",
    "rating": 5.0,
    "comment": "$5",
    "timestamp": 1561240800
  },
  {
    "username": "myopia",
    "rating": 5.0,
    "comment": "Bland filler",
    "timestamp": 1552431600
  },
  {
    "username": "fwagler",
    "rating": 5.0,
    "comment": "German Version: \"Wo ist das Gehrin\"",
    "timestamp": 1548889200
  },
  {
    "username": "geerhead",
    "rating": 5.0,
    "comment": "Another hysterical theme with slightly less than stellar game mechanic. I used to work in retail, so \"Give Me The Brain, the customer is WRONG!\" makes me laugh every time.",
    "timestamp": 1483225200
  },
  {
    "username": "LordJosh",
    "rating": 5.0,
    "comment": "cute, but it gets a bit tedious. Overall would be better if there were a way to end it quicker.",
    "timestamp": 1468533600
  },
  {
    "username": "Cryvens",
    "rating": 5.0,
    "comment": "8",
    "timestamp": 1456441200
  },
  {
    "username": "Mxever7",
    "rating": 5.0,
    "comment": "I would try it again, if there was nothing else.",
    "timestamp": 1456441200
  },
  {
    "username": "bryanldoughty",
    "rating": 5.0,
    "comment": "Played I think once. It was amusing but not especially interesting.",
    "timestamp": 1423782000
  },
  {
    "username": "MyParadox",
    "rating": 5.0,
    "comment": "Funish game that can kill some time. Plus the premise is humerous.",
    "timestamp": 1415919600
  },
  {
    "username": "Madviking12",
    "rating": 6.0,
    "comment": "#Cheapass",
    "timestamp": 1737068400
  },
  {
    "username": "Jokeerus",
    "rating": 6.0,
    "comment": "verify.\nSilly fun. You will enjoy the color version more, if only for the card art.",
    "timestamp": 1732575600
  },
  {
    "username": "wagglybean",
    "rating": 6.0,
    "comment": "Steve Jackson games, so you know to expect a game that's just silly.\n\nIt's kinda of like if Uno and Munchkin had a baby. It's silly, really simple, but also a bit different, with bidding and job phases. The rulebook makes it seem like there's more to this one than there actually is.\n\nThe object is just to get rid of all your cards.\n\nI kind of like it but need a few plays to determine if it's worth keeping.\n\n3 player minimum is a slight downside.",
    "timestamp": 1715983200
  },
  {
    "username": "BonesJackson",
    "rating": 6.0,
    "comment": "Works best if you have a big rubber/foam brain for players to grab. Silly theme, but people seem to always ask for this or Lord of the Fries once they've played them.",
    "timestamp": 1712527200
  },
  {
    "username": "emonika",
    "rating": 5.5,
    "comment": "Not sleeved. (Won't)",
    "timestamp": 1674255600
  },
  {
    "username": "theFocusshift",
    "rating": 6.0,
    "comment": "shelf: B D 3\nstatus:unsorted",
    "timestamp": 1668121200
  },
  {
    "username": "BlackSpy",
    "rating": 6.0,
    "comment": "Fun, nonsense card game. It can sometime go on too long. Definitely a party game rather than a serious sit down and play title.",
    "timestamp": 1590876000
  },
  {
    "username": "Robb327",
    "rating": 6.0,
    "comment": "I still have the rules sheet, but where are my cards? Had to pull down the print-n-play. #Sadness",
    "timestamp": 1590789600
  },
  {
    "username": "Bigfifty",
    "rating": 6.0,
    "comment": "A fun, light, silly game",
    "timestamp": 1589061600
  },
  {
    "username": "alkis21",
    "rating": 6.0,
    "comment": "Like new, deluxe colour edition",
    "timestamp": 1586901600
  },
  {
    "username": "chillenniumfalcon",
    "rating": 6.0,
    "comment": "It's a \"get rid all your cards first\" game. With zombies that work at a fast-food restaurant. Not too shabby.",
    "timestamp": 1585350000
  },
  {
    "username": "Jam_Phil",
    "rating": 6.0,
    "comment": "Fun, silly game. There's not much strategy and a whole lot of randomness, but that's what gives it a wacky kind of fun. Mechanics are a bit off, but the theme is on point. It has a single giant die - the brain die. A BRAIN DIE! How freakin sweet is that?\n\nIt's not the most fun, but it's one of the games that will never leave my shelf just because of the sheer WTF factor.",
    "timestamp": 1573858800
  },
  {
    "username": "Kodeir",
    "rating": 7.0,
    "comment": "Give Me the Brain is a humorous and fast paced card game with a surprisingly well delivered theme. Unlike other silly confrontational card games, the abundant take-that mechanisms present don't make the game drag: an average session will be finished in ten to fifteen minutes, while a lengthy one can last up to twenty.\n\nThe premise is quite simple: a fast food restaurant from hell has hired a bunch of zombies. Players embody one of those zombies and their goal is to finish their work before everyone else. First one to finish and go home wins. Being a fast food restaurant, most tasks are done on autopilot and do not require much thought, but the more complex ones require an extra effort. The more complex ones requires zombies to think, to use their brains. But there is only one brain. One brain, multiple zombies who want it.\n\nWhile not all cards are illustrated, which can be surprising considering its humorous tone, they capture the theme perfectly well. The texts, the descriptions, the actions... They are all hilarious and thematic. My favourite is, and will ever be, the mope: \"Want to go home? Nope! Here's the mop! You aren't going anywhere until you finish mopping the floor!\". That said, its art style hasn't aged all that well: gamers used to newer games will find it ugly as sin.\n\nWork tasks take the form of cards: the first player who empties his hand has finished his work, thus winning the game. This is what prevents the game from dragging: the more the game goes on, the more likely is for someone to run out of cards. It only scales well up to five players though, preferably four, as with more it begins to drag.\n\nWhile I wouldn't recommend anyone working at a hellish fast food chain, working at a fast food chain from hell is super fun! Great parody card game.\n\nRating: \nOptimal number of players:\n3~4\n6~8\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "The Great Sun Jester",
    "rating": 7.0,
    "comment": "2002 purchase",
    "timestamp": 1703113200
  },
  {
    "username": "netlag",
    "rating": 7.0,
    "comment": "A little nostalgia influenced probably of good times. Still a fun light hearted game though.",
    "timestamp": 1672786800
  },
  {
    "username": "darbjustic",
    "rating": 7.0,
    "comment": "Got this on Kickstarter.\n\nZany, more complex game of Uno. I like the little brain and it's mechanism. Good social game to just sit and play together.",
    "timestamp": 1671490800
  },
  {
    "username": "matrosh81",
    "rating": 7.0,
    "comment": "Simple fun, similar to Munchkin or Fluxx, but enjoyable.",
    "timestamp": 1603231200
  },
  {
    "username": "djtrouts",
    "rating": 7.0,
    "comment": "Good condition, used a few times. 15",
    "timestamp": 1589493600
  },
  {
    "username": "Morgoth",
    "rating": 8.0,
    "comment": "In English only.",
    "timestamp": 1677366000
  },
  {
    "username": "vkottas",
    "rating": 8.0,
    "comment": "Played this many times with a variety of folks. For me a richer, more colorful game to take the place of an Uno (and evaluated along those terms, not as some deep hobby game). My mom can play (and win), and the take that is mostly random fun. Only downside is that play order can jump in a way that consistently skips certain people, which (coupled with cards that skip turns) can lead to a dull/frustrating session at times.",
    "timestamp": 1534716000
  },
  {
    "username": "m_stalhammar",
    "rating": 8.0,
    "comment": "This has gotten so many plays at our random groups. What a great filelr! Funny as hell, the theme is just so good! Bought a fake brain (ie. not a real one) for this that you can pass around and drop as need be and it makes this game 50% better  Highly recommended.",
    "timestamp": 1489791600
  },
  {
    "username": "Thursdaygaminggroup",
    "rating": 8.0,
    "comment": "July 3, 2015 Guardtower",
    "timestamp": 1472940000
  },
  {
    "username": "claudermilk",
    "rating": 8.0,
    "comment": "Great, simple filler/party game. It can server as a gateway to suck new players in. Comes with the Cheapass sense of humor, which is half the fun.",
    "timestamp": 1438639200
  },
  {
    "username": "MunchkinQueen",
    "rating": 8.0,
    "comment": "great, light, hilarious!",
    "timestamp": 1415055600
  },
  {
    "username": "Cat_O",
    "rating": 9.0,
    "comment": "Have the original cheap version, it is well worn from much use!",
    "timestamp": 1737586800
  },
  {
    "username": "cranefly_swarm",
    "rating": 9.0,
    "comment": "House Rule: when playing the bid “my tongue is stuck to the floor,” you must say the name of the card as if your tongue were actually stuck to the floor.",
    "timestamp": 1724796000
  },
  {
    "username": "cerulean",
    "rating": 9.0,
    "comment": "My top pick of the Cheapass lineup. Fast, simple, humorous and devious card game.",
    "timestamp": 1447023600
  },
  {
    "username": "toolbecca",
    "rating": 9.0,
    "comment": "This game isn't much of a strategy game because the cards dictate so much of the game play.\nThat said, this game is a laugh riot! We always read cards out loud when playing and use silly voices. It's so much fun to play with casual gamers because they really get into the style of the game and we can still have a conversation.\nYAY BRAINS!",
    "timestamp": 1410732000
  },
  {
    "username": "rickhatch",
    "rating": 9.2,
    "comment": "Wins: 1/2",
    "timestamp": 1337983200
  },
  {
    "username": "Nyarlathotep333",
    "rating": 9.0,
    "comment": "I picked up this game in 2000 and immediately liked it. The game is fast, fun and easy to learn. It plays best with a group of 3-4 and the games tend to be short enough to get in a 2-3 games over the course of the evening with friends.\n\nI've givin this version a '9' rating only because I feel the game is worth buying the Special Edition of for the full-color art and better quality cardstock. It still plays as a '10' though in my opinion!",
    "timestamp": 1283119200
  },
  {
    "username": "eilonwe",
    "rating": 10.0,
    "comment": "OMG I love this game so much! Easy to play and the graphics are hilarious! Great for all ages!",
    "timestamp": 1524520800
  },
  {
    "username": "drnlmza",
    "rating": 10.0,
    "comment": "Incredibly fun game. Usually quite short, but length is unpredictable.\n\nA large number of the card names have become staples of my groups conversations.",
    "timestamp": 1349906400
  },
  {
    "username": "Kysen",
    "rating": 10.0,
    "comment": "Hilarious, fun, and interesting.",
    "timestamp": 1345327200
  },
  {
    "username": "Nyarlathotep333",
    "rating": 10.0,
    "comment": "This game is one of the best games that Cheapass Games has produced in my opinion. It's relatively fast and easy to learn and is loads of fun. The various bid card art has great humorous pictures of zombies working in fast food jobs. I picked up the first edition of this game (the one that came in the paper envelope) and like the game enough to immediately order the Special Edition when it came out.",
    "timestamp": 1283119200
  },
  {
    "username": "Ravsitar",
    "rating": 10.0,
    "comment": "Played a lot [500+ plays] (weekly at least).\n\nIdeal with 3 players. A \"bring along\" game if it's me, Salt-man Z and Jagsaw. I need the brain, because the customer is WRONG!",
    "timestamp": 1190498400
  },
  {
    "username": "Salt-Man Z",
    "rating": 10.0,
    "comment": "I could play this game anytime, anywhere. Easily the best, most fun 3-player card game I know of. Using a bouncy pink rubber die for the Brain makes it even better. (I like this game so much, I tracked down the original b/w version, even though I already own the improved color edition.)",
    "timestamp": 1156543200
  }
]