[
  {
    "username": "Click86",
    "rating": 1.0,
    "comment": "It was fun back in the day, but it lost its luster.",
    "timestamp": 1760479200
  },
  {
    "username": "JoshuaStarr",
    "rating": 1.0,
    "comment": "Plenty of better party games these days.",
    "timestamp": 1750024800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 1.0,
    "comment": "1/5\n\nterrible game. family weight for sure. hard to even call it a game.",
    "timestamp": 1735254000
  },
  {
    "username": "GamerZzon",
    "rating": 1.0,
    "comment": "Good luck if you aren't in on the inside jokes. There is no skill involved in this game.",
    "timestamp": 1716328800
  },
  {
    "username": "RaffertyA",
    "rating": 1.0,
    "comment": "Jolly for the first few times. Total non-gamers can have great fun unless/until they come to realize what a random waste of time this really is; a real non-game.",
    "timestamp": 1716069600
  },
  {
    "username": "trawlerman",
    "rating": 1.0,
    "comment": "I am the #1 Party Pooper",
    "timestamp": 1687989600
  },
  {
    "username": "agrenon0418",
    "rating": 1.0,
    "comment": "I can't stand this game! You're all picking a random card from your hand that you think goes best with a description, and someone picks what card they think is the best/funniest. Okay fine, sounds like an activity to pass the time if nothing else is going on. Also, the game is supposed to have a winner (the person who has gotten luckiest and had their cards chosen the most) but that's just ridiculous. There's nothing you can do in this game to try and win.",
    "timestamp": 1684188000
  },
  {
    "username": "arthurcucumber",
    "rating": 1.0,
    "comment": "Apples to Apples should be fun but there are few issues with it that seem to suck the fun out of it. It's meant to be a light party game but can take far too long to play as each player rambles on about why they chose their card.\n\nI really don't want to spend more than 15 or 20 minutes playing a game like this and I'm counting each minute after that hoping it will end. The second biggest issue I have is that each player has to reveal which card they put in and then argue why it should be chosen only for the judge to choose someone else for a completely random reason. It means the arguments, which constitute most of the game are meaningless and the time spent arguing is wasted.\n\nI much prefer the blind choice of Cards Against Humanity (even if that game is also poor for other reasons). Lastly the comedy just feels forced.",
    "timestamp": 1647558000
  },
  {
    "username": "MightyJoeYoung",
    "rating": 1.0,
    "comment": "Unfortunately, I own this horrible game as a bad Christmas joke. If there's ever an apocalypse and I need fuel to make a fire, I'll keep this handy.",
    "timestamp": 1634421600
  },
  {
    "username": "DanFred",
    "rating": 1.0,
    "comment": "The worst \"game\" I have ever played. Not funny or clever, and not even a game. You simply put down a card hoping yours is selected. Some claim Apples to Apples teaches people how to predict other's responses, but it does no such thing. Dixit does what Apples to Apples claims to do, but is actually fun and clever. Buy Dixit instead. Apples to Apples is trash. How this is ranked better than Monopoly I will never know.",
    "timestamp": 1621461600
  },
  {
    "username": "jaypatel150",
    "rating": 1.0,
    "comment": "Party",
    "timestamp": 1605049200
  },
  {
    "username": "CMagex",
    "rating": 1.0,
    "comment": "Remove-bad game",
    "timestamp": 1604358000
  },
  {
    "username": "Janasik",
    "rating": 1.0,
    "comment": "I remember this being everywhere for a while, and looking back I still have no idea how anybody would ever enjoy it. How did this sell so many copies?",
    "timestamp": 1602972000
  },
  {
    "username": "HumbledStone",
    "rating": 1.0,
    "comment": "This should be in the dictionary as the definition of \"Meh\". This is a board game for those who don't play board games. It's simple, sure.... but the \"fun\" of this game stops after it's used as a cheap icebreaker. Every time I have played this game, everyone is so uninterested in the actual gameplay that half of the game is getting people to focus so they know when it's their turn. This game is the same amount of enjoyment as watching paint dry, with a group of your friends doing the same thing.",
    "timestamp": 1586469600
  },
  {
    "username": "senator52",
    "rating": 1.0,
    "comment": "Not fun or a game.",
    "timestamp": 1578524400
  },
  {
    "username": "AlphaLoR",
    "rating": 1.0,
    "comment": "bleh",
    "timestamp": 1557180000
  },
  {
    "username": "Pierce",
    "rating": 1.0,
    "comment": "Terrible in every way. I refuse to ever play this. I would rather sit and stare at the wall than play this.",
    "timestamp": 1557007200
  },
  {
    "username": "Haybuck",
    "rating": 1.0,
    "comment": "Reminds me of my \"LOL XD RANDOM :3\" days on the internet, and I really do not want to go back there.",
    "timestamp": 1551308400
  },
  {
    "username": "Eraelan",
    "rating": 1.0,
    "comment": "Just not my style of game. I will gladly bow out anytime this is offered up.",
    "timestamp": 1550703600
  },
  {
    "username": "Outterskillet",
    "rating": 1.0,
    "comment": "Waste of space it’s has little replay ability and zero strategy because you have zero clue when it ends",
    "timestamp": 1550530800
  },
  {
    "username": "jpatche",
    "rating": 1.0,
    "comment": "Best way to ruin a party.",
    "timestamp": 1539122400
  },
  {
    "username": "GeckoCream",
    "rating": 1.0,
    "comment": "I would give this a lower rating if I could. I will never play this again.",
    "timestamp": 1539036000
  },
  {
    "username": "Redward",
    "rating": 1.0,
    "comment": "Although party games are not really about winning the scoring in this is far too frustrating to be much fun. Also, there is just no reason to play this when Dixit does the same thing better and with beautiful art.\n5/18/15 (multiple plays before I logged much)",
    "timestamp": 1538604000
  },
  {
    "username": "alexdrazen",
    "rating": 1.0,
    "comment": "Democratic, not strategic. And, as was once said, the best argument against democracy is a five minute conversation with the average voter.\n\nI guess technically only one person picks the winner but it's just banal banter beforehand. It's democratic in that there is a debate, and it's autocratic that an unelected bureaucrat will arbitrarily decide how each round goes.\n\nThis is not even a game; it is basically a corporate icebreaker/team-building exercise.\n\nIts only redeeming feature is that you can quit at any time and it won't matter.\n\nFor a party game that actually involves some skill, I'd suggest Scattergories (though it requires reasonable people as there is still an evaluation phase).",
    "timestamp": 1535407200
  },
  {
    "username": "ShotgunShawn",
    "rating": 1.0,
    "comment": "BOOOOOOOOORING!!",
    "timestamp": 1528668000
  },
  {
    "username": "SJacobsen159",
    "rating": 1.0,
    "comment": "Fun as a teenager, now it's just tedious.",
    "timestamp": 1523570400
  },
  {
    "username": "sgtcustard",
    "rating": 1.0,
    "comment": "Party activities more interestingly designed than this game:\n\nSit in complete silence.\nEveryone go home and do your taxes.\nTake turns punching each other in the face.\n\n1\\10 party filler, 10\\10 party killer",
    "timestamp": 1523138400
  },
  {
    "username": "legolasegb",
    "rating": 1.0,
    "comment": "I hate this game. The cards that win are consistently chosen for such ludicrous reasons that there is no real way to form a coherent strategy to win.\nPotatoes aren't fascinating. Language is not purely subjective or we couldn't communicate.\nIf you want a game that has this mechanic, but actually is subjective, try Perfect Present. https://boardgamegeek.com/boardgame/32118/perfect-present\nIf you would like Tank better than a private chef, well, that's actually legitimately subjective.",
    "timestamp": 1521154800
  },
  {
    "username": "deucemckenzie",
    "rating": 1.0,
    "comment": "I hate this \"game.\" This is also responsible for starting the judging phenomenon that I generally despise.",
    "timestamp": 1515625200
  },
  {
    "username": "clawlan",
    "rating": 1.0,
    "comment": "how do people enjoy this \"game\"?",
    "timestamp": 1512169200
  },
  {
    "username": "tracerbull",
    "rating": 1.0,
    "comment": "P.G. cards against humanity. Doesn't make the game any more fun or hilarious.",
    "timestamp": 1511823600
  },
  {
    "username": "tjdrake719",
    "rating": 1.0,
    "comment": "I hate this game.",
    "timestamp": 1506204000
  },
  {
    "username": "tlarraya",
    "rating": 1.0,
    "comment": "Didn´t Like it at all. Forgettable.",
    "timestamp": 1501970400
  },
  {
    "username": "Boltana",
    "rating": 1.0,
    "comment": "Simple party game that could be a lot of fun with the right group. It also can come off the rails and feel like an exercise in futility when playing with one or more people that frown on off-the-wall and humorous plays.",
    "timestamp": 1496959200
  },
  {
    "username": "greeklettertau",
    "rating": 1.0,
    "comment": "I don't understand how anyone like this game. Complete garbage. The social dynamics of Apples to Apples are roughly those of a sold-out Greyhound bus stuck in stop-and-go traffic. If you're at a party and people start playing \"Apples to apples,\" leave. Don't say goodbye, these people are not your friends, just leave.",
    "timestamp": 1493503200
  },
  {
    "username": "Delinquent",
    "rating": 1.0,
    "comment": "I overplayed it in college when it was new.",
    "timestamp": 1487545200
  },
  {
    "username": "mantooth012",
    "rating": 1.0,
    "comment": "the worst, and even worse with people who take it too seriously.",
    "timestamp": 1481238000
  },
  {
    "username": "foxx",
    "rating": 1.0,
    "comment": "More of a social activity than a game. It gives way too much power to the whims of whoever is the judge to the point that it always ends up feeling completely random.\n\nYou may as well just take turns turning up the top red and green card to the middle of the table and discuss the implications of how they match. In fact, that would be more entertaining since it wouldn't be pretending to be a game.",
    "timestamp": 1480978800
  },
  {
    "username": "spiralingcadaver",
    "rating": 1.0,
    "comment": "Terrible kingmaking party game.",
    "timestamp": 1467928800
  },
  {
    "username": "Arythea",
    "rating": 1.0,
    "comment": "If I could give this abomination of a game a 0 rating, I would. It's a random collection of cards to be played at random and hope for the best to randomly happen. Seriously, that is as valid a strategy as any. Did I mention this \"game\" is entirely random? Awful. Makes me want to stab my eyes out with a fork, because that would feel heavenly compared to sitting through a game of Apples to Apples.",
    "timestamp": 1457564400
  },
  {
    "username": "alfonzo54",
    "rating": 1.0,
    "comment": "Not a game and also stupid.",
    "timestamp": 1450825200
  },
  {
    "username": "Eclypsuz",
    "rating": 1.0,
    "comment": "Ugh.",
    "timestamp": 1450220400
  },
  {
    "username": "charliex2003",
    "rating": 1.0,
    "comment": "There is no game here.",
    "timestamp": 1431986400
  },
  {
    "username": "mlcarter815",
    "rating": 1.0,
    "comment": "It's Apple to Apples. What more is there to say? The experience is highly dependent on the group you play with and whether they want serious or funny answers.",
    "timestamp": 1426806000
  },
  {
    "username": "Zyrallus",
    "rating": 1.0,
    "comment": "Please. No. Just stop pulling this thing out at parties. Please.",
    "timestamp": 1419289200
  },
  {
    "username": "rathstar",
    "rating": 1.0,
    "comment": "The stated object of this game is way different from what the gameplay actually degenerates into. An exercise in futility.",
    "timestamp": 1401141600
  },
  {
    "username": "hockeyking9",
    "rating": 1.0,
    "comment": "This game always starts fun, but within about 5-10 minutes someone gets bored and then just starts picking random cards. Example: Card to match \"Historical Figure\", cards that come in Abraham Lincoln, Caesar, Hitler and Chocolate. And the bored person will pick Chocolate.",
    "timestamp": 1391554800
  },
  {
    "username": "BuckAlbertBill",
    "rating": 1.0,
    "comment": "Embarrassed to even own this, but it was a gift, yuck! Dusty as hell and I don't give a damn. Keep waiting for something to catch on fire so I can use this to put it out with!",
    "timestamp": 1389999600
  },
  {
    "username": "mrgodot",
    "rating": 1.0,
    "comment": "so boring. why do people insist on playing it?",
    "timestamp": 1389222000
  },
  {
    "username": "lazytribe",
    "rating": 1.0,
    "comment": "A very bad game. It is so subjective that even if you have a card that is accurate or correct the judge can still pick something stupid or not even related (apples to oranges should be the title).\n\nDEFINITELY a game for non-gamers that are mentally challenged and like wasting their time on garbage.",
    "timestamp": 1356303600
  },
  {
    "username": "rzaleski",
    "rating": 1.0,
    "comment": "Upon review, I was too nice to this.",
    "timestamp": 1354575600
  },
  {
    "username": "chefdevergue",
    "rating": 1.0,
    "comment": "While party games are never my first choice, I am perfectly happy to play a game like Balderdash, Dixit, Crappy Birthday, or even (if the circumstances are right) Pictionary.\n\nApples to Apples is like a vampire that attacked those other games and sucked all of the fun right out of them. It forces the players into making choices which do not allow for any creativity whatsoever. The result is an experience which is boring and generally not fun.\n\nI hesitate even to call this a game, The random and arbitrary nature in which a player wins makes it impossible to strategize on any level.\n\nReading the scathing comments on BGG is much more fun than playing the game itself.",
    "timestamp": 1353798000
  },
  {
    "username": "liquidavalon",
    "rating": 1.0,
    "comment": "I cannot express how much I loath this game.",
    "timestamp": 1346277600
  },
  {
    "username": "bpovis",
    "rating": 1.0,
    "comment": "I wouldn't normally give a game a crazy low rating like this, but the avg rating for this game won't suffer on my account. The title of this game are the three words I most fear when going to a party where there will be \"games\". I can see why some people like it with the right crowd, just not my cup of tea.",
    "timestamp": 1339624800
  },
  {
    "username": "wolfie_beast",
    "rating": 1.0,
    "comment": "Infuriating game IMO. Everybody else loves it, it just rubs me the wrong way.\n\nAfter further analysis, I think my initial impression had something to do with the group I've played it with.\n\nNope, played it with a better group and it's still boring and tedious. Sorry A2A, The Big Bang Theory party game just did your shtick right, so your rating dropped back down to where it was initially.",
    "timestamp": 1339365600
  },
  {
    "username": "craigills",
    "rating": 1.0,
    "comment": "Uh, where is the 'game' in this game?",
    "timestamp": 1334354400
  },
  {
    "username": "Jayne Starlancer",
    "rating": 1.0,
    "comment": "Just not really a game in my opinion, but it can be fun to play during a party with the right people.",
    "timestamp": 1324767600
  },
  {
    "username": "Grayle84",
    "rating": 1.0,
    "comment": "I never want to play this again. It wasn't remotely fun. Even if I logically have the best card someone won't pick it because they don't know or they like star wars and will pick darth vader. Terrible game. If you ask me to play it I might accidently destroy it.",
    "timestamp": 1322607600
  },
  {
    "username": "dhaeman",
    "rating": 1.0,
    "comment": "The winner is 80% arbitrary. Not my kind of game at all.",
    "timestamp": 1322521200
  },
  {
    "username": "kvenosdel",
    "rating": 1.0,
    "comment": "I absolutley hate this game. I used to think I liked it, back when I could combine cards such as \"Helen Keller\" and \"Touchy Feely.\" However, once that novelty wore off this game had nothing left to offer.\n\nThe thing that really takes any enjoyment straight out of the game is the whole \"you gotta play your opponent\" idea. EEEEFFFFFF that noise. So stupid. Your telling me that if I want to win I shouldn't play the card that everyone thinks is funny just because its the prudish boring guys turn and he's likely to pick something \"realistic?\" Awful.\n\nPlease God replace every copy of this game with Dixit.",
    "timestamp": 1316383200
  },
  {
    "username": "jme198",
    "rating": 1.0,
    "comment": "I absolutely hate this thing. I can't call it a game, because it isn't one. It is more a torture device than a game.",
    "timestamp": 1315173600
  },
  {
    "username": "thomrenault",
    "rating": 1.0,
    "comment": "Tried inputting 0 and 0.0000001 as my rating for this terrible game",
    "timestamp": 1310767200
  },
  {
    "username": "sksuser",
    "rating": 1.0,
    "comment": "The outcome of this game is completely subjective to the whim of the shallow group that plays it.\n\nIf you are playing against a group of people that are at all interested in winning or being \"serious\" there is no strategy or way to beat them fast just to get the game over with. As the ego-centrists drag the game ad nauseum, you'll feel yourself being dragged into a nonobjective black hole of stupidity.\nIf you find yourself lucky enough to play with an agreeable group, you're better off just having a nice conversation with them.\n\nSimilar (but much better, more logical and non-subjective) alternatives would include Scattergories, Balderdash.... or even calvinball\n\nFurthermore, this game contains no useful bits to cannibalize towards making something useful. The cards were cheaply printed, and since thats the only thing besides the box itself, its nearly worthless.\n\nI would have rated this game a zero, but it gets a bonus point for resale value or if you feel like doing the human race a favor its possible to take it completely out of circulation by re-skinning the box and putting another game inside after discarding the previous contents.",
    "timestamp": 1307570400
  },
  {
    "username": "Kartigan",
    "rating": 1.0,
    "comment": "Horrible, horrible, horrible party game. I don't hate all party games, but I do hate this one. Boring and repetitive it seems like each turn is the exact same, which wouldn't be bad.....if the turns were actually fun.\n\nWould be better if each person just had a pencil and paper and could make up words rather than being limited to a particular hand of cards.....but then, why would you even need a game for that ?",
    "timestamp": 1301007600
  },
  {
    "username": "ssspinball",
    "rating": 1.0,
    "comment": "1 play. This is only very loosely a \"game\"--more like a social experiment.",
    "timestamp": 1294182000
  },
  {
    "username": "rayzg",
    "rating": 1.0,
    "comment": "Awful.\n\nI particularly like party games. The minimum that a party game should do is inspire creativity, This one does the opposite -- rarely anyone finds strange word combinations amusing. So the game becomes about being the lucky player to have the most bland noun card at the right time.\n\nFor word association games, Scattergories beats this easily.",
    "timestamp": 1293663600
  },
  {
    "username": "Lady Aellinsar",
    "rating": 1.0,
    "comment": "Cute party game to play once and then its novelty wears off. It's very much a no brainer and unless you have some hilariously funny people it will be a big yawner. Played this game once out of choice, then was forced to play it 4 more times now it's on the blacklist. Not sure why so many folks are enamored with it. Its one advantage is it accommodates a lot of people.",
    "timestamp": 1291158000
  },
  {
    "username": "Coca Lite",
    "rating": 1.0,
    "comment": "Shocking update: Apples to Apples becomes absolutely fantastic when you spend a bunch of time beforehand making personalized noun cards. The better the members of the group know each other, the better. This change turns Apples to Apples into a solid '8' or '9' from its usual miserable '1.' Original (and still relevant) comment below.\n\n----------\n\nI can't remember the last time I played a game this bad. Deciding whether 'Martha Stewart' or 'San Andreas Fault' is more 'easy' is not funny. I would rather play Duck Duck Goose.\n\nThe very best party games are essentially environments that foster creativity in all participants--creativity, in many cases, the players don't even believe they have. These games tend to be parlor games (Celebrities being the best example, really), because when the players determine all the content (names in Celebrities, whatevers in Charades or even 20 Questions, etc.), everyone can feel a sense of 'ownership' over the game. That is to say, each game of 20 Questions will have its own special dynamic created entirely by the players within the very simple framework. Time's Up, the commercial release of the near-perfect parlor game Celebrities, comes with a deck of celebrities' names that are to be used. Nothing could be worse.\n\nWell, except for Apples to Apples. In this title, players' ownership over the course of the game is taken from them entirely and put into a deck of cards they had no control in creating. \"Gameplay\" consists of assembling the cards together, and presumably laughing about how inappropriate the card pairings sometimes were. This is depressing!",
    "timestamp": 1279922400
  },
  {
    "username": "flash thompson",
    "rating": 1.0,
    "comment": "How this game ever became as popular as it did is a giant mystery to me. For people to say that it's a \"non-gamer\" game or a party-game is absurd. It's just a BAD game. I have no idea how anyone can play this game. If Jesus Christ Himself came down from on high and asked me to play a game, I'd have to think long and hard about it. This game is the epitome of the word interminable. You want a party game? Play Balderdash or even Trivial Pursuit, but leave this one where it belongs: as far away as possible.",
    "timestamp": 1264201200
  },
  {
    "username": "jonnylawless",
    "rating": 1.0,
    "comment": "There are some great party games out there. This isn't one of them. I'd rather just talk with the people I'm with than play this game. It's just no fun at all.",
    "timestamp": 1253743200
  },
  {
    "username": "Heyswyndon",
    "rating": 1.0,
    "comment": "As you may have noticed from my rating (1), I do not like this activity. I refrain from calling it a \"game\" because the judge has supreme control in their criterion for picking a card, eliminating any game rules and theory, and can be capricious and arbitrary.\n\nPerhaps I have not played this with sufficiently serious players, but in all my plays (involving mid-school aged and family members) the game has simply degenerated to the judge picking the funniest word arbitrarily. There is no way to predict, strategize, or otherwise \"game\" the decision. The only benifit to this supposed game (that I have seen) is its educational aspect when a younger player does not understand a specific word or term on the cards.\n\nApples to Apples holds as much excitement for me as a pack of mid-school flash cards!",
    "timestamp": 1241042400
  },
  {
    "username": "lastalchemist",
    "rating": 1.0,
    "comment": "after about five plays this game gets real old, real quick. If I never see this game pulled out at a party I will be happy.",
    "timestamp": 1234306800
  },
  {
    "username": "ojannen",
    "rating": 1.0,
    "comment": "Less of a game, more of an event.",
    "timestamp": 1227999600
  },
  {
    "username": "Stoffel",
    "rating": 1.0,
    "comment": "I do not understand this \"game\".\n\nUPDATE: From a geeklist, on suggested strategy (to get others to never pull this game out again) is to always announce that you will be playing your cards in order, and do so. Awesome.",
    "timestamp": 1222812000
  },
  {
    "username": "ed95005",
    "rating": 1.0,
    "comment": "Horrible. 0-1",
    "timestamp": 1217282400
  },
  {
    "username": "thorndor",
    "rating": 1.0,
    "comment": "The \"game\" is one of predicting the other players mental connections while being constrained by a random selection of cards. In theory, this might work, but you would really have to know the other people well. If you don't the other players well, they might as well be random. I think we are all supposed to laugh at the various connections. In practice, the \"game\" is seemingly random and it's boring.",
    "timestamp": 1212444000
  },
  {
    "username": "garygarison",
    "rating": 1.0,
    "comment": "l thoughtfully took a homemade Disney-theme version of Hollywood Blockbuster to L.A. in the hopes my girlfriend's friends we were staying with would enjoy this game that was perfectly themed for our visit. Come game night, they opted instead for Apples to Apples -- \"even less thinking than Taboo\", the hostess tittered. The only highlight of that game was my playing an unaltered blank card for \"Frivolous (trivial, silly, shallow)\", saying the answer was already written on the back of the card. In the end, an overly-long session of unfunny randomness. Because of this letdown, I now refuse to ever play Apples to Apples again.",
    "timestamp": 1208469600
  },
  {
    "username": "eldestransom",
    "rating": 1.0,
    "comment": "I truly loathe this game. Boring as hell.",
    "timestamp": 1199919600
  },
  {
    "username": "thekossack",
    "rating": 1.0,
    "comment": "FYI - This is not a game. It is a system to, as Monty Pyhton once put, \"to buy a conversation.\"\n\nIf you want to play a game, play a game. If you want a conversation, have one. Apples to Apples is abysmal.",
    "timestamp": 1134774000
  },
  {
    "username": "ndkid",
    "rating": 1.0,
    "comment": "I feel that calling this a game is unfair. It is a method of entertainment to use at a party, in a way not dissimilar from morton's list. Judged as a game, it fails horribly.",
    "timestamp": 1132614000
  },
  {
    "username": "zachhannibal",
    "rating": 2.0,
    "comment": "Hand Management / Simultaneous Selection / Voting",
    "timestamp": 1740438000
  },
  {
    "username": "SYGF",
    "rating": 2.0,
    "comment": "this sort of game is like conversation, but for people who are incapable of having their own ideas. In that way, it makes perfect sense for children and for the foolish amongst us",
    "timestamp": 1734390000
  },
  {
    "username": "Trevorbatman",
    "rating": 2.0,
    "comment": "Present from a well-meaning relative. (\"You like board games-so I bought you one!\")",
    "timestamp": 1712095200
  },
  {
    "username": "atomiczap",
    "rating": 2.0,
    "comment": "Can be loads of fun with the right group, but this is the game kids usually point at when I ask what they want to play, and it can be pretty boring with a bunch of kids who don't know who any of the people (or events and things) in the game are.",
    "timestamp": 1709506800
  },
  {
    "username": "shanev316",
    "rating": 2.0,
    "comment": "There are just so many better party games. Pass.",
    "timestamp": 1702335600
  },
  {
    "username": "AmandaDesignsGames",
    "rating": 2.0,
    "comment": "Was innovative, but not anymore. Thing is, the game is fun when some good, funny combinations come up, and the random card draw limits that a lot: too few good moments, limited by the game system.",
    "timestamp": 1701817200
  },
  {
    "username": "tomfish",
    "rating": 2.0,
    "comment": "Not a fan.",
    "timestamp": 1700607600
  },
  {
    "username": "alpettit04",
    "rating": 2.0,
    "comment": "Sometimes mildly amusing. That's about the nicest thing I can say.",
    "timestamp": 1678316400
  },
  {
    "username": "phsyrik",
    "rating": 2.0,
    "comment": "Incredibly boring, and now there are much more fun variations out there.",
    "timestamp": 1673391600
  },
  {
    "username": "Zackster",
    "rating": 2.0,
    "comment": "4-10 players 30 minutes",
    "timestamp": 1672182000
  },
  {
    "username": "LouLee7th",
    "rating": 2.0,
    "comment": "The game that existed before Cards Against Humanity. I've played this when I've gamed with children before, and it's ok in that regard. Why play this though when you can play Cards Against humanity instead.",
    "timestamp": 1671145200
  },
  {
    "username": "kennywah",
    "rating": 2.0,
    "comment": "hate this game",
    "timestamp": 1667343600
  },
  {
    "username": "Burton Lovell",
    "rating": 2.0,
    "comment": "Ugh! Mimics the type of game I think is utter tripe.",
    "timestamp": 1659996000
  },
  {
    "username": "Destrio",
    "rating": 2.0,
    "comment": "I don't like games where you just make up a lot of the rules. In this case, the rules have it so that players make up the winning answers. This is not so much a game and more of an activity.",
    "timestamp": 1659477600
  },
  {
    "username": "Kadoza",
    "rating": 2.0,
    "comment": "Family friendly meh...",
    "timestamp": 1654725600
  },
  {
    "username": "Fencejummper",
    "rating": 2.0,
    "comment": "The OG game of picking the funniest option. Played a lot in middle school, but not something I would chose now.",
    "timestamp": 1654380000
  },
  {
    "username": "pgrossman001",
    "rating": 2.0,
    "comment": "I find this game tiresome.",
    "timestamp": 1652133600
  },
  {
    "username": "attackofmilk",
    "rating": 2.0,
    "comment": "A lot of downtime, not a lot of player choice, not a lot of opportunities for table talk. Unfortunately, my friends love this game.",
    "timestamp": 1649973600
  },
  {
    "username": "DraconicMama",
    "rating": 2.0,
    "comment": "The game claims to be hilarious but we were bored to tears. Rarely, if ever, was anything played ever actually laugh out loud funny. At -best- some were mildly amusing, but it took MAJOR effort on my part to get my kids to even crack a smile as we played this. I thought it might be better at the junior level so I bought that one at the thrift store too, but it was just as awful.",
    "timestamp": 1649541600
  },
  {
    "username": "bneffer",
    "rating": 2.0,
    "comment": "I liked the idea of this game, but actually playing it has never been much fun for me.",
    "timestamp": 1643065200
  },
  {
    "username": "lostfanatic6",
    "rating": 2.0,
    "comment": "Not really into party games all that much so this one bores me terribly.",
    "timestamp": 1638313200
  },
  {
    "username": "SplinterBlade",
    "rating": 2.0,
    "comment": "The only flaw this game has is that it's mind-numbingly boring. I have had a few decent times with it, but never a good time. It's less offensive than Cards Against Humanity, but I have at least had more raucous times with that, despite all its flaws. Do yourself a favor and never play this.",
    "timestamp": 1616799600
  },
  {
    "username": "badmojorayman",
    "rating": 2.0,
    "comment": "A novelty the first time you play it. Then, the joke wears off quickly. I would say the same of all of its imitators.",
    "timestamp": 1609023600
  },
  {
    "username": "Cheesemaster2",
    "rating": 2.0,
    "comment": "This game is so boring you have basicly no decisions to make, look at your cards pick the one the makes the most sence put it in the pile repeat and try to not fall asleep. This game is popular because most people have no creativity so it let's them play a party game that feels like you made a funny smart decision but you actually did nothing. The fact that everyone outside of the hobby always wants to play this or cards against humanity makes me rate it lower",
    "timestamp": 1608332400
  },
  {
    "username": "tommynomad",
    "rating": 2.0,
    "comment": "Party game that doesn't feel like a party.",
    "timestamp": 1605049200
  },
  {
    "username": "bdm0610",
    "rating": 2.0,
    "comment": "Overplayed, stale party game.",
    "timestamp": 1591740000
  },
  {
    "username": "disposable.superhero",
    "rating": 2.0,
    "comment": "We were given a tip on a great game called Apples to Apples. We went to the store and bought it, not only did we buy the game we bought the boxed edition with all the expansions. Excited we took it to our friends house and played it. We played it 5 times. No one had fun and so we put it on the shelf. To this day when I think of a game that completely blows I think of Apples to Apples.",
    "timestamp": 1583276400
  },
  {
    "username": "lukestrotz",
    "rating": 2.0,
    "comment": "I appreciate it was important when it came out (hence why I owned a copy) as it got the whole 'party game' ball really rolling, but it's barely a game.\n\nWhen played as per the rules, it's just an exercise in 'what appeals to my friends'? It's like having a conversation where you don't talk and instead play cards.\n\nVastly improved by a house variant where each player must explain why they picked their chosen card. The attempt to justify clearly disparate concepts is often hilarious. But I'd still rather play almost any other game.",
    "timestamp": 1571695200
  },
  {
    "username": "Inkwan",
    "rating": 2.0,
    "comment": "terrible random \"game\"",
    "timestamp": 1564524000
  },
  {
    "username": "BigAlJ7",
    "rating": 1.8,
    "comment": "Can be funny. Most rounds are not. There is a nice element of figuring out what different players like and will choose as the winner. Other than that, the cards are pretty mediocre.",
    "timestamp": 1552431600
  },
  {
    "username": "MDJD",
    "rating": 2.0,
    "comment": "This style of game just isn't fun for me.",
    "timestamp": 1551049200
  },
  {
    "username": "benshever",
    "rating": 2.0,
    "comment": "Yea whatever. Fun if you’re in middle school and none of your friends are creative.",
    "timestamp": 1550098800
  },
  {
    "username": "markbesada",
    "rating": 2.0,
    "comment": "(11/15) 3.\n\nGiven to Claudia\n\n(10/17) Drop to 2. Maybe I didn't play this early enough but it just seems so very bland. I can't think of many, if any, games I wouldn't rather play.\n\n(1/19) 2.",
    "timestamp": 1548802800
  },
  {
    "username": "debiant",
    "rating": 2.0,
    "comment": "The edition that we had of this didn't lend itself to family play. Half of the cards were ones our children didn't understand. We went in with the assumption that this was a family game and came away disappointed by both the mechanics and the humor. Even as a game played by adults, the humor was absent.",
    "timestamp": 1546210800
  },
  {
    "username": "integon",
    "rating": 2.0,
    "comment": "I don't know, I removed the outer wrap but left the cards sealed, meh. I see no humor or fun to be had here.",
    "timestamp": 1539640800
  },
  {
    "username": "AZrugger",
    "rating": 2.0,
    "comment": "I'm so... freaking.... tired of this game.",
    "timestamp": 1533506400
  },
  {
    "username": "yokuyuki",
    "rating": 2.0,
    "comment": "At home",
    "timestamp": 1532296800
  },
  {
    "username": "bumpusth",
    "rating": 2.0,
    "comment": "Entertaining party game when nobody really wants to play anything of substance. Need the right crowd though as it is silly and with little purpose or technique to winning.",
    "timestamp": 1522879200
  },
  {
    "username": "Pixelfixation",
    "rating": 2.0,
    "comment": "Destroyer of Parties.",
    "timestamp": 1522792800
  },
  {
    "username": "jamjams32",
    "rating": 2.0,
    "comment": "Good classic party game. We've had some fun with this game.",
    "timestamp": 1520982000
  },
  {
    "username": "Cryp7o",
    "rating": 2.0,
    "comment": "Scoring is both subjective and pointless. The actual gameplay is at the whim of whoever is judging and what cards you draw. Slightly more thought required than CAH, but not enough to make me actually want to play this again.",
    "timestamp": 1519167600
  },
  {
    "username": "drhellier",
    "rating": 2.0,
    "comment": "Bad Game! People use experiences to inform decisions, which is fine as long as you were a part of those experiences. But, when people pick answers because of their friend from 1st grade who made them laugh and this card just reminded them of that time, it makes for a mind-numbing experience. Plus, several times your cards just don't fit the description. Both of these make it so too often you are randomly throwing cards down, and mostly because you just want a better card than that even though it has almost nothing to do with the description. What's worse: sometimes your throw away card gets picked!!!!??????",
    "timestamp": 1516143600
  },
  {
    "username": "mgclark29",
    "rating": 2.0,
    "comment": "The wife likes it. I just don't get it. Super lame. There's no real room to be creative since you're given the cards. I would much rather play something like Taboo or Five Second Rule in a party situation.",
    "timestamp": 1503612000
  },
  {
    "username": "dsals",
    "rating": 2.0,
    "comment": "The most fun I ever had with this game was only using the adjective cards. My sister and I would flip over a card and then each of us would try to convince the other why that adjective described us more than the other person - regardless of what it was. Way more fun than the real game.",
    "timestamp": 1497564000
  },
  {
    "username": "pinustrobus",
    "rating": 2.0,
    "comment": "Fun only if the other players are having fun too. Kind of obnoxious to have the \"picker\" choosing cards that have not one ounce of similarity to the topic card.",
    "timestamp": 1483311600
  },
  {
    "username": "Brigadier_Rogers",
    "rating": 2.0,
    "comment": "If you are into social party games for gateway and lightweight gamers I can think of a number of titles that have replaced this - Codenames, Dixit, and Anomia all spring to mind immediately. For me this falls in the same category as activities like Cards Against Humanity - a chance to hang out but not really a game.",
    "timestamp": 1482706800
  },
  {
    "username": "GoddessInTriptych",
    "rating": 2.0,
    "comment": "Pigeons: Rebellious. They were saying, 'coup! coup!'",
    "timestamp": 1481756400
  },
  {
    "username": "clydeiii",
    "rating": 2.0,
    "comment": "Super bad.",
    "timestamp": 1479337200
  },
  {
    "username": "CmdrOverbite",
    "rating": 2.0,
    "comment": "Not at all a game of strategy and not all that great as a party icebreaker, either.",
    "timestamp": 1479078000
  },
  {
    "username": "varneysa",
    "rating": 2.0,
    "comment": "Got bored with it once every card had been played a few times. Needs constant expansions. I'm saddened that Cards Against Humanity basically ripped off this design and found a ton of success.",
    "timestamp": 1475704800
  },
  {
    "username": "swpeanut",
    "rating": 2.0,
    "comment": "The game has been replaced by meant other party games, probably still a good gene for kids",
    "timestamp": 1474927200
  },
  {
    "username": "xxxIcarusxxx",
    "rating": 1.5,
    "comment": "This game.... is not a game. This is \"Hey everybody, is my card the best?\"",
    "timestamp": 1464213600
  },
  {
    "username": "yendorii",
    "rating": 2.0,
    "comment": "If you enjoy CaH there is no purpose to this games existence.",
    "timestamp": 1456182000
  },
  {
    "username": "jandes",
    "rating": 2.0,
    "comment": "Have played this game many times and don't think I've ever enjoyed it. Maybe it's because my competitive nature won't let me play a game \"just for fun\" or maybe it's because I always think people choose the wrong answer, but I get annoyed just thinking about this game. If I'm gonna play an opinion-based game I'll play Cards Against Humanity any day over this because at least I get some laughs from CaH.",
    "timestamp": 1455231600
  },
  {
    "username": "earthlindz",
    "rating": 2.0,
    "comment": "When this first came out - I LOVED it. Then I played it 500 times and each time I played it I hated it more and more. I guess I'm just not funny enough to play this game, since my family and friends always want the most hilarious answer. I actually think I have a different sense of humor than most people, so that's probably it. Won't play again unless someone REALLY begs me to. And pays me money. Now that I think about it, why do I still have this game?",
    "timestamp": 1454626800
  },
  {
    "username": "jgunnz",
    "rating": 2.0,
    "comment": "I do not understand why this game is popular.",
    "timestamp": 1454540400
  },
  {
    "username": "wolfkin",
    "rating": 2.0,
    "comment": "no.",
    "timestamp": 1449529200
  },
  {
    "username": "mgreen02",
    "rating": 2.0,
    "comment": "Crowd dependent. Don't play with the fickle or contrary, it just gets annoying fast.",
    "timestamp": 1434924000
  },
  {
    "username": "Poserdisposer",
    "rating": 2.0,
    "comment": "I do not find this game fun or funny. I suppose I would play it with kids, but for a similar type of experience I would rather play Cards Against Humanity (with adults).",
    "timestamp": 1434837600
  },
  {
    "username": "glookose",
    "rating": 2.0,
    "comment": "If not played by the right people, can be un-fun. We had one person who took all the responses and just picked one arbitrarily without trying to get close to the original choice at all. It made us all feel like we were just wasting our time.",
    "timestamp": 1434060000
  },
  {
    "username": "Cheesechick",
    "rating": 2.0,
    "comment": "This is routinely a hit with non-gamers for me and in that context I am somewhat willing to play (if they really won't play anything else). But this is a PURELY content-driven game, so while it might be funny the first time around all of the humor literally evaporates once you've seen the cards and combinations a couple times. Give me something with actual creativity any day.\n\nAttribute has the same concept but is much funnier and has better longevity thanks to actual player input and the match/mismatch idea to add variety, but unfortunately its fiddly scoring system and minor dexterity element can turn some people (especially non-gamers) off.",
    "timestamp": 1430949600
  },
  {
    "username": "ptwaugh",
    "rating": 2.0,
    "comment": "Fun party game if you have some knowledge of the individuals... In great shape.",
    "timestamp": 1428789600
  },
  {
    "username": "thesnyderguy",
    "rating": 2.0,
    "comment": "Party Edition",
    "timestamp": 1427065200
  },
  {
    "username": "Eselbeus",
    "rating": 2.0,
    "comment": "This game lacks replayability and suffers greatly from anyone who takes it too seriously. Absolutely terrible. Only fun your first few times, and assuming you aren't playing with anyone incapable of imagination. Skip to Cards Against Humanity to avoid the latter problem, but even that game gets old pretty quick.",
    "timestamp": 1426374000
  },
  {
    "username": "TedW",
    "rating": 2.0,
    "comment": "Probably a 7 for kids. No game here for adults.",
    "timestamp": 1424473200
  },
  {
    "username": "Kalistoga",
    "rating": 2.0,
    "comment": "This was fun the first couple of times I played it, but didn't like it after that. Not sure why...I tend to like strategy I guess.",
    "timestamp": 1422054000
  },
  {
    "username": "talonsea",
    "rating": 2.0,
    "comment": "Buy Dixit it's much better",
    "timestamp": 1421708400
  },
  {
    "username": "cardshark28800",
    "rating": 2.0,
    "comment": "A decent party pastime; make sure to play with the other players and not play the game.",
    "timestamp": 1414450800
  },
  {
    "username": "Phuntom",
    "rating": 2.0,
    "comment": "Played once. Boring, did not work with my group. Might with yours, but I probably would avoid your group if your group enjoyed this. Sold 4/2013 for $5, exactly what this game is work in US currency.",
    "timestamp": 1414188000
  },
  {
    "username": "rwodonnell",
    "rating": 2.0,
    "comment": "If ever there is a hint of this game coming out, I try to divert to \"Dixit\" instead.",
    "timestamp": 1408658400
  },
  {
    "username": "devingd",
    "rating": 2.0,
    "comment": "The game was fun the first two times I played it. After that it just turned into a favoritism game that people would try too hard to make a joke. It got old really fast.",
    "timestamp": 1407362400
  },
  {
    "username": "mrbeankc",
    "rating": 2.0,
    "comment": "Will play only under the threat of violence.",
    "timestamp": 1404770400
  },
  {
    "username": "JQTNguyen",
    "rating": 2.0,
    "comment": "Gift",
    "timestamp": 1404252000
  },
  {
    "username": "Rokinron1",
    "rating": 2.0,
    "comment": "Some people love this game. I'm not a huge fan. Not a lot of strategy in my opinion. Can be quite funny with the right people though!",
    "timestamp": 1403474400
  },
  {
    "username": "thesir",
    "rating": 2.0,
    "comment": "Boo. If I play this without looking at my cards at all, I score the same amount of points. Dixit is a much better game",
    "timestamp": 1390950000
  },
  {
    "username": "Solid",
    "rating": 2.0,
    "comment": "Originality (0.5/1.0)\nTheme (0.0/0.5)\nPure Fun (0.0/1.0)\nReplayability (0.0/1.0)\nStrategy/Luck Ratio (0.0/0.5)\nScalability (0.5/0.5)\nParity (0.0/0.5)\n\nOverall 1.0/5.0",
    "timestamp": 1387926000
  },
  {
    "username": "jgoyes",
    "rating": 2.0,
    "comment": "2011-07-27\n\nInitial Rating: 6.0 (June 2010)\n\nOne of the first games I ever played, first let me tell you that I love party games, but not this one. At first I thought this was almost fun, but I dislike Apples to Apples. The game is completely random; you have no way to control your victory. Winning depends on the mood of the judges, if you could write anything down as an answer the game would be better, but you are limited by your cards. If you want a party game go play Dixit or Time´s Up, both very superior games.\n\nCurrent Rating: 3.5\n\n\n2013-11-05\n\nAfter another play, I can really say, I hate this game. I won’t play it ever again. Way too random and subjective.\n\nCurrent Rating: 2.0",
    "timestamp": 1383606000
  },
  {
    "username": "PrettyYoungThang",
    "rating": 2.0,
    "comment": "Hate everything about it",
    "timestamp": 1376344800
  },
  {
    "username": "dprski33",
    "rating": 2.0,
    "comment": "I would rather have my fingernails removed than play this game sober",
    "timestamp": 1374530400
  },
  {
    "username": "webvira",
    "rating": 2.0,
    "comment": "The rating is with teenagers/kids in mind. They LOVE this game. If it were up to me I'd give it a 2. IMO it's completely boring after playing 1/2 a round. The kids/teens will play it all night long though.",
    "timestamp": 1374098400
  },
  {
    "username": "darkk_",
    "rating": 3.0,
    "comment": "One player judges other players' answers blindly.\n\nCaptivating ❌\nEngaging ✅\nReplayability ❌\nRules ✅\nQuality ❌",
    "timestamp": 1760392800
  },
  {
    "username": "ahrnge",
    "rating": 3.0,
    "comment": "I would play with the right group, but this \"judge what's funny\" genre falls pretty far outside of what makes me like games.",
    "timestamp": 1758924000
  },
  {
    "username": "rharn",
    "rating": 3.0,
    "comment": "Instills false hope that creativity will get rewarded, then instead tosses players a lottery ticket and tells them good luck. Just awful.",
    "timestamp": 1758751200
  },
  {
    "username": "deedee1504",
    "rating": 3.0,
    "comment": "Applies creative pressure on the players without the fun or humor of other games.",
    "timestamp": 1756850400
  },
  {
    "username": "DaSnow",
    "rating": 3.0,
    "comment": "I loved this game as a kid.\n\nCAH stole it's entire gameplay, yet is the inferior version overall.\n\nHas a lot of outdated references, and might teach you a thing or two while you play.\n\nThere has to be other games that do this idea better. Would probably play again since my mom loves this one.",
    "timestamp": 1752789600
  },
  {
    "username": "veve33",
    "rating": 3.0,
    "comment": "I have probably just played this too much.",
    "timestamp": 1748210400
  },
  {
    "username": "TyDeL",
    "rating": 2.5,
    "comment": "Have never been impressed with this game. I don't like games where your imagination is limited by the cards available. It can be fun with a tight-knit group and there's some strategy to trying to know the other person's sense of humor.",
    "timestamp": 1744840800
  },
  {
    "username": "looleypalooley",
    "rating": 3.0,
    "comment": "OK on occasion for parties and family gatherings, ice-breakers, non-gamer groups, etc. TTFN",
    "timestamp": 1742252400
  },
  {
    "username": "ncc1701jv",
    "rating": 3.0,
    "comment": "Kid friendly Cards Against Humanity. Sometimes implied offensiveness is funnier than being openly offensive.",
    "timestamp": 1738450800
  },
  {
    "username": "chuckberry",
    "rating": 3.0,
    "comment": "Foxdale",
    "timestamp": 1734908400
  },
  {
    "username": "pluviometer",
    "rating": 3.0,
    "comment": "A classic kid- and family-friendly party game. Unless the kid is me and the family is my family, because they didn't get it at all and bailed after a couple rounds. That was the last time I ever tried to get them to play anything with me...",
    "timestamp": 1733698800
  },
  {
    "username": "tearexgames",
    "rating": 3.0,
    "comment": "LIKE NEW - played once.",
    "timestamp": 1733266800
  },
  {
    "username": "ahkat",
    "rating": 3.0,
    "comment": "Sold @ Google",
    "timestamp": 1732748400
  },
  {
    "username": "Dycast",
    "rating": 3.0,
    "comment": "Never really been a fan.",
    "timestamp": 1732230000
  },
  {
    "username": "origamidesigner",
    "rating": 3.0,
    "comment": "Classic 90s kids game. Seems pretty boring now that I'm an adult. Superseded by Dixit and Puns Of Anarchy.",
    "timestamp": 1722808800
  },
  {
    "username": "Juan Notrump",
    "rating": 3.0,
    "comment": "I give AtA a lot of credit for the idea of a “judge” party game. It’s not really for me because it feels to random (e.g. I’ll get points on words that didn’t feel like they were that good and vice versa). But 20 years ago sure I’d play it if everyone else wanted to because it was the only judge game out there. Today there’s scores of them and most all of them have a specific theme that make it funnier or more entertaining over AtA, which is mostly a victim of those standing on its shoulders.",
    "timestamp": 1721426400
  },
  {
    "username": "bardfark",
    "rating": 3.0,
    "comment": "G rated Cards Against Humanity",
    "timestamp": 1720908000
  },
  {
    "username": "Telaz",
    "rating": 2.5,
    "comment": "My rating(50%): 3\nMy “want to play-again” rating(50%): 2\nMy overall rating: 2.5\nPlays: 5+",
    "timestamp": 1713996000
  },
  {
    "username": "Greenosaur",
    "rating": 3.3,
    "comment": "SOLD @ Greenie's Gamer Garage Sale, April 2024",
    "timestamp": 1712440800
  },
  {
    "username": "bdmiller",
    "rating": 3.0,
    "comment": "For Sale",
    "timestamp": 1707606000
  },
  {
    "username": "tycham85",
    "rating": 3.0,
    "comment": "fun for a few plays, but now that i get the concept, i think im good for the rest of my life. does depend on the group, so i could be talked into another play.",
    "timestamp": 1707433200
  },
  {
    "username": "narcow",
    "rating": 2.8,
    "comment": "Geosphere's review told me to score this much lower (1.5), but as much as I really don't want to play this again it at least succeeds in being what it wants to be. Unfortunately the thing it wants to be isn't fun or engaging to me.",
    "timestamp": 1706742000
  },
  {
    "username": "genresavvy",
    "rating": 3.0,
    "comment": "Slow game with judges who have no accountability meaning the game is can only be as good as the players. The experience does not elevate players it restricts and limits them to narrow play patterns.",
    "timestamp": 1702940400
  },
  {
    "username": "Kernelcorndog",
    "rating": 3.0,
    "comment": "4-10 (6-8) light",
    "timestamp": 1702422000
  },
  {
    "username": "KingD7W",
    "rating": 3.0,
    "comment": "I never enjoy this game. There are too many not funny cards and doesn’t feel creative. I can appreciate that it defined its own genre of games, but I don’t like this style party game.",
    "timestamp": 1701471600
  },
  {
    "username": "wowbagger44",
    "rating": 3.0,
    "comment": "An inoffensive game, but I would never ask to play",
    "timestamp": 1698966000
  },
  {
    "username": "MikeJonez",
    "rating": 3.0,
    "comment": "2022:3/10\nplays:3\nAny game with a player judge kinda feels bad to me. The fun is from the funny pairings, but that goes away after the first play, then you see that it is just a bad game, that made you laugh at first. After writing this I'm tempted to give it a 2 instead of 3.",
    "timestamp": 1697061600
  },
  {
    "username": "Bomberdave",
    "rating": 3.0,
    "comment": "quite group dependent",
    "timestamp": 1693605600
  },
  {
    "username": "charlest",
    "rating": 3.0,
    "comment": "I was way late to the party on this one as I didn't get to play it until 2013. It was definitely fun with a few non-gamers but there are other party games I'd rather play.",
    "timestamp": 1688076000
  },
  {
    "username": "EllikTheren",
    "rating": 3.0,
    "comment": "Quiplash from Jackbox party packs don't limit you in what you can respond. I prefer to play that game or other similar ones.",
    "timestamp": 1683842400
  },
  {
    "username": "MikeKoro",
    "rating": 3.0,
    "comment": "4th Play Thoughts - 3 - (Nov 2020):\n\nI have grown very tired of these \"impress the judge\" style games where you are trying to play the most witty card and hope the judge picks you, arguing over why yours is better. It is very much not my style of game, and I have played to many that I just seem to despise them all. There are so many good word and party games in this day and age that I don't think anyone should be playing these lazily designed games. They all play out ultimately the same and I have yet to play a single one that was good. You may get a chuckle or two in the first few hands, but it gets dull fast, and there is almost no replay-ability. This review could easily be copied and pasted onto any of these games and you wouldn't know which of the 100's I am talking about. Maybe that is actually what I did, who knows?",
    "timestamp": 1682892000
  },
  {
    "username": "EarlofBronze",
    "rating": 3.0,
    "comment": "Okay party game...fun with the right people.",
    "timestamp": 1682287200
  },
  {
    "username": "Joakley815",
    "rating": 2.5,
    "comment": "- Terrible. Will not play again.\n\nI much prefer something like Codenames for a large group game. This one is fun for a play or two, but I'm pretty much done with it.",
    "timestamp": 1679439600
  },
  {
    "username": "ODaly",
    "rating": 3.0,
    "comment": "The family-friendly precursor to CAH. Much better games allow players to create their own humor rather than rely on a hand of cards to do the thinking for them.",
    "timestamp": 1676934000
  },
  {
    "username": "cnedrow",
    "rating": 3.0,
    "comment": "The mechanic which makes this game famous is singlehandedly responsible for the dumbest genre of games in existence.",
    "timestamp": 1672441200
  },
  {
    "username": "Sir Pent",
    "rating": 3.0,
    "comment": "Party game where one player has a category and the other players pick a card that they think the chooser will associate with that category. VPs depend on being chosen. But the randomness of the cards drawn and the COMPLETELY subjective judging of the other players make this too random for my taste.",
    "timestamp": 1671058800
  },
  {
    "username": "CHRISDH",
    "rating": 3.0,
    "comment": "I have played this one a lot with the family. After awhile the cards get samey and the game gets boring. I would much rather play Dixit.",
    "timestamp": 1670626800
  },
  {
    "username": "somedave",
    "rating": 3.0,
    "comment": "The played cards almost never have anything to do with the prompt card when I've played this. There are much better and varied takes on this concept now, even for kids.",
    "timestamp": 1667948400
  },
  {
    "username": "Snapcase",
    "rating": 3.0,
    "comment": "The original of the \"judge votes on the selection they like the best\" card games. Play Cards Against Humanity or any of its knock offs if you like this but want more dick jokes.\n\nSkip this entire dull genre if you have any sense.",
    "timestamp": 1664056800
  },
  {
    "username": "Buck817",
    "rating": 3.0,
    "comment": "Party",
    "timestamp": 1660255200
  },
  {
    "username": "pmmeyer",
    "rating": 3.0,
    "comment": "This is the same boring formula copied by a million other games. The only reason I didn't rate it lower is 1) it is the OG and 2) I have had a ton of fun playing this with the right group of people. Otherwise, it is boring and I don't know most of the famous people they list, leaving me with a junk filled hand.",
    "timestamp": 1660168800
  },
  {
    "username": "petegrey",
    "rating": 3.0,
    "comment": "ugh",
    "timestamp": 1658440800
  },
  {
    "username": "SnakesEvan",
    "rating": 3.0,
    "comment": "This game was incredible when I was a child, like it'd be an 8 if I was 11 years old. As you grow older though and play other games it will quickly lose its shine",
    "timestamp": 1656021600
  },
  {
    "username": "vxl119",
    "rating": 3.3,
    "comment": "Excellent game for non-gamers. It emphasizes fun and not competition.\n\nKIDS 8+",
    "timestamp": 1641769200
  },
  {
    "username": "Whodini24",
    "rating": 3.0,
    "comment": "Your standard judge picks favorite card game",
    "timestamp": 1640991600
  },
  {
    "username": "cogstockeros",
    "rating": 3.0,
    "comment": "Since I only ever played this with children, I know they don't get my sense of humor. My fiancee on the other hand, dominates this game. She always knows the perfect match (in this, and in real life)!\n\nI just don't like this game. I find it boring.",
    "timestamp": 1637622000
  },
  {
    "username": "jakemanus",
    "rating": 3.0,
    "comment": "This is a terrible game. Buy Say Anything instead, it's much better.",
    "timestamp": 1637103600
  },
  {
    "username": "pianodamon",
    "rating": 3.0,
    "comment": "From childhood/teenage years",
    "timestamp": 1635894000
  },
  {
    "username": "jaretmorlan",
    "rating": 2.5,
    "comment": "A great party game for people who only play games at parties. But its never my first suggestion. The game is void of strategy and is 100% subjective. At this point, I'd honestly pick almost any other game to play with my friends. And if we had to play it, the only way to possibly enjoy the nonsense of this game is to play its adult version, CARDS AGAINST HUMANITY. At least get a few naughty giggles out the experience.",
    "timestamp": 1628632800
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Party game",
    "timestamp": 1627423200
  },
  {
    "username": "JK777",
    "rating": 3.4,
    "comment": "Microbadge",
    "timestamp": 1626991200
  },
  {
    "username": "visual_eye",
    "rating": 3.0,
    "comment": "Too crowd dependent.",
    "timestamp": 1623103200
  },
  {
    "username": "Zenthain",
    "rating": 3.0,
    "comment": "It's too long for a simple, luck-driven game. There are many better party game options out there... but there are also many worse.",
    "timestamp": 1618956000
  },
  {
    "username": "Drakmar",
    "rating": 3.0,
    "comment": "I realize it's more of a party or family friendly type of game, but it's just too arbitrary for me and doesn't provide enough silliness or laughs to compensate. Cards Against Humanity is essentially just a \"dirty version\" of this game.",
    "timestamp": 1611788400
  },
  {
    "username": "Neiln99",
    "rating": 3.0,
    "comment": "Terrible.\n\nGameplay = -\nReplayability = -\nTheme = +\nArtwork = +\nFun = -\nGame Length = -\nPlayer Count = n/a\nPrice = +\nRulebook = n/a\nBox = +\nComponents = +\nPortability = -\nSU & TD Time = +",
    "timestamp": 1610233200
  },
  {
    "username": "OMD56",
    "rating": 3.0,
    "comment": "Replaced by more creative games",
    "timestamp": 1608418800
  },
  {
    "username": "nebuhcaneza",
    "rating": 3.0,
    "comment": "One of the first, to me anyways, games to use that play a card to get a reaction out of everyone to win the \"point\". This game is better compared now to Cards Against Humanity, who really took this to a whole other level. I do think this game can work in small bursts but I really have lost any interest in playing it.",
    "timestamp": 1607036400
  },
  {
    "username": "datamonk",
    "rating": 3.0,
    "comment": "Too many plays of this game. It got old, quick.",
    "timestamp": 1599861600
  },
  {
    "username": "HairyPotter",
    "rating": 3.0,
    "comment": "Can be an entertaining party game, but the cards just aren't interesting enough. Gets very old very fast. Still would play if asked, but there are much better party games out there.",
    "timestamp": 1599343200
  },
  {
    "username": "MeestR",
    "rating": 3.0,
    "comment": "Better options available. Nearly always suggest Dixit as a counter whenever this gets suggested.",
    "timestamp": 1597528800
  },
  {
    "username": "IronyThrown",
    "rating": 3.0,
    "comment": "Yawn...I’m not a big part of party games to begin with. Games with voting for points...I’ll pass.",
    "timestamp": 1596664800
  },
  {
    "username": "kaepone",
    "rating": 3.0,
    "comment": "Popularity contest",
    "timestamp": 1583794800
  },
  {
    "username": "Pagoda79",
    "rating": 3.0,
    "comment": "This is not really a game so much as an activity (that old chestnut) and one I seem to tire of way before everybody else.",
    "timestamp": 1581116400
  },
  {
    "username": "Forfonk",
    "rating": 3.0,
    "comment": "Was a good game until Cards Against Humanity made it pale in comparison. Game depends heavily on people you play with, and oftentimes, casual players disappoint b y not reading the cards in full or not knowing the right thing about something.",
    "timestamp": 1578610800
  },
  {
    "username": "lucsavoie9",
    "rating": 3.0,
    "comment": "Rather plan Joking Hazard",
    "timestamp": 1578178800
  },
  {
    "username": "Kitabuck",
    "rating": 3.0,
    "comment": "Apples to Apples and Cards Against Humanity... oh where do I begin. I want to like these games, as they are all that my non-gamer friends want to play when we get together. My enjoyment from this game is derived purely from what cards I get and how well I know the other people. Some games I get pretty unfunny cards. Some games the other players make references to inside jokes the whole time. I prefer games where subjectivity isn't the exclusive domain for playing.",
    "timestamp": 1575241200
  },
  {
    "username": "Magnusson",
    "rating": 3.0,
    "comment": "3 - Likely won’t play this again\n\nThe (grand-)mother of Cards against humanity is pretty dull. At least CaH has a dark humour side, which I prefer.",
    "timestamp": 1573599600
  },
  {
    "username": "Minlader",
    "rating": 3.0,
    "comment": "Pretty boring tbh, plenty of other alternatives much better",
    "timestamp": 1573426800
  },
  {
    "username": "msalmon14",
    "rating": 3.0,
    "comment": "This is just a dumb game. I have very little control over winning. I would say more than half the time I'm completely shocked by the winning card. Because of this game I will never play Dixit",
    "timestamp": 1572476400
  },
  {
    "username": "TaceoAgrotis",
    "rating": 3.0,
    "comment": "Classic party activity, not really a game. Really boils down to matching a few funny words together that isn't really that fun for me. Mechanics are weak, you are more likely to win by putting down a random card as anything.",
    "timestamp": 1571954400
  },
  {
    "username": "Truthsketcher",
    "rating": 3.0,
    "comment": "I'm not into party games.",
    "timestamp": 1568671200
  },
  {
    "username": "giltleaf",
    "rating": 3.0,
    "comment": "marked above cards against humanity because even though it's a game meant for kids, it's somehow less juvenille. (alternate joke: even though it's a game about apples, it doesn't go for the low hanging fruit)\n\nThis actually makes you try in order to be funny instead of just relying on \"lolzomg random\" cards.",
    "timestamp": 1568671200
  },
  {
    "username": "walkincarpet",
    "rating": 3.0,
    "comment": "In family collection, not personally owned.",
    "timestamp": 1568584800
  },
  {
    "username": "dkuznick",
    "rating": 3.0,
    "comment": "There are so many better party games of this type.",
    "timestamp": 1568412000
  },
  {
    "username": "mandrewsbex",
    "rating": 3.0,
    "comment": "Sell...new",
    "timestamp": 1561932000
  },
  {
    "username": "bone4lyf",
    "rating": 3.0,
    "comment": "just need to find a way to sell or give this away",
    "timestamp": 1561154400
  },
  {
    "username": "Beyak",
    "rating": 3.0,
    "comment": "BURNED IN FIRE, OCTOBER 2017\nGets old really quick. Avoid playing with young children it can be agonizing.",
    "timestamp": 1556056800
  },
  {
    "username": "DrMasqueRetro",
    "rating": 3.0,
    "comment": "The game my relatives all like and I despise. You are not finding the best answer just what you think the other person will think is the best answer. You can have the perfect card for the answer, but if your opponent does not know what it is, then it is trash. Utterly futile.",
    "timestamp": 1554588000
  },
  {
    "username": "michaelderr",
    "rating": 3.0,
    "comment": "This will definitely get you closer to your death without having to actually engage with your relatives.",
    "timestamp": 1552258800
  },
  {
    "username": "pkufahl",
    "rating": 3.0,
    "comment": "Really the most generic party game of all time. Those who like it the most (little kids) actually are the worst to play it with. Mechanically, this one stinks, but it does find its way out of storage on occasion and it is perfectly harmless.",
    "timestamp": 1550012400
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "A popular party game, but it relies too much on knowing your friends than knowing anything, and knowing your friends might fall apart on their whim. A good hand is impossible to maintain, since there's no way of knowing what will be good in future turns; there are no \"bad\" cards to just discard if you feel like you have nothing good to contribute.",
    "timestamp": 1759269600
  },
  {
    "username": "noisycrow",
    "rating": 4.0,
    "comment": "Good party game, only has about two rules. Great for \"non-gamers\", and can be played after alcohol consumption.",
    "timestamp": 1758319200
  },
  {
    "username": "SleepyKei",
    "rating": 4.0,
    "comment": "4-10 Players\nCommunity: 4-10+ — Best: 6-8",
    "timestamp": 1756159200
  },
  {
    "username": "hylian_marq",
    "rating": 4.0,
    "comment": "Had fun playing this as a kid",
    "timestamp": 1754604000
  },
  {
    "username": "killerwar_hog2",
    "rating": 4.0,
    "comment": "...meh",
    "timestamp": 1754604000
  },
  {
    "username": "pdowen3",
    "rating": 4.0,
    "comment": "It is what it is. Since I'm not a fan of one-player-judge games when the judge knows whose answer is whose, I don't seek out this game.",
    "timestamp": 1750802400
  },
  {
    "username": "EvilCheesypoof",
    "rating": 4.0,
    "comment": "Why I got rid of it: It was funny 20 years ago, this genre is played out now.",
    "timestamp": 1749333600
  },
  {
    "username": "CannonFodderTed",
    "rating": 3.7,
    "comment": "Is it sad that we have to describe this as a family-friendly version of Cards Against Humanity when this game came first?",
    "timestamp": 1746482400
  },
  {
    "username": "cubntin",
    "rating": 4.0,
    "comment": "4-10 Players",
    "timestamp": 1743289200
  },
  {
    "username": "geoffder",
    "rating": 4.0,
    "comment": "There are much better word party games to play these days. At first I enjoyed it more, but I found myself getting roped into playing it at gatherings long after I grew tired of it. Slow and samey, not enough laughs.",
    "timestamp": 1743116400
  },
  {
    "username": "Overexposed",
    "rating": 4.0,
    "comment": "A simple activity suitable for kids, etc. Not much of a game.",
    "timestamp": 1741215600
  },
  {
    "username": "DonJunk",
    "rating": 4.0,
    "comment": "Last Verified\nFebruary 8, 2025",
    "timestamp": 1738969200
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "innovative idea\n\n aesthetically arid\n thematically tenuous\n mechanically moronic\n strategically shallow\n creatively challenged\n fucking formulaic\n\nI'd rather play Things..., Say Anything, Telestrations, etc where there is more creative agency. At least A2A is not a forced low-brow experience like CAH and all the other modern iterations.\n\nIt only works with players you already know, and can be enjoyable if you force players to argue why their card should win or why an opponent's card shouldn't. Ultimately, it suffers from the same problem Cards against Humanity does, just on the opposite end of the spectrum of humor. It's too PG.",
    "timestamp": 1738278000
  },
  {
    "username": "savetheEnts",
    "rating": 4.0,
    "comment": "Is it really a board game? Even labeling it as a card game seems a stretch. I guess it's a party... activity?",
    "timestamp": 1738105200
  },
  {
    "username": "RockyMountainMama",
    "rating": 4.0,
    "comment": "You know, when your with a bunch of people that just want a good time, Apples to Apples is a level playing field for most. Its easy to let people come and go and let everyone feel like they are part of something. but that's about all the good I have to say about it. There is more strategy then I am going to give it credit for, but it gets a little stagnant from there. Stereotypes get old, cards get overplayed, the funny moments feel fake/disingenuous, like the funny wasn't you and your amazing comedic timing, it was the fact that you got one of the \"trump\" cards that always wins and that's that.",
    "timestamp": 1738018800
  },
  {
    "username": "dr_strangelove",
    "rating": 4.0,
    "comment": "Gen Con Math Trade 2011.",
    "timestamp": 1735167600
  },
  {
    "username": "andy61",
    "rating": 4.0,
    "comment": "Party game that popularised the player voting mechanism",
    "timestamp": 1730329200
  },
  {
    "username": "matthewgallion",
    "rating": 4.0,
    "comment": "There was a time in my life when I thought this was good, but then I found out other party games exist.",
    "timestamp": 1723845600
  },
  {
    "username": "MatroidX",
    "rating": 4.0,
    "comment": "The main gameplay is predicting how others will choose (usually either seriously or for maximum humour / randomness). It's okay, but quickly gets boring. I think it's surpassed by Dixit (where the matches are more abstract) or Codenames (where you try to maximize your matches with a single clue).",
    "timestamp": 1720735200
  },
  {
    "username": "G_Riffy",
    "rating": 4.0,
    "comment": "I loved this as a kid.\n\nI still remember some of my favourite plays. Because of this it still holds a place in my heart, but I don't enjoy this genre of game anymore.",
    "timestamp": 1720216800
  },
  {
    "username": "x3kross",
    "rating": 4.0,
    "comment": "Early version of the Cards Against Humanity judge party game.",
    "timestamp": 1718316000
  },
  {
    "username": "Coala342",
    "rating": 4.0,
    "comment": "It can be fun or it can flop terribly. 10 players max.",
    "timestamp": 1715464800
  },
  {
    "username": "eddieb",
    "rating": 4.0,
    "comment": "Party game that everyone copied. Don't concern yourself with score. Just have fun till you are done then never play again.",
    "timestamp": 1715205600
  },
  {
    "username": "joeyvigil",
    "rating": 4.0,
    "comment": "I'd rather play this over cards against humanity, but honestly I would rather skip both",
    "timestamp": 1708988400
  },
  {
    "username": "PiecesOfToast",
    "rating": 3.5,
    "comment": "This was the game of 2000s. Unfortunately, playing today it is now outdated as there are so many better versions it's hard to come back to and play",
    "timestamp": 1704841200
  },
  {
    "username": "Daminor8",
    "rating": 4.0,
    "comment": "Have not played in years, unlikely to bring out soon. Codenames has replaced this for me.",
    "timestamp": 1704668400
  },
  {
    "username": "comred",
    "rating": 4.0,
    "comment": "This use to be a great game for youth groups, lots of friend or any other large social events.\n\nHowever, the game is lackluster and I'd rather play a Jackbox game or other board games.",
    "timestamp": 1704150000
  },
  {
    "username": "WaffleBoi",
    "rating": 4.0,
    "comment": "Used to love this game. I feel like it's inevitable that I will eventually play it again but I'm not exactly looking forward to that day.",
    "timestamp": 1702940400
  },
  {
    "username": "Mark_Gendro",
    "rating": 4.0,
    "comment": "Just play Dixit.",
    "timestamp": 1700866800
  },
  {
    "username": "Yinzadi",
    "rating": 4.0,
    "comment": "Published by Mattel\nApples to Apples and Apples to Apples Junior are at Empire\n\nApples to Apples Junior\nhttps://www.amightygirl.com/apples-to-apples-junior",
    "timestamp": 1699138800
  },
  {
    "username": "GamesForLaufs",
    "rating": 4.0,
    "comment": "Like to be collective instead of single judge and it is not for me.",
    "timestamp": 1697320800
  },
  {
    "username": "yolandavi",
    "rating": 4.0,
    "comment": "I'm sick of this game because it became the default party game in our couples group and extended family gatherings. Yes, it's a great game for all. But matching random words barely strains the brain. Rating lowered.",
    "timestamp": 1694124000
  },
  {
    "username": "Citery",
    "rating": 4.0,
    "comment": "Falls into the same trap Cards Against Humanity does, in that it doesn't allow players to be funny in their own way. It's far better than CAH though for being playable by a mixed-age group, and the simple answer cards do allow a little bit of creative license in interpretation, so adults can find a little of their own humor in them.",
    "timestamp": 1693864800
  },
  {
    "username": "benmh",
    "rating": 4.0,
    "comment": "Probably the most boring judgment game. None of the cards are particularly interesting, funny, or related, so most of the rounds just end up being \"I guess this one wins because it kind of applies to the prompt.\" Overall, pretty harmless but definitely better judgment games out there.\n\nWeight- 1.1",
    "timestamp": 1687816800
  },
  {
    "username": "Firearchitect",
    "rating": 4.0,
    "comment": "played countless times",
    "timestamp": 1687816800
  },
  {
    "username": "mr0santan",
    "rating": 4.0,
    "comment": "Used to love playing this in the basement with a big group of friends. Such great memories. I would go towards something else now a days, but still have a copy and would play with a big group if it was requested.",
    "timestamp": 1687298400
  },
  {
    "username": "rynelf",
    "rating": 3.5,
    "comment": "--Dec2003-- Fun for several plays; but the appeal diminishes in the face of superior competition (Attribute). Still fun with the right crowd.\n--08Aug2004-- Rating downgraded.\n\n++ ~5 unlogged plays. ++",
    "timestamp": 1680559200
  },
  {
    "username": "VolleyGame",
    "rating": 4.0,
    "comment": "1.2 - Ok with the right crowd. Played a few times before recording plays.",
    "timestamp": 1680386400
  },
  {
    "username": "Gern299",
    "rating": 4.0,
    "comment": "Passable enough with people that enjoy it.",
    "timestamp": 1679785200
  },
  {
    "username": "SultanSevy",
    "rating": 4.0,
    "comment": "Okay, but overly simple for my tastes. I'm not a fan of tabletop games where a winner is decided by judging. That said, it's still a solid family game or light party game for non-gamers.",
    "timestamp": 1678230000
  },
  {
    "username": "AlanNash",
    "rating": 4.0,
    "comment": "I enjoyed this game growing up and could see myself playing a home-made game inspired by it with kids or seniors in the future. As for the original game though, I donated it and see no need to play it every again.",
    "timestamp": 1677538800
  },
  {
    "username": "hotrodjimmy",
    "rating": 4.0,
    "comment": "Not even sure where this game came from; I remember playing it as a freshman at ASU a lot before CAH came out. We keep this game around for when old folks want to play an easy word game that they have heard of.",
    "timestamp": 1677193200
  },
  {
    "username": "chicagojohn",
    "rating": 4.0,
    "comment": "Reason for purging: Got stale and repetitive very quickly.",
    "timestamp": 1675465200
  },
  {
    "username": "Commanders",
    "rating": 4.0,
    "comment": "4-10 players",
    "timestamp": 1674687600
  },
  {
    "username": "authentic",
    "rating": 4.0,
    "comment": "One of my favorite games growing up, but there are much better party games around now with less downtime or feeling powerless. At one point I noticed some players cheating, and they were consistently making the game more fun for everyone. That shifted my perspective a bit on the game. It needs instructions that let people reset their hand every turn, or have much higher hand sizes, something to break up the inevitable monotony and bad turns.\n\nBut one big problem with this game is how easily it can dissolve into rivalries. If players take the game personally--which is encouraged by the excellent MY cards--then it can ruin a day as easily as make it better.",
    "timestamp": 1673996400
  },
  {
    "username": "tangentline",
    "rating": 4.0,
    "comment": "Gets dry after a couple rounds. If you have a bad hand your cards might not even fit the prompt!",
    "timestamp": 1672959600
  },
  {
    "username": "nswoll",
    "rating": 4.0,
    "comment": "I gave this a 1, because I honestly feel that this game is broken. Someone will submit a card that 5 out of the 6 people playing will agree is the best possible match, but the 6th person is the \"judge\" and he won't pick that card because\na: he doesn't understand what that card means (or he doesn't know who it is)\nb: he decides it would be \"funny\" to pick the card that is the worst possible match\nc: he tries to read people's facial expressions when the cards are read so he can pick the person he likes\n\nSo basically since this game relies on being subjective it is broken. Also, when I criticize the game, people who like the game make this claim - \"If you're playing to win you're playing it wrong\" Doesn't that mean it's not a game?",
    "timestamp": 1671231600
  },
  {
    "username": "infeneris",
    "rating": 4.0,
    "comment": "Not fun being forced into bad choices but easy to play with non gamers. I'd rather play Say Anything where you get to choose your own answers.",
    "timestamp": 1669849200
  },
  {
    "username": "PaperDesigner",
    "rating": 4.0,
    "comment": "It's better than its army of clones (or clones of the most popular clone, Cards Against Humanity). It's also not that interesting after a while.",
    "timestamp": 1668639600
  },
  {
    "username": "Schwenkstar",
    "rating": 4.0,
    "comment": "Updated Comments: Thankfully has dropped in its BGG Ranking. Now I no longer feel insane.\n\n---\n\nUgh! Why is this party game so popular... even here on boardgamegeek! Ranked almost in the top 1000?! Really?! Am I missing something?\n\nIn all truth - though it's bad - it's not *that* bad, but due to the fact that it is so mediocre yet so inexplicably popular that I probably react more badly to it than I probably should.",
    "timestamp": 1668121200
  },
  {
    "username": "Leviat",
    "rating": 4.0,
    "comment": "Enjoyed this game when I was a teen but it's been played out. Doesn't give enough room for creativity.",
    "timestamp": 1665612000
  },
  {
    "username": "brumbala",
    "rating": 4.0,
    "comment": "This feels more like an activity than a game. I've played with several different groups of people over the years, and it always turns into a \"silliest answer\" contest, rather than what actually makes sense together.",
    "timestamp": 1665093600
  },
  {
    "username": "icortezi",
    "rating": 4.0,
    "comment": "A party game that we haven't played in many years.",
    "timestamp": 1663192800
  },
  {
    "username": "ashbane",
    "rating": 4.0,
    "comment": "15$",
    "timestamp": 1656540000
  },
  {
    "username": "PolarDad",
    "rating": 4.0,
    "comment": "Family fun. Always provides laughs every time we play. Some of our family tries to be serious in their offerings. Others like to be goofballs. It is not my personal first choice of games (not a huge fan of wordy party games) but I always enjoy it when we do play.\n\nLast played Q1 2018\n\nDonated to wife's classroom. 2022",
    "timestamp": 1654812000
  },
  {
    "username": "jarredscott78",
    "rating": 4.0,
    "comment": "Arbitrary.",
    "timestamp": 1654466400
  },
  {
    "username": "skrebs",
    "rating": 4.0,
    "comment": "I've had enough of this game after about 15 minutes, and although I usually like those 15 minutes, the game generally lasts another hour or more.",
    "timestamp": 1651442400
  },
  {
    "username": "gimlianon",
    "rating": 4.0,
    "comment": "A mediocre appeal-to-the-judge party game about making comparisons between the card on the table and cards in hand. It's boring.\n\nDonated to the office",
    "timestamp": 1651269600
  },
  {
    "username": "danielklinge",
    "rating": 4.0,
    "comment": "I have really have fun memories of playing this game with friends growing up. It is a fun family game, but with the advancement of board games over the years, I think that it has become a little dated. But still a fun game with the right people in the right setting.",
    "timestamp": 1650319200
  },
  {
    "username": "Ben1842",
    "rating": 4.0,
    "comment": "It's really basic. It's fine a few times but it wears out it's welcome and there are so many of this style of game.",
    "timestamp": 1648677600
  },
  {
    "username": "chaddyboy_2000",
    "rating": 4.0,
    "comment": "Great party/family game to play with non-gamers. Lots of fun and laughs!\n\nThe entire game is simply one player (the judge) playing an adjective, and all other players playing nouns, hoping the judge will think their noun best matches the adjective. Play circulates with each turn getting to be the judge until someone scores a certain number of points.\n\nIt's best played with people you know, as you really want to play cards that you know the judge is apt to choose.",
    "timestamp": 1645570800
  },
  {
    "username": "downstream",
    "rating": 4.0,
    "comment": "Great fun for a party, very simple to learn, and bonus marks for the fact that I don't normally like party games at all. It can be somewhat entertaining, but it gets boring really fast.\n\nUpdate: Couldn't stand it anymore. The last play was so boring. Gave it away as a gift.\n\nUpdate: Ended up with this in the collection again because my partner owns it. Maybe I'd try again with the right group.\n\n* J knows this, likes it",
    "timestamp": 1644879600
  },
  {
    "username": "dr_sanchez",
    "rating": 4.0,
    "comment": "I keep this around for the non gamers in my life. Can be fun in the right group, but even then its really it's more about the group than the game. It's especially difficult since the red cards are inconsistent in their relevance and notoriety. For example: Grandparents won't know Justin Bieber and kids won't know Clark Gable.",
    "timestamp": 1643929200
  },
  {
    "username": "timori",
    "rating": 4.0,
    "comment": "No effort required to play this game, yet other party games of equal contribution pays out many more dividends.",
    "timestamp": 1642114800
  },
  {
    "username": "Trevor03",
    "rating": 4.0,
    "comment": "It's fine. Occasionally good for a laugh with \"PG\" people. Replaced by Cards Against Humanity for every other group, though.",
    "timestamp": 1634940000
  },
  {
    "username": "sfouche",
    "rating": 4.0,
    "comment": "Sleeved: n/n",
    "timestamp": 1632866400
  },
  {
    "username": "Blacksad",
    "rating": 4.0,
    "comment": "Primera partida (4/10)\nPartygame para 6 en adelante. Irrelevante.\n\nNota\nSale de la colección mediante MT sin jugar",
    "timestamp": 1632175200
  },
  {
    "username": "Castlevanio",
    "rating": 4.0,
    "comment": "Vendido Marzo 2019",
    "timestamp": 1631311200
  },
  {
    "username": "CanadianWyteWolf",
    "rating": 4.0,
    "comment": "I don't mind Apples to Apples, but it's such a subjective experience that I think it's more a game for those who generally don't play board games.",
    "timestamp": 1630879200
  },
  {
    "username": "Sportomax",
    "rating": 4.0,
    "comment": "Party",
    "timestamp": 1629324000
  },
  {
    "username": "Ravensburg24",
    "rating": 4.0,
    "comment": "Top of the mainstream games shelf.",
    "timestamp": 1628460000
  },
  {
    "username": "Rag136",
    "rating": 4.0,
    "comment": "ok",
    "timestamp": 1624831200
  },
  {
    "username": "Far0a",
    "rating": 4.0,
    "comment": "5.18.21\nRanking: 52",
    "timestamp": 1624572000
  },
  {
    "username": "mjhake",
    "rating": 4.0,
    "comment": "Clean version of Cards against humanity in my opinion",
    "timestamp": 1622066400
  },
  {
    "username": "Moosekretz",
    "rating": 4.0,
    "comment": "Pros:\nCan create silly conversation.\n\nCons:\nCan last way too long, needs house-rules to keep fun, more activity than game.",
    "timestamp": 1621375200
  },
  {
    "username": "Giantredmonkey",
    "rating": 4.0,
    "comment": "Boring Cards against humanity.",
    "timestamp": 1619042400
  },
  {
    "username": "John Rogers",
    "rating": 4.0,
    "comment": "A game where winning doesn't matter. Play can be extremely different among different personalities. Playing with imaginative people is suggested.\n\nWIFE RATING - 2",
    "timestamp": 1614466800
  },
  {
    "username": "DaneIronfoot",
    "rating": 4.0,
    "comment": "A bit Outdated.",
    "timestamp": 1613343600
  },
  {
    "username": "mudville9",
    "rating": 4.0,
    "comment": "Why play this when you can play snake oil?",
    "timestamp": 1612220400
  },
  {
    "username": "bitflipper456",
    "rating": 4.0,
    "comment": "Was fun in high school, not my jam anymore",
    "timestamp": 1611788400
  },
  {
    "username": "PBandJellyfish",
    "rating": 4.5,
    "comment": "@SC",
    "timestamp": 1760824800
  },
  {
    "username": "matthan",
    "rating": 5.0,
    "comment": "With the right people, this game rocks. Can be really, really funny.",
    "timestamp": 1759442400
  },
  {
    "username": "Brother Abe",
    "rating": 5.2,
    "comment": "September Traded 2nd copy of Apples to Apples trade value of $1 to BoardGameCo for Battleship trade value of $1\n\nMaria’s pre2015",
    "timestamp": 1758578400
  },
  {
    "username": "ChuckWengam",
    "rating": 5.0,
    "comment": "The rating I gave this game is slightly skewed, as are almost all my games in my collection, by the group of friends that I play with. Think of this game as \"Wise and Otherwise\" lite. Great party game!\n\nBest with LARGE group",
    "timestamp": 1757023200
  },
  {
    "username": "abjohnuf",
    "rating": 5.0,
    "comment": "gave away",
    "timestamp": 1753480800
  },
  {
    "username": "Waffleater",
    "rating": 5.0,
    "comment": "Replay",
    "timestamp": 1753048800
  },
  {
    "username": "BoxerDog",
    "rating": 5.0,
    "comment": "Fun party game, if you get the right cards. Otherwise it is a looong 30+ minute game. Game is showing its age.\n\n**Repetitive, you’ve outgrown it — better versions exist (Say Anything)**",
    "timestamp": 1752616800
  },
  {
    "username": "SVan",
    "rating": 5.0,
    "comment": "Fast game that is easy to learn and gets your brain going. Just better stuff out there that does it better.",
    "timestamp": 1750456800
  },
  {
    "username": "FlurkyTurkey",
    "rating": 5.0,
    "comment": "So many better party games out there. Id much rather play dixit.",
    "timestamp": 1747951200
  },
  {
    "username": "Thies",
    "rating": 5.0,
    "comment": "Fun for maybe one game if in the right (silly) mood. The fun seems to wear off at some point, so best to just end it rather than play to a win condition. Not really the type of game to play for scores anyway.",
    "timestamp": 1747519200
  },
  {
    "username": "AetasAaM",
    "rating": 5.0,
    "comment": "Better than cards against humanity. Making a sly dirty or off-color joke in this game is much funnier and more satisfying than in the other.",
    "timestamp": 1746914400
  },
  {
    "username": "kingwilli",
    "rating": 5.0,
    "comment": "[NR] (#143) Before adults got cards against humanity, this was the G rated version. Fun party game for all ages.",
    "timestamp": 1741993200
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "Decent party game if uninspiring.a weaker version of Cards Against Humanity.",
    "timestamp": 1740438000
  },
  {
    "username": "Bluegunstarhero",
    "rating": 5.0,
    "comment": "opened, complete",
    "timestamp": 1739142000
  },
  {
    "username": "Odegourds",
    "rating": 4.5,
    "comment": "Rating for Party Mode (Large Mixed Groups)\n--\nA aging party game that works in groups where you know each other and lots of American culture from a certain timeframe - and completely falls flat if you don't. We never have a large enough group that wants to play this without kids that are too young for the references now. It's a game that you do better if you know the person judging which is not always the case at our \"parties\". I do like that I could play with my card hand in my sweater pocket while roaming around watching the little kids or while distracted in conversation. However, most people we have played with are bored, confused or just uninvested which doesn't sound like a fun party AT ALL. We like other games better and honestly, it just doesn't get played.\n\n(Not) Bonus Points because we have cleaned up the cards that exploded out of the box more times that we have played so it's definitively moving out of our collection.",
    "timestamp": 1738969200
  },
  {
    "username": "TrentonTron",
    "rating": 5.0,
    "comment": "No strategy, feels completely random. Not creative at all because of the restriction of only being able to use the words on the cards.\n\nEdit: Played recently because a group of my friends were playing. It was actually fun, but I can't see myself ever suggesting it.",
    "timestamp": 1737846000
  },
  {
    "username": "Chris Schreiber",
    "rating": 5.0,
    "comment": "This game belongs in every gaming advocates collection. Very fun party game, very accessible. I don't play it often so I won't score it highly, but I often find myself in situations where I wish I had it with me.\n\nUpdate 02/2009 - I don't personally play this anymore because I prefer Time's Up Title Recall or Wits & Wagers for party games; but I have it being played at many game nights I host with high school students.\n\n2015 - If I never play this again I am okay with that",
    "timestamp": 1737068400
  },
  {
    "username": "Sasha_Nein",
    "rating": 5.0,
    "comment": "It's Apples to Apples...\n\nWould you like me to explain Catan too?",
    "timestamp": 1736204400
  },
  {
    "username": "GirloftheFandom",
    "rating": 5.0,
    "comment": "(Famous People cards separated)",
    "timestamp": 1736118000
  },
  {
    "username": "docspouse",
    "rating": 5.0,
    "comment": "4-10 players",
    "timestamp": 1733007600
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "Decent mass market party game. I haven't seen it in a long time, or I've just filtered it out of my consciousness",
    "timestamp": 1732489200
  },
  {
    "username": "Vazerum",
    "rating": 5.0,
    "comment": "It was fun with friends years ago. Keeping for the kids.",
    "timestamp": 1732143600
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "Good party game. Great for gamers and non-gamers alike with very simple rules. I don't think I have ever shuffled that many cards before. We need an automatic card shuffler to play.\n\nGot in 2007",
    "timestamp": 1731279600
  },
  {
    "username": "CurtisC",
    "rating": 5.0,
    "comment": "A very popular and fun party game. This gets played at more backyard barbeques than any other game we have.",
    "timestamp": 1730070000
  },
  {
    "username": "funnyfishman",
    "rating": 5.0,
    "comment": "Party Games - https://boardgamegeek.com/geeklist/341794/",
    "timestamp": 1726524000
  },
  {
    "username": "DarrinWilliams",
    "rating": 5.0,
    "comment": "Green Card: Apples to Apples. Red Cards: ARod; Al Capone; Apple Pie. I'd choose A-Rod because they're both over-rated.",
    "timestamp": 1725487200
  },
  {
    "username": "Cyborgosaur",
    "rating": 5.0,
    "comment": "Gave to Mom. This isn't as much of a game as it is a \"social activity.\"",
    "timestamp": 1725141600
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √",
    "timestamp": 1724450400
  },
  {
    "username": "benjaminehlers1",
    "rating": 5.0,
    "comment": "Haven't played this one in years, but it was fun back in the day.\n**Update: just introduced this to my son as he was asking to learn it, and he had a blast learning it as a brand new game to him.",
    "timestamp": 1723845600
  },
  {
    "username": "aliendaydreamer",
    "rating": 5.0,
    "comment": "Better with drinks",
    "timestamp": 1723327200
  },
  {
    "username": "tmoiynmwg",
    "rating": 5.0,
    "comment": "Good party game for meeting folks.",
    "timestamp": 1722808800
  },
  {
    "username": "OutlanderCDR",
    "rating": 5.0,
    "comment": "Mostly would rater play some other thing",
    "timestamp": 1722463200
  },
  {
    "username": "Mbyron7",
    "rating": 4.8,
    "comment": "- 4-10 Player\n- 20-30 min\n\nMisc:\n- Not Sleeving",
    "timestamp": 1722376800
  },
  {
    "username": "AmandaCK",
    "rating": 5.0,
    "comment": "Complete.",
    "timestamp": 1720735200
  },
  {
    "username": "msfleck",
    "rating": 5.0,
    "comment": "Really quick and easy party game that is so fast to learn, and doesn't require any real creativity or direct participation/performance so it is good even for people who normally are shy",
    "timestamp": 1718748000
  },
  {
    "username": "Dragonmaster256",
    "rating": 4.8,
    "comment": "4.5 for Alex, 5 for Cye",
    "timestamp": 1717624800
  },
  {
    "username": "LinkToDarkness",
    "rating": 5.0,
    "comment": "Apples to Apples suffers from the curse of many party games: you have to play with the right group for it to be fun. It also unfortunately suffers from the issue that it was one of the first major party games to become popular and it's ideas have been implemented (often better) in other games.\n\nApples to Apples remains a part of my collection, but due to there being so many other games that I would choose over it, I doubt it will be coming out too often until my children get older and are willing to play games with my wife and I. Even then, I will probably choose other games over Apples to Apples, despite its universal appeal, especially since it often falls into the \"How can I tailor my red cards played to what the other person finds funny,\" rather than trying to play a red card that is most appropriate for the judge's chosen green card.",
    "timestamp": 1716933600
  },
  {
    "username": "fliegen5",
    "rating": 4.5,
    "comment": "Gifted Mar'23",
    "timestamp": 1712700000
  },
  {
    "username": "CorbyC",
    "rating": 5.0,
    "comment": "A fun enough party game. We just learn more strategic at my place.",
    "timestamp": 1709593200
  },
  {
    "username": "TravisWhit",
    "rating": 4.5,
    "comment": "Fine for what it is",
    "timestamp": 1708815600
  },
  {
    "username": "AWraith",
    "rating": 5.0,
    "comment": "Cull",
    "timestamp": 1706914800
  },
  {
    "username": "Kf4vkp",
    "rating": 5.0,
    "comment": "Cleaner version of CAH, More family friendly, but some outdated references. Left behind in divorce.",
    "timestamp": 1706482800
  },
  {
    "username": "banannery",
    "rating": 5.0,
    "comment": "4–10 players; best with 6–8.\nAmerican pop culture references. Gets old fast when overplayed.",
    "timestamp": 1706310000
  },
  {
    "username": "jimok",
    "rating": 5.0,
    "comment": "Not sure what happened to my copy. Don't care.",
    "timestamp": 1705791600
  },
  {
    "username": "bm6262",
    "rating": 5.0,
    "comment": "Was okay for period of time.",
    "timestamp": 1704322800
  },
  {
    "username": "Larry Welborn",
    "rating": 5.0,
    "comment": "Fun with a large group. Non-gamers usually enjoy this.",
    "timestamp": 1703199600
  },
  {
    "username": "stpitner",
    "rating": 5.0,
    "comment": "It's cute, it's fun, my family enjoys it. It is now getting outdated with the cards on it, but what's great is what it set up as so many other similar types of games like it. I think my family would prefer the Pictures Apples to Apples version the best. Could cause lots of laughs at parties.",
    "timestamp": 1703113200
  },
  {
    "username": "mothertruckin",
    "rating": 5.0,
    "comment": "Party crate 2005 version with exp 1 and 2, plus 2 more crate expansions. I have a lot of fun with this but it hardly feels like a game. Lots of laughs with the right group and some booze.\n\nParty Crate: Base game plus expansions 1 & 2.\nCrate Expansion 1: Expansions 3 & 4.\nCrate Expansion 2: Expansions 5 & 6.\n\nDonated.",
    "timestamp": 1701126000
  },
  {
    "username": "Bluedevil310",
    "rating": 5.0,
    "comment": "It depends on the crowd. There are some humorous answers, but when there is a clearly correct match, but something wonky is selected, it can be quite frustrating.",
    "timestamp": 1694469600
  },
  {
    "username": "Priestess_of_Neptune",
    "rating": 5.0,
    "comment": "4-10 player, best 6-8.",
    "timestamp": 1694296800
  },
  {
    "username": "nabos",
    "rating": 5.0,
    "comment": "Language dependent",
    "timestamp": 1692914400
  },
  {
    "username": "TheYodaMan",
    "rating": 5.0,
    "comment": "It is what it is... Fun with a group for a short while.",
    "timestamp": 1691964000
  },
  {
    "username": "Parsat",
    "rating": 5.0,
    "comment": "As simple as a game can get, but great fun.",
    "timestamp": 1691791200
  },
  {
    "username": "marynik007",
    "rating": 5.0,
    "comment": "Apple crate",
    "timestamp": 1691704800
  },
  {
    "username": "_The_Inquiry_",
    "rating": 5.0,
    "comment": "Prior to 2020: 50 plays (est)",
    "timestamp": 1689890400
  },
  {
    "username": "hazelnym",
    "rating": 5.0,
    "comment": "Fun game but you absolutely need the right group of people. Otherwise it's intolerable.",
    "timestamp": 1688940000
  },
  {
    "username": "garysax",
    "rating": 5.0,
    "comment": "This game basically enables people to be funny. If they aren't funny otherwise, the game doesn't work. If they *are* funny, the game is really great. Simple enough? There's a mild psychology element which can be amusing as well. This is an good party game with a good group. And dear god, don't play many times in a row!",
    "timestamp": 1688594400
  },
  {
    "username": "drydoc",
    "rating": 4.5,
    "comment": "This game was somehow enjoyable when I was a kid/teenager, but that is no longer the case. It's a \"not so good\" party game that fun people can have a fun time with. That is more of a testament to the people than the game. It does have the bonus of being easily accessible and clean humored. Honestly though, if you're not playing Apples to Apples with a group of kids and don't mind a little bit of dirt, just play Cards Against Humanity instead. (10-15 plays)",
    "timestamp": 1686780000
  },
  {
    "username": "Leuname",
    "rating": 5.0,
    "comment": "A classic party game but it's been firmly replaced for me. A good one for it's time but there's better ones now.",
    "timestamp": 1684188000
  },
  {
    "username": "fnord_friendly",
    "rating": 5.0,
    "comment": "One of my least favorite party games, not to say it’s no fun, but these apples are just over ripe at this point. I keep it on my shelf because it teaches easily and it’s a comfort game for many casuals.",
    "timestamp": 1682719200
  },
  {
    "username": "TxnkrBell",
    "rating": 5.0,
    "comment": "4-10 ppl / Best 6-8",
    "timestamp": 1679954400
  },
  {
    "username": "bbgavel",
    "rating": 5.0,
    "comment": "There's something to be said for a game that can appeal to all sorts of people and make them chuckle, but it gets a bit old after a while.",
    "timestamp": 1678402800
  },
  {
    "username": "Alicat717",
    "rating": 5.0,
    "comment": "It's ok. Fun for family time but I never think about it or am crazy about playing it.",
    "timestamp": 1677452400
  },
  {
    "username": "rkaski",
    "rating": 5.0,
    "comment": "Party game. Great for non-gamers. A classic.",
    "timestamp": 1676588400
  },
  {
    "username": "Olaph",
    "rating": 5.0,
    "comment": "My problem with Apples isn't so much that it's overplayed in general in my group, it's that once we get it out it NEVER STOPS. It outstays its welcome but nobody actually wants to stop playing it, so this light, fun, 30 minute game takes up 3 hours and has me clawing my eyes out by the end. The people I play it with are always saying \"oh, let's play to 15, now!\" Let's not.\n\n**#GeekSort-Exclude**",
    "timestamp": 1675983600
  },
  {
    "username": "mikesanerd",
    "rating": 5.1,
    "comment": "Can be fun with the right group, but it's often pretty boring. The responsibility is really on the players to make it fun. I've played with groups where this game was fun and with other groups where it was mind-numbingly dull.",
    "timestamp": 1675810800
  },
  {
    "username": "Scootmin",
    "rating": 5.0,
    "comment": "I'm never excited to play this or similar games",
    "timestamp": 1674946800
  },
  {
    "username": "Ozzie",
    "rating": 5.0,
    "comment": "Parents",
    "timestamp": 1674946800
  },
  {
    "username": "nerdygirl",
    "rating": 5.0,
    "comment": "Travel Version",
    "timestamp": 1674860400
  },
  {
    "username": "VincentDarlage",
    "rating": 5.0,
    "comment": "Not as much fun as I thought it would be. Maybe because I was playing with the kids. Amanda took it with her in the divorce.",
    "timestamp": 1673996400
  },
  {
    "username": "nattitude",
    "rating": 5.0,
    "comment": "Not a bad game to play with a group of non-gamers or as a warm up game.",
    "timestamp": 1673391600
  },
  {
    "username": "Aicardimom",
    "rating": 5.0,
    "comment": "Fun group game...unless you don't know who half the people on the cards are!",
    "timestamp": 1672182000
  },
  {
    "username": "jbbrwcky",
    "rating": 5.0,
    "comment": "gave to Cathy",
    "timestamp": 1671145200
  },
  {
    "username": "Blanche75",
    "rating": 5.0,
    "comment": "5€",
    "timestamp": 1668380400
  },
  {
    "username": "Daniel Nunn",
    "rating": 5.0,
    "comment": "Party game. You can make it work for any sized group. Easy to set a fixed ending. Simple rules.",
    "timestamp": 1666216800
  },
  {
    "username": "MBorcher54",
    "rating": 5.0,
    "comment": "Great fun was really good initially when it came out but has been replaced in a reasonable manner by the cards against humanity for me and I dont often see this one getting to the table any more.",
    "timestamp": 1665439200
  },
  {
    "username": "lillibbs",
    "rating": 5.0,
    "comment": "In Rhode Island",
    "timestamp": 1664229600
  },
  {
    "username": "Kereliuk96",
    "rating": 5.0,
    "comment": "The standard for give cards to a judge for random prompts. Fun when played on the rare occasion, but I wouldn't want to own it.",
    "timestamp": 1662328800
  },
  {
    "username": "paulanz",
    "rating": 5.0,
    "comment": "played so many times, gotten a bit boring for us",
    "timestamp": 1661464800
  },
  {
    "username": "eatabagofdice",
    "rating": 5.0,
    "comment": "It's fun, not as fun as its more adult counterparts, but I can totally play this when the younger family members are around.",
    "timestamp": 1660687200
  },
  {
    "username": "heavymetalboardgamer",
    "rating": 5.0,
    "comment": "Clean Cards Against Humanity.",
    "timestamp": 1657317600
  },
  {
    "username": "BadgerGatan",
    "rating": 5.0,
    "comment": "Imagine Cards Against Humanity, but every card isn't a cheap, juvenile joke written for shock value.\n\nImagine Cards Against Humanity, but to gather the laughs for offensive or suggestive humor, you need to carefully consider the connotations and linguistics of every card you have in your hand.\n\nImagine Cards Against Humanity, but instead of the game handing you a card that says \"Prostitute Orgies,\" you match \"My First Kiss\" with \"High & Low\" and get to feel very clever\n\nImagine Cards Against Humanity, but as an entertaining experience that you CAN'T replicate by reading the cards out loud one at a time.\n\nImagine Cards Against Humanity, but good. While my 13-year-old self wouldn't agree, as a hobbyist who occasionally indulges in party games, I will choose this over CAH every time.",
    "timestamp": 1653948000
  },
  {
    "username": "SeanC",
    "rating": 5.0,
    "comment": "Lots of fun if not played too often. A game that \"non-gamers\" will enjoy. I've had it requested for my next staff christmas party.",
    "timestamp": 1652911200
  },
  {
    "username": "Luke23007",
    "rating": 5.0,
    "comment": "this could be good with kids one day.",
    "timestamp": 1651960800
  },
  {
    "username": "stenole",
    "rating": 5.0,
    "comment": "(4-10P) Word association game which preceeded Cards Against Humanity. Each turn a player is a judge for a trait card where other players submit nouns and people on cards to fit the adjective, or the judge's sensibilities. Not competitive, but can function as a good icebreaker in social situations.",
    "timestamp": 1651269600
  },
  {
    "username": "DocMetal72",
    "rating": 5.0,
    "comment": "I think the \"mediocre - take it or leave it\" description that BGG offers for a 5 rating is about where Apples to Apples is at. Meh. I don't hate it when I play this, but I don't love it either. It's one of those games that you can play with 6 or with 66 year olds because players just toss in a card that might draw a funny laugh, a player picks one, and you move on. There are some laughs and good times to be had so, like I said, I don't hate it. It's perfectly fine for what it is. I'd rather play this than the Meme game or Cards against Humanity. But that's just me.",
    "timestamp": 1651096800
  },
  {
    "username": "moosemcd",
    "rating": 5.0,
    "comment": "Bennet",
    "timestamp": 1649714400
  },
  {
    "username": "DMountford",
    "rating": 5.0,
    "comment": "I cannot find reference to exactly the edition I have. It looks almost exactly like the main image here (Over one million sold ... Party Box ... Game of the year), but does not have the Out of the Box logo in the lower left (though it does have that logo on the side of the box)",
    "timestamp": 1649196000
  },
  {
    "username": "anomalyinflow",
    "rating": 5.0,
    "comment": "Reasonably fun party game. Elevated with a sense of humor.",
    "timestamp": 1647298800
  },
  {
    "username": "darthmoeder",
    "rating": 5.0,
    "comment": "Includes cards for Woody Allen, Mike Tyson, Mel Gibson, and Michael Jackson… is the category “problematic”?\n\nDonated to English language learner classroom at the middle school (Jan. 2022)",
    "timestamp": 1643670000
  },
  {
    "username": "Procyon_lotor",
    "rating": 5.0,
    "comment": "4+ players\nParty game\nThrifted",
    "timestamp": 1643410800
  },
  {
    "username": "grimzap",
    "rating": 5.0,
    "comment": "For an easy game that is completely non-threatening to non-gamers, this game has no equal. I can bring it out just about anywhere and people end up playing. True gamers find its lack of strategy and randomness annoying. You kind of have to put that part of your brain that strategizes to sleep--then you can just have fun with it. Hasn't aged well for my group... lots of groans if I try to bring this out.",
    "timestamp": 1641769200
  },
  {
    "username": "basejester",
    "rating": 5.2,
    "comment": "+ Cute player judge game\n+ No shock cards like its clones\n- Not very interesting as a gaming challenge",
    "timestamp": 1641250800
  },
  {
    "username": "Greenflash21",
    "rating": 5.0,
    "comment": "nice party game. Havent played in years and doubt I will again any time soon.",
    "timestamp": 1640559600
  },
  {
    "username": "ct_cruiser",
    "rating": 4.5,
    "comment": "No brainer fun that's a good language teacher's resource. The actual game itself doesn't have any longevity though.",
    "timestamp": 1638486000
  },
  {
    "username": "LannisterCrimson",
    "rating": 5.0,
    "comment": "Bling Status ✓\n\nExpansions: ✓\nPromos: -\nSpecial Edition: -\nUpgraded Components: -",
    "timestamp": 1638054000
  },
  {
    "username": "rgtft",
    "rating": 5.0,
    "comment": "Can be excellent with the right group and mood.",
    "timestamp": 1637362800
  },
  {
    "username": "supergraci",
    "rating": 5.0,
    "comment": "Simplón y aburrido. Eso si trae muchos mazos que jamás vas a usar, con uno o dos vas sobrado porque el juego no da para mucho.",
    "timestamp": 1633989600
  },
  {
    "username": "crnkgt",
    "rating": 5.0,
    "comment": "Donated",
    "timestamp": 1631570400
  },
  {
    "username": "spartax",
    "rating": 5.0,
    "comment": "It's fun in its way, depending very much on the group. A group of literalists can be pretty dull. On the other hand, you'll have some judges who take the least appropriate entry every time. Somewhere in the middle is good. I like playing the speedy variant, where one player gets left out each turn (if you have 5 players competing, only the first four entries are taken). It adds a little zest.",
    "timestamp": 1629237600
  },
  {
    "username": "HIGHB4LL",
    "rating": 5.0,
    "comment": "Dated, but had a time where it was good. More family friendly Cards Against Humanity predecessor.",
    "timestamp": 1627164000
  },
  {
    "username": "compster",
    "rating": 5.0,
    "comment": "The first game or two is fun, but it quickly loses steam. It's a good game to play with family / kids.",
    "timestamp": 1626645600
  },
  {
    "username": "Taonuviel",
    "rating": 5.0,
    "comment": "4+ players",
    "timestamp": 1622930400
  },
  {
    "username": "Wilseph",
    "rating": 5.0,
    "comment": "It's only annoying because it's so successful. If you play to win this, you've already lost.",
    "timestamp": 1622844000
  },
  {
    "username": "rkfan",
    "rating": 5.0,
    "comment": "J&H.",
    "timestamp": 1622584800
  },
  {
    "username": "sdevorah",
    "rating": 5.0,
    "comment": "marked for school donation\npurge",
    "timestamp": 1618524000
  },
  {
    "username": "drgtr71",
    "rating": 5.0,
    "comment": "Not planning to sleeve - 2021-04-01",
    "timestamp": 1618264800
  },
  {
    "username": "StupidRatCreature",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1616108400
  },
  {
    "username": "johnnyboystnl",
    "rating": 4.5,
    "comment": "Clunky game, with potential for some, often forced, laughs\n-This game is incredibly simple to learn (literally a one minute explanation). Pick a green card containing an adjective -> everyone picks a red card from their hand that matches the green card in the funniest way possible -> person that picked the green card chooses whose is the funniest -> next person chooses green card.\n-The exclusive goal in the game is to be the funniest with your card choices. While this may sound exciting, it comes across as being forced and arbitrary. There are much better games that naturally produce funny scenarios and often laughter (as well as a range of other emotions), and these games are often more memorable.\n-If you are looking for a game promising laughs -- I would look into a dexterity game (eg. flipships), a party game (eg. skull, codenames), or a heavily thematic game (mysterium, galaxy trucker).",
    "timestamp": 1615590000
  },
  {
    "username": "fisherevans",
    "rating": 5.0,
    "comment": "FR: Tofu\nLFR: Canned Corn",
    "timestamp": 1613948400
  },
  {
    "username": "FranklinTV",
    "rating": 4.7,
    "comment": "Short term enjoyable simple fun nonsense, but with not a lot of long term appeal.  With experienced card players, it can just becomes a game of random snap unless you invoke the \"everybody plays a card option\".  Still, a nice party icebreaker when the environment is too disruptive (eg: small children) to play a more focused board game, but only with people who have not played it before, given that it really is bubblegum (ie good for the first chews before the taste goes) (01/01/09). UPDATE: I have this sense that the game is slightly broken and just doesnt appeal anymore - and can use the junior version for kids, so now an archive game (rating reduced by 1 to 5) (17/9/11). UPDATE: For some reason, its that game which we all need to have on the shelf even if we never want to play it - gone (Rating 4.738, Jan 17). UPDATE: Pub Meeple Ranking Engine Dec 2020 (Rating: 4.731)",
    "timestamp": 1613602800
  },
  {
    "username": "ToxicTexan",
    "rating": 5.0,
    "comment": "Game closet",
    "timestamp": 1611010800
  },
  {
    "username": "joebelanger",
    "rating": 5.0,
    "comment": "Like most Out of the Box games, this game is a lot of fun at first and then drops off quickly. A couple of great things about this game are the accessibility of this game for new players and its ability to scale well between few and many players.",
    "timestamp": 1609196400
  },
  {
    "username": "deepphoenyx",
    "rating": 5.0,
    "comment": "Good for vocabulary study when playing in two languages, which adds different nuances depending on the native language of the player with the green apple. However, more recent reimplementations of this mechanic allow for funnier word combinations.",
    "timestamp": 1603576800
  },
  {
    "username": "halforange",
    "rating": 5.0,
    "comment": "It’s a decent kids game, but adults can find games that have further refined their gameplay.",
    "timestamp": 1602626400
  },
  {
    "username": "JamesTS",
    "rating": 5.0,
    "comment": "Ah the kosher version of Cards Against Humanity. It’s a great party game, and it still holds up. But some of the references I don’t get. I find myself having to pretend to laugh when playing with people from the previous generation.",
    "timestamp": 1596751200
  },
  {
    "username": "Tonwhirler",
    "rating": 5.0,
    "comment": "A decent get-to-know-you game. I wouldn't ever pick this game, but would play if someone else did.",
    "timestamp": 1596664800
  },
  {
    "username": "quiltymom",
    "rating": 5.0,
    "comment": "Donated to Ronald McDonald House",
    "timestamp": 1595368800
  },
  {
    "username": "gbworld",
    "rating": 5.0,
    "comment": "Great game to play when you have a lot of kids around. Otherwise, it is pretty inane. There are other games with a similar theme that can be more fun (depending on crowd).",
    "timestamp": 1592604000
  },
  {
    "username": "NoodlerJr",
    "rating": 5.0,
    "comment": "This rating would be much higher in the past, but now that there are so many games that do this concept better, I can't rate it any higher. Still though, set the stage for many party games.",
    "timestamp": 1589925600
  },
  {
    "username": "TrekScout",
    "rating": 5.0,
    "comment": "Physical, TTS",
    "timestamp": 1589493600
  },
  {
    "username": "Imaravencawcaw",
    "rating": 5.0,
    "comment": "Gotta have the right group to get the most out of this game. In some groups its a 10 for me, but for some its a 1, rarely is it ever in the middle.",
    "timestamp": 1588975200
  },
  {
    "username": "HolographicZoo",
    "rating": 5.0,
    "comment": "Started a genre of games for sure. We only play it now when the kids want to. Much prefer Dixit or Say Anything to this game",
    "timestamp": 1588543200
  },
  {
    "username": "OptiMitchPrime",
    "rating": 5.0,
    "comment": "Apples to Apples is a classic party game, but that's all there really is to it. It's great the first couple of times you play it, and there are some hilarious moments, but after a while you'd rather play absolutely anything else when you're with a group of friends.",
    "timestamp": 1586296800
  },
  {
    "username": "Jays Basement",
    "rating": 5.0,
    "comment": "Much better out there for family party games.",
    "timestamp": 1586296800
  },
  {
    "username": "Casualcryptic",
    "rating": 5.0,
    "comment": "I just prefer Cards Against Humanity. This is a great alternative for people with kids or who like to keep things PG. It's just not my kind of thing. I haven't really played the copy I have, so it's being sold as is. I'm assuming everything is there. If someone's interested I'll take the time to confirm all components are present.",
    "timestamp": 1586296800
  },
  {
    "username": "mccarpen",
    "rating": 5.0,
    "comment": "Check to see if I still have it?",
    "timestamp": 1584054000
  },
  {
    "username": "mellchia",
    "rating": 5.0,
    "comment": "Great party game.",
    "timestamp": 1583622000
  },
  {
    "username": "HandEyeProtege",
    "rating": 5.0,
    "comment": "My favorite party game. Works well with four or more people, you can play for as long or as short as you like, and it doesn't require embarassing yourself.",
    "timestamp": 1583103600
  },
  {
    "username": "drfreema",
    "rating": 5.0,
    "comment": "Condition: Played, complete, box and game are in excellent condition\nShipping: Bloomington, IN, CONUS shipping only, USPS\nLanguage: English",
    "timestamp": 1583017200
  },
  {
    "username": "LegionGamer",
    "rating": 5.0,
    "comment": "Pointless if you don't have a hatred of Cards Against Humanity. Same game but not nearly as funny for our family.",
    "timestamp": 1582326000
  },
  {
    "username": "ravenguild08",
    "rating": 5.0,
    "comment": "Would it be appropriate to say that this is G-rated Cards against humanity? Clever way to bring people together, for sure.",
    "timestamp": 1582066800
  },
  {
    "username": "mrgeneraldude",
    "rating": 4.6,
    "comment": "I'll play it as a part of a social event; and it works well enough as a party game. But the actual gameplay is not particularly stimulating. The only strategy is in reading the other players.",
    "timestamp": 1581548400
  },
  {
    "username": "Boshiby",
    "rating": 5.0,
    "comment": "Honestly, sometimes funnier than Cards Against Humanity because it is less try hard.",
    "timestamp": 1581030000
  },
  {
    "username": "Andromeda No Shun",
    "rating": 5.0,
    "comment": "It can be funny, but honestly, it's just not my kind of game.",
    "timestamp": 1581030000
  },
  {
    "username": "loudpaperclips",
    "rating": 5.0,
    "comment": "You wouldn't think you could exhaust the concept so quickly, but then it hits and you start recognizing cards. Fun? Sure. But it's hard to know when you're going to go from having a great time to suddenly extremely ready to do something else.",
    "timestamp": 1579215600
  },
  {
    "username": "desalema70",
    "rating": 5.0,
    "comment": "Lots of fun, especially with friends/family that know each other well. A rare game (at least in this house) that can be played by more than four players.\n\nEdit: after a while, meh. Have to be in a party mood to enjoy it, otherwise it’s just a chore.",
    "timestamp": 1578697200
  },
  {
    "username": "Grendal1971",
    "rating": 5.0,
    "comment": "There is a 100% chance this will be played at my relatives house on the holidays.",
    "timestamp": 1577660400
  },
  {
    "username": "Baldonetoo",
    "rating": 5.0,
    "comment": "Party",
    "timestamp": 1577574000
  },
  {
    "username": "SochaDJ",
    "rating": 5.0,
    "comment": "I loved this game the first time I played it. It was a big hit with everyone and always generates a lot of laughter. I have a zany mindset and try to justify outlandous cards to the judge. It's lost some of its appeal but the kids adore this. Some of the card words were too difficult for my kids when they were younger so we also picked up Apples to Apples Jr.",
    "timestamp": 1576969200
  },
  {
    "username": "cynical81",
    "rating": 4.5,
    "comment": "The PG version of Cards Against Humanity doesn't have enough bite to be interesting for my group of adults and also contains too many obscure references to be playable with the kids.",
    "timestamp": 1576623600
  },
  {
    "username": "riledguy",
    "rating": 5.0,
    "comment": "Fantastic party game. The better you know the people around you the better you will do. A bit less fun when you are playing with \"squares\" who play it really \"straight.\"",
    "timestamp": 1576623600
  },
  {
    "username": "johnhandy",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1576450800
  },
  {
    "username": "MarsGodOfWar",
    "rating": 5.0,
    "comment": "It's okay, but generally not what I'm looking to play. The kids like to play this when they are younger. It helps if you know your fellow teammates.",
    "timestamp": 1575759600
  },
  {
    "username": "teeps12",
    "rating": 5.3,
    "comment": "You know what it is.",
    "timestamp": 1575241200
  },
  {
    "username": "dmcapeh",
    "rating": 5.0,
    "comment": "Creates disagreements and rather play Dixit",
    "timestamp": 1574982000
  },
  {
    "username": "LaraCardoza",
    "rating": 5.0,
    "comment": "Totally depends on who you're playing this game with. Can be a blast or horrible.",
    "timestamp": 1572994800
  },
  {
    "username": "gotrek987",
    "rating": 5.0,
    "comment": "What can you say? This is probably the \"original\" party game outside of charades. Anyone can and will usually play. This game birthed the juggernaut of party games that is CAH, but can be played with younger players and families much easier.",
    "timestamp": 1571090400
  },
  {
    "username": "Mkyrmse",
    "rating": 4.5,
    "comment": "Player judge for scoring is one mechanism I dislike, however my children and friend non-gamers enjoy playing this game. I will play if asked, but won't request this.",
    "timestamp": 1570399200
  },
  {
    "username": "Heisenberg",
    "rating": 5.0,
    "comment": "Good party game or icebreaker. Rated lower than \"things\" because of the limited customization.",
    "timestamp": 1570399200
  },
  {
    "username": "Woahorse",
    "rating": 5.0,
    "comment": "Beer and Nuts Family game.",
    "timestamp": 1569276000
  },
  {
    "username": "CriticalMass",
    "rating": 5.0,
    "comment": "Great with a group of kids",
    "timestamp": 1568066400
  },
  {
    "username": "orangetiki",
    "rating": 5.0,
    "comment": "many better games w the same premise. Also seems to wear thin if you played a lot",
    "timestamp": 1567029600
  },
  {
    "username": "Highbrow",
    "rating": 5.0,
    "comment": "Kids Game",
    "timestamp": 1566252000
  },
  {
    "username": "Sayburr",
    "rating": 5.0,
    "comment": "Best party game, be ready to laugh. Have had more fun with this game than with most any other game. But, that is all there is too it, just fun. No sense of accompishment. I have two copies, one at home and one at the lake.",
    "timestamp": 1564351200
  },
  {
    "username": "Sooner811",
    "rating": 5.0,
    "comment": "Not a game i look forward to playing, but it's simple and often entertaining. our kids love it. There are variations that make it more fun, but no one in my group ever wants to play with them. I wouldn't buy it new from the store, would play it if the majority of the group wanted to.",
    "timestamp": 1560722400
  },
  {
    "username": "Red22jlj",
    "rating": 5.0,
    "comment": "Fine party game.",
    "timestamp": 1559944800
  },
  {
    "username": "jajohnso34",
    "rating": 5.0,
    "comment": "4-10 Players (6-8 best)\n30-60 minutes\nDifficulty: 1.16/5\nAge: 12+\nRating: 5.9/10",
    "timestamp": 1559426400
  },
  {
    "username": "redwindmill",
    "rating": 5.0,
    "comment": "Classic party game that I think I'll always keep around. Good for the holidays with a large group of non gamers.",
    "timestamp": 1556229600
  },
  {
    "username": "erichenyey",
    "rating": 5.0,
    "comment": "A fun party game, although a bad hand of cards can be a real handicap. Perhaps there should be a rule allowing a player to discard any number of red cards are draw replacements, instead of \"playing to\" a green card.",
    "timestamp": 1556056800
  },
  {
    "username": "OldManFroof",
    "rating": 6.0,
    "comment": "A much copied mechanism that is still fun with like minded players.",
    "timestamp": 1759960800
  },
  {
    "username": "YoLYcmqZ",
    "rating": 5.5,
    "comment": "Rating: +0.0\nOwn: Physical",
    "timestamp": 1759615200
  },
  {
    "username": "SkyborneVeggies",
    "rating": 6.0,
    "comment": "Modern classic",
    "timestamp": 1758924000
  },
  {
    "username": "jonocop",
    "rating": 6.0,
    "comment": "[TRADE/SELL/DONATE] I haven't played it in so long. A game that is not as \"in your face\" as Cards Against Humanity. But in the right setting, it can be just as risque...it just takes more effort.",
    "timestamp": 1757887200
  },
  {
    "username": "theryanstorm",
    "rating": 6.0,
    "comment": "Rachel",
    "timestamp": 1756764000
  },
  {
    "username": "Madrock1012",
    "rating": 6.0,
    "comment": "Was a huge hit in college, when it first came out. Fun memories and lots of laughs. With the wonderful improvements in board games, specifically party games, will not request, but may be willing to play if requested, it just never is anymore. Just recently I had a niece that was excited to show me this cool new game she got (Apples to Apples) and how fun it was. She was surprised to hear that I had played it many times 20+ years ago. After a round or two, I may have redirected our family gathering to a different party game.",
    "timestamp": 1754863200
  },
  {
    "username": "RainbowOctopus",
    "rating": 6.0,
    "comment": "Sleeved",
    "timestamp": 1754344800
  },
  {
    "username": "jmangus",
    "rating": 6.0,
    "comment": "$15",
    "timestamp": 1754258400
  },
  {
    "username": "PaulS77",
    "rating": 6.0,
    "comment": "Fun word game that provides some laughs. Happy to play occasionally.",
    "timestamp": 1753826400
  },
  {
    "username": "TobiasRieper",
    "rating": 6.0,
    "comment": "Ah, the classic apples to apples.\n\n\nYou play one of your red cards that matches the adjective on the green card.\n\n\nIf the green card is \"scary\" you may wish to play cards like \"spiders\", \"sharks\" or \"Ronda Rousey\" (Respectfully, please don't break my arms)\n\nThis is a solid game, and good for a laugh here and there, but if you're playing with adults, you're likely to get more laughs out of cards against humanity.\n\nIf you're playing with kids though, this is your best option for this type of game, at least in my humble opinion.",
    "timestamp": 1753221600
  },
  {
    "username": "pininforthefjords",
    "rating": 6.0,
    "comment": ".",
    "timestamp": 1752616800
  },
  {
    "username": "dmajor1848",
    "rating": 6.0,
    "comment": "Family collection (CGW)",
    "timestamp": 1752530400
  },
  {
    "username": "Shelbygirl",
    "rating": 6.0,
    "comment": "When this came out, I remember it being THE party game. Now, I find it to be just ok",
    "timestamp": 1752530400
  },
  {
    "username": "Tycalt",
    "rating": 6.0,
    "comment": "This is a great laugh in the right circumstances and very simple to play. Update 2025: People just see it as an inferior Cards Against Humanity clone now, which is funny since Apples was first.",
    "timestamp": 1751666400
  },
  {
    "username": "tscox87",
    "rating": 6.2,
    "comment": "A party game which has its place and is good for families",
    "timestamp": 1751580000
  },
  {
    "username": "Racelympics",
    "rating": 6.0,
    "comment": "Cleaner version of Cards Against Humanity. It’s been a long time ever since I’ve played this version, but I can’t wait to pull it out again.",
    "timestamp": 1751407200
  },
  {
    "username": "dmwainw",
    "rating": 6.0,
    "comment": "Kids love this one...",
    "timestamp": 1751320800
  },
  {
    "username": "johnjihoonchang",
    "rating": 6.0,
    "comment": "This classic party game has worn quite a bit with all the copycats over the years, but I still like it better than its more popular potty mouth successor Cards Against Humanity since it's easier to play with a larger variety of people. It still can be fun, but I'm past suggesting it anymore.",
    "timestamp": 1750629600
  },
  {
    "username": "KatydidWonders",
    "rating": 6.0,
    "comment": "4-10",
    "timestamp": 1745877600
  },
  {
    "username": "aetwitch",
    "rating": 5.7,
    "comment": "This game can really be a blast. Unlike other party games it can be fun regardless of who you play it with, which is huge for a party game. A lot of people have it so there's no need to own it.",
    "timestamp": 1744236000
  },
  {
    "username": "Blix",
    "rating": 6.0,
    "comment": "Respect, Not Love",
    "timestamp": 1743890400
  },
  {
    "username": "addastefans",
    "rating": 6.0,
    "comment": "Kjaftaskja á íslensku - sama leikkerfi og er í CAH en þetta er fjölskylduvænna - fyrir börnin og ömmu.",
    "timestamp": 1742684400
  },
  {
    "username": "Coralouwho",
    "rating": 6.0,
    "comment": "Apples to Apples, Party Box has no cards to sleeve, although has 1008 cards (58x89mm), but low usage and not worth sleeving.\n\n#LetterA\n#Wordy\n#Cards-only",
    "timestamp": 1742684400
  },
  {
    "username": "mattbain31",
    "rating": 6.0,
    "comment": "an entry level mainstream party game.",
    "timestamp": 1741215600
  },
  {
    "username": "TeganAndTheOneRing",
    "rating": 6.3,
    "comment": "Can be kinda fun.............but can also suck quite a bit if you're stuck with a hand full of irrelevant cards.",
    "timestamp": 1739574000
  },
  {
    "username": "layla24x",
    "rating": 6.0,
    "comment": "It's an appropriate version of Cards Against Humanity. I really need to be in the mood to play this, but it is fun.",
    "timestamp": 1739228400
  },
  {
    "username": "BrotherCheese",
    "rating": 6.0,
    "comment": "Official Player #: 4-10\nRecommended #: 4-10+\nBest #: 6-8\nPlay Time: 20-30 minutes\nAge: 8-12+\nComplexity: 1.15/5",
    "timestamp": 1738191600
  },
  {
    "username": "pavin",
    "rating": 6.0,
    "comment": "Prédécesseur de Apples to Apples\nJe préfère Apples to Apples Marvel",
    "timestamp": 1737846000
  },
  {
    "username": "DoctorPhil",
    "rating": 5.5,
    "comment": "Rules and gameplay 9\nStrategic avenues 1\nMechanism strength 5\nThematic integration 1\nVariability 5\nReplayability 7\nFun factor 6\nPlayer interaction 7\nSkill ceiling 1\n\nOverall 5.5",
    "timestamp": 1736982000
  },
  {
    "username": "Rrperezc",
    "rating": 6.0,
    "comment": "Ok party game for once in a while events.",
    "timestamp": 1736204400
  },
  {
    "username": "Badchenn",
    "rating": 6.0,
    "comment": "brd",
    "timestamp": 1734562800
  },
  {
    "username": "WeedMonkey",
    "rating": 5.5,
    "comment": "4-10players",
    "timestamp": 1734130800
  },
  {
    "username": "SiddGames",
    "rating": 6.0,
    "comment": "Filler 4-8\nrtp\n\nAlways a hit, I think everyone I've introduced this to has liked it.\n\nIt's been copied many times now in different ways and themes (e.g., Cards of Humanity).\n\n\n_store_GR_Sh_2-4",
    "timestamp": 1732230000
  },
  {
    "username": "pezboy",
    "rating": 6.0,
    "comment": "KEEP - APPLES",
    "timestamp": 1732230000
  },
  {
    "username": "Regnad Kcin",
    "rating": 6.0,
    "comment": "Not a favorite of mine, but my family loves it. It's good for a few laughs.\nDonated 11/24",
    "timestamp": 1731538800
  },
  {
    "username": "Stevod611",
    "rating": 6.0,
    "comment": "Simple, conversation party game. Can create some laughs",
    "timestamp": 1729807200
  },
  {
    "username": "TriathlonTodd",
    "rating": 5.5,
    "comment": "Played with Ashley, Craig, and Tess. $3 Goodwill find",
    "timestamp": 1729720800
  },
  {
    "username": "theschaitel",
    "rating": 6.0,
    "comment": "Family Game. Not my go to but a nice party game",
    "timestamp": 1729461600
  },
  {
    "username": "danielletrave",
    "rating": 6.0,
    "comment": "Fun game to play with different groups of people. We enjoyed playing this game with our kids. Other games have taken this concept but we still enjoy the original game the most.",
    "timestamp": 1729116000
  },
  {
    "username": "chipsmith",
    "rating": 6.0,
    "comment": "Lots of fun times playing this with the kids. Then they grew up, and now they prefer cards against humanity.",
    "timestamp": 1726610400
  },
  {
    "username": "HolyRayne",
    "rating": 6.0,
    "comment": "Cards Against Humanity but actually enjoyable by providing room for creative answers.",
    "timestamp": 1725400800
  },
  {
    "username": "quietcorn",
    "rating": 6.0,
    "comment": "Pleasant game of associations. Lots of different cards you can mix in. I played a lot of this and enjoyed making whatever edgy jokes we could come up with. Then we played Cards Against Humanity and that became the thing. After lots of Cards Against Humanity, I'm back to Apples. The jokes feel more creative. It's nice that you can play it straight with kids. It helps to prune the cards a bit to customize to your group.",
    "timestamp": 1722031200
  },
  {
    "username": "EndersGame",
    "rating": 5.5,
    "comment": "Can be a fun party game for non-gamers if treated very casually.\n\nAlternative for gamers, and arguably better: Attribute",
    "timestamp": 1720994400
  },
  {
    "username": "rseater",
    "rating": 6.0,
    "comment": "a good party game for pulling in non-gamers. Too many celebrity references.",
    "timestamp": 1719093600
  },
  {
    "username": "LiatKolink",
    "rating": 6.0,
    "comment": "It's a fine party game similar to Cards Against Humanity, but more family-friendly. There are much better games out there though.",
    "timestamp": 1717884000
  },
  {
    "username": "FezAZ",
    "rating": 5.5,
    "comment": "fun party game w/ non-gamers.",
    "timestamp": 1717711200
  },
  {
    "username": "mixmixmix",
    "rating": 6.0,
    "comment": "Players provide a card from their hand that they believe matches the current theme or category card. Harmless answers, but so many choices that work all the time. Mostly replaced by Cards Against Humanity, unless children are around.",
    "timestamp": 1716933600
  },
  {
    "username": "thestoryguy",
    "rating": 6.0,
    "comment": "It can be very fun and funny. One problem is that you sometimes you have to just throw away cards. Another is the little jokes and comments on the bottom of the cards are not usually entertaining. I prefer Say Anything over this because it allows for a lot more creativity.",
    "timestamp": 1715205600
  },
  {
    "username": "Quayde",
    "rating": 6.0,
    "comment": "Finally owned after all these years, the 'original' judging game. It's incredibly basic, playing it now, but it still gives rise to some - well, a few - funny moments.",
    "timestamp": 1713823200
  },
  {
    "username": "GomJabbar",
    "rating": 6.1,
    "comment": "Good party game for adults and kids alike. Usually a lot of laughing. Winning isn't really the point of this game since the judging is so subjective.",
    "timestamp": 1712700000
  },
  {
    "username": "spudzero",
    "rating": 6.0,
    "comment": "Work",
    "timestamp": 1712440800
  },
  {
    "username": "locollama",
    "rating": 5.5,
    "comment": "4-10+ 8+",
    "timestamp": 1712181600
  },
  {
    "username": "7mm08",
    "rating": 5.5,
    "comment": "party game",
    "timestamp": 1711753200
  },
  {
    "username": "northernpaul",
    "rating": 6.0,
    "comment": "Good with a larger group",
    "timestamp": 1711407600
  },
  {
    "username": "darthoneill715",
    "rating": 6.0,
    "comment": "#GeekSort-Exclude",
    "timestamp": 1710630000
  },
  {
    "username": "JeroenDepoorter",
    "rating": 6.0,
    "comment": "Kort",
    "timestamp": 1709593200
  },
  {
    "username": "PlayerPersoon",
    "rating": 6.0,
    "comment": "I have Big Picture packed inside my game box.\n\nAlso in Jason's Collection.",
    "timestamp": 1709247600
  },
  {
    "username": "Eternichi",
    "rating": 6.0,
    "comment": "Currently own???",
    "timestamp": 1709074800
  },
  {
    "username": "Turbo Pascal",
    "rating": 5.5,
    "comment": "Simple but deceptively fun. Fairly quick to play and explain to non-gamers, this makes an excellent party game. My copy now lives at my folks' place since this is where it gets the most plays.",
    "timestamp": 1707865200
  },
  {
    "username": "Onthewayover",
    "rating": 5.8,
    "comment": "I've cooled on this, but I still respect its universal appeal.",
    "timestamp": 1707087600
  },
  {
    "username": "MrIkerito",
    "rating": 6.0,
    "comment": "Funny",
    "timestamp": 1705791600
  },
  {
    "username": "j333walk",
    "rating": 6.0,
    "comment": "A fun family game that everybody can play and understand, no matter what age, as long as they can read.",
    "timestamp": 1703286000
  },
  {
    "username": "purvisa",
    "rating": 6.0,
    "comment": "Before there was Cards Against Humanity (and every other flavor of matching game), there was Apples to Apples. Folks will prefer one or another such game based upon the tone they want, but for my money, this game remains a solid entry into the field. It won't be my favorite, but it will always satisfy, and it seems to appeal to more people than most others.\n\nIt's simple: Everyone gets a hand of 7 cards, and one person, on a rotating basis, serves as just for a round. The judge selects a red apple card, reads it aloud, and waits for the others to submit their green apple cards. The judge shuffles them and lays them out to decide which is best/funniest/rudest/whateveryoudecidest. The players may, of course, lobby for their choice (whether theirs or anyone else's). There are the usual variants, of course, for playing two cards to playing antonyms, and more.\n\nSet up and re-boxing are minimal, as you take cards out, shuffle them, deal them, and start on one side, and that's the slower of the two.",
    "timestamp": 1702854000
  },
  {
    "username": "puCrepeaP",
    "rating": 6.0,
    "comment": "Nice get to know you game. I actually like the kids game Grounded for Life better, it's a bit sillier. But this game can get silly too. You have a couple ways to play and strategize. I try to understand the judge, but you can't over think it. Maybe they aren't looking for the outrageous solution, or maybe they want to pick something less obvious to stir things up. I also like to allow campaigning for your card.",
    "timestamp": 1701817200
  },
  {
    "username": "LionRose",
    "rating": 6.0,
    "comment": "The Apples to Apples Crate Edition",
    "timestamp": 1700866800
  },
  {
    "username": "miracle_kite",
    "rating": 6.0,
    "comment": "classic party game but there are more creative ones out nowadays",
    "timestamp": 1698793200
  },
  {
    "username": "krit1789",
    "rating": 6.3,
    "comment": "Should play with the right people who are familiar with the specific linguistic/cultural details.",
    "timestamp": 1695765600
  },
  {
    "username": "crito13",
    "rating": 6.0,
    "comment": "Was probably my family's favorite game to pull out and play on weekends or vacations until Wits & Wagers and Say Anything hit our collection. My family are big family game fans.",
    "timestamp": 1695679200
  },
  {
    "username": "Johnny Awesome",
    "rating": 6.0,
    "comment": "Good party game. Jamie's game.",
    "timestamp": 1695679200
  },
  {
    "username": "tytoalbion",
    "rating": 6.0,
    "comment": "It’s a party game. Not my go-to, but newbie friendly and safe for people who aren’t super into board games.",
    "timestamp": 1694901600
  },
  {
    "username": "Fubbsy",
    "rating": 6.0,
    "comment": "card size: 2.36\" x 3.86\" https://www.maydaygames.com/collections/all-card-sleeves/pro...",
    "timestamp": 1693260000
  },
  {
    "username": "Smokalotapotamus",
    "rating": 6.0,
    "comment": "Designers: Matthew Kirby, Mark Alan Osterhaus\nArtist: John Kovalic\n\nCategories: Card Game, Humor, Party Game\nMechanisms: Hand Management, Player Judge, Simultaneous Action Selection\n\nTags: Best Six, Best Seven, Best Eight",
    "timestamp": 1693173600
  },
  {
    "username": "mjsminkey",
    "rating": 6.0,
    "comment": "For what it is, a family-friendly fun party game that most ages can play together, it's a good game. I'm not a huge fan of the \"judge picks a winner\" type of games like this and Cards against Humanity (the adult-only version of this) but if you aren't looking for a serious competition, it may be perfect for you.",
    "timestamp": 1693087200
  },
  {
    "username": "BGGPhoenix",
    "rating": 6.0,
    "comment": "4-10P 30M Party\nHand Management, Player Judge",
    "timestamp": 1690149600
  },
  {
    "username": "jimmyorr",
    "rating": 6.0,
    "comment": "Best: 6-8",
    "timestamp": 1688767200
  },
  {
    "username": "Regislive",
    "rating": 6.0,
    "comment": "Gave to Lil",
    "timestamp": 1688594400
  },
  {
    "username": "HiveGod",
    "rating": 6.1,
    "comment": "A perfectly fine social interaction coupling device, though like absinthe and mercury there is such a thing as too much of this.",
    "timestamp": 1688335200
  },
  {
    "username": "dynahthirst",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1687903200
  },
  {
    "username": "Gozon",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1687730400
  },
  {
    "username": "chrisnd",
    "rating": 6.0,
    "comment": "An excellent party game - best with at least 8 players. There are some great word combinations that can come from this game, especially if everyone has a good sense of humor (i.e. I once won the card \"courageous\" by throwing in \"road kill\". What can be more \"courageous\" than \"road kill\" the moment before it becomes road kill?).\n\nA great game, and a lot of fun. My favorite of all the party games I own.\n\nEDIT: I have decided that this gets tiresome after a while - it definitely has to be played with the right people at the right time. As in \"adults with adults\" and \"kids with kids\", as the kids many times don't understand the potential \"adult-nature\" that the game inherently contains.",
    "timestamp": 1687212000
  },
  {
    "username": "Cheesehead52221",
    "rating": 6.0,
    "comment": "its fun in a big group",
    "timestamp": 1686348000
  },
  {
    "username": "stevejuggler",
    "rating": 6.1,
    "comment": "Cannibalised for joke-writing box.",
    "timestamp": 1685916000
  },
  {
    "username": "presbycat",
    "rating": 6.0,
    "comment": "This one always gets laughs.",
    "timestamp": 1683151200
  },
  {
    "username": "isearch",
    "rating": 5.9,
    "comment": "1st play 10/31/16\nNeed to play more.\nIt a party game that i find more useful these days.",
    "timestamp": 1680213600
  },
  {
    "username": "pennincao",
    "rating": 6.0,
    "comment": "Loaned Haley",
    "timestamp": 1679868000
  },
  {
    "username": "masaokano",
    "rating": 5.9,
    "comment": "It has aged over time and I feel like other games do this better. Still a classic.",
    "timestamp": 1679526000
  },
  {
    "username": "DSAdixits",
    "rating": 6.0,
    "comment": "I haven't played in years, but I enjoyed it quite a bit back in the day.",
    "timestamp": 1678057200
  },
  {
    "username": "matowai",
    "rating": 6.0,
    "comment": "Many Plays",
    "timestamp": 1677366000
  },
  {
    "username": "LoopyNZ",
    "rating": 6.0,
    "comment": "Fun with kids but also a bit challenging because of cultural references they're not familiar with, and the pure subjectiveness of the scoring system. But those issues can be easily houseruled and the game turned into a fun activity for all ages.",
    "timestamp": 1674687600
  },
  {
    "username": "Krotack",
    "rating": 6.0,
    "comment": "Classic party card game that's fun when you have more than 4 people. It takes longer to play the more people you have and can commonly exceed an hour, but it's easy to learn and a general crowd pleaser.",
    "timestamp": 1674601200
  },
  {
    "username": "Transmuter",
    "rating": 6.0,
    "comment": "This game was fun when we got it, but I feel that it's largely been replaced by Dixit in my collection.",
    "timestamp": 1674169200
  },
  {
    "username": "jwrinne",
    "rating": 6.0,
    "comment": "Choose silly or clever word matches to win this popular party game. [4-10 players]",
    "timestamp": 1673996400
  },
  {
    "username": "PHIL4477",
    "rating": 6.0,
    "comment": "A good party game.To my mind this has been replaced by Say Anything which is a more flexible angle on the same idea.",
    "timestamp": 1673305200
  },
  {
    "username": "DetroitJohnny",
    "rating": 6.0,
    "comment": "Great party game. Lots of laughs.",
    "timestamp": 1672873200
  },
  {
    "username": "queenieA",
    "rating": 6.0,
    "comment": "Javi",
    "timestamp": 1672786800
  },
  {
    "username": "pdrseuss",
    "rating": 6.0,
    "comment": "Fun party game. Can play with really large groups too. Funny, and very fun. Creative. Quick to teach. Good for all ages.\n\nThis should be in every home.",
    "timestamp": 1670540400
  },
  {
    "username": "nerman8r",
    "rating": 6.0,
    "comment": "4-10 players. 30 minutes. Emily's.",
    "timestamp": 1669590000
  },
  {
    "username": "brothervm",
    "rating": 6.0,
    "comment": "One of the few extended family games that gets played on Thanksgiving in our household.",
    "timestamp": 1663365600
  },
  {
    "username": "ameberly1",
    "rating": 6.0,
    "comment": "Good group game. One that even our teenager liked to play.",
    "timestamp": 1663020000
  },
  {
    "username": "mablet",
    "rating": 6.0,
    "comment": "Donated",
    "timestamp": 1661724000
  },
  {
    "username": "espoon82",
    "rating": 6.3,
    "comment": "A classic party game that is really fun, but gets old after awhile. Still, it is almost a must-have because everyone likes it and is familiar with it, so it gets a lot of requests in mixed company.",
    "timestamp": 1660773600
  },
  {
    "username": "bigjay415",
    "rating": 6.0,
    "comment": "Hasn't been played in many-a-year. Enjoyable party game, but not much into party games anymore.",
    "timestamp": 1659823200
  },
  {
    "username": "RandomStrategy",
    "rating": 6.0,
    "comment": "This game is always good for a few laughs!",
    "timestamp": 1658613600
  },
  {
    "username": "DocLuke",
    "rating": 6.0,
    "comment": "Although this doesn't get to the table as much, it is a great party game.",
    "timestamp": 1658268000
  },
  {
    "username": "DavidNiecikowskiPhD",
    "rating": 6.0,
    "comment": "Rating increases to a 7 when used in the classroom.\nOOB and Mattel editions.",
    "timestamp": 1657749600
  },
  {
    "username": "diggad",
    "rating": 6.0,
    "comment": "Great for parties. Sometimes it's awkward when playing with people that have a different sense of humor than you.",
    "timestamp": 1656885600
  },
  {
    "username": "curly3stgs",
    "rating": 6.0,
    "comment": "Party",
    "timestamp": 1656280800
  },
  {
    "username": "Jestertrek",
    "rating": 6.0,
    "comment": "The one and only pure kids game in my collection. It does what it does extremely well, and as long as you don't take it too seriously, you'll have fun. It self-regulates itself quite well, so games will tend toward \"fairness.\" Kid rating -1 to +3 depending on the kid. ;-)",
    "timestamp": 1655244000
  },
  {
    "username": "ejmowrer",
    "rating": 6.0,
    "comment": "GATEWAY? This might be on the mainstream side of the threshold, making it not a gateway game.",
    "timestamp": 1654293600
  },
  {
    "username": "PandorasFolly",
    "rating": 5.7,
    "comment": "Solid Game, played best by ignoring rules and playing to people's humor however. Re-implemented better by Say Anything.",
    "timestamp": 1654034400
  },
  {
    "username": "ericbrooke",
    "rating": 6.0,
    "comment": "Fun and simple family Game, where you figure out how others will respond to your suggestions",
    "timestamp": 1653170400
  },
  {
    "username": "chocolate_mouse",
    "rating": 6.0,
    "comment": "It’s easy to explain and fun to play, but like most word games it works best if you are playing with a group that has eclectic interests.",
    "timestamp": 1652997600
  },
  {
    "username": "CrazyBlueDwarf",
    "rating": 6.3,
    "comment": "Good with the family. Best with larger groups.\n\n.5/1 Storytelling\n1/1 Effort to fun ratio in line with complexity\n.25/1 Variety in play/strategy\n.25/1 Art\n1/1 Appropriate level of setup for it's complexity\n.5/1 Meaningful Decisions\n.5/1 Likelihood to skip similar games for this one\n.5/1 Keeps me engaged\n.5/.5 Immediately want to play again\n.5/.5 Theme\n.5/.5 Components\n.25/.5 Subjective/Evangilization",
    "timestamp": 1652392800
  },
  {
    "username": "ex1st",
    "rating": 6.0,
    "comment": "Class",
    "timestamp": 1650924000
  },
  {
    "username": "springem",
    "rating": 6.0,
    "comment": "Fun party game for the whole family. This is a good icebreaker for gatherings for anyone to enjoy.\n\nGave away 04/2022",
    "timestamp": 1650837600
  },
  {
    "username": "RHReiss",
    "rating": 5.5,
    "comment": "A party game - what works if folks are in the right mood.",
    "timestamp": 1650837600
  },
  {
    "username": "bugeeker",
    "rating": 6.0,
    "comment": "Subjective party game, easy ice-breaker",
    "timestamp": 1650578400
  },
  {
    "username": "Heather1000",
    "rating": 6.0,
    "comment": "4-10 players",
    "timestamp": 1649023200
  },
  {
    "username": "JAM2099",
    "rating": 6.0,
    "comment": "Good for big groups.",
    "timestamp": 1647039600
  },
  {
    "username": "Dash Justice",
    "rating": 6.0,
    "comment": "Easy to pick up and play, but heavily dependent on the group. A bit too much pop culture.",
    "timestamp": 1646780400
  },
  {
    "username": "Iguanoman",
    "rating": 6.0,
    "comment": "An interesting concept for a game: the winner is the one that comes up the most entertaining answer. Can be good when the cards (and sense of humor for the group) allow for such entertainment, but can also be boring if things don't go so well.",
    "timestamp": 1646434800
  },
  {
    "username": "truebluedrew",
    "rating": 6.0,
    "comment": "Like New",
    "timestamp": 1645916400
  },
  {
    "username": "niledesign",
    "rating": 5.5,
    "comment": "This is a fairly benign party game in that it does not call upon individuals to engage in foolish behavior, or to be especially creative and therefore is more readily acceptable to a wider range of participants. It does however favor those players who know each other. It is particularly random with folks who don't know each other at all AND poor card draws can further handicap some players. It does have a nice level of interaction and it typically is worth some laughs.",
    "timestamp": 1643583600
  },
  {
    "username": "Maxplanck12",
    "rating": 6.0,
    "comment": "This game gets a bad rap, but I have always had a good time playing this. Just put a time limit on it so it doesn't overstay its welcome.",
    "timestamp": 1642460400
  },
  {
    "username": "DoctorJ",
    "rating": 6.0,
    "comment": "Always fun for a crowd. Easily learned and enjoyed by people who ordinarily wouldn't touch a game. We usually end up playing the crab apples variant by the end.",
    "timestamp": 1641942000
  },
  {
    "username": "jake010706",
    "rating": 6.0,
    "comment": "4-10 players",
    "timestamp": 1641510000
  },
  {
    "username": "Fazazzums",
    "rating": 6.0,
    "comment": "This is pretty much the only game of this sort that I really enjoy. I feel like all of the clones that came after and have more-or-less dominated the shelves of non-gamers (I'm looking at you, CAH), have lost sight of what actually made this game good. In order to be funny in Apples to Apples, you actually have to be clever, utilize a bit of brainpower, and lean heavily into innuendo, implied meaning, satire, and context. I still don't love it. These days I find the Jackbox games tend to do this sort of thing much better than any board game I've played, but if someone pulls this out I'll usually sit in for a few rounds.",
    "timestamp": 1641078000
  },
  {
    "username": "tim-pelican",
    "rating": 6.0,
    "comment": "[Rated 2005/04/18 based on 5 plays]\n\nGood fun with the right crowd - if people are prepared to argue their corner, it's entertaining. If it's just \"pick the best option\" in something close to silence, it's pretty tedious.\n\nSeems quite good for getting kids involved in what's a relatively grown-up game.",
    "timestamp": 1640905200
  },
  {
    "username": "Fleming2015",
    "rating": 6.0,
    "comment": "Lost in flood",
    "timestamp": 1640818800
  },
  {
    "username": "Hokiechica3",
    "rating": 6.0,
    "comment": "4 to 10 (sealed)",
    "timestamp": 1640646000
  },
  {
    "username": "kykwg",
    "rating": 6.0,
    "comment": "Innocuous enough to play with non-gamers, strangers and acquaintances.",
    "timestamp": 1640646000
  },
  {
    "username": "Sartan",
    "rating": 6.0,
    "comment": "Great end to a game night!\n\nEdit: This is so played out it only sometimes gets used with Cards against humanity. I am holding onto this to play with my godson when he gets older.",
    "timestamp": 1639090800
  },
  {
    "username": "Volstag",
    "rating": 6.0,
    "comment": "Very fun with the right crowd -- though you may find that your more rational / logical / literal gamers hate this game (as they expect the rational choice to be selected, as opposed to, say, the funniest choice). But, again, great game with the right crowd (and, perhaps, some alcohol).\n\n** GIVE AWAY / TRADE",
    "timestamp": 1638054000
  },
  {
    "username": "BoosterSeat",
    "rating": 6.0,
    "comment": "Matthew Kirby\nMark Alan Osterhaus",
    "timestamp": 1637017200
  },
  {
    "username": "tootstorm",
    "rating": 6.0,
    "comment": "It's a (mediocre) classic (with better alternatives (but not bad))!",
    "timestamp": 1635980400
  },
  {
    "username": "jimnshelle",
    "rating": 6.0,
    "comment": "party",
    "timestamp": 1633039200
  },
  {
    "username": "iseoni",
    "rating": 6.0,
    "comment": "How this plays really depends on who you are with. It's horrible for mixed crowds or people you don't know well. Great for adults who are trying to reconnect like siblings, cousins or at reunions.",
    "timestamp": 1631656800
  },
  {
    "username": "LukeJMiller6",
    "rating": 6.0,
    "comment": "I never want to play Apples to Apples, but I have fun every time I do play it. It can feel very rewarding to pick the winning card, but it can feel equally frustrating when you have a great answer that doesn't get selected.\n\nOne thing that makes the game really nice is that it can be played to all ages and all audiences, you just have to adapt with your answers. Apples to Apples is not my type of game, but I typically do enjoy it.",
    "timestamp": 1630879200
  },
  {
    "username": "something_obscure",
    "rating": 6.0,
    "comment": "C1",
    "timestamp": 1630360800
  },
  {
    "username": "FamilyGameTime",
    "rating": 6.0,
    "comment": "Game gets a lot of hate, but it's still an easy to teach go to for non-gamers. We often use our adaptation of the game, apples to oranges, which makes the game more fun.",
    "timestamp": 1629842400
  },
  {
    "username": "WildaBeast",
    "rating": 6.0,
    "comment": "Fun party game.",
    "timestamp": 1627250400
  },
  {
    "username": "Nevin",
    "rating": 6.0,
    "comment": "Enjoyable on family gatherings. Now I know where Cards against Humanity got its inspiration from.",
    "timestamp": 1627250400
  },
  {
    "username": "yarnchef",
    "rating": 5.5,
    "comment": "In a wood box",
    "timestamp": 1626732000
  },
  {
    "username": "TurtleLime",
    "rating": 6.0,
    "comment": "Family",
    "timestamp": 1625608800
  },
  {
    "username": "marknau",
    "rating": 6.0,
    "comment": "Great fun with the right crowd. Need 6-12 people willing to be creative and share some laughs.",
    "timestamp": 1625349600
  },
  {
    "username": "oldgoat3769967",
    "rating": 6.0,
    "comment": "Really a party game.The saving grace is that he game becomes funny as one player is playing cards to make the other laugh. good for Drunken players",
    "timestamp": 1624485600
  },
  {
    "username": "Mlinx6",
    "rating": 5.5,
    "comment": "PARTY - Kids love this game, which I would call more of an \"activity\" than a game. Good for a few laughs.",
    "timestamp": 1623621600
  },
  {
    "username": "villepa",
    "rating": 6.0,
    "comment": "Got few laughs but not a big fan of games that uses judge mechanism or whatever you want to call that.",
    "timestamp": 1616194800
  },
  {
    "username": "antiussentiment",
    "rating": 5.5,
    "comment": "Fun party game to be played occasionally..",
    "timestamp": 1616194800
  },
  {
    "username": "thoia",
    "rating": 6.0,
    "comment": "Definitely a hit of a party game. I have the big-ass Apple Crate edition, because...how do you not buy that wooden box? Man it's sweet. Certainly the easiest game to get people who are idly hanging around to jump into. My favorite of the party games.\n\nI have the Apple Crate edition that has all the expansions in a nice wooden box.\n\nGave this away to a home that will play it more than mine.",
    "timestamp": 1614034800
  },
  {
    "username": "todocaldo",
    "rating": 6.0,
    "comment": "Perfect simple multi-generational family game.",
    "timestamp": 1613689200
  },
  {
    "username": "jfield524",
    "rating": 6.0,
    "comment": "Simple, card based, party game.",
    "timestamp": 1613257200
  },
  {
    "username": "Inglais",
    "rating": 6.0,
    "comment": "Not a huge fan of voting games, but this isn't bad to just bring people to play together without the crassness of CAH.",
    "timestamp": 1612911600
  },
  {
    "username": "jhurtster",
    "rating": 6.0,
    "comment": "fun for first ten times you play it and then you hate it. lol",
    "timestamp": 1612479600
  },
  {
    "username": "SnowyAshton",
    "rating": 6.0,
    "comment": "This is a fun game my family enjoys playing.",
    "timestamp": 1611529200
  },
  {
    "username": "bbabs1",
    "rating": 6.0,
    "comment": "This is an easy party game that I assume sprung Cards Against Humanity into its unfortunate run as a super popular game. I do prefer this one to CaH these days, mostly because I can play this with everyone and not worry about offending someone. It's not a game I reach for often though.",
    "timestamp": 1609801200
  },
  {
    "username": "Neuromanced",
    "rating": 6.0,
    "comment": "Played at the game cafe",
    "timestamp": 1609542000
  },
  {
    "username": "Fyrebird",
    "rating": 6.0,
    "comment": "From Santa - Express version",
    "timestamp": 1608850800
  },
  {
    "username": "mawilson4",
    "rating": 6.0,
    "comment": "Too many good memories to trash this one with a lower rating, but the party game genre has exploded into more exciting iterations of A2A's central mechanic for me. Still fun to play with family.",
    "timestamp": 1608678000
  },
  {
    "username": "RavingLoon",
    "rating": 6.0,
    "comment": "Apples to Apples can serve its purpose, and that is a simple, no rules overhead, party game. No knowledge or skills are required, and it can be played with all ages.",
    "timestamp": 1607986800
  },
  {
    "username": "Robertino_Ruffinelli",
    "rating": 7.0,
    "comment": "Solid, fun and fast paced game. Enjoyable with the family and friends",
    "timestamp": 1758492000
  },
  {
    "username": "mpatoka",
    "rating": 6.5,
    "comment": "Bought new from thrift store for $3. Fun to play with non-gamers and party groups, they usually like it.",
    "timestamp": 1753653600
  },
  {
    "username": "L17_of_course",
    "rating": 6.5,
    "comment": "great when you have a lot of people",
    "timestamp": 1751407200
  },
  {
    "username": "Hoodie_Wearing_Idiot",
    "rating": 7.0,
    "comment": "Apples to Apples is slightly outdated, in terms of the celebrities and buzzwords on its cards, but every other aspect of the game flows together to create a genuinely solid party game for friends and family. Easy to pick up, easy to play, and you'll have a blast. Though the people out there who only choose literal answers and discount jokes make me want to throw an apple into their Adam's apple",
    "timestamp": 1744408800
  },
  {
    "username": "Dominikach",
    "rating": 7.0,
    "comment": "Fun party game!",
    "timestamp": 1742511600
  },
  {
    "username": "Teslavstwain",
    "rating": 7.0,
    "comment": "Fun family alternate for CAH. Much more willing to play this one as it is much cleaner. Keep it at my parents' house.",
    "timestamp": 1737154800
  },
  {
    "username": "Gwar13",
    "rating": 6.5,
    "comment": "facile",
    "timestamp": 1737068400
  },
  {
    "username": "calconey",
    "rating": 6.5,
    "comment": "Party Game. Fun, but gets stale after a while.\n\nQuite a few unlogged plays before I was really in the hobby.",
    "timestamp": 1735772400
  },
  {
    "username": "Daggerclaw",
    "rating": 7.0,
    "comment": "MC",
    "timestamp": 1733353200
  },
  {
    "username": "powers123",
    "rating": 7.0,
    "comment": "Not that this is my greatest game overall, it's more about how often it comes to the table bc of my kids and family. I can't complain when I can get people to play!",
    "timestamp": 1733094000
  },
  {
    "username": "teeheehee",
    "rating": 7.0,
    "comment": "its fun",
    "timestamp": 1733007600
  },
  {
    "username": "TheBrainlessdude",
    "rating": 7.0,
    "comment": "I suck at this game.",
    "timestamp": 1732662000
  },
  {
    "username": "Benterdimensional",
    "rating": 7.2,
    "comment": "The granddaddy of modern party games, and it still holds up. The amount of games that have borrowed from this alternating judge idea is staggering.\nYou got an ease of entry that is hard to beat, organically funny moments, opportunity for metagaming, and it's something that can just be played sitting around a living room.\nA big seller for a reason.",
    "timestamp": 1730242800
  },
  {
    "username": "skyglow",
    "rating": 7.0,
    "comment": "Much better with a larger group. Not so great for 4.",
    "timestamp": 1728684000
  },
  {
    "username": "JVerse",
    "rating": 7.0,
    "comment": "It's basically Cards Against Humanity for kids. It's perfect for families and elementary school children and you can make some really silly combinations. There are plenty of cards to avoid repeats most of the time. It's also easy to adjust the rules a bit to make the game shorter or longer, and you can play with a fairly large group without affecting play time or complexity.",
    "timestamp": 1726956000
  },
  {
    "username": "WolfSoul121",
    "rating": 7.0,
    "comment": "4-10 players",
    "timestamp": 1721858400
  },
  {
    "username": "firemage85",
    "rating": 7.0,
    "comment": "A good party game for non-gamers. Flexible and versatile. Lots of fun.",
    "timestamp": 1720994400
  },
  {
    "username": "Sugarberrybaby",
    "rating": 7.0,
    "comment": "4-10",
    "timestamp": 1720821600
  },
  {
    "username": "sanderkerel",
    "rating": 7.0,
    "comment": "Same mechanics as Cards agains humanity, but older, and safe for children. I do need to weed out the cards with famous Americans that my children never heard of.",
    "timestamp": 1720562400
  },
  {
    "username": "PerfectRoll",
    "rating": 6.8,
    "comment": "Found this really fun with the larger group (8) that played at church board game night.",
    "timestamp": 1720389600
  },
  {
    "username": "Innsbruck",
    "rating": 7.0,
    "comment": "Player Count: 4 to 10\n Competitive Game: One player wins alone.\n\nCards Against Humanity has forever ruined Apples to Apples for me.\n\nDesigned by Matthew Kirby and Mark Alan Osterhaus.",
    "timestamp": 1719266400
  },
  {
    "username": "nburrrzy",
    "rating": 7.0,
    "comment": "Hell yeah",
    "timestamp": 1719093600
  },
  {
    "username": "Newsh",
    "rating": 6.5,
    "comment": "I found this to be every bit as enjoyable as the majority of reviews suggest. The game is simplicity itself, and consistently creates magic moments where in-jokes or topical references will have everybody laughing, and having fun. great party game - and end-of evening filler.",
    "timestamp": 1718229600
  },
  {
    "username": "DSmitty",
    "rating": 7.0,
    "comment": "Great game to play with a big group, such as family gatherings. You have to have an intelligent group to play the original game though - unfortunately, I've found there are a lot of cards that people (especially kids) don't know.",
    "timestamp": 1715119200
  },
  {
    "username": "Madstone",
    "rating": 7.0,
    "comment": "Fun group game that is fun for all ages. I think best games are 4-6 people.",
    "timestamp": 1714946400
  },
  {
    "username": "dstachowicz",
    "rating": 6.5,
    "comment": "Need to remove some cards to make it family friendly. I.e “redneck and Democrats. Like the family version better than the one we own.",
    "timestamp": 1712959200
  },
  {
    "username": "Marx09",
    "rating": 6.5,
    "comment": "It's a party game. It's not a BAD party game... but it's a party game.",
    "timestamp": 1710370800
  },
  {
    "username": "scmiles1313",
    "rating": 7.0,
    "comment": "Fun group game. Easy to learn.",
    "timestamp": 1708470000
  },
  {
    "username": "Rivka",
    "rating": 7.0,
    "comment": "Works as a party game or a family game.\nPros: scales well, can be silly fun\nCons: concept and gameplay bores some people, can lead to acrimony regarding chosen \"best\" answer",
    "timestamp": 1708210800
  },
  {
    "username": "Kinskey",
    "rating": 6.5,
    "comment": "4-10 players",
    "timestamp": 1707951600
  },
  {
    "username": "funnyfisher7",
    "rating": 7.0,
    "comment": "I enjoy playing this game, albeit not as much as some others (family/friends) but yeah, I do like it.",
    "timestamp": 1705791600
  },
  {
    "username": "bittahness",
    "rating": 7.0,
    "comment": "Hedgehouse and Lake House. Tentative score based on past plays. Party game, best with 6-8 players. Great warm-up game for parties or inexperienced gamers. Easy to pick up, leads to funny and fun moments. For large groups, speed up play by adding rule to discard last submitted card.",
    "timestamp": 1704150000
  },
  {
    "username": "DodgerDoug",
    "rating": 7.0,
    "comment": "A classic fun family and party game!",
    "timestamp": 1703545200
  },
  {
    "username": "LVbgg",
    "rating": 7.0,
    "comment": "Still fun with certain people.",
    "timestamp": 1702422000
  },
  {
    "username": "hungryhomer",
    "rating": 6.5,
    "comment": "Better with larger groups, especially if you know the other players very well. Playing with funny and creative personalities bring this up to an 8.",
    "timestamp": 1694296800
  },
  {
    "username": "bandit_boy7",
    "rating": 6.9,
    "comment": "I received this as a gift for my 30th Birthday (in 2008). It's still in the shrink. But prior to my conversion to modern boardgames in 2007 this was a Friday Game Night regular with my family & friends. I know at some point it will re-emerge, since I love puns and predicting the effects of my choices upon my opponents.\n\n> TO DO: Update Rating",
    "timestamp": 1693864800
  },
  {
    "username": "ricklaporte",
    "rating": 6.8,
    "comment": "Matthew Kirby, Mark Alan Osterhaus - Out of the Box",
    "timestamp": 1693173600
  },
  {
    "username": "ryan3740",
    "rating": 6.5,
    "comment": "My rating has lowered over the years. This is still fun once in a while.",
    "timestamp": 1693173600
  },
  {
    "username": "cjswo3060",
    "rating": 7.0,
    "comment": "영단어 게임 추천, 멘사 셀렉트",
    "timestamp": 1690840800
  },
  {
    "username": "Grayhawk",
    "rating": 7.0,
    "comment": "Absolutely a Great Party Game!",
    "timestamp": 1690754400
  },
  {
    "username": "hughthehand",
    "rating": 7.0,
    "comment": "I rate this game a 9, with this consideration: I am rating it based specifically that it is in a party game genre. I cannot rate this game based on my typical likes of heavier euros, because it would make no sense.This is a great party game...good for non-gamers and family. Or possibly at the end of a long session of meaty games. It is more for fun than playing a game. The chaos of it all takes the game part out of it.",
    "timestamp": 1689890400
  },
  {
    "username": "red_gamster",
    "rating": 7.0,
    "comment": "Play for 20 minutes. Have a good laugh. Put away quickly. That's the trick with party games that have such a slight premise. Great for non-gamers and the perfect ultra-light party game. Making your own cards is even better, particularly if you live outside the US.",
    "timestamp": 1689372000
  },
  {
    "username": "Ginewes",
    "rating": 7.0,
    "comment": "Kids like it but 1/3 of the cards do not work for kids",
    "timestamp": 1686780000
  },
  {
    "username": "ChefGrigg",
    "rating": 6.9,
    "comment": "Dad's",
    "timestamp": 1686002400
  },
  {
    "username": "Timmiejane",
    "rating": 6.5,
    "comment": "This is my 2nd copy. First copy met with a tragic watery end.\n\nLoved this game from the moment I bought it, back when it was fresh in the stores. The family loved playing it, and it brought out a lot of good times and memories.\n\nBefore getting the second copy, the “judge” type games have become the dominant party game in our collection. Some of the twists are nice, but have definitely watered down the genre.\n\nStill love this game, but mostly out of nostalgia.",
    "timestamp": 1683064800
  },
  {
    "username": "Wills2003",
    "rating": 7.0,
    "comment": "6 to 8",
    "timestamp": 1682287200
  },
  {
    "username": "HokieGeek",
    "rating": 6.5,
    "comment": "It can be learned immediately and, with the right group (which my family is) it can be loads of unending fun. I like it!",
    "timestamp": 1679954400
  },
  {
    "username": "smapple30",
    "rating": 6.5,
    "comment": "Played",
    "timestamp": 1676156400
  },
  {
    "username": "artistterry",
    "rating": 7.0,
    "comment": "foot stool",
    "timestamp": 1674514800
  },
  {
    "username": "alexisluckier",
    "rating": 7.0,
    "comment": "competitive, party game",
    "timestamp": 1668380400
  },
  {
    "username": "Kisa",
    "rating": 7.0,
    "comment": "This is a game that I resisted playing because I expected (and wanted) to dislike based on the description. However, I have had fun every time I am talked into playing it. :-)",
    "timestamp": 1665007200
  },
  {
    "username": "Awstraw",
    "rating": 7.0,
    "comment": "X",
    "timestamp": 1664488800
  },
  {
    "username": "jpgfour",
    "rating": 7.0,
    "comment": "Kid's shelf\n\nVery good with kids and/or with casual friends and/or at work",
    "timestamp": 1662674400
  },
  {
    "username": "Conbarris",
    "rating": 6.5,
    "comment": "The best social party game I've played.",
    "timestamp": 1655935200
  },
  {
    "username": "jaceycole",
    "rating": 7.0,
    "comment": "Lots of plays over the years, a generally chill evening experience. Need the right crowd. House rule: The card \"chickens\" must always win.",
    "timestamp": 1654725600
  },
  {
    "username": "absurdistkobold",
    "rating": 6.5,
    "comment": "If you're gaming with your kids, you could do worse.",
    "timestamp": 1651874400
  },
  {
    "username": "Pnthrgrl",
    "rating": 6.5,
    "comment": "GOOD PARTY GAME",
    "timestamp": 1645311600
  },
  {
    "username": "Agrajag",
    "rating": 7.0,
    "comment": "Great for introducing newbies to the hobby. Not sure I'd ever play again given Cards Against Humanity.",
    "timestamp": 1644966000
  },
  {
    "username": "fuzzyscribble",
    "rating": 7.0,
    "comment": "10 player",
    "timestamp": 1644534000
  },
  {
    "username": "jonpaget",
    "rating": 7.0,
    "comment": "Always fun and can be learned very quickly.",
    "timestamp": 1643151600
  },
  {
    "username": "Akke",
    "rating": 7.0,
    "comment": "Marvelous party experience.",
    "timestamp": 1642892400
  },
  {
    "username": "MamaWaffles",
    "rating": 6.5,
    "comment": "1/19/2022\nOnly played once.\n\nIt has been about a decade since I played it, but it's completely fine. I wouldn't recommend it to a hardcore gamer or for strategic play, but I played this with my friends family and it was the perfect setting. Definitely more PG than Cards Against Humanity, but I honestly think it's great for what it's trying to achieve.",
    "timestamp": 1642546800
  },
  {
    "username": "partino",
    "rating": 6.5,
    "comment": "A fun party game but maybe a bit overrated. A lot depends on who's playing, as the person who's judging is supposed to select based on how closely a submitted word card matches the subject card. But if people choose based on who has more or less cards, or for spite, or simply to be contrary, well, the fun can end pretty quickly. Or, playing it with somebody who thinks they're funny but aren't, and so on. (One time my wife and I played with a couple, the husband of which read out every answer and tried to be 'quippy' with each one, and we were close to either hanging ourselves or just shooting him.)\n\nHave played it with as many as 12 people. Basically, I'm usually okay with playing \"Apples to Apples,\" but I don't go looking to play it. On the other hand, I can think of other group games I'd rank behind this. In my experience it seems to work better with smaller groups, like 4-6 and that’s if the players are good sports and playing to have fun.\n\nIf playing with kids, play the kids version, as they won’t know the names of older actors or celebrities, etc., and won’t have a sufficient vocabulary to participate.\n\nMy rating is 6.5, which is based on repeated plays with various people, and reflects my experience that most of the time when I play it, the game's enjoyable, but at times I'm indifferent even while playing, plus as noted, a lot depends on who you're playing with. If not a good group I could even rate this a 4, but with the right group, a 7.",
    "timestamp": 1641510000
  },
  {
    "username": "whydelilah",
    "rating": 7.0,
    "comment": "Juego party en el que un jugador propone un adjetivo y el resto de los jugadores tienen que buscar un nombre que le encaje mejor que el del resto. Dicho así puede sonar aburrido o un poco pedante.\nSin embargo, estamos ante un juego con cartas en el que la carta de adjetivo tiene puesto los significados y los demás jugadores eligen un sustantivo de entre los que tienen disponibles y que no tienen ni que encajar con el adjetivo. A veces se la lleva el que mejor lo vende.\n\nEjemplo: adjetivo: egoísta. Sustantivo ganador: Celia Cruz. Era muy egoísta, yo fui a Cuba y lo decía todo el mundo. Azúuuuucar, todo el azúcar para mí.\n\nJugado como un millón de veces. Ahora mismo está en barbecho. Nos hemos reído un millón con él. Celia Cruz, egoísta.",
    "timestamp": 1641164400
  },
  {
    "username": "ntbrands",
    "rating": 6.5,
    "comment": "Box has quite a bit of wear, but the cards are in good shape. There is also a mini-expansion added in. I'm not sure which one.",
    "timestamp": 1640732400
  },
  {
    "username": "mattjones_56",
    "rating": 7.0,
    "comment": "Matt",
    "timestamp": 1640646000
  },
  {
    "username": "OralBob",
    "rating": 6.5,
    "comment": "Crate.\n\nWhy is this game in my collection?\n\nI found Apples to Apples before anyone knew about Apples to Apples. Now, there are so many Apples to Apples knock offs, its tedious. The best of these is Dixit, that is Apples to Apples with pictures. I don't need anything but the original in my collection. Its only a few games that gets its own sub-genre because it is so influential.",
    "timestamp": 1640127600
  },
  {
    "username": "geographist2000",
    "rating": 7.0,
    "comment": "While I might have rated this one high for a party game, I've had nothing but laughs everytime we've played. My kids were engaged and laughing and really, that's all that matters.",
    "timestamp": 1639609200
  },
  {
    "username": "Gamesaurus2016",
    "rating": 7.1,
    "comment": "RULES - Charu, Prem, Vijay, Yogi\nSLEEVES - Done\nAWARDS - Mensa Select Winner (1999)\nINSTA - Yes",
    "timestamp": 1633644000
  },
  {
    "username": "darkthur",
    "rating": 7.0,
    "comment": "Divertidísimo party que ha funcionado casi siempre que lo he sacado a mesa y que costó dos duros.",
    "timestamp": 1633298400
  },
  {
    "username": "VerdantHyborian",
    "rating": 7.0,
    "comment": "Game depends on how funny your group is. This is my favorite party game and think it's a much better version of \"Cards against Humanity.\" Because there are no \"adult\" themes, you have to be more witty to make the game funny ending up in greater laughs. I also love useing this boardgame with new friends as a way to get to know them better.",
    "timestamp": 1629496800
  },
  {
    "username": "Jrb259",
    "rating": 6.5,
    "comment": "This game has fond memories for me of trying to profile family members and friends. If you guess right for what they are likely to think is the best answer, then you can get it right.\n\nOver time, the game was played out and feels a bit bland.\n\nNegatives for me are when you have a hand full of cards that you know will never win, and you don't find funny or special. There should be some house rules of culling your deck to mine for better cards.\n\nWhen someone gets the right card, there are very funny movements.\n\nJudging is so arbitrary, that this is more of an experience than anything.",
    "timestamp": 1628719200
  },
  {
    "username": "1000rpm",
    "rating": 7.0,
    "comment": "Entertaining party game - nothing that special though.\nUpgraded to a 7 as this is great with non-gamers and works for a large variety of players",
    "timestamp": 1627509600
  },
  {
    "username": "shammois",
    "rating": 6.5,
    "comment": "Fun enough party game",
    "timestamp": 1626300000
  },
  {
    "username": "Reasonable_Doubt",
    "rating": 7.0,
    "comment": "Only game that can be played with almost anyone gamer/non-gamer alike and still be fun.",
    "timestamp": 1624053600
  },
  {
    "username": "AbovetheLawson",
    "rating": 7.0,
    "comment": "Have the party crate edition, but that isn't a choice.",
    "timestamp": 1622498400
  },
  {
    "username": "BungJon",
    "rating": 6.5,
    "comment": "Sold in Indonesia",
    "timestamp": 1621720800
  },
  {
    "username": "GuitarGuy07",
    "rating": 7.0,
    "comment": "This is a good silly game......if you've assembled the right group of people.\nDefinitely play with a group of people with similar senses of humor otherwise people could easily get bored, offended, etc. Its crazy to say that, but I've seen it happen plenty of times.",
    "timestamp": 1618178400
  },
  {
    "username": "Infernoderek",
    "rating": 7.0,
    "comment": "It is less obnoxious version of cards against humanity.",
    "timestamp": 1617228000
  },
  {
    "username": "TVal",
    "rating": 6.5,
    "comment": "Best with more people",
    "timestamp": 1616022000
  },
  {
    "username": "kwalzl",
    "rating": 7.8,
    "comment": "6B",
    "timestamp": 1758664800
  },
  {
    "username": "Namenotfound999",
    "rating": 7.5,
    "comment": "Cards Against Humanity without the risk of going to jail",
    "timestamp": 1758405600
  },
  {
    "username": "tugdad93",
    "rating": 7.5,
    "comment": "Good party game. The kids enjoyed this one when they were younger.",
    "timestamp": 1756677600
  },
  {
    "username": "Terwox",
    "rating": 7.5,
    "comment": "I can't believe how badly this game ripped off Cards Against Humanity, it's almost criminal!",
    "timestamp": 1754258400
  },
  {
    "username": "Istvanffy",
    "rating": 8.0,
    "comment": "Fun light family game. Quick & enjoyable for all ages. Simple.",
    "timestamp": 1746741600
  },
  {
    "username": "lizefly",
    "rating": 7.5,
    "comment": "Disney version",
    "timestamp": 1745877600
  },
  {
    "username": "aaronday",
    "rating": 8.0,
    "comment": "Storage",
    "timestamp": 1741993200
  },
  {
    "username": "laneug",
    "rating": 8.0,
    "comment": "Fun party game.",
    "timestamp": 1741647600
  },
  {
    "username": "TheKloewers",
    "rating": 8.0,
    "comment": "A funny game with way too many movie references for my taste.",
    "timestamp": 1738796400
  },
  {
    "username": "KDLadage",
    "rating": 8.0,
    "comment": "Reviewed: MM",
    "timestamp": 1733094000
  },
  {
    "username": "EmperorEternal",
    "rating": 8.0,
    "comment": "Everyone has 8 card hands and sends in 2 red cards (we use card sleeves to keep them paired). It's a riot and the only way we play.",
    "timestamp": 1715378400
  },
  {
    "username": "nickguay",
    "rating": 8.0,
    "comment": "Party",
    "timestamp": 1714946400
  },
  {
    "username": "GoldenHorse",
    "rating": 8.0,
    "comment": "Love playing it but some of those cards are super dumb and we removed them.",
    "timestamp": 1707519600
  },
  {
    "username": "Euroman",
    "rating": 8.0,
    "comment": "Best with 5P or more. Good with the right group, horrible with the wrong one.",
    "timestamp": 1707087600
  },
  {
    "username": "Samuelw3",
    "rating": 7.5,
    "comment": "2024\n\nBarcode: 659390077200\nISBN 1-932359-17-6",
    "timestamp": 1707001200
  },
  {
    "username": "TuesdayFortnite",
    "rating": 8.0,
    "comment": "I love this game - the original \"cards against...\" without the try hard offensive streak. Trust me at 2am this gets very double entender-y, and is still safe to play with 7 year olds.",
    "timestamp": 1706914800
  },
  {
    "username": "RonCarlson01",
    "rating": 8.0,
    "comment": "Some cards still sealed.\nNo tray(s).",
    "timestamp": 1705705200
  },
  {
    "username": "BrendansBoat",
    "rating": 8.0,
    "comment": "This is an excellent choice for groups of 6 or more -- i.e. groups too large for a 2-6 player board game -- and for players who don't consider themselves board game enthusiasts. In my opinion, it's best played for laughs rather than to gain points and win. I mean, honestly, you won't remember who won this or that particular game but you will remember that epic round that just wrecked everybody.\n\nFor example, we were playing the Bible version of the game, and the noun was \"Stinky.\" The selections included \"the sons of Jacob,\" \"Lazarus,\" \"loaves and fishes,\" \"the 12 apostles,\" \"the multitude of disciples...\" I mean, come on! How is anyone supposed to pick the best one from that set of selections??\n\nIt was so funny I seem to recall someone actually wetting their pants...",
    "timestamp": 1704322800
  },
  {
    "username": "sunrayevening",
    "rating": 8.0,
    "comment": "I’m a bit surprised at how low this is rated. If you are looking for an easy and clean family game to play with children, this is fantastic. It can be very funny and everyone is smiling. This game isn’t for hard core gamers or if the age of the table is over 14, but for families and kids, this is a solid 8.",
    "timestamp": 1701817200
  },
  {
    "username": "TheHunter008",
    "rating": 7.8,
    "comment": "Classic!!! Must have.",
    "timestamp": 1701039600
  },
  {
    "username": "christeven115",
    "rating": 8.0,
    "comment": "This game gives me all the feels. It's staying in my collection. Judge away = )",
    "timestamp": 1696975200
  },
  {
    "username": "AmassGames",
    "rating": 7.9,
    "comment": "Great! Might sleeve\n\nGoogle AmassGames (2,300 board game reviews, podcast, 3000+ Instagram posts and more)",
    "timestamp": 1692396000
  },
  {
    "username": "gcanessa",
    "rating": 7.5,
    "comment": "Great party game. Good with larger groups.\n\nCabin",
    "timestamp": 1686348000
  },
  {
    "username": "wkover",
    "rating": 8.0,
    "comment": "If not played too frequently, this can lead to hilarious word associations.\n\nUpdate:\n\n20+ years after its initial release, AtA has gotten a second lease on life in our house - especially during family visits and holidays. Still fun, though players should be able to discard and replace outdated/unfamiliar words at will.\n\nThe original '99 release was a speed game, with multiple submissions allowed and only the first four cards being judged. That stupid rule inevitably led to anger and a lack of fun, so it was changed to a variant in later editions. Good call.\n\nThe most entertaining house rule (which we always use) is to add a random card from the draw stack to the answer pile. The rando response is often hilarious, and Madame Extra - our neutral opponent - has come uncomfortably close to winning numerous times.",
    "timestamp": 1685829600
  },
  {
    "username": "Convisor",
    "rating": 7.5,
    "comment": "Donald Trump >>> Best card",
    "timestamp": 1675465200
  },
  {
    "username": "chigangrel",
    "rating": 8.0,
    "comment": "Best when drunk and silly lol",
    "timestamp": 1669676400
  },
  {
    "username": "Niara7",
    "rating": 8.0,
    "comment": "Very group dependent. I tend to enjoy this with friends/peers but not with family/mixed ages.",
    "timestamp": 1666908000
  },
  {
    "username": "aadrian13",
    "rating": 8.0,
    "comment": "Fun with the right crowd.",
    "timestamp": 1656540000
  },
  {
    "username": "CaptainCrockpot",
    "rating": 8.0,
    "comment": "The game out of the box is a 4.5.\n\nI created a house ruled version that makes the game an 8+.\n\nAll I did was add a scoring system, which added strategy, and took out bias:\n\nThe players all choose one of their 7 cards to give to the judge. Those cards are shuffled before being seen by the judge so that no bias is created.\n\nThen the judge will give out its first score. It could be the best answer, worst answer, or most middle answer. Note that no players are allowed to say ANYTHING about the answers. The judge makes their first decision with their gut and own intuition. That player will receive points based on number of players. Points are kept secret. (We use clay poker chip counters to keep score. The players keep the counters hidden.)\n\nThe player who scored can now help the judge make future decisions. They can give their opinions. The judge takes those into consideration, but doesn't have to follow what they say at all. Usually, the judge will at least acknowledge the thoughts of the already scored players.\n\nThen the judge gives out the next score and so on and so forth.\n\nEx. When there are 2 people left, everyone else will be able to give the judge their thoughts.\n\nWith scoring, it's best to have everyone getting a different score with a bit more weight to the front and back ends.\n\nHere's how I score for player counts:\n4: -1, 0, 1, 3\n5: -1, 0, 1, 2, 4\n6: -1, 0, 1, 2, 3, 5\n7+…\n\nYou just follow that pattern of scoring.\nThe negative 1 really makes it exciting.\nI'd recommend keeping that in.",
    "timestamp": 1652392800
  },
  {
    "username": "eecpickle",
    "rating": 8.0,
    "comment": "Fun childhood game, but isn't as much fun as I have gotten older.",
    "timestamp": 1641942000
  },
  {
    "username": "Torsten",
    "rating": 7.5,
    "comment": "Apfelkompott",
    "timestamp": 1640214000
  },
  {
    "username": "Kellogg99",
    "rating": 8.0,
    "comment": "Really fun with the right group of people!",
    "timestamp": 1632175200
  },
  {
    "username": "JMakowskiTroy21",
    "rating": 8.0,
    "comment": "Apples to Apples is the child friendly version of Cards against humanity, is a very un game to play used to play a lot when I was younger both in school and with my family.",
    "timestamp": 1612998000
  },
  {
    "username": "akmanolias21",
    "rating": 8.0,
    "comment": "I see Apples to Apples as the family friendly version of Cards Against Humanity, and it works very well. I like this game a lot because the prompts can be hilarious. It is also a great game to play with families, and it can be funny with anyone playing.",
    "timestamp": 1612479600
  },
  {
    "username": "Crazycatlady007",
    "rating": 8.0,
    "comment": "I'm surprised at this rating! This is a fun group game with replayability. I mean, it's not a game for those seeking to conquer something. It is more about social interaction. But, it is solid for sure!!",
    "timestamp": 1609801200
  },
  {
    "username": "samurite",
    "rating": 8.0,
    "comment": "UK Edition from around 2008\nProbably lost a load of cards by now",
    "timestamp": 1607382000
  },
  {
    "username": "Styro",
    "rating": 8.0,
    "comment": "Probably the best party game out there. I actually prefer the Jr version of this game.",
    "timestamp": 1605999600
  },
  {
    "username": "PumpkinGirl",
    "rating": 8.0,
    "comment": "Fun party game. Accessible to all ages.",
    "timestamp": 1604358000
  },
  {
    "username": "pisecobabe",
    "rating": 8.0,
    "comment": "V20\nArby's Kids Meal mini box, Deck 1",
    "timestamp": 1603666800
  },
  {
    "username": "MrBigUK",
    "rating": 7.5,
    "comment": "The best party game.\nI am now heartily sick of it after it being requested everywhere I went. That does not stop me still appreciating its quality.",
    "timestamp": 1594850400
  },
  {
    "username": "freddicus",
    "rating": 8.0,
    "comment": "Had a ton of family fun with this game back in the day. The PG precursor to CAH.",
    "timestamp": 1594159200
  },
  {
    "username": "Intrigue21",
    "rating": 8.0,
    "comment": "Extremely exciting game. Party. Ranking: 3rd",
    "timestamp": 1594072800
  },
  {
    "username": "Paul Risner",
    "rating": 8.0,
    "comment": "Great Social Game!",
    "timestamp": 1593208800
  },
  {
    "username": "TheHighFrontier",
    "rating": 8.0,
    "comment": "I like apples, and Apple Computers, and Christina Applegate, so it was a given that I would like this game.",
    "timestamp": 1589493600
  },
  {
    "username": "PhilSchwarzmann",
    "rating": 7.5,
    "comment": "Tooooo much fun! Can old quickly though for experienced players.",
    "timestamp": 1584918000
  },
  {
    "username": "repkask",
    "rating": 8.0,
    "comment": "Fun game that can be played with almost anyone.",
    "timestamp": 1584831600
  },
  {
    "username": "bluestraggler",
    "rating": 8.0,
    "comment": "Silly party game that I enjoy the hell out of. Play with the biggest group you can get.",
    "timestamp": 1583794800
  },
  {
    "username": "LegolasTN",
    "rating": 8.0,
    "comment": "Great party game for at least 4. A word game that doesn't require you to be a word nerd, although word nerds love it.",
    "timestamp": 1578265200
  },
  {
    "username": "crazybirdman",
    "rating": 8.0,
    "comment": "I know it's cliche, but this game is literally fun for the whole family.",
    "timestamp": 1577746800
  },
  {
    "username": "SkyWoocaY",
    "rating": 8.0,
    "comment": "4-10 Players",
    "timestamp": 1577142000
  },
  {
    "username": "roaming_dutchman",
    "rating": 8.0,
    "comment": "Good party game",
    "timestamp": 1576796400
  },
  {
    "username": "Kløve",
    "rating": 8.0,
    "comment": "Simple fun, good for company that does not play games, or for when alcohol is in play.",
    "timestamp": 1575241200
  },
  {
    "username": "Red Eyed Jack",
    "rating": 8.0,
    "comment": "Family owned.",
    "timestamp": 1573340400
  },
  {
    "username": "Gabusan",
    "rating": 8.0,
    "comment": "Best party game of its kind. Some (competitive) people complains they never get the right cards. Language dependant, sometimes we play with dictionary available. Would buy the spanish edition.",
    "timestamp": 1570053600
  },
  {
    "username": "temp3ror",
    "rating": 7.5,
    "comment": "Box, #4, #5, ##6, ##7, ##8, group",
    "timestamp": 1569103200
  },
  {
    "username": "lericson20",
    "rating": 8.0,
    "comment": "JS-Yes",
    "timestamp": 1567375200
  },
  {
    "username": "Jenfosca",
    "rating": 8.0,
    "comment": "Random, but fun with kids as a party game. House rules - butter and bacon ALWAYS win.",
    "timestamp": 1563573600
  },
  {
    "username": "Cecrow",
    "rating": 8.0,
    "comment": "This game can be extremely funny in the right company (and that's almost any company!)",
    "timestamp": 1559685600
  },
  {
    "username": "naturestee",
    "rating": 8.0,
    "comment": "Not only does my gamer's club own a copy, but my gamer-fearing sister does too! Now if only I could get her to play an rpg... she'd be converted.",
    "timestamp": 1558908000
  },
  {
    "username": "alfredo lorente",
    "rating": 8.0,
    "comment": "One of the few party games I enjoy -- and may be willing to play instead of a heavy Euro.",
    "timestamp": 1558476000
  },
  {
    "username": "cindyfnb",
    "rating": 7.5,
    "comment": "Apples to Apples is a really fun game as long as you have a group that is willing to cut loose and enjoy a laugh. Its not really for the stoic sort. I seldom have enough company to do this game justice, but its a good enough game to keep around.",
    "timestamp": 1557525600
  },
  {
    "username": "Reklaw",
    "rating": 8.0,
    "comment": "Apples to apples\n4-10 [6-8]\n30\n10+\n1.16\nBR 0.58",
    "timestamp": 1557007200
  },
  {
    "username": "Earth Dragon",
    "rating": 8.0,
    "comment": "SO much better then Cards against humanity. The humor and brashness aren't all there is too it, but is so much more clever when it gets worked in!!\n\nExtremely sad that this sub-6, and really shows too many need to be force their entertainment.",
    "timestamp": 1553814000
  },
  {
    "username": "sbconstant",
    "rating": 8.0,
    "comment": "Lots of laughs, plus chances to be eccentric and obscure.",
    "timestamp": 1553036400
  },
  {
    "username": "albcann",
    "rating": 8.0,
    "comment": "Good, fun, family, and party game. Not going to provide much of a mental challenge, but sometimes you may not want to think and just want to laugh and have fun.",
    "timestamp": 1551394800
  },
  {
    "username": "arlhok",
    "rating": 8.0,
    "comment": "P: 4-12 / 6-8\nA: 10+\nW: 1.16\nT: 30'\nG: Party (Humor)",
    "timestamp": 1546642800
  },
  {
    "username": "Andu",
    "rating": 8.0,
    "comment": "Keep - Top 50",
    "timestamp": 1544050800
  },
  {
    "username": "lencosja",
    "rating": 8.0,
    "comment": "The Big Apple Edition. How cool is the oversized apple?",
    "timestamp": 1538172000
  },
  {
    "username": "Granite26",
    "rating": 8.0,
    "comment": "This is a fun, vanilla, party game that is completely G rated. It gets old, though.",
    "timestamp": 1535061600
  },
  {
    "username": "SLEGOLACE",
    "rating": 8.0,
    "comment": "c'est un jeu Famlily friendly qui mérite sa place dans n'importe quelle collection.",
    "timestamp": 1520463600
  },
  {
    "username": "Indy418",
    "rating": 7.5,
    "comment": "At the Lake.",
    "timestamp": 1519513200
  },
  {
    "username": "hoduldt",
    "rating": 8.0,
    "comment": "Best if the person who chooses is \"advised\" by other players.",
    "timestamp": 1517266800
  },
  {
    "username": "mercere99",
    "rating": 8.0,
    "comment": "Fun party game -- trivial to lean.",
    "timestamp": 1514156400
  },
  {
    "username": "tourbud",
    "rating": 8.0,
    "comment": "This games is good for Parties with lots of people. it can get old though. so don't play it often.",
    "timestamp": 1510786800
  },
  {
    "username": "dampe2001",
    "rating": 7.6,
    "comment": "J-D-3",
    "timestamp": 1502661600
  },
  {
    "username": "jrichview",
    "rating": 8.0,
    "comment": "A solid go-to party game but watch out for politics entering into it!",
    "timestamp": 1498082400
  },
  {
    "username": "EricShift",
    "rating": 8.0,
    "comment": "Being Loaned Out.",
    "timestamp": 1497996000
  },
  {
    "username": "SunlessAmora32",
    "rating": 8.0,
    "comment": "you wanna chuckle with the kids, this is the game man!",
    "timestamp": 1496959200
  },
  {
    "username": "tiarulz8",
    "rating": 8.0,
    "comment": "It takes more than just flipping cards over to make this game fun - play this with people willing to justify their choices (as judge) or argue the merits of their answers (as players) and you have hours of good-natured competitive banter.",
    "timestamp": 1491775200
  },
  {
    "username": "teristen",
    "rating": 8.0,
    "comment": "Have played several times in different groups.",
    "timestamp": 1490137200
  },
  {
    "username": "danaenicole",
    "rating": 9.0,
    "comment": "Owned in classroom",
    "timestamp": 1724191200
  },
  {
    "username": "eastfire",
    "rating": 9.0,
    "comment": "为其首创的创新性打高分",
    "timestamp": 1720216800
  },
  {
    "username": "LaurenAlise",
    "rating": 9.0,
    "comment": "1.15 Complexity Rating",
    "timestamp": 1703890800
  },
  {
    "username": "elisenotelsie1",
    "rating": 9.0,
    "comment": "Family-friendly and kid-friendly party games don't really get better than this. Super nostalgic, and as a pro-tip, you can also use the cards as charades prompts.",
    "timestamp": 1664488800
  },
  {
    "username": "Marky",
    "rating": 9.0,
    "comment": "In the right place (kids, family get togethers) this is a great game.\n\nUnderrated imo. Just viewing the comments here can see lots of low ratings with: 'great fun but have outgrown it'. True, my family has also outgrown it now that all the kids are teens and older, but during their childhood this was a fantastic game with them and Grandma, and Aunties etc.",
    "timestamp": 1662328800
  },
  {
    "username": "droberts441",
    "rating": 9.0,
    "comment": "Good party game. Is it a game I would pick out to play with a game group? No. Is it a good party game where enjoying your time with friends and/or family is most important? Yes.\n\nEasy rules, no setup, easily played if drinking with friends. You don't really need to clear off the table to play.\n\nSome family members love this game, so they bought it for me for Christmas a few years back, so they didn't have to bring theirs during Christmas/Thanksgiving. I finally played it with them, and found it was a good game with family after the holiday dinner.\n\nI actually went from lurker to BGG user, with an account, after that first play with them. So I credit this game with my joining BGG.\n\nI have the Apple Crate Edition with the cards from the original core set and Apples to Apples: Expansion Set #1 and Apples to Apples: Expansion Set #2.",
    "timestamp": 1639782000
  },
  {
    "username": "wwffan7385",
    "rating": 9.0,
    "comment": "Car",
    "timestamp": 1629496800
  },
  {
    "username": "Falwakeeltroy21",
    "rating": 9.0,
    "comment": "Apples to Apples is super fun and is super hype. With a big group of people this game is amazing, Apples to Apples needs interaction with people unlike a game where you can play it all the way through without saying a word. Apples to Apples will always be a fun game to play.",
    "timestamp": 1613170800
  },
  {
    "username": "Instinct8",
    "rating": 9.0,
    "comment": "The party game that started it all. Do you think Cards against Humanity would exist without this classic? This is gold.",
    "timestamp": 1603666800
  },
  {
    "username": "PirateBear",
    "rating": 9.0,
    "comment": "I think this is a great party game and leads to lots of laughs for all ages and not leaving anyone feeling uncomfortable.",
    "timestamp": 1582066800
  },
  {
    "username": "TnTMac",
    "rating": 9.0,
    "comment": "I love playing this when my sister, my daughter, her friends, and my nieces and nephew visit.",
    "timestamp": 1578783600
  },
  {
    "username": "SophieLynne",
    "rating": 9.0,
    "comment": "Great party game!",
    "timestamp": 1578178800
  },
  {
    "username": "tenhole",
    "rating": 9.0,
    "comment": "[TRADE INTEREST LOW] Great filler for gamers. A rock solid can't miss at parties with non-gamers.",
    "timestamp": 1569535200
  },
  {
    "username": "Nightgaunt",
    "rating": 9.0,
    "comment": "Just plain brilliant. Practically never gets old. The only weak point are the personalities in the red deck. They should be fun to play, but they rarely are.",
    "timestamp": 1568498400
  },
  {
    "username": "brumcg",
    "rating": 8.5,
    "comment": "As a party game, I'd give this a 7 given people of the same relative ages. A 6 with a mixed group. With the family, my wife and I are on the same page... the kids are on a different page. Honestly, I give this game more credit the more we play it. It's... fun.",
    "timestamp": 1565301600
  },
  {
    "username": "Zarzuela",
    "rating": 9.0,
    "comment": "Pretty fun game. Can get old after playing over and over. I still really like it overall.",
    "timestamp": 1559685600
  },
  {
    "username": "expatstef",
    "rating": 9.0,
    "comment": "A Spiel Abend favorite",
    "timestamp": 1558735200
  },
  {
    "username": "kaylee66",
    "rating": 9.0,
    "comment": "Apples to Apples is a lot of fun.",
    "timestamp": 1550703600
  },
  {
    "username": "JacamaW",
    "rating": 9.0,
    "comment": "This is my Daughters favorite game and is always asking to play.",
    "timestamp": 1542063600
  },
  {
    "username": "Poddster",
    "rating": 8.5,
    "comment": "Progenitor judging game.\n\nMuch better than Cards Against Humanity as:\n\n1. You have to actually put forward your position, rather than simply relying on a hilarious card to do it for you.\n2. Family Friendly\n\n\nSome of the pop culture references date the game a bit.\n\nThese days I would go for Snake Oil first, but A2P is still a classic.",
    "timestamp": 1539468000
  },
  {
    "username": "mkgray",
    "rating": 9.0,
    "comment": "Perhaps one of the best party games ever. It has an extremely questionable level of\nskill involved, but is a huge amount of fun, and reasonably plays as few as 4 or as many\nas 10. This will continue to get pulled out for a long time. Often, this is a very amusing\nand light note on which to end a gaming session.",
    "timestamp": 1514415600
  },
  {
    "username": "SnoopyThe3rd",
    "rating": 9.0,
    "comment": "When you get tired of/grow out of the Cards against Humanity vibe, but love the game metric, this is a great game to play. Recommend: changing the rule, so that people can argue for their card.. much more fun and hilarity",
    "timestamp": 1514329200
  },
  {
    "username": "topdoggus",
    "rating": 9.0,
    "comment": "This game is the s*#t. So much fun to play with friends, and even your relatives. Both hilarious and extremely creative. Love playing this game almost any time. Perfect for parties, or a rainy day at home. Buy this game. Period.",
    "timestamp": 1499378400
  },
  {
    "username": "bazaarbroz",
    "rating": 9.0,
    "comment": "Great game for parties and family occasions - great icebreaking game and to get people talking (and arguing!) - I like how you can use your cards to keep score (no pen and pad to keep score) - Overall prefer this to Cards against Humanity, as there is more opportunity to argue your case.",
    "timestamp": 1498600800
  },
  {
    "username": "ChaosSlave51",
    "rating": 9.0,
    "comment": "At in-laws",
    "timestamp": 1490396400
  },
  {
    "username": "TBranum",
    "rating": 9.0,
    "comment": "A creative game that actually works being as simple as it is.",
    "timestamp": 1489100400
  },
  {
    "username": "versaglobe",
    "rating": 9.0,
    "comment": "Funny Associations",
    "timestamp": 1487458800
  },
  {
    "username": "WoozyB",
    "rating": 8.5,
    "comment": "Not much to it, but it is a solid party game that literally anyone can play, which is extremely valuable.",
    "timestamp": 1469656800
  },
  {
    "username": "swiftlex",
    "rating": 9.0,
    "comment": "This is a fun game, especially liked by my then 10 year old son, for whom I obtained the junior version. His younger brother also liked this game at that age.",
    "timestamp": 1464645600
  },
  {
    "username": "wingedpotato",
    "rating": 9.0,
    "comment": "A new classic. Best with expansions #1 and #3.",
    "timestamp": 1463608800
  },
  {
    "username": "CharlieWonka",
    "rating": 9.0,
    "comment": "Good clean party fun. Can get some great oddities as well. 23 Plays",
    "timestamp": 1441058400
  },
  {
    "username": "TheresaH",
    "rating": 9.0,
    "comment": "Still the best party game, other than it's clone Cards Against Humanity.",
    "timestamp": 1426719600
  },
  {
    "username": "atomicblue",
    "rating": 8.7,
    "comment": "This game has been a favourite of my friends nearly the entire way through our twenties - I can't think of much higher praise than that. It's an excellent game for getting to know how your friends think and understanding their different senses of humour.\n\nThe only reason I didn't give it a perfect score is because some of the cards had American references that were lost on me (I'm from Australia). We've used permanent marker to change those cards to interesting or funny ones over the years, though, which has kept the game being played now that we're all in our thirties!",
    "timestamp": 1421535600
  },
  {
    "username": "Lady_Law",
    "rating": 9.0,
    "comment": "Although rated high because I love it, the game clearly better in some groups than others.",
    "timestamp": 1415055600
  },
  {
    "username": "bancandrei",
    "rating": 9.0,
    "comment": "Great game for \"get to know\" sessions or just having some fun while chilling (no thinking strategic necessary)",
    "timestamp": 1409781600
  },
  {
    "username": "Woger",
    "rating": 9.0,
    "comment": "A good party game to have in your collection. Who knew simple nouns and verbs can cause so much laughter!?",
    "timestamp": 1392591600
  },
  {
    "username": "ErikFrog",
    "rating": 9.0,
    "comment": "Fun, very light party game. If you like words and such, you should give it a try.",
    "timestamp": 1391727600
  },
  {
    "username": "EnvoyPV",
    "rating": 9.0,
    "comment": "Great party game",
    "timestamp": 1388617200
  },
  {
    "username": "Fabiroux",
    "rating": 8.5,
    "comment": "For a light filler game, this can be played endlessly (but best to limit it to 1 or 2 games). While games like Cards Against Humanity do the same and often with more humour, Apples to Apples doesn't leave you questioning your morals afterwards which makes it overall a more satisfying game. Would be better in a smaller box.",
    "timestamp": 1388098800
  },
  {
    "username": "Critical Mass",
    "rating": 9.0,
    "comment": "Family game.\n\nFun fast and light. Good for my family and other non gamers. Lots of laugh out loud moments with unexpected match ups and even funnier when you use the personality analysis at the end of the game.\nCrate edition with expansions 1 and 2.",
    "timestamp": 1378245600
  },
  {
    "username": "KeeperoftheGate",
    "rating": 9.0,
    "comment": "Borderline flawless.",
    "timestamp": 1377295200
  },
  {
    "username": "fajwat",
    "rating": 9.0,
    "comment": "Strictly house rules only! It makes the game like Cards Against Humanity - more fun scoring is either useless or difficult.",
    "timestamp": 1365976800
  },
  {
    "username": "Portland Game Geeks",
    "rating": 9.0,
    "comment": "Great party game. Good for a broad range of ages",
    "timestamp": 1365458400
  },
  {
    "username": "veganjay",
    "rating": 9.0,
    "comment": "This is a good one for non-gamers",
    "timestamp": 1359586800
  },
  {
    "username": "ZettaComposer",
    "rating": 9.0,
    "comment": "Easily the most hilarious game I've ever played. It never gets old.",
    "timestamp": 1358636400
  },
  {
    "username": "ptarmigan61",
    "rating": 9.0,
    "comment": "Always a fun party game. I have not introduced it to anyone who didn't enjoy it.",
    "timestamp": 1356390000
  },
  {
    "username": "way2slo",
    "rating": 9.0,
    "comment": "Great party game.",
    "timestamp": 1351983600
  },
  {
    "username": "Humble Family",
    "rating": 9.0,
    "comment": "I love this game. Great to play with a group of friends.",
    "timestamp": 1346882400
  },
  {
    "username": "Fenriz",
    "rating": 9.0,
    "comment": "This is rated a 6.2? Shame on you geeks for hating on a game just because it's popular. This is one of the few mainstream games that I truly enjoy. Of course, it's a party game, not a gamer's game. Winning isn't even the point, but it's a lot of fun.",
    "timestamp": 1341180000
  },
  {
    "username": "malyta",
    "rating": 9.0,
    "comment": "4-10 so much fun to play! Easy for anyone with a good sense of humor!",
    "timestamp": 1340575200
  },
  {
    "username": "EduArdPc",
    "rating": 8.5,
    "comment": "Divertido cuando lo llevas al nivel absurdo... Ideal para jugar con amigos que llevan una copita de más encima...",
    "timestamp": 1334354400
  },
  {
    "username": "christopher_the_fehn",
    "rating": 9.0,
    "comment": "LOTS of fun playing this with the family.",
    "timestamp": 1331334000
  },
  {
    "username": "VanityMachine",
    "rating": 8.8,
    "comment": "Such an easy and fun game - I've been playing it for years and have only had one person I know freak out in a negative way from how fun it was.",
    "timestamp": 1328914800
  },
  {
    "username": "whexican",
    "rating": 9.0,
    "comment": "Great game to play with kids or adults. Always a crowd-pleaser",
    "timestamp": 1326150000
  },
  {
    "username": "JoshBot",
    "rating": 9.0,
    "comment": "More fun than I would have guessed. Definitely better than most party games. If the options are this or listening to idle, bland gossip, I'll take this. EDIT 12/17/11: For large groups, this is the go-to.",
    "timestamp": 1324076400
  },
  {
    "username": "MoggCatcher",
    "rating": 9.0,
    "comment": "This is a fantastic party game. Great for non-gamers as well",
    "timestamp": 1323990000
  },
  {
    "username": "phatmoti",
    "rating": 9.0,
    "comment": "Great party game. Must be able to read. Other than that there is no minimum age. Works well with non-gamers and gamers alike.",
    "timestamp": 1322866800
  },
  {
    "username": "pimaggot",
    "rating": 9.0,
    "comment": "really fun- you get to know how people think with this game",
    "timestamp": 1322521200
  },
  {
    "username": "seqiro",
    "rating": 9.0,
    "comment": "Great for the family or non-gamers. Less of a game, more of an activity.",
    "timestamp": 1316556000
  },
  {
    "username": "sodacapman",
    "rating": 8.5,
    "comment": "I love to bring this game out when people want something to do. It's simple, EVERYONE can figure out how to play, and there is always something funny happening.\n\nAnd it must be a game that is liked by a lot of people. I know this because my original copy was stolen out of my car. Someone broke in, stole my ipod, and this game. I got a new one",
    "timestamp": 1315864800
  },
  {
    "username": "skudfisher",
    "rating": 8.5,
    "comment": "Great party game! It's so fast to setup and get going even with people who have never played and it always ends up being hilarious.",
    "timestamp": 1312495200
  },
  {
    "username": "AndyVZ",
    "rating": 8.5,
    "comment": "my favorite party game. if you don't enjoy it, you're not doing it right.",
    "timestamp": 1311717600
  },
  {
    "username": "Kabegami",
    "rating": 9.0,
    "comment": "This is the only game that brought my family together. It draws people in because they don't have to do any really hard thinking - they can just choose from their hand of cards. Also, it's easy to pull people into playing because you can just tell them, \"It's ok...just hold these cards\", and then later say, \"Oh look, you get to judge!\" Before you know it, people go from watching to actually playing. I can't help but love Apples to Apples.\n\nA super bonus: Apples to Apples is the game that got me into board gaming!",
    "timestamp": 1309989600
  },
  {
    "username": "Orsino71",
    "rating": 8.5,
    "comment": "Simple, fast, fun and it supports up to 10 players. What more can you ask of a party game? Perfect for, well, parties.",
    "timestamp": 1309644000
  },
  {
    "username": "sun_girl_dog",
    "rating": 9.0,
    "comment": "I have played this a lot. I love to play this as a light game with lots of friends. When we are trying to socialize.",
    "timestamp": 1305410400
  },
  {
    "username": "starshadow",
    "rating": 9.0,
    "comment": "The party game. Perhaps at times overplayed but it always finds its way in to a group gaming session for non-serious gamers",
    "timestamp": 1303596000
  },
  {
    "username": "kwsrv",
    "rating": 8.5,
    "comment": "Fun, easy to learn family game, or party game",
    "timestamp": 1302732000
  },
  {
    "username": "Radien",
    "rating": 9.0,
    "comment": "A surprisingly enjoyable party game that thrives on social energy.",
    "timestamp": 1287784800
  },
  {
    "username": "joords",
    "rating": 9.0,
    "comment": "This. Game. Is. FUN! There is no strategy nor is there any kind of continuity as to which red apple card will be chosen for any given green apple. However, anyone who says this isn't a good game needs to take a serious look in the mirror. Obviously they take themselves too seriously. I mean, who can't love a game where \"Toaster\" is the best descriptor for \"Affluence\" or where \"Girl Scouts\" are \"Easy\"? This will get a LOT of play during future parties. I just cannot say enough good things about this game that causes 13 and 14 year olds to put down the video games, turn off the TV and then BEG to play \"Just once more Dad. Please\". Sure it's not Puerto Rico or Agricola, but for a large group of relative strangers, this is THE game for me! Just like \"THE Dump\" will win every time!",
    "timestamp": 1281996000
  },
  {
    "username": "chrisdk",
    "rating": 9.0,
    "comment": "Lots of fun when played with the right crowd of people. Excellent filler for when you are waiting for the rest of the group to show up or for the other game table to finish up.",
    "timestamp": 1273442400
  },
  {
    "username": "mmastertheone",
    "rating": 9.0,
    "comment": "Apples to Apples tends to be good fun, but you need a crowd who are reasonably comfortable with each other, and who receive half-decent hands.",
    "timestamp": 1271109600
  },
  {
    "username": "onslaught88",
    "rating": 8.5,
    "comment": "fun family game",
    "timestamp": 1269644400
  },
  {
    "username": "arroz2003",
    "rating": 8.5,
    "comment": "One of the greatest party games of all time. Super fun, lots of laughs depending on the crowd.... lame crowd lame game! Humor is the key. Must have for any one at a semi clean party or friendly get together.",
    "timestamp": 1267916400
  },
  {
    "username": "DoomDahDoomDoom",
    "rating": 8.5,
    "comment": "Awesome party game - only outdone by Balderdash, IMO. Pretty simple concept, but what really makes this game is trying to figure out how to play each judge.",
    "timestamp": 1263423600
  },
  {
    "username": "deathtoll2001",
    "rating": 9.0,
    "comment": "Great with more people, like 10+ Still good for 4-5.\n\nAmazing mod: Draw a number of cards (any amount or type you decide on), then make a story out of the cards in your hand. Has nothing to do with win or lose, but had my family in stitches for 2 hours!\n\nMy rating is based on the fact that my family is a great group for this type of game.",
    "timestamp": 1262214000
  },
  {
    "username": "Dingus",
    "rating": 9.0,
    "comment": "Everyone got tired of this before I did. C'mon, someone play it with me. I like the tangential connections you get to defend. Funny.\n\nTwo years later. . . finally got to play again!",
    "timestamp": 1261436400
  },
  {
    "username": "wilwheaton",
    "rating": 8.5,
    "comment": "The original OMG WE HAVE TO PLAY IT AT OUR PARTY game.",
    "timestamp": 1261350000
  },
  {
    "username": "robertmfreeman",
    "rating": 8.5,
    "comment": "Either very fun or very dull, depending on the group you play with. Another game that gets better when drinking. Plenty of the cards are out of date though, in the older sets.",
    "timestamp": 1260313200
  },
  {
    "username": "Scoobysnacks",
    "rating": 9.0,
    "comment": "This is a great party / get together game. Finally a game where I don't have to act or draw a picture.",
    "timestamp": 1256162400
  },
  {
    "username": "rayhosler",
    "rating": 9.0,
    "comment": "Fun party game. Not much to it but anyone can enjoy the concept. Some of the concepts can be dated. Lots of expansions.",
    "timestamp": 1254693600
  },
  {
    "username": "spanky777",
    "rating": 10.0,
    "comment": "I love how random this game is. This game is best played with the right group who's humor you get.",
    "timestamp": 1729288800
  },
  {
    "username": "RedGamr27",
    "rating": 10.0,
    "comment": "One of my favorite games for a party or large group. Family-friendly and great fun.",
    "timestamp": 1704841200
  },
  {
    "username": "JearShad",
    "rating": 10.0,
    "comment": "Nos encanta, lo unico \"malo\" es que nuestra version es en ingles, entonces a ciertas personas eso les dificulta jugar y entender el sentido del juego, pero obviando eso es un super juego!",
    "timestamp": 1686088800
  },
  {
    "username": "SamDanae",
    "rating": 10.0,
    "comment": "Love this party game!",
    "timestamp": 1672095600
  },
  {
    "username": "JESUSisCHRIST",
    "rating": 10.0,
    "comment": "nyh gift to me, 1/2020, ralphs, starbucks, shuffle n cut, la mirada, disc golf\n\n+good social distant game at a park",
    "timestamp": 1663538400
  },
  {
    "username": "Tolkana",
    "rating": 10.0,
    "comment": "18\n\nVäldigt bra partyspel",
    "timestamp": 1661637600
  },
  {
    "username": "Iceberg188",
    "rating": 10.0,
    "comment": "A very crazy and funny game when you have card combinations.",
    "timestamp": 1648249200
  },
  {
    "username": "glbrt007",
    "rating": 9.5,
    "comment": "One of the easiest game to introduce to friends. Even the most casual and uninterested gamers can play this instantly. Requires a good company of friends to play, but when you do, it's a blast.",
    "timestamp": 1615590000
  },
  {
    "username": "ArtfulDodger",
    "rating": 10.0,
    "comment": "Fantastic game, one of our standbys",
    "timestamp": 1609455600
  },
  {
    "username": "WEngwallTroy23",
    "rating": 10.0,
    "comment": "This will ALWAYS get a good laugh out of me. From vicious celebrities to brilliant cockroaches, you always have to think about the combinations. And then you start to laugh. And then you don’t stop. At all.",
    "timestamp": 1599688800
  },
  {
    "username": "dead jawa",
    "rating": 9.5,
    "comment": "Other games that can be played with this:\nCodenames\nMedium",
    "timestamp": 1598220000
  },
  {
    "username": "Derivatus",
    "rating": 10.0,
    "comment": "A great game at doing what it does: bringing a large group of people together in a very short time. Every time I play Apples to Apples, it creates a hearty feeling in the group. Everybody cracks up and it's just fun. However, I recommend playing with one card only, instead of choosing the card you are arguing for: you take one card and one card only and base your arguments on that single card. It speeds up the gameplay even more and can create hilarious situations and creative debates.",
    "timestamp": 1593640800
  },
  {
    "username": "Dinoval",
    "rating": 10.0,
    "comment": "Great fun with friends, awkward with acquaintances. Get a huge group together and it becomes really competitive.",
    "timestamp": 1591308000
  },
  {
    "username": "Otakar",
    "rating": 10.0,
    "comment": "Very fun party game.",
    "timestamp": 1570312800
  },
  {
    "username": "newyear",
    "rating": 10.0,
    "comment": "Way better than Card against humanity. I say give me a challenge. To what length will I go to make something inappropriate. CAH is a shadow to this amazing party game for all ages. Nothing better than being able to play a game with the whole family and get the adults laughing and the kids looking confused but none the wiser. lol",
    "timestamp": 1540767600
  },
  {
    "username": "TheDorkArts",
    "rating": 10.0,
    "comment": "One of the greats.",
    "timestamp": 1521068400
  },
  {
    "username": "kimrich",
    "rating": 10.0,
    "comment": "This game is similar to Cards Against Humanity, but is a family friendly version. I have loads of sealed taster packs for sale and invented my own additional rules for this in order to extend the game play life of the cards. Packs are for sale (including additional rules) at £3.99 each. Customers can buy in bulk for £2.99 per pack (for 10 or more) £1.99 per pack (for 50 or more) or £0.99 per pack (100 or more). Ideal for playing parties (as an ice breaker game), party bags, wedding gift bags, for use as a travel game, or giving as a complimentary gift e.g. as prizes at board game evenings etc. All the packs are the same and have 40 red apple cards, 5 green apple cards and quick play rules.",
    "timestamp": 1506463200
  },
  {
    "username": "RenegaidRob",
    "rating": 10.0,
    "comment": "Great party game and a very good game for the ESL classroom.\n\nGoes great as a drinking game along side Kings cup and other such games with lots of antics.\n\nAnd on the flip side it can be used with middle school and up aged ESL students to help build vocabulary and teach how to use adjectives in English.\n\nI purchased this game way back when it first came out and I think it's been the most consistently played game in our collection every since. However, it's starting to get a bit dated so we've changed a couple of the \"people\" cards to represent a younger audience.",
    "timestamp": 1486162800
  },
  {
    "username": "rebecca toma",
    "rating": 10.0,
    "comment": "you are going to need this game i personally love it!",
    "timestamp": 1475877600
  },
  {
    "username": "ADanks",
    "rating": 9.5,
    "comment": "Apples to Apples is THE perfect icebreaker game, hands down.",
    "timestamp": 1428962400
  },
  {
    "username": "kowaiyoukai",
    "rating": 10.0,
    "comment": "The best party game ever!! So much fun, simple rules, and everybody gets a chance to decide what card wins. Can be played seriously, for laughs/groans, for worst correlations imaginable, for fandom fun (ALWAYS PICK BATMAN), and more. Highly rec'd!",
    "timestamp": 1420498800
  },
  {
    "username": "Obistahr",
    "rating": 10.0,
    "comment": "Anyone can play. Everyone has an opinion. And correct is in the eye of the beholder. Reason can be left at the door.",
    "timestamp": 1405893600
  },
  {
    "username": "ranapuer",
    "rating": 10.0,
    "comment": "Don't listen to the haters. In some ways, this is the best game of all time. This is the perfect game for non-gamers, and if you bring the right cards and the right attitude, even a Eurogamer, Wargamer, or Ameritrash enthusiast can enjoy this. You have to accept that you can't control your fate; the winner is 99% random, but deciding which card to play for each round is hilarious and fun. This game should be a part of anyone's collection.\n\nfull review: http://boardgamegeek.com/thread/885394/dont-listen-to-the-ha...\n\n#1 on personal list \"Top 10 games for a new gamer to own\"",
    "timestamp": 1375048800
  },
  {
    "username": "Uberaris",
    "rating": 10.0,
    "comment": "If you have 5+ friends over, want something fun to do, you will play this game and have fun laughing like a maniac.",
    "timestamp": 1357858800
  },
  {
    "username": "wizardoest",
    "rating": 10.0,
    "comment": "Brillant. Great \"get to know you\" game or as something with a low bar for folks who usually don't board game.",
    "timestamp": 1355698800
  },
  {
    "username": "elorac",
    "rating": 9.5,
    "comment": "Great party game - simple rules, quick to play, lots of laughs.\n\nPity blank cards aren't easier to come by though!",
    "timestamp": 1350338400
  },
  {
    "username": "rincewind76",
    "rating": 9.5,
    "comment": "Simple, fun, almost anyone can learn it!",
    "timestamp": 1348696800
  },
  {
    "username": "rickhatch",
    "rating": 10.0,
    "comment": "A+\nWins: 1+?/12, 0/1",
    "timestamp": 1337983200
  },
  {
    "username": "ltkessler",
    "rating": 10.0,
    "comment": "There are fewer games that have given me this much fun. If I could wave a wand and replace every copy of Monopoly with this game, I would and the world would thank me.",
    "timestamp": 1335132000
  },
  {
    "username": "ragudaddy",
    "rating": 10.0,
    "comment": "This game is almost the entire reason we hold game nights at the house. Add a little hooch and the fun increases 10-fold",
    "timestamp": 1322780400
  },
  {
    "username": "Gallo22",
    "rating": 9.5,
    "comment": "Also own expansion Set #1",
    "timestamp": 1321225200
  },
  {
    "username": "klurejr",
    "rating": 10.0,
    "comment": "One of the best party games I have ever played. My father is not into games at all, but I got him to play this on a family vacation and i was able to see a whole new side to him I never knew. It was great!",
    "timestamp": 1312408800
  },
  {
    "username": "Shamurai",
    "rating": 10.0,
    "comment": "Always fun and works well with large groups, even if they don't know each other well.",
    "timestamp": 1311112800
  },
  {
    "username": "hubrisseven",
    "rating": 10.0,
    "comment": "Best party game ever, anyone says any different is a Terrorist. -H7",
    "timestamp": 1310421600
  },
  {
    "username": "MordosHawk",
    "rating": 10.0,
    "comment": "Have the right friends. This game is funny as hell.",
    "timestamp": 1305324000
  },
  {
    "username": "relbot",
    "rating": 10.0,
    "comment": "My rating is based on intended use - as a party game. For strategy there are many games I prefer but for the an interactive party environment with a zillion players, this one is excellent.",
    "timestamp": 1299452400
  },
  {
    "username": "Davetheman",
    "rating": 10.0,
    "comment": "I've played this over and over with various groups of adults and youth, even children. It is ALWAYS a big hit. Everyone loves this game and it is extremely easy to play.",
    "timestamp": 1294095600
  },
  {
    "username": "sweetooth84",
    "rating": 10.0,
    "comment": "I had so much fun playing this game that I had to buy the expansion pack. I'm pretty sure they just came out with another expansion pack on top of that, I'll prob end up grabbing that one too. Most fun?=the blank cards!",
    "timestamp": 1289775600
  },
  {
    "username": "rongleeakqzed",
    "rating": 10.0,
    "comment": "Great Game. Highly recommended that you grab the expansions if you want a high replay value after four or five plays.",
    "timestamp": 1289170800
  },
  {
    "username": "Smilingsalad",
    "rating": 10.0,
    "comment": "This game so far is the only game that if I set it out somebody will pull me to the side and ask to play it.",
    "timestamp": 1287007200
  },
  {
    "username": "Kingchaosxl",
    "rating": 9.8,
    "comment": "Amazing Party Game",
    "timestamp": 1274824800
  },
  {
    "username": "flycat",
    "rating": 10.0,
    "comment": "Great for a large group of non-gamers. Everyone can get into it.",
    "timestamp": 1249682400
  },
  {
    "username": "PopeBrain",
    "rating": 10.0,
    "comment": "(25+ plays)\n\nWho can play? Party game for 3-many players.\n\nThis game just gets played again and again and again. Up and running in 3 minutes, even with new players - and everyone always likes it. We always play more than one game, and there's always laughing. Laughing is good.",
    "timestamp": 1242597600
  },
  {
    "username": "livvyB",
    "rating": 10.0,
    "comment": "I love this game. It is so fun.",
    "timestamp": 1227394800
  },
  {
    "username": "ndirksen",
    "rating": 10.0,
    "comment": "Best card game ever",
    "timestamp": 1200610800
  },
  {
    "username": "SamLL",
    "rating": 10.0,
    "comment": "I've had hours and hours of fun out of this game at parties, with my whole extended family, and even with at a Christmas party with the CEO of my company. Usually very funny, and there's even some psychology and strategy in predicting what card will be picked.",
    "timestamp": 1200006000
  },
  {
    "username": "thewayofeeyore",
    "rating": 10.0,
    "comment": "Fast taught and fun game for almost anyone who can read.",
    "timestamp": 1196118000
  },
  {
    "username": "bamzilla",
    "rating": 10.0,
    "comment": "Great party game for 5+ people. 4+ is alright, just a smaller \"pool\" to choose from.",
    "timestamp": 1195513200
  },
  {
    "username": "LittleMisfit",
    "rating": 10.0,
    "comment": "Apples to Apples is the ultimate party game. It's one of those rare games I can play over and over and never get tired of it. I've played the game with at least 50 different people and I have yet to meet a single person that doesn't like the game.\n\nThe game is hilarious, fast paced, and takes only 30 seconds to learn. If your group doesn't enjoy this game, you're either playing it wrong, or you're borderline comatose.",
    "timestamp": 1194649200
  },
  {
    "username": "csniezek",
    "rating": 10.0,
    "comment": "I've played this game with lots of people, some of whom are game geeks, and some who don't really care for games. Those who tend to dislike it most are the super-competitive hardcore types; they don't appreciate that the scoring is completely subjective. But I for one have laughed more playing this game than any other game I've ever encountered...",
    "timestamp": 1193698800
  },
  {
    "username": "mrtomsmith",
    "rating": 10.0,
    "comment": "Best party game evah.",
    "timestamp": 1189461600
  },
  {
    "username": "ChrisGordon",
    "rating": 10.0,
    "comment": "Love this game!",
    "timestamp": 1185660000
  },
  {
    "username": "bdeuel",
    "rating": 10.0,
    "comment": "best partygame ever",
    "timestamp": 1181253600
  },
  {
    "username": "Harley22",
    "rating": 10.0,
    "comment": "like it heaps",
    "timestamp": 1179007200
  },
  {
    "username": "real_supergirl",
    "rating": 10.0,
    "comment": "Maybe the best party game ever. I've played it with pre-adolescents, with my parents, and with everyone in between.",
    "timestamp": 1174345200
  },
  {
    "username": "Jokin",
    "rating": 10.0,
    "comment": "This is the perfect party game, but don´t try to play it seriously. If you wanna play a serious game, full of strategy and mind-breaking, don´t ever try this one.",
    "timestamp": 1167951600
  },
  {
    "username": "pbleadfoot",
    "rating": 10.0,
    "comment": "I have gotten dyed in the wool \"I don't play games\" people to play this and have fun.The game can also be modified to work with younger children by chooing the red (or noun) cards before the green (adjective) card is exposed. You'll be surprised at how many times appropriate matches come up.",
    "timestamp": 1167778800
  },
  {
    "username": "Taynas",
    "rating": 9.5,
    "comment": "an excellent party game. Not full of strategy at all but more full of oppertunities for uproarious laughter. Reconmended to all word lovers.",
    "timestamp": 1164582000
  },
  {
    "username": "Miss Panda",
    "rating": 10.0,
    "comment": "This is the way to drum up business. Jimmy and I walked into the Game Wizards and were invited into the game. I fell in love with it and Jimmy bought it for me right there. Most times they act like we're interupting them so we'll buy from RC Hobbies at a discount, their loss.\n*Destroyed in flood of 06.\n**Jimmy gave me a new game on Sweetest Day 06 to replace the ruined one.",
    "timestamp": 1161468000
  },
  {
    "username": "D1ng0",
    "rating": 9.9,
    "comment": "THE quintessentiol party game, Play by the rules or not, best if you have an amazing sense of humor, or are Slap happy and tired!",
    "timestamp": 1158184800
  },
  {
    "username": "tyoda",
    "rating": 10.0,
    "comment": "Ideal icebreaker for a party",
    "timestamp": 1140303600
  },
  {
    "username": "cweez",
    "rating": 10.0,
    "comment": "I thouroughly enjoy playing this game as it comprises great entertainment values and some elements of thought. Would recommend.",
    "timestamp": 1138316400
  },
  {
    "username": "Spannerj Jon",
    "rating": 10.0,
    "comment": "ditto!",
    "timestamp": 1135033200
  },
  {
    "username": "MarkEJohnson",
    "rating": 10.0,
    "comment": "Some people have reported this to sometimes be unfun, even a little argumentative, but that's baffling to me. We've always had hilarious fun. Also with the Junior set for kids.",
    "timestamp": 1133391600
  },
  {
    "username": "JoltedKev",
    "rating": 10.0,
    "comment": "Extremely easy game to teach people of different skill levels. Always a laugh. My highest recommendation for party games.",
    "timestamp": 1111100400
  },
  {
    "username": "janiera",
    "rating": 9.5,
    "comment": "Have the Apple Crate Edition, which includes the first two expansions. Love the game. Taught members of my family to play, and now they want to buy it. All of them are non-gamers.",
    "timestamp": 1094162400
  },
  {
    "username": "dalloftheabove",
    "rating": 10.0,
    "comment": "I play this game more then any two other games put together. Fun, speedy, delightful in a mixed audience of non-gamers. Repeditive with frequent play unless you add the expansions.",
    "timestamp": 1088546400
  },
  {
    "username": "HellHound",
    "rating": 10.0,
    "comment": "LOVE this game",
    "timestamp": 1088546400
  },
  {
    "username": "hooligan1",
    "rating": 10.0,
    "comment": "What an absolutely fabulous game. I've rarely had so much fun......",
    "timestamp": 1082584800
  },
  {
    "username": "jsciv",
    "rating": 10.0,
    "comment": "One of the greatest easy-to-play group games of the past decade. Easy to learn, and fun to play!!!",
    "timestamp": 1081461600
  },
  {
    "username": "Midian2000",
    "rating": 10.0,
    "comment": "Let's put it this way: Every single person I've EVER played this with bought it for themselves within 24 hours. That's saying something...",
    "timestamp": 1077318000
  },
  {
    "username": "mosstron",
    "rating": 10.0,
    "comment": "This game Rocks, hillarious Party game!",
    "timestamp": 1066600800
  },
  {
    "username": "jomblo69",
    "rating": 10.0,
    "comment": "Awesome party game that gets everyone going, not very replayable though -- I must need the expansions.",
    "timestamp": 1064181600
  },
  {
    "username": "toomanyminis",
    "rating": 10.0,
    "comment": "Great game for non-gamers. Not a lot of strategy, but a lot of conversation. Non-threatening and interactive.",
    "timestamp": 1061330400
  },
  {
    "username": "Mommica",
    "rating": 10.0,
    "comment": "I give this a ten because it is so easy to learn and it's never too late in the evening because it requires such little thinking.",
    "timestamp": 1053640800
  },
  {
    "username": "TommyTutone",
    "rating": 10.0,
    "comment": "Loved by the family and is always requested at family functions.",
    "timestamp": 1053295200
  },
  {
    "username": "viperxo",
    "rating": 10.0,
    "comment": "great party game",
    "timestamp": 1052690400
  },
  {
    "username": "chameleon",
    "rating": 10.0,
    "comment": "I love this game! We play it every time. Easy to learn, lot of laughs.",
    "timestamp": 1036623600
  },
  {
    "username": "TMAN245",
    "rating": 10.0,
    "comment": "A great party game!",
    "timestamp": 1012258800
  },
  {
    "username": "RobRose",
    "rating": 10.0,
    "comment": "We play with more people than recommended. Well though out, simplistic idea for a game. We need to find more blank cards! There are so many people and things (ideas) we want to ridicule!!",
    "timestamp": 1007766000
  }
]