[
  {
    "username": "darknight74",
    "rating": 1.0,
    "comment": "One of the worst games I ever played.\nOver complicated rules, lack of help sheets, too much unbalanced over luck.\nBasically roll dice, hope for the best and move hoping to do the worst damage you can do.\nA big mess.\nAvoid",
    "timestamp": 1665784800
  },
  {
    "username": "Danjell",
    "rating": 2.0,
    "comment": "I really want to like this but I just can't. The Command Point roll is way too much of a deciding factor. Over-ruled and with no real way of planning ahead. Weapons are allocated randomly and at equal cost and you might end up with a spray can or with a missile defence lazer. Guess which one is better...\n\nAdd complete random unit recruitment and utterly unbalanced cards to the mix and you've got yourself this disaster of a game. Play Neuroshima Hex instead.\n\nBiggest let-down since the Judge Dredd movie. And that's something.",
    "timestamp": 1274997600
  },
  {
    "username": "Albarc",
    "rating": 3.0,
    "comment": "Traded\nI got this game many years ago together with the expansion. I played it a couple of times then, but later I have not been able to re-read and deal with the fiddly rules and I decided to trade it away.",
    "timestamp": 1568239200
  },
  {
    "username": "whovian223",
    "rating": 4.0,
    "comment": "I don't remember much about my play of this as it was 6-7 years ago, but I do remember that I didn't have any fun with it.",
    "timestamp": 1633384800
  },
  {
    "username": "Sternenfahrer-MUC",
    "rating": 5.0,
    "comment": "ES, pretty, cool combat game in a weird scenario",
    "timestamp": 1495144800
  },
  {
    "username": "MattDP",
    "rating": 5.0,
    "comment": "3 / 5 - Good\n\nEntertaining, but ultimately chaotic light wargame. You'll need to like 2000ad (and not mind lots of dice) to enjoy this. See my review for mre details: http://www.boardgamegeek.com/thread/82495",
    "timestamp": 1380232800
  },
  {
    "username": "GastonLagaffe",
    "rating": 6.0,
    "comment": "sell",
    "timestamp": 1752789600
  },
  {
    "username": "Cucumbertronic",
    "rating": 6.0,
    "comment": "KSA",
    "timestamp": 1720389600
  },
  {
    "username": "jvincentp",
    "rating": 7.0,
    "comment": "A bit complex for what it is, but a good time nonetheless, especially if you're familiar with the Judge Dredd lore and story it's based on. Lots of fun mayhem!",
    "timestamp": 1694988000
  },
  {
    "username": "Yokiboy",
    "rating": 8.0,
    "comment": "My rose tinted glasses are firmly in place when playing this game. I have so much nostalgia for it, and other similar games of my childhood (such as Talisman). All that on top of my love for the theme!\n\nThe game is long, the rules are easy to read, but not the best reference, and the game is full of thematic chrome. That said, I still have a blast playing the game, even though it was a game made for another generation, for 1980's teens with unlimited play time.\n\nPlayer Turns:\n54 cards total, a set number is removed based on the number of players, and each player starts with a hand size of 3 cards.\n2 Players: 54-16-6=32, and 32/2=16 turns per player\n3 Players: 54-12-9=33, and 33/3=11 turns per player\n4 Players: 54-6-12=36, and 36/4=9 turns per player\n\nHouse Rules:\n1) Roll 3d6 and use the highest, and lowest results for your Command Points. For more action, roll 3d6, and use the two highest dice results for your CP. The best option may be to give every player 12 CP per turn, and just have games end in a quick storm of violence!\n2) Allow an active Blocker to switch Armory, and Hardware tokens with another Blocker for 1 Movement Point, this may also be used simply to give a Token to another Blocker.",
    "timestamp": 1749074400
  },
  {
    "username": "White348",
    "rating": 9.0,
    "comment": "Like a Mordillo cartoon bought to life with the anticipation of jenga like collapses of your blocks!",
    "timestamp": 1736809200
  },
  {
    "username": "rob_vz",
    "rating": 10.0,
    "comment": "Highest rating in reverence to 2000AD comics, 1980's Games Workshop board games, being 12-years old and becoming an adult board game maker 25 years later.\n21st-century board game rating is closer to 6.5 as the game is fiddly - fire/collapse book-keeping is a mini-game in itself.\nI still dream of an alternative reality where the game includes the original Mike McMahon and Ron Smith art from the comic series and a modern board game designer has given it a rethink. Alas, the game rights holders are not that imaginative, as shown in the recent, unchanged after 35-years,reprint. But still a classic for those don't have a musty dog-eared\n80s copy!",
    "timestamp": 1758232800
  }
]