[
  {
    "username": "AMI_SOLGER",
    "rating": 1.0,
    "comment": "Not for me",
    "timestamp": 1733698800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "My first 18xx, and admittedly some of that hump was just figuring out what to do with no teaching. But also in hindsight it's a flawed arc where the goal is to have a debt-ridden company that gets converted into national shares. So it's just an extra step of work to get to the profit, while being more convoluted?",
    "timestamp": 1720994400
  },
  {
    "username": "flyboy16",
    "rating": 1.0,
    "comment": "Just doesn't seem to be worth learning that many rules to argue with your friends.",
    "timestamp": 1274220000
  },
  {
    "username": "Tom Lehmann",
    "rating": 1.5,
    "comment": "A game that seems pretty decent initially, but don't look behind the curtain: not only is the game badly designed, but it's actually broken with more than four players.\n\nI strongly believe strategy games are about interesting decisions. 1856 presents players with a plethora of false decisions: Should you take loans for your first company? Hell, yes, snort them for as much as you can. Doing anything else is just silly. Should you invest in other companies initially? Hell, no, that's just solving their initial cash flow problems -- what do you think this is, a stock investing game? Should you withhold dividends or try to pay off your loans? Are you crazy, man? Your first company is just to buy in your privates, pay out dividends, set up your second \"real\" company, and be tossed into the national RR. Should you hold on to expensive stock? No way, man, the stock track is linear, so as long as a company looks to be someone's real one, dump your high priced stock and buy more shares of the cheaper, real companies. And so on...\n\nAnd, in 5+ player games, when everyone does this, then there aren't enough national RR shares to go around, so then the game devolves into hot potato and a 2 hour stock round as everyone tries to wiggle out of being the player who fails to get all his shares redeemed when the national RR forms (as that player is guaranteed last place).\n\nThere are far, far better 18xx games out there, such as 1830, 1861, 1826, or 1841 (first edition). 1856 is ok, if you are just learning how to play 18xx, but that's it. Once you truly figure it out (and play with other competitive players who have done the same), the game becomes far less interesting. I would give it a 4, except for being broken with 5+ experienced players.\n\n(Full Disclosure: I have designed some 18xx games, none of which I mentioned above.)",
    "timestamp": 1266102000
  },
  {
    "username": "prkl",
    "rating": 2.0,
    "comment": "We had a 10 hour game of this. In my opinion it's too long and unbalanced. I like the game mechanics though so another 18xx might be better.",
    "timestamp": 1258844400
  },
  {
    "username": "BrettK",
    "rating": 2.0,
    "comment": "See my comments about 1830.",
    "timestamp": 1162422000
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "After repeated plays, I am rather unimpressed.",
    "timestamp": 1691964000
  },
  {
    "username": "saccenti",
    "rating": 3.0,
    "comment": "This is just a mess. Given it two tries so far, and not saying I won't ever again, but...\n\nI'm getting to a place as I type this right now where I'm settling on my personal tastes in 18xx games, and...\n\nI think I really dislike Bill Dixon designs. Just layers and layers of extra stuff for no extra fun and tons of extra playtime. Yuck. This and 1870 have their fans, but not me!",
    "timestamp": 1681077600
  },
  {
    "username": "coxy_fc",
    "rating": 3.0,
    "comment": "6-7 hrs of mind blowing tedium for me and there are other games I'd prefer to spend the time on. I don't mind 18xx at around 3hrs, but this one was way too long for what you get and the winner was obvious after an hour or so. For the time spent I want more depth and variety than this! And it took up my whole Saturday gameday which was never repayed, one of those things I dislike!",
    "timestamp": 1630965600
  },
  {
    "username": "seepieceeggshell",
    "rating": 4.0,
    "comment": "Too long and the national isn't really interesting enough. 1836jr preferred for this ruleset.",
    "timestamp": 1672095600
  },
  {
    "username": "Pandorzecza",
    "rating": 4.0,
    "comment": "Not my theme",
    "timestamp": 1644102000
  },
  {
    "username": "discoking7",
    "rating": 4.0,
    "comment": "I might play this once more...but there's no hurry.",
    "timestamp": 1512169200
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Need to play on table. May create big moments.\n\nVery long ending if no player bankruptcy. The merger is an insane mess with a high player count, very difficult to not get hurt or time that scrap heap. 1856 has forced scripting:\n1. Open a company, accept as many loans as possible whilst running for whatever you can scrape and paying maximum dividends\n2. DO NOT cross invest as you only help others finance their trains\n3. Open a second company, if possible finance a train with your first company, loot the first AND/OR get it building nice routes for #2\n4.IF you can, prepare for the merger->if permanent trains are heading into the CGR then you will want many shares in it. Buy rubbish company shares watching out for dumps.\n\nSecond play->5p game and the timing of the merger was unbelievably chaotic. Got absolutely screwed by turn order. Ugh.\nInitial rating on one play. The game has a very different focus to others I've tried. Game#1 ended in player bankruptcy post National but before it could run.",
    "timestamp": 1751493600
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "I'm not a fan of XX games.",
    "timestamp": 1731279600
  },
  {
    "username": "Victoria_hermit",
    "rating": 5.0,
    "comment": "18xx over 5 hours.",
    "timestamp": 1670972400
  },
  {
    "username": "pickboy87",
    "rating": 5.0,
    "comment": "Edit: Reflecting back on these 18xx, I realize I was probably way too harsh for most of them. I need to play this again to really evaluate my thoughts on it, especially years after playing. I think it's most likely the group I was playing with souring the experience more than it was the actual game. I do have a couple 18xx I don't care for, but most are likely a 6 or better.\n\nThis one is an interesting one. I'm not sure how much I liked the end game of this one since it just seemed to be who could run the longest D train which just felt really long. I did however like the loans and the companies merging into the large Canadian company was fun. I didn't know exactly how it worked, nor did I understand the loans fully till it was too late, but I enjoyed the game well enough.\n\nI feel like there are much better 18xx games that take around 4-5 hours. This one was rather relaxing, but it just felt about an hour too long.",
    "timestamp": 1595109600
  },
  {
    "username": "lamaros",
    "rating": 4.5,
    "comment": "I find this one turns a bit too much on timing, and the play is not as dynamic game to game as my preference.\n\nI still enjoy it though.",
    "timestamp": 1583103600
  },
  {
    "username": "johnwong882",
    "rating": 5.0,
    "comment": "@",
    "timestamp": 1570312800
  },
  {
    "username": "Jclancy15",
    "rating": 6.0,
    "comment": "I am horrible at this game.",
    "timestamp": 1756332000
  },
  {
    "username": "arehb",
    "rating": 6.0,
    "comment": "It's very fun and engaging until the group gets skilled enough and realise there really is only one viable path to victory - Plunder the first company and fold it into CGR, and start a second company with high stock value later. From that point on the game has a quite limited strategic space and there are more interesting 18XX games to play.",
    "timestamp": 1749852000
  },
  {
    "username": "Lowengrin",
    "rating": 6.0,
    "comment": "1856 is a cousin to 1830: Railways & Robber Barons, but adds to it incremental capitalization, company loans and a government railway. The loans and the Canadian Government Railways encourage debt financing; any public company that can't pay back its debt is nationalized and it's assets are given over to the CGR. It's a bit counter-intuitive, but piling debt on your company (or companies) appears to be a good thing in this game as the government will bail players out. There is some cost as the shares of the debt-ridden company are redeemed two of one with the GCR. But on the plus side, a company can pay out dividends round after round without worrying about ever having to save money to buy a permanent train. All in all, an interesting older title, but not one that I would ever suggest playing.",
    "timestamp": 1740697200
  },
  {
    "username": "larienna",
    "rating": 6.0,
    "comment": "In overall, it has a lot of interesting mechanics but it's a bit too long to play and it has some downtime.\n\nI like the fact that plays in multiple phases which are played differently and that events triggers these changes of phases. This is how you can screw people over.\n\nThe other thing I like is that you can try to convince other player to invest in your company.\n\nI think the problem that I see with this game is that there is a lot of unjustified exceptions and restrictions that they could have been removed to make the game simpler. Ex: restricting the number of certificates you can have, the number of train per company, etc.\n\nI like the fact that after the middle of the game, the stock market part of the game should be more important but the problem is that even after going through half the game, many companies did not sold all their stock yet. So you get situations where 4 companies out of 6 have their share value below their starting cost. So buying these shares mean losing money. So if all the shares could get sold out faster, there would have been more buying and selling afterward.\n\nI also don't like the fact that the number of trains reduce by increasing level. Having like 5 trains of each type would have been OK. Since the new trains are disappearing faster than the old trains, since there are less of each, you never have the time to truly benefit from them. So you always end up having an hard time running your company because you lose trains and end-up not making money.\n\nThe tile placement is OK, it's just weird that you don't pay for the tracks. In fact you are just spending time.\n\nI also don't like the fact that later in the game, you play much more company operation rounds than share buying. Why add an exception. Eventually, there will be no shares available and this phase will get shorter. No need to do it artificially.\n\nThe learning curve is like chess: the few first time you play, you always try to make the best move every turn. But you don't know any strategic moves until you become and expert.",
    "timestamp": 1619560800
  },
  {
    "username": "krisclark0",
    "rating": 6.0,
    "comment": "Online 4 & 5 players. Rated lower than a lot of other 18xx games as the loans and formation of the Canadian Government Railway adds a level of complication and uncertainty to all but the most experienced. Also share price order is important at this stage so can result in a lot of share dealing with more players and is an arduous process made worse if you're a bystander.",
    "timestamp": 1597269600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "The whole government loan thing is a major twist, and one I didn't effectively manage as other players did. Made like this one less, as there felt like a “right way” to play.",
    "timestamp": 1596146400
  },
  {
    "username": "SteffenBarth",
    "rating": 7.0,
    "comment": "Did not get my head around this one yet and I am not sure if nowadays games are more elegant and these old games miss something of that",
    "timestamp": 1724364000
  },
  {
    "username": "peregrinus_lex",
    "rating": 7.3,
    "comment": "Only a couple of plays, maybe 3.",
    "timestamp": 1722981600
  },
  {
    "username": "SigsPerry",
    "rating": 7.0,
    "comment": "Still looking forward to my first full game",
    "timestamp": 1721253600
  },
  {
    "username": "Gomez",
    "rating": 7.5,
    "comment": "I love these sorts of games although I admit I'm not very good at them. One day it will all click, I hope!",
    "timestamp": 1743030000
  },
  {
    "username": "ts0ng",
    "rating": 8.0,
    "comment": "I hold this and other 18xx’s in high regard but the central question I had going into this one was, “when should I take loans?” I’m disappointed that the answer seems to be “as often as possible”. In truth among other 18xx’s I am less interested in revisiting this one, but I probably would play this before other games I’d rated a 7 if given the opportunity. Bumping to an 8, with all the above kept in mind.",
    "timestamp": 1740524400
  },
  {
    "username": "W1LDH0R53",
    "rating": 8.0,
    "comment": "11 Bills Sleeves",
    "timestamp": 1738969200
  },
  {
    "username": "andycted",
    "rating": 8.9,
    "comment": "After three plays, we got to call it in 3.5h-4h max and every time it was worth it even if we couldn't break the bank.\nOne of my favourite 18xx",
    "timestamp": 1758924000
  },
  {
    "username": "axsk",
    "rating": 8.8,
    "comment": "18xx\nyounger brother of 1870 slightly higher rated by my buddies\nsupposedly quite financial (1817, 41 like?)\n\nnote that this is the dixon without the price protection",
    "timestamp": 1750802400
  },
  {
    "username": "Glanzmuecke",
    "rating": 9.0,
    "comment": "I have not managed to win a single game, but I am in love with the games of Bill Dixon, which have to be played much more nowdays! We are missing the different cap.types, the loans, the price protection (1870), the systems (1832). So much innovation, so much strategy, so much pain.",
    "timestamp": 1749333600
  },
  {
    "username": "MysteryDough",
    "rating": 10.0,
    "comment": "My favorite 18xx.",
    "timestamp": 1712268000
  },
  {
    "username": "rivo",
    "rating": 9.5,
    "comment": "Played the full game twice now. It's a great variant of 1830, but it tends to be on the long side. Last time it took more then ten hours after reading the rules. Therefore I lowered the rating by 0.5 point. Maybe we try again but with a limited amount of money for the bank.\n\nAlso played the short introduction once. Which was a good game to get my two sons (7 and 8 years) familiar with the company actions during an operationg round. It's a great way of learning the game.",
    "timestamp": 1698879600
  },
  {
    "username": "rcog",
    "rating": 9.5,
    "comment": "Get loans, transfer assets over, abuse nationalization. One of my top 18XX.",
    "timestamp": 1671058800
  }
]