[
  {
    "username": "Normal_st",
    "rating": 1.0,
    "comment": "One of the worst game experience I've had, and I'm writing it on first round knowing I need to play 2 more rounds in this terrible game.\n\nPlayed 4th edition.\n\nNone of your actions matter, any player can f up your game, and you can't do anything. One of the worst rules I've heard, very non-intuative. Terrible game, absolutely not recommended for everyone, even if you like the theme, because this have almost none, it's an abstract game.",
    "timestamp": 1758751200
  },
  {
    "username": "GaiaHero",
    "rating": 1.0,
    "comment": "Bad idea",
    "timestamp": 1624744800
  },
  {
    "username": "Nomorepiratedgame",
    "rating": 1.0,
    "comment": "For working with Yoka, a company known for its plagiarism of Bang!",
    "timestamp": 1564092000
  },
  {
    "username": "Blake the Flake",
    "rating": 1.0,
    "comment": "Die Macher (English third edition) (2006)",
    "timestamp": 1453417200
  },
  {
    "username": "hsh1417",
    "rating": 1.0,
    "comment": "너무 오래되고 너무나 긴게임kps",
    "timestamp": 1447542000
  },
  {
    "username": "Maaartin",
    "rating": 1.0,
    "comment": "I don't mind long-taking games, but this one is just terrible.",
    "timestamp": 1321657200
  },
  {
    "username": "Ozme52",
    "rating": 1.0,
    "comment": "Grr - Maybe again if I get to peruse the rules.",
    "timestamp": 1314223200
  },
  {
    "username": "dacoutts",
    "rating": 1.0,
    "comment": "Way too long for what it is, and no amount of skill can make up for being excluded from player deals",
    "timestamp": 1223676000
  },
  {
    "username": "The Doctor",
    "rating": 1.0,
    "comment": "Dull, tedious political adult game that goes on WAYYYYYYYYYYY TOO LOOOOOONNG.",
    "timestamp": 1194735600
  },
  {
    "username": "overseer",
    "rating": 1.0,
    "comment": "In spite of its simple design, and being an \"open system\" game, it bores me to death... and having all the time it takes in my hands, I would ceartinly choose any other game or activity.",
    "timestamp": 1187906400
  },
  {
    "username": "doosapil",
    "rating": 2.0,
    "comment": "disorganized game, untidy",
    "timestamp": 1716674400
  },
  {
    "username": "orange",
    "rating": 2.0,
    "comment": "It takes more than an hour to explain the rules, if you survive that and have five more hours you may enjoy this complex game, but only if you don't mind the considerable luck element in a gamer's game. One lucky card after five hours of play can win or lose the game for you. Luck certainly has some role in real elections as well. I think this is one of the most overrated games on BGG.\nHighest rated game on BGG from the year 1986.",
    "timestamp": 1547852400
  },
  {
    "username": "NoxMortem",
    "rating": 2.0,
    "comment": "Update 11.11.18 to 2: Was cool while it lasted, and a unique experience but is ridiculously long and annoying in many regards.",
    "timestamp": 1541890800
  },
  {
    "username": "marliv",
    "rating": 2.0,
    "comment": "Unnecessarily complex rules for not so complex game with a lot of cards. Game is way overrated(33) and overweighted (4.4).",
    "timestamp": 1302991200
  },
  {
    "username": "ZiggyZambo",
    "rating": 2.0,
    "comment": "After 1 Play: Quite a let-down for me. I didn't think it was nearly as 'heavy' as people say. There is far too much luck here for a game of this length: Dice rolling, card drawing, investing in areas with a mostly unknown payoff, and being forced to bid on face-down cards of wildly varying usefulness. Any of these factors (except bidding for face-down cards) would be fine in a shorter game, but I'm not going to invest an entire day into a game only to have my chances shattered by a single card draw. I think the high rating is due in large part to the legendary status this game acquired while out of print.",
    "timestamp": 1300316400
  },
  {
    "username": "dyfrgi",
    "rating": 2.0,
    "comment": "Wow. Why do people like this? Way, way way too much luck, especially for such a long game - but even at half the length, still awful. I would never play this again.",
    "timestamp": 1216072800
  },
  {
    "username": "Orph",
    "rating": 2.0,
    "comment": "A very complicated game the first time through. There's alot to keep track of, so it's hard to come up with a good strategy your first time. Well, for me at least. This game feels more like an exercise in bookkeeping. I keep hearing the same comments made about this game, \"It takes a bunch of plays before you really understand the strategy\". I don't want to sit through a painfully dull 4+ hour game several times before I even have an inkling of the strategy. I'd rather eat a thumbtack.",
    "timestamp": 1196809200
  },
  {
    "username": "rgscherf",
    "rating": 2.0,
    "comment": "Not at all interesting.",
    "timestamp": 1181944800
  },
  {
    "username": "singingdragon",
    "rating": 2.0,
    "comment": "This game is far too random for the amount of time and effort it takes to play it.",
    "timestamp": 1175119200
  },
  {
    "username": "Komodo",
    "rating": 2.0,
    "comment": "Very tedious and NOT fun! It looks good and I am sure that there is a game in there somewhere, but this is DEFINATELY not for me. Most likely it is the theme which is the big turn off.",
    "timestamp": 1143068400
  },
  {
    "username": "gkizilis",
    "rating": 3.0,
    "comment": "dry and boring",
    "timestamp": 1731452400
  },
  {
    "username": "codinh",
    "rating": 3.0,
    "comment": "The randomness is unbearable, even worse than the randomest ameritrash. It's ok to have player interaction, it's less ok if your scoring decreases by a factor of 3 or 4 in a single round, without having any possibility of controlling it. Avoid at all cost if you want to have a sane game experience. There are better and more modern alternatives.",
    "timestamp": 1634853600
  },
  {
    "username": "KubaP",
    "rating": 3.0,
    "comment": "Well, it's REALLY chaotic and barely controllable if at all. Mixes the complexity of Dominant Species with the negotiations-caused chaos of A Game of Thrones. Not sure if it is actually a good mix.",
    "timestamp": 1628373600
  },
  {
    "username": "MrBigUK",
    "rating": 3.0,
    "comment": "I wish I could see what the fuss is about. It's ok. Probably the best political election boardgame I've played but this fact only reveals the abysmal quality of political boardgames rather than the quality of this one. (NB Unless you count Kremlin as an election game in which case this is a far second best).",
    "timestamp": 1626645600
  },
  {
    "username": "thf2",
    "rating": 3.0,
    "comment": "Abstract representations of German politics -- so abstract that it has very little sense of politics at all. (If everyone pours in resources into a single state, it just means that that state has more points to give out, when the results should be zero-sum.) Graphic design of pieces is poor. Played it once in 2008 and it never made it to the table again and I don’t regret that for a second.",
    "timestamp": 1614380400
  },
  {
    "username": "Darador",
    "rating": 3.0,
    "comment": "The negotiation mechanic, singling out particular opponents for targeted attacks, important hidden trackable information (money) - this game has almost every mechanic I regularly dislike in games (except player elimination).\nMoreover, I found several elements considerably too luck based for a game that lasts as long as this - particularly, bidding on hidden poll cards of wildly varying strength and important die rolls with wildly varying results.\nMy rating of 3 already includes a +1 bonus for the theme, which is right up my alley and was the reason I wanted to try out the game. I would otherwise rate it with the very bad 2.\n(Rating and comment are based on the German second edition.)",
    "timestamp": 1562277600
  },
  {
    "username": "sekhmett",
    "rating": 3.0,
    "comment": "too drab",
    "timestamp": 1521327600
  },
  {
    "username": "halbower",
    "rating": 3.0,
    "comment": "Do you like arithmetic? Do you like following a tedious procedure? Then boy do I have the game for you!",
    "timestamp": 1493762400
  },
  {
    "username": "Aroquesada",
    "rating": 3.0,
    "comment": "Un par de partidas no registradas.\n\nConceptualmente no es un mal juego, el problema está en que es antiguo y al compararlo con diseños más actuales se ven todas sus errores y carencias.\n\n- La partida es laaaaaarga y acortarla no es posible pq las estrategias son a largo plazo en muchos casos. Si se da un tijeretazo y se acorta el nº de elecciones, el juego pierde gran parte de su jugo.\n\n- La estética de las cartas no es nada intuitiva y francamente mejorable.\n\n- Puede resultar repetitivo pq son varias las elecciones y casi todas son iguales.\n\n- Demasiado conteo de votos.\n\n- Para un no-alemán con ningún conocimiento de las elecciones en alemania, hay muchas reglas y mecánicas que resultan incomprensibles.\n\nCreo que para alemanes, y en los inicios de los eurogames, pudo tener su sentido. Ahora, comparándolo con diseños más actuales lo veo anticuado por no decir obsoleto.",
    "timestamp": 1393023600
  },
  {
    "username": "SaraCV",
    "rating": 3.0,
    "comment": "Interesting and complicated game.. I just really dislike it at the same time. Duncan likes it and there aren't many copies in our gaming circles, so we keep it, but I doubt I'll ever play it again.",
    "timestamp": 1388876400
  },
  {
    "username": "quietcorn",
    "rating": 4.0,
    "comment": "The core idea here is you place cubes into regions and then those cubes become worth points based on how many of the issue cards in that region align to the issue cards in front of you. For having the most points in a region, you also get the special reward of trying to groom the endgame scoring requirements to match what issues you want them to be. The game has some decent amount of flip luck, and planning too much to set up future turns has a way of backfiring pretty easily as players slip the issues cards, and your multipliers out from under you. Ultimately I found this game a little too complicated, chaotic and long.",
    "timestamp": 1721685600
  },
  {
    "username": "g4bor",
    "rating": 4.0,
    "comment": "An interesting area control Euro, spoiled by some totally awkward randomness and thematic WTFs. Definitely worth a try, especially since its weight of 4.32 is clearly overstated, but it's not a game I want to play a second time.",
    "timestamp": 1708297200
  },
  {
    "username": "JoshuaStarr",
    "rating": 4.0,
    "comment": "A groundbreaking game that has not stood the test of time. Board games have evolved in the 40 years since Die Macher arrived and more interesting decision spaces can be delivered in far less time.",
    "timestamp": 1700262000
  },
  {
    "username": "Biku-Beku",
    "rating": 3.5,
    "comment": "It is a grandparent of Modern Euros...but it does not mean that I have to like it!",
    "timestamp": 1699311600
  },
  {
    "username": "s_nav",
    "rating": 4.0,
    "comment": "First impressions:\n\n- An area control game at it's heart. Winning an \"area\" involves gaining the most rally cubes (and trend) and also maximizing the number of matching cards for that region.\n\n- The main phases of the game are very procedural to the point of being tedious to run through every round.\n\n- Turn order is hugely important in most phases. Since the first player is dictated by a blind bid, it make no sense why the turn order isn't in order of who spent the most money. This could potentially result in the second place bid being last in turn order which could completely deny the ability to take actions in the round like play a media marker or play a cabinet card. This feels like a huge flaw in the game and feels unsatisfying to play.\n\n- The opinion poll cards also feel very out of place because it directly punishes two random players. The main reason you buy a poll card is to increase your own trend, but that action also drags two random players down. Since trend is a hard resource to get, it feels like a bad design choice again.\n\n- For such a long and procedural game, there are one too many random elements making it not that fun to play. I do love the setting and the thematic integration of most mechanisms.",
    "timestamp": 1677625200
  },
  {
    "username": "ekloff",
    "rating": 4.0,
    "comment": "Die Macher shows how far euro games have come. Its an incredibly overdrawn game that has far too many systems layered upon each other. The game is also highly procedural, making the protracted play time insufferable, as even small decisions take several minutes to play out. The shadow cabinet and polling cards are neat ideas, but are drowned beneath the menagerie of auxiliary mechanisms. The game also implements blind bidding in an unfortunate way, and has far too many random elements for a game of its length. While I'm sure Die Macher was the cream of the crop decades ago, but now it feels antiquated and obsoleted by modern game designs.",
    "timestamp": 1635894000
  },
  {
    "username": "zardon",
    "rating": 4.0,
    "comment": "Too Long, boring and repetitive for me. Will never play again.",
    "timestamp": 1612134000
  },
  {
    "username": "John Rogers",
    "rating": 4.0,
    "comment": "With the right crowd this game is a 10. Of course it is also kind of a lumbering procedural dated slog. I really have no idea how to rate this. It has been so long since my last play. I wonder if I were to play this now if I'd be immersed in all its chrome or drowned by it.\n\nWIFE RATING - 5",
    "timestamp": 1609110000
  },
  {
    "username": "Virabhadra",
    "rating": 4.0,
    "comment": "Played once with some good friends and to be honest, I don't have any idea how to rate this thing. I'm sure that it is a masterpiece of game design and I trust that there is some absurdly abstract level on which all of Die Macher's moving parts link together to form a wooden cube-fueled engine of Euro-elegant perfection, but years of playing games with lasers, dinosaurs, spellcasting, explosions, etc. prevents my Ameritrash-rotted mind from tapping that divine lattice.",
    "timestamp": 1594764000
  },
  {
    "username": "SWxNW",
    "rating": 4.0,
    "comment": "A repetitive, overlong procedural experience with a lot more chaos than you'd expect from a game known as a venerable classic of the heavy euro class.",
    "timestamp": 1560290400
  },
  {
    "username": "Agrabrand",
    "rating": 5.0,
    "comment": "Parlamentarismus halt",
    "timestamp": 1757109600
  },
  {
    "username": "GuySamstag",
    "rating": 5.0,
    "comment": "Just too random for its length sadly. Good simulation value.",
    "timestamp": 1748642400
  },
  {
    "username": "turntable",
    "rating": 5.0,
    "comment": "A classic game, but has a massive amount of randomness for the amount of time it takes to play. It holds up ok if you're only comparing it to games of the same era, but it doesn't really compare to modern games. And I say this as someone who likes a lot of classic games!\n\nUnfortunately, Die Macher has a number of areas where it's quite weak if you're willing to play games designer after 1990.",
    "timestamp": 1744495200
  },
  {
    "username": "individyouall",
    "rating": 5.0,
    "comment": "Disappointing. Turns out Prime Minister is what I hoped this would be.",
    "timestamp": 1742338800
  },
  {
    "username": "Forgeforgeforge",
    "rating": 5.0,
    "comment": "Love the mathyness ,but the core game vote of aligning your party platform feels like it doesn't quite work, as it mostly feels like an accidental result of turn order and deck shuffle. Lots of player's saying \"go fish\" with the platform deck to try to match what's currently in public opinion as everyone's platform shifts to be as identical as they can make them. Randomly drawn polls are often decisive.\n\nNever really feel like I have the opportunity to be clever.",
    "timestamp": 1732057200
  },
  {
    "username": "westbrookgamer",
    "rating": 5.0,
    "comment": "Played (actually partly played) this last weekend - no understanding whatsoever of what was going on made this game a disaster. I live in hope. Our group isn't up for 4 hour games though.",
    "timestamp": 1716588000
  },
  {
    "username": "Ranior",
    "rating": 5.0,
    "comment": "There's a lot of cool elements to like in this game, but it also shows its heritage of one of the first proto-Euro style games.\n\nNamely, there is a lot of randomness going on still, in an otherwise strategic and lengthy game. Your goal is to gain votes, but getting votes has to do with aligning your party platform to a region, gaining popularity in that region, and getting members in that region. The issue is your party platform is partially determined by random card draws, so you can't match if you don't draw the right cards, and your popularity track is partially determined by random poll results that may be what you need or not.\n\nWhich means doing well and winning comes down a little to player decisions, and a lot to the luck of being able to position yourself in the right way. This may be (and is) an excellent commentary on politics, but it doesn't make for fun game mechanics.\n\nI've heard that various editions and house rules mitigate a lot of this as over the years the designer and others take ideas from more modern designs that have learned some things, and I think Die Macher likely would benefit from ways to further reduce and mitigate the randomness of these and other elements.\n\nIf those succeed, I think the rest of the game is pretty fun and the theme comes through pretty strong. The gameplay is interesting as everyone is rationing their resources in order to fight all these various elections and make sure you can afford the various things you need to.\n\nThe game I played though that's the final issue--because you get money also from winning seats, if you get poor early alignment on issues and poll results, you get far less cash too, and so it feels far too swingy to be a proper great strategy game, and why am I spending 3ish hours playing a game asking me to do all this resource management and planning if the main thing picking the winner isn't our decision making, but instead the luck of the draws?",
    "timestamp": 1680645600
  },
  {
    "username": "LuTennant",
    "rating": 5.0,
    "comment": "This is really random.",
    "timestamp": 1671836400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "Nice heavy area control. Long term and short terms goals are fun.",
    "timestamp": 1668380400
  },
  {
    "username": "cfarrell",
    "rating": 5.0,
    "comment": "2022 Update: this is a game to which time has not been kind. We played it endlessly back in the 90s and a bit into the early aughts, but after a couple plays in the mid-2010s I just have zero desire to return to it. It’s long, it’s punishing, it’s capricious, it’s fiddly, and the rules for winning “by a nose” have never worked satisfactorily despite trying a few variations. We just have so many better meaty games in inventory now, I can’t imagine ever playing it again. Tribune has a somewhat similar political flavor from this same designer, and is a game that *has* held up reasonably well to the onslaught of modern games so I’d check that one out.\n—-\nI keep waffling my rating a bit on this one, between a 7 and an 8. I really like the challenge of the game, all the tough and interesting choices it confronts you with, and the fact that it feels really thematic as you try to figure out which regions your party will run well in and how you can change your party platform to please the voters. What I don't like is the fact that the luck of the draw on the polls and the platform cards seems a bit too heavy given the weight and length of the game.\n\nOn the one hand, thematically, these luck elements feel right. You shouldn't be able to arbitrarily change your party's platform all the time, and voters are often unpredictable. But, this is a long game (5-6 hours), and one with a lot of energy and emotional investment, and yet one that can turn on a single poll card or getting good platform draws. I guess I just wish the game were just a bit shorter. At 5 hours, this is the same length as Revolution, Successors, or Civilization (with 5), and I don't feel that it's nearly as rewarding as those games.\n---\nNote: We always play with a house rule that if the 80-seat region comes out in the initial 4 elections, we replace it. This region (which was added in the 1996-ish Hans-im-Gluck reprint and not the original) could, and probably should, be removed from the game.\n---\nEdition Note: There are now 3 versions of the game, the original (and now very hard-to-find) Moskito edition, the updated Hans-im-Gluck version, and the Valley Games reprint of the Hans-im-Gluck edition. The big differences are between the Moskito and HiG versions; the latter version supports a fifth player, has fewer restrictions on the parties, and a couple other minor rule changes I don't specifically recall. The Valley Games version has updated issues and slightly more internationally-friendly cards.\n\nProbably the Hans-im-Gluck version is the best; it's graphically the most professional and functional (some of the CG illustrations in the Valley Games version are cheesy), and while there is German on some of the cards, it's not a big deal. The Valley Games edition is of slightly lower printing quality and some of the symbols on the issue cards are strange (although some of the complaints I've heard seem overblown). The Valley Games version does have a more sensibly-sized box, though!",
    "timestamp": 1663711200
  },
  {
    "username": "Yashima",
    "rating": 5.0,
    "comment": "Only played that one legendary game of this. Would definitely want to try again sometime now with a better understanding of boardgames in general.",
    "timestamp": 1653948000
  },
  {
    "username": "Zondag",
    "rating": 5.0,
    "comment": "The game is interesting. If playable in half the time, it would have been a 7",
    "timestamp": 1622757600
  },
  {
    "username": "Pandorzecza",
    "rating": 5.0,
    "comment": "Not for me",
    "timestamp": 1621375200
  },
  {
    "username": "marioaguila",
    "rating": 5.0,
    "comment": "Esperando que llegue de Alemania (17 abril).Llegó sin problemas tras 10 días de travesía; he leído las reglas y se ve muy entretenido. Creo que deberé estudiarlo al menos unas 5-6 veces, más la traducción de las cartas y términos alemanes, antes de ponerlo en la mesa.8,8 puntuación dada por mis Geekbuddies.\nJugado en junio un par de veces: muy pesado para mi grupo, que se desconcentra mucho. Lamentable decisión de venta :-(",
    "timestamp": 1615417200
  },
  {
    "username": "ChrB",
    "rating": 4.5,
    "comment": "Yay, I finally got to play the board game that is number 1 in the BGG database! I played the newest version, which has some updated rules, but most of the game is the same. We were 4 players, which I know is not ideal according to BGG, where 5 players are preferred, but I actually think 4 worked quite well and did cut the playing time down; and even so the game still took 3-4 hours... And this is my main criticism for me personally as I rarely like extremely long games, so while I know that the game is objectively good, I don't really want to play it again... Although I have promised to play it once more with 5 players to get the full experience.",
    "timestamp": 1602626400
  },
  {
    "username": "naehlen",
    "rating": 5.0,
    "comment": "gespendet an bodo",
    "timestamp": 1599429600
  },
  {
    "username": "_The_Inquiry_",
    "rating": 5.0,
    "comment": "Prior to 2020: 1 play",
    "timestamp": 1580857200
  },
  {
    "username": "143245",
    "rating": 5.0,
    "comment": "Die Macher as a game that is over 30 years old and still played is an example of another time in gaming. Today, the game lacks a certain pizzazz that newer heavy euros have (not just in theme, but mechanical implementation) and it's more difficult to hold the attention of players. I can see where those who put in the effort to look past the points where modern gamers would say \"this really should be streamlined\" and study of the design will be rewarded.\n\nIn some ways, it's a game that falls into the same category as Virgin Queen/HiS and the COIN series; long, hulking, beautiful monstrosities that require a full player count to shine. Bonus points if they are all experienced folks. People have to rearrange their lives and schedules to make these sorts of games happen. Die Macher is a wonderful convention game, provided people have agree on a rule set... Unfortunately, that boat seems to have sailed, and the 4th edition is also unlikely to resolve that. That's not necessarily bad, just an annoyance.\n\nThis is an experience, one of those games that was revolutionary at it's time, and I encourage people to give it a shot. I'd like to sit and tinker with it, to explore how the interlocking pieces and parts all fit together, but at what cost? Do I need a copy on hand? I doubt it, possibly just nearby. Every now and then I think about it, even if it took years to get it to the table, and I'm unsure when I'll see it played again...\n\nedit: The more I fiddle with and talk about the game with others, the more I find that it's just undercooked, and you have to cobble together an agreeable ruleset in order to get it to really sing. I don't think that's worth my time anymore.",
    "timestamp": 1579561200
  },
  {
    "username": "Innsmouth_Look",
    "rating": 5.0,
    "comment": "Extremely heavy game and too mathy for me. I also find the eye-gouging in this game to be too extreme and very unfair. You can spend four turns and multiple actions building up your position in one zone only to have all that hard work completely undone with a single action from another player that is impossible for you to stop, and this happens time after time throughout the game. Plays far too long also.",
    "timestamp": 1579388400
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "There are some interesting things going on in this game (the ability to plan ahead in future elections, for instance), but there is an awful lot of card-based luck in terms of candidate platforms, polls/trends, and card-related scoring. Also, if you do very poorly in the first election (which is a money election), you're already at a fairly decent disadvantage. I may play this again, but I may not.",
    "timestamp": 1575241200
  },
  {
    "username": "liketheboys",
    "rating": 6.0,
    "comment": "So let's start with the bad. All the little calculations in this game are tedious and obnoxious to make (more so than in any 18xx I've played). Calculating Factor is especially bad, but going around the table parsing each player's platform to score their National Issue matches is a close second. The rules are fiddly and the game is borderline unteachable without a good player aid (there is luckily a pretty good one in the files section here by user k1mm1ngs). Even with the improved iconography of the second edition, simply identifying matches and mismatches is draining. End game is a chore and prolly took us 10 minutes. Placements for Media and Meeting markers felt obvious, but that could just be lack of creativity on our part (for one we never used our shadow cabinet card to hurt other parties so we certainly missed out on something).\n\nBut there was a lot to love here. The negotiation felt really great; we permitted money to exchange hands and I loved how one emergent strategy was to partner up with other players to agree on how much to let poll cards go for (or even split the costs). Coalitions are one of the coolest mechanisms, especially how you can manipulate your platform to force or encourage coalitions. I get slight vibes of El Grande's GOPS system in how you balance early money and late game bonus die rolls, and it's sublime. It's fascinating how turn order can be both a boon and a bane, and how important it is to correctly navigate it.\n\nThis game has more than its fair share of randomness with the die rolls, hidden poll cards, and and draws for platform and opinion cards, but none of it felt especially bad to me. If anything, I appreciated the uncertainty and push-your-luck/mitigation elements it brings to the game; the poll cards are especially dramatic, and I love that at times it caused people to absolutely lose their minds in the auction (and then face palm immediately up seeing the card for themselves).\n\nI really do need to play it once more to see how strategies develop and see how the upkeep and maintenance hold up with a little more experience. It's also a bit long and repetitive. Our session ran long for extraneous reasons, but it felt engaging anyways. If it reliably went four hours, that's prolly fine for this game.",
    "timestamp": 1745704800
  },
  {
    "username": "loopster70",
    "rating": 5.5,
    "comment": "My rating is probably too low; I partly feel like I should hold off rating until I play another game of it. But this feels like a \"like it, don't love it\" situation. It is very Euro-y for sure. Very long, and a lot of balls to keep in the air. Closest comp for me would be Dominant Species, which is more complicated, but which I liked more; both have a very no-frills approach to visual design, which I'm not crazy about. Die Macher is very, very fluid, almost abstract, more so than I expected. I would have liked to see a little more stability, a little more cross-over from one election to another. Given the time commitment and the need for at least 4 players, I can't see myself playing it very often; if I'm going to play one game for 4 hours, it'll probably be Arkham Horror. But playing another game where I know what I'm doing from the get-go would be helpful. Consider the rating provisional.",
    "timestamp": 1742770800
  },
  {
    "username": "rizcharger",
    "rating": 6.0,
    "comment": "Game on German coalition party politics. It is organised chaos - role of media and opportunistic switching of coalition partners are evident to achieve electoral victory. Challenging to master or to identify optimal paths. Tactically many moves are available, providing ample player agency but it can be overturn by opponents. Mechanics are intertwined across turns and between parties, enabling levers for manipulation but at the cost of excessive complication. Graphics and user interface are dated, obstructing gameplay. Too procedural and suitable for table that prefer to negotiate for every advantage which then lead to long game time.",
    "timestamp": 1726264800
  },
  {
    "username": "Wolfshade",
    "rating": 6.0,
    "comment": "[5+P] OG tekst",
    "timestamp": 1712700000
  },
  {
    "username": "seandavidross",
    "rating": 6.0,
    "comment": "Played with people who already know the rules, and played quickly, this is a game I would almost always be willing to play. There is almost no downtime as each player makes many small decisions concurrently with each other to move through the 11 (11!), but tiny, phases of the turn. And, each decision matters and can have a bad word inducing impact on the other players - no multi-player solitaire here. I wouldn't want to play the game all the time - it's mentally taxing - but I'll still look forward to seeing it hit the table again sometime in the future.\n\nIt takes time to come to grips with the many and varied moving parts that is the engine called Die Macher. It's what I imagine trying to fly a helicopter would be like - every adjustment affects some other system which then needs to be adjusted, which affects another system, and so on.... An exhausting but thoroughly entertaining ride.",
    "timestamp": 1704236400
  },
  {
    "username": "mOCHU035",
    "rating": 5.5,
    "comment": "1 Play\n\nMight have been a better game if it had been tighter and shorter. Despite enjoying my first play through on the game, I cannot somehow bring myself to play this again. -1 in the ratings as a consequence.\n\n7/9/19 - Moving this back to a 7. Can be really interesting with a proper implementation.\n3/15/20 - Is alright. Not great.",
    "timestamp": 1703372400
  },
  {
    "username": "Mayasty",
    "rating": 6.0,
    "comment": "Plus: rare theme. Minus: very high entry barrier vs unpredictibility and play time. After second round I had the impression that nothing exciting will happen till the end. Just boring repetition round by round with huge luck factor. With that complexity I would have expected a chance to build an engine that might work. None of this. Pity. I was really excited about it until I played. The only plus is that the game triggers lots of emotions, negotiations and fun. But apart from this is for nobody. Too much maths for casuals and too much randomness for geeks.",
    "timestamp": 1697666400
  },
  {
    "username": "sweetsweetdoughnuts",
    "rating": 6.0,
    "comment": "7 rounds is slightly too many. I'd really seen everything after 5 and would have been happy to end the game there. It also (the 2 extra rounds) made no difference to our final scores. All that happened was, by that time, people's attention was wandering.\n\nBeyond that, I like a lot about the game; the original selection of issues seemed fairly key as did the luck of the draw in getting suitable replacement issues.",
    "timestamp": 1684360800
  },
  {
    "username": "b0ardgamer",
    "rating": 6.0,
    "comment": "I'm pleased to have played this classic, but I have no desire to play it again! (Long, heavy.)",
    "timestamp": 1679180400
  },
  {
    "username": "exparrot",
    "rating": 6.0,
    "comment": "This is one of the Boyfriends grail games.\n\nEnjoyed the play of this and it is really quite different to anything else in my collection. It's not as amazing as the current price tag would seem to suggest but it is quite good.\n\nWe only played the short game (5turns) but still played for a good 5 or so hours, but it was a learning game for all of us. None of us were really thinking about strategy rather just doing stuff and seeing what effect it would actually have.\nOverall I would be happy to play again.\n\nSold in massive (150+) game bundle in 2023",
    "timestamp": 1678143600
  },
  {
    "username": "krit1789",
    "rating": 6.4,
    "comment": "Simulation of the German election. Quite meaty and long. I prefer the short variant (5 rounds).",
    "timestamp": 1651010400
  },
  {
    "username": "Rich_Z",
    "rating": 6.0,
    "comment": "Well... maybe it didn't age well? I 'get' all the intricacies going on for when and where you invest to score but it is a very long game without much 'actual mechanics'?",
    "timestamp": 1649887200
  },
  {
    "username": "OGNOG",
    "rating": 5.6,
    "comment": "Probably OG. (Rating non-indicative of game quality.)",
    "timestamp": 1649714400
  },
  {
    "username": "chaddyboy_2000",
    "rating": 6.0,
    "comment": "Definitely a bunch of difficult decisions packed into a great game design. Managing your campaign is no easy task, and the multitude of choices lead to a fairly meaty game.\n\nThe one problem some people might have is that there is a lot of luck involved, and some of the luck can be pretty brutal if it doesn't go your way. It's a bit of a stark contrast to the otherwise somewhat heavy feel to the game, but I happen to find the luck more fun than frustrating (although it can certainly be frustrating to have plans wiped out by the flip of a card).\n\nHowever, it's not the monster I was expecting, as I've had 5 newbies get through a full game in 3.5 hours. Definitely playable on a normal game night.",
    "timestamp": 1647471600
  },
  {
    "username": "PSouth",
    "rating": 6.0,
    "comment": "Interesting with the right group. Very group dependent.",
    "timestamp": 1645138800
  },
  {
    "username": "warder57",
    "rating": 6.0,
    "comment": "1st Impressions:\nI didn't love this game, but I was also very tired when we played so perhaps I just had a bad first play. It seemed hard to grock and the timing was super important but not at all easy to remember. Other than that, I did see the potential for a lot of interactive maneuvering. I just can't tell if the amount of chaotic changes is too much or if I just need to get better at the game. May raise or lower in rating after more plays. I'm going to prioritize giving it another try.\n\nAfter another play:\nThe game grew on me, but I was left with the solid opinion that while it provided decent player interaction it’s not worth the large learning curve and amount of work required to make any reasonable predictions.",
    "timestamp": 1642114800
  },
  {
    "username": "claudio212",
    "rating": 6.0,
    "comment": "Update: the revised version plays in half the time and is quite enjoyable. Still more of a logistics game than I like. But teach in 20, play in 3hrs is a pretty good place to be.\n\nOriginal: I think it will end up a solid 6 or 7 for me. I felt that the landscape of the platforms/will of the people changed a bit to dramatically and the luck of the poll cards was just a bit too tough. I didn't mind having to buy the poll card of a region you were competitive in RIGHT now, but it dampened the desire/ability to actively work later regions because then you'd have to buy those every time until they were resolved. I'm not generally opposed to a bit of luck, but this seemed a bit much for such a long and heavy game. That said, I enjoyed it considerably as an 'experience' game. Very glad to have played.",
    "timestamp": 1636671600
  },
  {
    "username": "redscare",
    "rating": 6.0,
    "comment": "If you're into it, it's a great game. I don't feel involved with this one, though.",
    "timestamp": 1634162400
  },
  {
    "username": "cartesius",
    "rating": 6.0,
    "comment": "I enjoyed my fist game but found it too random sometimes.",
    "timestamp": 1633039200
  },
  {
    "username": "Bart",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1628373600
  },
  {
    "username": "tomgazpacho",
    "rating": 7.0,
    "comment": "Deep, political, chaotic. It shows its age with things that modern games no longer require such as a preliminary round that demands decisions before you know all of the concepts and 10+ phases per round. The table talk made this game interesting but six hours was quite a commitment. It will be a struggle to get this one played outside a convention where players can dedicate most of a day to it.",
    "timestamp": 1753740000
  },
  {
    "username": "rkleopold",
    "rating": 7.0,
    "comment": "!!!!! Going",
    "timestamp": 1748124000
  },
  {
    "username": "Nye27",
    "rating": 7.0,
    "comment": "An interesting political game, took about 4 hours I enjoyed would play again but didn't blow my socks off and some people at the table did not enjoy.",
    "timestamp": 1741820400
  },
  {
    "username": "Trit0n",
    "rating": 7.0,
    "comment": "What an interesting game. Super long though",
    "timestamp": 1740956400
  },
  {
    "username": "timbovelander",
    "rating": 7.0,
    "comment": "I already liked this game very much after the first play, but I like it more and more with each play. It's so very thematic, I really feel like I have to win votes in the regions.\n\nWe had a weird game where I won handily though, mainly because I started out with a tableau which matched the opinion cards in the first region almost perfectly and it turned out to be the 80 points region. Not sure if we played it wrong, but that was not very nice because you just run away with the game immediately and that was pure luck.",
    "timestamp": 1740783600
  },
  {
    "username": "AdosCze",
    "rating": 7.0,
    "comment": "Beneficial for strategical thinking, and resource management.",
    "timestamp": 1734303600
  },
  {
    "username": "Grim Norsefury",
    "rating": 7.0,
    "comment": "Kickstarter; can't wait for my first play of this one!",
    "timestamp": 1732489200
  },
  {
    "username": "scottdarrington",
    "rating": 6.9,
    "comment": "Gnarly and thematically rich, a rad look into the past. Waltzing through this with a German accent was a very enjoyable time, just not something I'd ever choose to pull out on my own, haha. The biggest thing that felt outdated and creaky was the card randomness, especially the way player policies worked. The options for state policy swaps often felt restricted and clogged, but trying to pivot on issues felt like a coin flip, and actually getting a card you want to pivot into felt impossible for me for the last three rounds. I can see the benefit to that in how it keeps players from simply forming a complete hive mind, but I just kept wishing there was a better way of doing that that also let me feel like I was able to actually make changes as needed. The ways you have to play around your policies are present, at least, so I do think it's partially on me not being as experienced with the game. Too bad I don't think that's going to progress anytime soon, haha.",
    "timestamp": 1731452400
  },
  {
    "username": "zsknight",
    "rating": 7.0,
    "comment": "* 신판의 개정룰로는 플레이 안해봤음",
    "timestamp": 1730156400
  },
  {
    "username": "lroces1969",
    "rating": 7.0,
    "comment": "Politic game.",
    "timestamp": 1727906400
  },
  {
    "username": "Adanedhel",
    "rating": 8.0,
    "comment": "Requiere inmersion en el juego, 4 horitas mínimo. No recomenado para principiantes.\nDonado al club.",
    "timestamp": 1759960800
  },
  {
    "username": "HerbertML",
    "rating": 8.0,
    "comment": "Thematic game - I enjoyed it\n/*#V4*//*stay*/",
    "timestamp": 1759356000
  },
  {
    "username": "SiddGames",
    "rating": 8.0,
    "comment": "g4 b5\n240m\n\nPlayers represent different parties in the German political season. Finally got a 5p session in. Really like it. Can't believe this game came out in 1986 - a Euro ahead of its time, still very solid now. Tons of little decisions (somewhat tactical in nature) that add up to a long term strategy? Lots of interaction, lots of ways to earn points, and not as long as we'd feared (about 4 hours total for our learning game, I think we can get that down to 3ish now that we know how to play).\n\nLooking forward to more plays, possibly at BGGcon 2008. Rating may go up.\n\nNot a lot of enthusiasm for playing this more, so I gifted it to a friend who wanted a copy.\n\nSpielworxx reprint is available.",
    "timestamp": 1757455200
  },
  {
    "username": "aadepizol",
    "rating": 8.0,
    "comment": "Complex game about German electoral system",
    "timestamp": 1755986400
  },
  {
    "username": "yorinaga_k",
    "rating": 8.0,
    "comment": "una de mis asignaturas pendientes, de los juegos a los que mas ganas le tengo pero que es excesivamente \"duro\" para mi grupo habitual de juego.\n\n11/03/2015 Por fin le hemos jugado... y no es tan fiero el león como le pintan. La verdad es que me encanta, por temática, por mecánicas, por jugabilidad..... Como pero, y muy gordo, el arte del juego. Unas ilustraciones nada agradables que no relacionas con lo que significan en el juego y que hacen mas engorroso meterte en la partida. deseando volver a jugarle",
    "timestamp": 1754776800
  },
  {
    "username": "Carnage994",
    "rating": 8.0,
    "comment": "Who knew the german election process could make for an intriguing game? This is an amazing game considering when it was designed, but it does suffer a bit from design elements that show its age. Super crunchy and unforgiving!",
    "timestamp": 1751839200
  },
  {
    "username": "libonati",
    "rating": 8.0,
    "comment": "Ler o manual",
    "timestamp": 1750543200
  },
  {
    "username": "TheRook",
    "rating": 8.2,
    "comment": "We really enjoyed our one play of this. I know it's a cliche to say how this game surprises you on how fun it is, but that's exactly the way we felt about it.",
    "timestamp": 1748469600
  },
  {
    "username": "Aevin",
    "rating": 8.0,
    "comment": "3-5 players (5 preferred). Missing one card, but printed out.",
    "timestamp": 1746568800
  },
  {
    "username": "zeotter",
    "rating": 8.0,
    "comment": "Playe at GMT Weekend in 2025 and really enjoyed it.",
    "timestamp": 1746223200
  },
  {
    "username": "royaljayhawk",
    "rating": 8.7,
    "comment": "Die Macher is a heavyweight Eurogame that plunges players into the intricacies of German federal elections, tasking them with managing national political parties across seven regional contests. It’s a sprawling, multi-layered experience where players must balance public opinion, media influence, party platforms, and resource management- all while jockeying for dominance in each region. The game’s complexity is legendary, but for those willing to invest the time, it delivers one of the most rewarding strategic arcs in board gaming.\n\nEach round unfolds like a mini-campaign, with players adjusting their party stance to match regional issues, deploying activists, and leveraging media control to sway voters. The tension is palpable as you decide whether to go all-in on a region or strategically concede to focus elsewhere. The interplay between short-term tactics and long-term national strategy is razor-sharp, and the scoring system which is based on regional victories, media presence, and ideological alignment ensures that every decision matters.\n\nWhat elevates Die Macher is its thematic integrity. It doesn’t just use politics as a backdrop... it feels political, with all the negotiation, compromise, and strategic posturing that entails. The game’s components and presentation may feel utilitarian by modern standards, but the mechanics more than make up for it. It’s best with 4–5 players who relish deep planning and interaction, and while the rules are dense, they’re surprisingly intuitive once the game gets rolling.\n\nDie Macher is a towering achievement in strategic design. It’s not for the faint of heart, but for players who crave a rich, cerebral challenge with real-world resonance, it’s a must-play. A true classic that still holds its seat at the table of political strategy games.",
    "timestamp": 1760306400
  },
  {
    "username": "Pillowdude",
    "rating": 8.5,
    "comment": "Played this several times now, rating still stands. Like the meta gaming aspect, but I wish there maybe was just one more parameter on how you could score.\n\n***\n\nFinally I got to play Die Macher, the grumpy old grandfather of modern Euros. With the optimal 5 players and it was a fun group too...\n\nConsidering Die Macher was published in '86, much in it still feels fresh. A bit procedural though, the owner of the copy was \"game master\" and was using the \"check list\" to keep us going through steps and phases in the right order. In a modern design, steps and turns are usually more intergrated in the game visually on the board he thought, and I think he is right.\n\nA \"heavy\" game, at least for me, and it took me almost 2 elections before I had sorted out all the details. Managed to squeeze out a win by doing extremly good in the last region (a 80 point election).\n\nGive it an 8 for now, could definitely rise with more plays. A long game for sure, and a bit dry, but still thematic and very engaging. Played the \"Valley games\" edition, some of the icons on the cards were confusingly similar..",
    "timestamp": 1754863200
  },
  {
    "username": "Gernial",
    "rating": 8.7,
    "comment": "Far ahead of the times (1986). Still an underestimated great, evening filling game. Needs time to be learned.",
    "timestamp": 1754604000
  },
  {
    "username": "CharlieNZ",
    "rating": 9.0,
    "comment": "Played",
    "timestamp": 1752357600
  },
  {
    "username": "evilm2twjunkie",
    "rating": 9.0,
    "comment": "Lovely meaty/crunchy euro. Would love to play more often.",
    "timestamp": 1751925600
  },
  {
    "username": "Desiderata",
    "rating": 8.5,
    "comment": "Heavy Euro. Hard to believe this game was published in 1986. I imagine it will be considered a classic, as it is that good! Theme fits well with the mechanics. Drawback is the length and learning curve. Almost no downtime for any player--engaging throughout. So many strategies and ways to victory. Fun, exciting game!\nUnfortunately, it won't get played as often because of the barrier to introduce it based off of the theme and length.\n\n28 Aug '23: After getting rid of the Valley Games version, years later, I repurchased the 2nd edition. I prefer the visual presentation of this version, even though it is all in German; there's very little text that it doesn't affect gameplay.",
    "timestamp": 1750111200
  },
  {
    "username": "cwmassey",
    "rating": 9.0,
    "comment": "A four hour game that never feels like four hours - truly a great game. I really think that if you played this more than once a year, that you could trim the time a little bit as well.",
    "timestamp": 1748988000
  },
  {
    "username": "andycted",
    "rating": 8.8,
    "comment": "Second game in and this is probably the best example of what modern tastes can't tolerate - great example of the nascent German mechanisms, still untouched by elegance, seasoned with relentless interference and interaction. The game does need a good understanding to be able to play the delicate balance of kicking down the right player or game aspect: the game itself doesn't do it at all ! It's all great but really needs for the player to step up their bash the leader management.\n\nThe typical German today has a catch-up mechanism, a way to end the game without being eliminated and no way to interfere with other players choices, except than to make \"better\" ones.\nThis is all the opposite. You can kill a player, but is it the right one to kill ? Or should you join him in a Koalition ? What if that opinion poll is extremely bad for you and you completely lose that region ? Should I really pay that amount of money ? Or should I have had invested more in the Media ?\nThat's very swingy, yep. Not everybody cup of tea for sure, and the final experience is probably akin to John Company\n\n(Old)\n\nJust played one game, 4 newbies. Took 4h plus a 30 minutes explanation. Next game would probably end in 3.5h.\n\nExcellent classic - needs repeated plays. Opinion polls are swingy, and that's why you need money to control them !",
    "timestamp": 1741647600
  },
  {
    "username": "pnpbackup",
    "rating": 8.5,
    "comment": "The best part of this game for me was the auction for the opinion poll even though you might end up only throwing 2 dice! I paid $55,000 for 2 dice near the end of the game, brutal but it was fun anyway. Tons of details to think about and highly entertaining, this 7 hour game (first playing) was an emotional rollercoaster.",
    "timestamp": 1738018800
  },
  {
    "username": "DaveHammer",
    "rating": 9.0,
    "comment": "Valley Games version. Card graphics bad for issues. Otherwise a great game. Lots of interaction and decisions, mechanics are easy, strategy difficult. BGG player aid with all steps very helpful.",
    "timestamp": 1737327600
  },
  {
    "username": "Amnese",
    "rating": 9.5,
    "comment": "The mechanics blend so well together. This is a MUST HAVE in any collection. The rules are not too difficult (esp. with player aids available on bgg), but the gameplay (ie: how the rules actually relate to each other) is much more difficult. Persevere, DM is awesome!",
    "timestamp": 1760220000
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "An election game, perfectly realized. Much of it is a math problem, but at the same time, all of it is intuitive. Some people don't like the opinion polls, but I think they were handled very well; perhaps too true to theme for some to have comfort.",
    "timestamp": 1759356000
  },
  {
    "username": "CortexBomb",
    "rating": 10.0,
    "comment": "Own both a 1st Edition (Blue Box, 4 players only) and a Second Edition (Max 5, different rules, Yellow Box)\n\n1st Edition\n(Corrected games log: 2 plays, 03-08-07, 08-16-07)\nThe 1st edition of Macher is noticeably more of a rough-cut than the 2nd, but the game system is still recognizable, and the final product is still very fun. Everything that one would expect from the later version is here in spades: media control, shadow cabinet play, but the system is slightly less tuned and more opaque in many phases, particularly the conversion of meeting markers into votes, and the extremely convoluted final scoring.\n\nI like playing this version of the game rather than the 2nd when we only have 4 players, mainly because the 1st seems to be slightly nastier and more effectively tuned for the 4 scale.\n\nA rule that I particularly like is the way the party platform changes, here it is a completely deterministic, voluntary choice thing, and I would actually like to convert that rule to the 2nd edition, because I think it adds another interesting player choice into the mix without sacrificing anything in the process.\n\nI will say though, the final scoring is a headache your first time through, and the scores seem positively gaudy when one is used to the later iteration of the system.\n\n\n2nd Edition\n\nMasterful, deep, intriguing, there is nothing I can say negative about this game other than the fact that due to its political nature the scale should be a minimum 4. The 4 hours this takes feel like less than 1 to me, as it pulls me in completely. Hard to find a game with a more long term strategy element to it either, this will reward the person thinking 3 elections ahead time and time again with a big fat mandate and the score to show for it. The balance on this game is utterly superb as well, early election victories lead to more points for media markers, yet lower the number of national issues you're going to successfully dictate. Small elections might offer a small mandate, but they might be an easy way to push your agenda, or get your media on top. Control the media? Your agenda becomes the people's agenda. Cash in early chips and go for an absolute majority to further your own ends? Or hold out and try to push that multiplier a little bit higher? Absolutely everything I'm looking for in a game...\n\nScale is by far and away best with 5, though I am willing to play it with 4. With 3, the game just loses too much to be worth pulling out.\n\nOn an aside, I prefer to play this with the following variants:\n- Flood Rule --> Nigh compulsory, important for media value.\n- Shifting National Opinion Rule --> Also nigh compulsory, rewards long term issue presence, keeps late changes from being even more powerful.\n- Money can change hands --> My softest preference, but I do like it. Can add some intrigue at times.\n\nNotes on the 3rd Edition (Valley Games):\n\nA minus for the graphical design on the cards, a plus for the graphical design on the boards. Some of the issue cards are too similar for their own good, and are harder to tell apart at a distance than the HiG edition. On the plus, the icons for where the region card / shadow cabinet cards / coalition tiles should go is a nice add.\n\nThe rules changes are brutal though:\nI played this once with the exchange pool rules as written (i.e.: pool starts at 6, no way to actually add cards to it, it just stays at 6 with cards rotating in and out based on media control) and didn't care for the restriction that it placed on the media. I would lobby actively against playing with the rule again and would likely opt out of playing it if a majority wanted to play with it.\n\nThe short game rules are an atrocity and I would not be willing to play the game with them. They cut off a chunk of the game's long term planning and excise, perhaps, 1-1.5 hours at most from play, a tiny time savings for the kind of things they remove.",
    "timestamp": 1753653600
  },
  {
    "username": "GoingTopShelf",
    "rating": 10.0,
    "comment": "I can see why this game is #1 in the BGG database. I find this to be an almost perfect design. It's rules light but very strategically deep. There is math involved, but it's not Arkwright levels of math. You can plan ahead. There's randomness, but you can mitigate it by either winning auctions or being the media lead in each state election. The only complaint is that it runs long for the full game (~4 hours) and it looks ugly so I doubt my normal group would want to play it. But make no mistake, it's exceptional.",
    "timestamp": 1752184800
  },
  {
    "username": "ledvolta",
    "rating": 10.0,
    "comment": "I ticked off this long-standing SoS game early in 2024 and it was a very strong first impression. For a game that looks this dry and with it's incredibly procedural lack of flow, Die Macher produced surprisingly consistent excitement at the table from start to finish.\n\nWith 5 first time players, the first round or two felt a bit like educated guesswork as we made incremental decisions in one phase and then braced ourselves for the fallout in the next. By the mid-point things were humming along nicely - nuanced negotiations, less nuanced lobbying, constantly shifting alliances, coalitions of the willing and the not so willing, and all sorts of excellent shenanigans that would have been oh-so-memorable if not for a theme that adheres so doggedly to the bureaucracy the game seeks to simulate.\n\nThe second game was even more thought provoking than the first. With a better understanding of the tools at our disposal, how to affect change and how quickly that change can come about, how and where to set up short and long term strategies, and a strong sense of the scoring, the game was tense and the contest hot from the word go. The push and pull dynamic of the forced coalitions and national board are a fantastic forecasting decision space and I can't imagine playing without them as per the rules in the newest edition. The strict limitations on media cubes, meeting markers, shadow cabinet cards and coalition markers ensures every choice is impactful and that the trade-offs on timing and assets need always be considered carefully - save the goodwill of your opponents, there are no catch-up mechanics in Die Macher and plenty of ways to shoot yourself in the foot.\n\nI only expect the game to get better and more hotly contested with each successive play, I just need to make it happen. 10/10",
    "timestamp": 1740092400
  },
  {
    "username": "Chrisrob",
    "rating": 10.0,
    "comment": "I have now played this game a number of times. A very interesting system. It is very \"full\" (lots of tasks) to it takes someone with a wargamer background to be able to last. But every action by another player effects your own issues so is it like you are participating in another's turn.\n\nOften when I have played this game two if not three of the players were new to the game; though some had tried to learn the rules in advance. The first game I played took six hours as well as the second game; the third took seven hours. In a forced game I could see going five hours but it is far nicer to pace one's self and just say it will take six (it has taken this long even with all players having played before).\n\nIt seems that the actual playing time can be faster, but when rules & setup time are added, this is a long game.\n\nIt is not super complicated as much as there are many steps in every turn making the process take time. Those new to the game get the grasp of it enough to make their decisions after one or two rounds (of six); though in every case they would have wanted to try things diffently if played again. THIS GAME IS MUCH BETTER WITH THE HELP SHEETS THAT CAN BE FOUND HERE AT BGG; they keep track of all the steps. I do think it takes playing once or twice in order to get the management of money & resources down so that a stratagy could be followed better during playing.\n\nIt is a most interesting way to set up an election game, still making me think the same format could be used to represent the primary process in American presidential elections.\n\nI also have a copy of the original \"blue box\" edition which has only four parties and seems a little different in its structure. (I have never played this version.)\n\nI also have the Valley Games printing but find the shorter five turn version ruins the game.\n\nI also have the Spielworxx printing but have yet to use it.",
    "timestamp": 1740006000
  },
  {
    "username": "ajie426",
    "rating": 10.0,
    "comment": "超主观点评（5人局）：\n1、代入感拉满了，党派方针要与公众舆论保持一致，但是控制媒体又可以直接影响公众舆论，好的幕僚更是可以直接让党派起飞，但是要请好的幕僚又很贵真的太真实了哈哈哈，公众教育、数字化、交通、社会福利等内容和生活也息息相关，很容易找到感觉。\n2、玩法挺简单的，对着玩家提示板说一遍就可以开始，但是资源有限，各种行动又互相影响，思考量巨大，爽歪歪。虽然结算耗时蛮久，但是大家都很有参与感，不会无聊到找别的事情做。\n3、输了就自己翻规则逆天改命的感觉真爽！纠出一个村点，第1名摆了2个媒体指示物到媒体板块，然后险胜2分哈哈哈！\n4、2019年12月16日初玩印象非常糟糕，2025年2月9日再玩感觉非常上头，大家决定下周末再开两局，不知道是规则改进了（怀疑当时没有轮抽）还是当年没玩懂或者是纯属运气太差？当时玩的是旧版，感受还是留一下：一个非常看运气的游戏，起始手牌不好的话建议直接掀桌！玩一局要三至四个小时，第二把我们玩的时候有三家手牌高度一致，结果就变成二打三，无论如何都没办法翻盘，简直浪费时间！（6分）\n小心得：\n1、抢先手很重要，顺位靠前可以确保幕僚卡的感叹号可以用出来，几乎每个感叹号都很逆天。\n2、钱没有那么重要，我们终局最高的159分，钱最多的才有6分太少了，而且钱是不公开的，再怎么省，自己的钱也不一定是最多的。",
    "timestamp": 1739142000
  },
  {
    "username": "mowglee",
    "rating": 10.0,
    "comment": "Ronak",
    "timestamp": 1738105200
  },
  {
    "username": "midnightfaerie",
    "rating": 10.0,
    "comment": "2024",
    "timestamp": 1735599600
  },
  {
    "username": "hylsberg",
    "rating": 10.0,
    "comment": "Outstanding game.\nA long game and you af inviolved all the time. Actually I've only played i once(exsl a get to learn die marcher play), but 10 is the only I can rate. We were all involved all the time and thou it lasted for around 5 hours it didn't seem so long a game. Might be my best gameexperience of all time.",
    "timestamp": 1731193200
  }
]