[
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "The premise was a clever trick taking game with a simple twist but it bombed so badly on its second play, I'm now using the cards for prototyping other trick takers. Bought in Taiwan BG Hut.",
    "timestamp": 1752357600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "The idea sounds like a lot of fun, but in practice it's not that exciting. Want to try more just in case I'm missing something.",
    "timestamp": 1722463200
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Strange card game",
    "timestamp": 1629410400
  },
  {
    "username": "Sparticuse",
    "rating": 2.0,
    "comment": "There are plenty of opportunities for incredibly spiteful plays and no way to plan around them. Easily the worst trick taking game I’ve played.",
    "timestamp": 1536876000
  },
  {
    "username": "mistermarino",
    "rating": 3.0,
    "comment": "BGG says I played this and hated it. Surely BGG wouldn't lie to me?\n\nI guess technically I told BGG that I played this and hated it. But I don't remember doing that, and I don't remember this game.",
    "timestamp": 1673650800
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "On surface level, the not-too-chaotic 3-4 player version of Sticheln seems to have a higher skill ceiling than Hearts, thanks to each player being subject to both their own penalty suit and a point incentive for them to win non-painful tricks. However, that all non-leading suits are simultaneous trumps is quite baffling, because almost no amount of clever play allows to truly overcome a hand of mostly high values. Of course, this kind of problem tends to even out over the course of 10+ rounds; but it's rather difficult for me to maintain interest in a self-proclaimed modern classic of trick-taking that, amongst its very minimal rules, lists a mistake that was already avoided by popular pre-20th century card games.\n\nUpdate - Holy cow, my laziness was both a boon for my experience and, in hindsight, the final nail in Sticheln's coffin. Unwilling to dust off my German, I had been initially playing a popular mistranslation of the rules, where players must follow suit when possible. It turns out they're not even supposed to be tied by that restriction, which shifts the whole thing way too close to a \"take that\" game for my taste. Maybe that better players than me see some genius here. What I mostly see in Sticheln is an affordable set of large suits, useful for prototyping better games.",
    "timestamp": 1670367600
  },
  {
    "username": "Arnar146",
    "rating": 4.0,
    "comment": "Gulli",
    "timestamp": 1754431200
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "A rather disappointing game. I've been wanting to play Sticheln for a long time. In the end I found it uninteresting. Maybe there is a strategy where you try to search for which suits your opponent is out of and try to use them to stick them with pain cards.",
    "timestamp": 1738537200
  },
  {
    "username": "PfrBraun",
    "rating": 5.0,
    "comment": "Sticheln – oder: systemfrei disruptiv! Mit Sticheln liegt mit Sicherheit der zentrale Reboot des Stichspiels vor. Darauf verzichtend, bedienen zu müssen; so sehr den Kopf verzwirbelnd, weil Punkte vermeiden zählt; so regelbrechend, weil die Trümpfe so unklar sind. Wer klassische Stichspiele kennt und schätzt, der wird 1993 mit Sticheln etwas nie Dagewesenes in den Händen gehalten haben. Das ist zu würdigen und nicht zu Unrecht wird Sticheln bis heute gepriesen. Das war Disruption als das Wort noch gar keine Rolle spielte. Gleichzeitig radikalisierte Palesch mit seinem taktischen Stichspiel den Zugang, die Spieler:innen von der Hand in den Mund leben zu lassen. Karten gekloppt werden da nicht; jeder Wurf will überlegt sein. Dabei ist der beste Platz in der Runde hinten. Da hat man die freie Wahl, ob es Pluspunkte für sich selbst oder Miese für die anderen gibt. Das dynamisiert das Blatt, wie es den Gedanken eines „Blatts“ wegwischt. Was sinnvoll gespielt wird, ergibt sich ad hoc. Die Hoffnung ist, dass es am Ende aufgeht – was nicht gesagt ist. Von daher kommt die Disruption mit einer ziemlichen Systemfreiheit um die Ecke. Kartenhand lesen? Fehlanzeige. Nun braucht ein Stichspiel nicht notwendigerweise eine zweite Ebene Sondermechanismus (Ansagen, Sammeln, Vermeiden). Aber die eingeschränkte Aneignungspotentialität des Ablaufs stichelt schon. Mehr als die Minuspunkte.",
    "timestamp": 1734217200
  },
  {
    "username": "Victoria_hermit",
    "rating": 5.0,
    "comment": "Trick taking card game (like Tichu, Rook). Avoid.",
    "timestamp": 1667689200
  },
  {
    "username": "slkg",
    "rating": 5.0,
    "comment": "Don't love the original game -- too much Take That. But glad to have the deck for other games",
    "timestamp": 1667343600
  },
  {
    "username": "jatang",
    "rating": 5.0,
    "comment": "Played quickly.",
    "timestamp": 1665180000
  },
  {
    "username": "adamolanna",
    "rating": 6.0,
    "comment": "giocato su BSW",
    "timestamp": 1754776800
  },
  {
    "username": "jerevinan",
    "rating": 6.0,
    "comment": "가볍게 먹이기 게임을 할 수 있는 트릭테이킹 비스무리한 것",
    "timestamp": 1752098400
  },
  {
    "username": "BoomDooger",
    "rating": 6.0,
    "comment": "Chels: 5\nAnt: 7\n\nDelightfully mean, if a little chaotic for a quick, take that style card game. The idea of a pain suit paints beautiful targets all around the table.",
    "timestamp": 1751752800
  },
  {
    "username": "lawmen",
    "rating": 6.0,
    "comment": "避墩型吃墩，不強制跟色，但不跟色會變成王牌，玩起來還可以",
    "timestamp": 1749679200
  },
  {
    "username": "VioletSquirrel",
    "rating": 7.0,
    "comment": "a bit of a twist on trick taking\nand can be really mean, I mean, it's best/most efficient played mean eg make someone get negative points",
    "timestamp": 1760565600
  },
  {
    "username": "Lochi",
    "rating": 7.0,
    "comment": "Walla?",
    "timestamp": 1759788000
  },
  {
    "username": "Mind4u2c",
    "rating": 7.5,
    "comment": "ROATAN\n\nEverything is Trump, and people are out to wreck you because there is one color you don't want to win and everyone knows it.\n\nIt's such a unique card game state of controlled chaos that it is hard to play well, but it tempts you to try. It breaks traditional trick-taking conventions in unique ways and should have a home in every serious card game fan's collection.",
    "timestamp": 1756072800
  },
  {
    "username": "GinoPino39",
    "rating": 8.0,
    "comment": "Fun trick taking game, in which you try to avoid taking cards of your pain suit.",
    "timestamp": 1755900000
  },
  {
    "username": "mrfixsimmons",
    "rating": 9.0,
    "comment": "Not as mean as people say. Just pay attention. I love that you can’t break the game and can play any card you want. Too many must follow trick takers always have a turn where someone accidentally plays off suit when they weren’t supposed to. This game also allows for last minute comebacks too.",
    "timestamp": 1752789600
  },
  {
    "username": "ansi",
    "rating": 9.0,
    "comment": "Wow. what a turnaround. I used to rate sticheln as a \"2\", but after giving it a new chance it really started to grow on me.",
    "timestamp": 1750024800
  },
  {
    "username": "r0cka",
    "rating": 10.0,
    "comment": "3-4p",
    "timestamp": 1736204400
  },
  {
    "username": "A304606",
    "rating": 10.0,
    "comment": "Fun.",
    "timestamp": 1715983200
  }
]