[
  {
    "username": "Sky Sternberg",
    "rating": 1.0,
    "comment": "Admittedly, I have only played it once, but it seemed so bad that I have no desire to try it again and then there are a zillion pieces. This ranks right up there as one of the worst games I have played. I would grab candyland first!",
    "timestamp": 1298070000
  },
  {
    "username": "Florik",
    "rating": 2.0,
    "comment": "I bought this as a fan of the CoC roleplaying game. Horrible to play, but there's not the least bit of horror (as a theme) in it. It's got nothing to do with Lovecraft at all.",
    "timestamp": 1268607600
  },
  {
    "username": "FredKiesche",
    "rating": 3.0,
    "comment": "First (Chaosium) edition. None of us could get through it. No idea if current edition (and spinoffs) is any better.",
    "timestamp": 1504303200
  },
  {
    "username": "Ternal2",
    "rating": 4.0,
    "comment": "J3 i J4",
    "timestamp": 1751493600
  },
  {
    "username": "emperormark",
    "rating": 5.0,
    "comment": "Was great in the 80's, but by today's standards it's a mess!",
    "timestamp": 1591394400
  },
  {
    "username": "svalladolid",
    "rating": 5.0,
    "comment": "Game takes sooo long.",
    "timestamp": 1451516400
  },
  {
    "username": "mistermarino",
    "rating": 6.0,
    "comment": "It's a cool historical artifact but not a great game. As fiddly as the second edition can be, it's a dramatic improvement over this.\n\nI played solo and not only lost brutally, but it dragged. It feels harder to win, and there are more rules ambiguities.\n\nWith only six possible encounters at each location, it gets stale. And the monster movement gets nigh unmanageable by mid-game, with so many critters circling the board.\n\nThis was probably pretty badass back in 1987. But it's 2021, and it's clearly been surpassed. Even I, with my near unconditional love for all things Arkham, feel it's unlikely I'll play this again.\n\nThe 6 rating is generous, because it's still Lovecraft.",
    "timestamp": 1630879200
  },
  {
    "username": "Paula_perez",
    "rating": 6.0,
    "comment": "Interesante",
    "timestamp": 1622498400
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.1,
    "comment": "The original Arkham Horror, by Chaosium, is the sort of game you should play with Role Players when you're too burnt out to really roleplay. The game is heavily themed, and fun as an event. Played many times in years of yore.\n\nOLD SCHOOL COLLECTION",
    "timestamp": 1759615200
  },
  {
    "username": "sbuge",
    "rating": 8.0,
    "comment": "This is starting to become my favourite Arkham game.\nBut I have added some stuff from the 2nd edition (and I will add more later).\n\nThe key is not to add too much stuff. To keep this moderately a simple and not tablespace-hungry game.\nFunny, but that is how I nowadays enjoy Arkham Horror.",
    "timestamp": 1615330800
  },
  {
    "username": "Posco",
    "rating": 8.8,
    "comment": "QUEST: A TIME OF HEROES",
    "timestamp": 1750802400
  },
  {
    "username": "kutaputa",
    "rating": 10.0,
    "comment": "classic",
    "timestamp": 1536271200
  }
]