[
  {
    "username": "Visinurland",
    "rating": 1.0,
    "comment": "鱼头",
    "timestamp": 1735081200
  },
  {
    "username": "Euroman",
    "rating": 2.0,
    "comment": "This game is mean. Though I like other Knizia push your luck games like M'LEM and Abandon Ship, this game is a snooze-fest. We played, I won, I didn't care. Also didn't think I did anything to help me win. Just did the obvious thing and rolled the right dice. Boring. Play M'LEM instead.",
    "timestamp": 1733094000
  },
  {
    "username": "coldkorn",
    "rating": 3.0,
    "comment": "Just play can't stop",
    "timestamp": 1752184800
  },
  {
    "username": "warlock000",
    "rating": 4.0,
    "comment": "I like the general concept of Rapido, but it's way too easy to bust on subsequent re-rolls with just one X rolled so the game feels too swingy with too many empty turns. I feel that the incentive for pushing your luck to roll doubles is not strong enough if all it takes to bust on second+ re-roll is a single X. This feels not only like a totally outdated \"lose a turn\" mechanism, it's even worse than that as you actually lose progress. I know that this is supposed to be a light filler, but there's something deeply unsatisfying about that rule.\n\nThe other issue I have is that when the leader is at the second to last stair (or generally at one of the top spots on the track) and places his dice on the \"1\" spot you have to sacrafice your turn (and move 0, even if you rolled very high) in order to kick out his dice and stop him from winning on his next turn. And this often means that the responsibility of stopping the leader is shifted to the next player to the right (usually the last player to roll before the leader) and this player cannot progress at all if they want to stop the leader (unless they roll doubles). I don't like this feeling as there's always that one player who has to take one for the team in such a scenario.",
    "timestamp": 1702594800
  },
  {
    "username": "mawilson4",
    "rating": 5.0,
    "comment": "This hints at what I want Can't Stop to be, but that potential is also partially theoretical instead of actual. Excape (Rapido in some editions) allows you both the dice-based decisions and the tier choices that can affect any or all players and their chances to move along the track. The risk/reward of staking a higher claim, and when (and who) to bump, adds a layer beyond just the dice rolls that I find amusing and interesting.\n\nThe issue is that busts are exceedingly common, relegating some to simply watch others play the game. As are situations where you're sort of forced by the situation to re-roll hoping for 70+ and generally bust. As is rolling doubles, which can invalidate and undermine the more interactive \"bet\" mechanic with rolls. Add those all together and the chances of a lackluster session for one or more players are exceedingly high.\n\nIt's a brilliant individual idea in search of a game that fully actualizes it, and surrounded by a bunch of stuff that undermines the good parts.",
    "timestamp": 1753221600
  },
  {
    "username": "Zaytor",
    "rating": 4.5,
    "comment": "**\n\nNot a bad game, but it is extremely light. I was expecting a little more neck-to-neck gameplay, but like anything luck driven, this wasn't the case.\n\nThe components are nice and durable.",
    "timestamp": 1750024800
  },
  {
    "username": "Ephorus",
    "rating": 6.0,
    "comment": "What I like:\n- It does what it's supposed to do. So much fun, many groans, and lucky streaks. Just amazing what one can do with a couple of dice.\n\nWhat I dislike:\n- Mindless, decisions are pretty much straightforward.\n- Could run a bit long.",
    "timestamp": 1758232800
  },
  {
    "username": "Eiska",
    "rating": 6.0,
    "comment": "A clever push-your-luck game without anything unnecessary, such as theme. Vintage design, but it still works well in these days. One of the earlier Knizia pieces.",
    "timestamp": 1752444000
  },
  {
    "username": "MikeTuna",
    "rating": 7.0,
    "comment": "I was introduced to this by a friend who regularly used it as an opener at his game night, and it's perfect in that space. It's a great little dice game for casual gamers -- easy to teach, quick to play, and dice rolls always make for some exciting moments. The decision making is limited, but does offer enough that there are certainly some strategic moments in the game. I finally picked up my own copy about the same time I bought Las Vegas and for a filler dice game, I would be hard pressed to choose a favorite between the two. Excape plays in about half the time of Las Vegas, which gives it an edge, but both are very enjoyable.",
    "timestamp": 1758232800
  },
  {
    "username": "CotB",
    "rating": 8.0,
    "comment": "Rankings\n115th Best Game 2022\n77th Best Game 2023\n62nd Best Game 2024",
    "timestamp": 1757109600
  },
  {
    "username": "Ddyraw",
    "rating": 9.0,
    "comment": "Love this game, knocking people out of a spot is fun.\n\nNeed another play.",
    "timestamp": 1759356000
  },
  {
    "username": "zenpunk",
    "rating": 9.5,
    "comment": "Push-your-luck dice-rolling race, with screwage.",
    "timestamp": 1749506400
  }
]