[
  {
    "username": "luke841",
    "rating": 1.0,
    "comment": "Played on BGA. Gross game.",
    "timestamp": 1688680800
  },
  {
    "username": "Rabbits",
    "rating": 2.0,
    "comment": "Actually gave it a point because you can teach your kids something with this game. That is about it.",
    "timestamp": 1484607600
  },
  {
    "username": "candoo",
    "rating": 3.0,
    "comment": "January 2017 first play:\n\nWAAAAAAAY too long for what it is.\n\nLay down an arrow in the direction you need it and wait for your opponents to inevitably screw you over by changing it to the direction that your opponent needs.\n\nA three player adult game clocked well north of two hours. That is ridiculous by 2017 standards when there are so many heavy meaty games that clock less than that. Playing this with kids to teach them geography for 30 minutes would be okay. But at 135 minutes, it just doesn't fit in modern gaming.",
    "timestamp": 1565128800
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "I don't like many of Kramer's games, and this one didn't compel me. Probably good for the time, but I found it pretty dull compared to other route games. I would rather play any cube rail game.",
    "timestamp": 1732489200
  },
  {
    "username": "spencyrrh",
    "rating": 5.0,
    "comment": "2023-06-05 (1 play at 4 on BGA): NB: I haven't played any previous edition.\n\nSimple, lightly thinky, and mean, which is a good combo for me. It feels quite vulnerable to who is at the table and what order they sit in, although that isn't a great sin in my eyes. A little dry and light on tabletalk, perhaps? I played on BGA, admittedly. But despite the high interactivity of the boardstate I think the play is a puzzle in the player's head. All another player can do is suggest whole turns for you.\n\nI could see someone having this as a family game instead of, say, Ticket to Ride.\n\nThe board is saturated with colour, making it quite hard to parse. The colourful primary arrows on top of a blazing blue and green board is a bit of a nightmare. A cute sepia map would have been a much better choice. I have quite bad eyesight, so perhaps others, playing a physical copy, may feel differently.",
    "timestamp": 1744236000
  },
  {
    "username": "ciceroni",
    "rating": 5.0,
    "comment": "Good entry level game, but I felt most of the turns the optimal move was quite obvious and if newer gamers fail to see them, they are out of contention to win.",
    "timestamp": 1739401200
  },
  {
    "username": "Bourbon_Kid",
    "rating": 6.0,
    "comment": "1997",
    "timestamp": 1760824800
  },
  {
    "username": "Jedita",
    "rating": 6.0,
    "comment": "BGA",
    "timestamp": 1745013600
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 4005556263554\nGL2",
    "timestamp": 1757368800
  },
  {
    "username": "gmcnish",
    "rating": 8.0,
    "comment": "Great not too heavy, fun game, with little down time as you scan for possible routes (not that they'll be available when it comes to your turn). I love a game where it's possible to make a brilliant move.\nPlayed 10 times (finally found a Nat Geog copy).",
    "timestamp": 1749679200
  },
  {
    "username": "anim8r",
    "rating": 9.3,
    "comment": "Apparently, this game has been around for ages but I have only just discovered it with this new edition ...and it is awesome! Can be taught in 10 min to just about anyone, build routes to reach certain destinations (some public, some secret), share control of 3 expeditions competitively to have them go where YOU want, and avoid going towards your opponents' goals— makes for engaging interaction between all players. A breezy 45min game that scales up to 6 players (probably more tactical, but still fun)! Love the elegant design and am very excited to play more!\nPain Points: Maybe the tactical gameplay at higher player counts might be an annoyance for some and there isn't much to make each game experience varied other than the locations one ends up with. That might be enough for some and not for others.\n\nMore, on my ⟣⧗First Pass⧗⟢ Blog:\nhttps://boardgamegeek.com/blogpost/161771/anim8rs-new-to-me-...",
    "timestamp": 1749765600
  },
  {
    "username": "btasam",
    "rating": 9.5,
    "comment": "Phenomenal gem; so much depth for something that's both beautiful and simple to play.",
    "timestamp": 1759183200
  }
]