[
  {
    "username": "joebelanger",
    "rating": 1.0,
    "comment": "Too many little exceptions that it felt clunky.",
    "timestamp": 1425942000
  },
  {
    "username": "Burrito",
    "rating": 2.0,
    "comment": "Haven't played yet.",
    "timestamp": 1616367600
  },
  {
    "username": "HardCore",
    "rating": 3.0,
    "comment": "Played it once long ago. I can't remember if I like it or not.",
    "timestamp": 1506290400
  },
  {
    "username": "rynelf",
    "rating": 3.5,
    "comment": "--Dec2003-- Bad rules. The game might be playable, but the rules are too poorly written to make the attempt lightly.",
    "timestamp": 1680559200
  },
  {
    "username": "Red Eye",
    "rating": 5.0,
    "comment": "SoS: After a few plays maybe this game would make some sense BUT way too many better options ahead of it to get to that point!",
    "timestamp": 1645225200
  },
  {
    "username": "wkusau",
    "rating": 5.0,
    "comment": "Played once long ago. I remember very little.",
    "timestamp": 1344808800
  },
  {
    "username": "vladdswrath",
    "rating": 6.0,
    "comment": "In a very broad sense, Overthrone is a trick taking game. Except everyone is playing for multiple suits at the same time, and then there are a bunch of other rules and mechanisms operating outside the trick taking that give the game it's feudal court flavor.\n\nIt's fun for what it is, a take that card game once you learn the rules. But it's definitely from it's era, when there wasn't twenty other games that do what it does better, and when people had time to learn and digest all the extra rules. In other words, it's great piece of nostalgic fun if you grew up with it, but it's a hard sell to anyone that didn't.",
    "timestamp": 1661378400
  },
  {
    "username": "Koreanator",
    "rating": 6.0,
    "comment": "Nice game, with a few flaws.",
    "timestamp": 1345586400
  },
  {
    "username": "brothervm",
    "rating": 7.0,
    "comment": "Main drawback with this game is it is minimum of 3 players. Quite a bit of luck involved too, but used to love this game - has a special place in my memory.",
    "timestamp": 1527631200
  },
  {
    "username": "tphon",
    "rating": 8.0,
    "comment": "BNIS",
    "timestamp": 1729807200
  },
  {
    "username": "IQTom",
    "rating": 9.0,
    "comment": "This game is not bad--it's excellent in fact-- it's just misunderstood. Granted, you won't really 'get it' the first time you play as it's a bit non-intuitive. The rulebook could be better but really it's all in there. Our group was lukewarm to it after a couple plays but it really grew on us. For a time we were playing it every week. And though it has the luck element you will always have with a card game, the better players will usually win. This game is much better than its BGG rating.",
    "timestamp": 1464127200
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "unpunched",
    "timestamp": 1714946400
  }
]