[
  {
    "username": "Zeleboba",
    "rating": 1.0,
    "comment": "While playing games cannot forget that AEG has poor customer service, works basically for US.",
    "timestamp": 1722290400
  },
  {
    "username": "RogerDHyman",
    "rating": 1.0,
    "comment": "I had gaming buddies who really liked this, so I played a couple of times with them.\nNever again. Mostly tedium, followed by intense chaos, where nobody knew what was happening. This is really a very bad party game, but is too complicated for your average party-goers.\nYMMV.",
    "timestamp": 1720303200
  },
  {
    "username": "Esyhpe",
    "rating": 1.0,
    "comment": "Un déchet",
    "timestamp": 1716501600
  },
  {
    "username": "FlinkerOeli",
    "rating": 1.0,
    "comment": "Really bad game...so boring and dumb.",
    "timestamp": 1610751600
  },
  {
    "username": "Phoenixgeek",
    "rating": 1.0,
    "comment": "I suspected that this would not be a game for me and I tried to keep an open mind butwithout doubt this was the worst gaming experience that I have ever had. I know that lots of people really like this but it fell so flat when we played. I will never be persuaded to play it again (We abandoned the game half way through).",
    "timestamp": 1598306400
  },
  {
    "username": "magpie65",
    "rating": 1.0,
    "comment": "Buy the original, the current publisher has failed.",
    "timestamp": 1587333600
  },
  {
    "username": "Tito_Atio_Labieno",
    "rating": 1.0,
    "comment": "Possibly the worts game experience I have ever had.",
    "timestamp": 1562882400
  },
  {
    "username": "Lieren",
    "rating": 1.0,
    "comment": "A long game that is terrible!",
    "timestamp": 1391900400
  },
  {
    "username": "emagius",
    "rating": 1.0,
    "comment": "A luck-driven, incredibly lengthy and degenerate \"beer & pretzels\" game where most of the players just sit around until someone activates the nuclear option of the coup, which makes the game even longer and less interesting. The concept is interesting, but the execution is terrible.",
    "timestamp": 1313186400
  },
  {
    "username": "rorshaq",
    "rating": 1.0,
    "comment": "a truly horrible game - VERY LONG and tedious and made me angry which hasnt happened since munchkin",
    "timestamp": 1310248800
  },
  {
    "username": "beckeykevin",
    "rating": 1.0,
    "comment": "The assignment of roles gets less and less interesting each hour that you spend on this game. The same can be said for the voting on the budget, assasinations and coup attempts. Basically a 2-7 hour party game for players that want a cheesy roleplay experience.",
    "timestamp": 1276984800
  },
  {
    "username": "derscheid",
    "rating": 1.0,
    "comment": "Another game in my Never-Again category. Combat phase is pointless and distracting; I understand there's a faster combat-resolution method floating around the 'net somewhere. Too late for me, might help you...",
    "timestamp": 1034978400
  },
  {
    "username": "Cyryl",
    "rating": 2.0,
    "comment": "Znacznik banana +1",
    "timestamp": 1751925600
  },
  {
    "username": "wizordrio",
    "rating": 2.0,
    "comment": "The worst board game I have ever played. I don't know, I guess it just isn't for me. I've given it several tries but everytime it was just boring, not rewarding at all, felt random in the worst way possible and just very unfun in general.",
    "timestamp": 1727906400
  },
  {
    "username": "ryder",
    "rating": 1.5,
    "comment": "",
    "timestamp": 1712008800
  },
  {
    "username": "Garnett11",
    "rating": 2.0,
    "comment": "Abstract, long for no good reason, pointlessly bickering over the overthrowing of the president. At which point another \"president\" takes over and here we go again. Pointless.",
    "timestamp": 1705532400
  },
  {
    "username": "Eugeniosaracino",
    "rating": 2.0,
    "comment": "Esp) Nunca jugado. Mas alla de que el tema no me parece correcto, la producción de ToyCo (argentina) es una vergüenza total.",
    "timestamp": 1696543200
  },
  {
    "username": "Warren Bruhn",
    "rating": 2.0,
    "comment": "Supposed to be funny, but a game that revolves around corruption and assassinations isn't amusing to me.",
    "timestamp": 1678834800
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "32\n\nToo complicated rules that you have to remember. And a lot of comments saying it takes over 3 hours, most probably 5hours. And it needs 5-7 players. I think I will never bring it to the table.",
    "timestamp": 1665784800
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Don't like it",
    "timestamp": 1628287200
  },
  {
    "username": "asfhgwt",
    "rating": 2.0,
    "comment": "Unpleasant, overly complex and drags on far too long.",
    "timestamp": 1599516000
  },
  {
    "username": "HiTracey",
    "rating": 2.0,
    "comment": "My rating reflects my detestation of this game rather than being a measured reflection of its quality. But life's not fair, as you'll be reminded if you play it.\n\nComplexity - 2/10",
    "timestamp": 1574809200
  },
  {
    "username": "Yokiboy",
    "rating": 2.0,
    "comment": "Much too long for a one trick pony! There are so many better modern games that does a similar thing in a fraction of the time.",
    "timestamp": 1559340000
  },
  {
    "username": "NoxMortem",
    "rating": 2.0,
    "comment": "One of the most funny games i ever played. Needs the right round of people. Even more fun when people can play their roles good. Needs people who can seperate between one round and another.\n\nUpdate 11.11.18 to 2: It's age shows. There are so much better games nowadays. Will not play this again.",
    "timestamp": 1541890800
  },
  {
    "username": "oursino",
    "rating": 3.0,
    "comment": "Le thème me plait mais trop long pour le plaisir apporté.",
    "timestamp": 1744840800
  },
  {
    "username": "JohnnyDgame",
    "rating": 3.0,
    "comment": "fun but never gonna play it again.. too old for my taste",
    "timestamp": 1698184800
  },
  {
    "username": "Radge",
    "rating": 3.0,
    "comment": "?",
    "timestamp": 1687471200
  },
  {
    "username": "RandaPrince",
    "rating": 3.0,
    "comment": "I just don't like back-stabbing games.",
    "timestamp": 1687125600
  },
  {
    "username": "bneffer",
    "rating": 3.0,
    "comment": "Never understood this game as a kid",
    "timestamp": 1681941600
  },
  {
    "username": "Donniedarko01",
    "rating": 2.5,
    "comment": "Un clásico básico. Antes lo buscaba, ahora lo evito.",
    "timestamp": 1678662000
  },
  {
    "username": "Capn Hook",
    "rating": 3.0,
    "comment": "confused rule book; hard to find players;",
    "timestamp": 1677106800
  },
  {
    "username": "stenole",
    "rating": 3.0,
    "comment": "(7P) A political game where players try to get as much money out of a failed nation state without getting killed by your rivals. Players will attempt to stay in power, by enlisting the other players and paying them enough to keep them loyal. This loyalty is tested during coups, which in terms of gameplay slows the game down and gives it a more serious atmosphere. The game fails to properly consolidate the two modes of play that this game offers.",
    "timestamp": 1652824800
  },
  {
    "username": "Mattias",
    "rating": 3.0,
    "comment": "Fun but broken.",
    "timestamp": 1651528800
  },
  {
    "username": "Puggen",
    "rating": 3.0,
    "comment": "This game had so much potential if they had made a propper battle system for the reprint. Anything will do better then the current battle system. As a Role Playing Game, it is outstanding and very funny.",
    "timestamp": 1635372000
  },
  {
    "username": "djbrickhaus",
    "rating": 3.0,
    "comment": "For me, the description on the back of the box was the best part of the game. I was so excited to give this one a go, but that ended shortly after starting the game. Games are supposed to be fun, and this one should have been right up my ally, but it fell overwhelmingly short.",
    "timestamp": 1630879200
  },
  {
    "username": "Beast_of_Leisure",
    "rating": 2.5,
    "comment": "Shows its age. Really overwrought game time for the experience it offers, it is not worth the time investment at all. The card play is a crapshoot - so few meaningful choices to be made. The most interesting part of the game is choosing which location to go to and, if you have the ability to assassinate, who to target and trying to guess where they are. The whole combat portion of the game is a bore and could be resolved in a fraction of the time. This game is a relic that I have no nostalgia for.",
    "timestamp": 1610578800
  },
  {
    "username": "Kiyote",
    "rating": 4.0,
    "comment": "Leisure Ways 1988",
    "timestamp": 1739919600
  },
  {
    "username": "zardon",
    "rating": 4.0,
    "comment": "Incredibly thematic, lots of laughs, but it just takes too long to play. Way too much downtime, and creating a coup adds 25 mins+ to the game each time. There is a huge luck in the draw in the cards you get and I find most of the cards are pretty useless unless you are lucky enough to get the exact sequence you need.\nI also found that the last round seems like a waste, as the coup does nothing, and being el presidente at the end of the game doesn't do anything.\n\nI'm sorry, this game isn't for me. It simply takes too long to play and the downtime is just too painful for me\n\n4/10",
    "timestamp": 1733526000
  },
  {
    "username": "RedwoodCroft",
    "rating": 4.0,
    "comment": "Some people love this. I'm not one of them.",
    "timestamp": 1727042400
  },
  {
    "username": "chrisgledhill",
    "rating": 4.0,
    "comment": "Daft, plodding, garish, but enough charm to save from The Yellow Bin.\n\nSatiro pri \"bananeca respubliko\".\n\nOni prefere ludu nur kun la politika parto de la ludo (diplomatio kun dispdonado de mono kaj poitikaj pozicioj) sen uzi la regulojn pri ŝtatrenverso. La ŝtatrenversa parto de la ludo aspektas tradician militoludon, sed ne estas aparte interesa. Spertaj ludantoj ofte uzas siajn proprajn regulojn por anstataŭ tion (ekz. oni uzu la konflikto-sistemon de Imperial / Imperial 2030, kiu ne dependas de kuboĵetoj.",
    "timestamp": 1723068000
  },
  {
    "username": "grabben",
    "rating": 4.0,
    "comment": "The total randomness of the distribution of votes kind of ruins the game. If it was shorter it could have been ok.",
    "timestamp": 1690322400
  },
  {
    "username": "B41939",
    "rating": 4.0,
    "comment": "I had the older edition (in shrink), the one with the guys with explosives hanging on to the balcony under El Pres. I recall rules problems, but I still prefer it to the edition pictured. It deserves another look.",
    "timestamp": 1689717600
  },
  {
    "username": "HavocIsHere",
    "rating": 4.0,
    "comment": "A long and boring way to foster bad feelings in a gaming group. I think the first reason is that it is too long to be fun.\nRemoving the wargame in it might improve it.",
    "timestamp": 1681077600
  },
  {
    "username": "ToreDenmark",
    "rating": 4.0,
    "comment": "Way way too long. Good idea, but the length drags it down.",
    "timestamp": 1679954400
  },
  {
    "username": "rabid_schnauzer",
    "rating": 4.0,
    "comment": "Very 80s",
    "timestamp": 1646521200
  },
  {
    "username": "patvonp",
    "rating": 4.0,
    "comment": "Long time since I played.",
    "timestamp": 1642546800
  },
  {
    "username": "cmpearson10",
    "rating": 4.0,
    "comment": "Never again.",
    "timestamp": 1597010400
  },
  {
    "username": "jcarvin",
    "rating": 4.1,
    "comment": "I tried but this just isn't my style of game.",
    "timestamp": 1579129200
  },
  {
    "username": "adamolanna",
    "rating": 5.0,
    "comment": "Acquistato in un mercatino dell'usato",
    "timestamp": 1756159200
  },
  {
    "username": "apisapia",
    "rating": 5.0,
    "comment": "holy hell - what a trashy game. can be fun when everyone is in the right mood for randomness, trash talk and backstabbing.",
    "timestamp": 1752098400
  },
  {
    "username": "BGTitan",
    "rating": 5.0,
    "comment": "Game was interesting, to say the least. It was relatively fast-paced and has very many twist and turns, with betrayal and deal at every point. The game did feel a bit all over the place, though. My group played for about three hours and we never really fully understood the game and made mistakes the whole time. Also, the end of the game was very disappointing. We finished off with a final coup attempt, but because of the way the resolution phase works, we had one or two people deciding who wins the game, which is never a fun way to end. I couldn't imagine playing for longer and we ended up take away half of the money deck so the game would go faster. The multi-staged gameplay kept me attentive the whole time, but the game can be very unbalanced if one person gets better cards/more votes in the voting phase. Probably better to play with an even amount of players, so that it can end up usually being a 2v2 or a 3v3.",
    "timestamp": 1747346400
  },
  {
    "username": "GarcianIII",
    "rating": 5.0,
    "comment": "A game that is only enjoyable thanks to the people that you play with.\n\nAs a pure piece of game design it clearly shows its age. For one, the game length is terrible. It is so misshapen. I actually really enjoy the concept of a light-hearted negotiation game carrying quite an elaborate wargame within it. However, that individual wargame 'coup' section can sometimes take 45minutes+ if the battle runs close.\n\nAnd then you are simply back to the negotiation module with barely any significant long lasting changes. Rinse and repeat. There is also something strange about how performing a 45 minute coup has the same gameplay impact as succeeding with a 1 minute-to-resolve assassination attempt. It is all so uneven. If this was made today, i am sure that there are numerous ways to make this a more coherent and polished experience whist not losing any of the core experience or appeal.\n\nAnd there is some appeal here. Assigning a budget and cabinet is fun. The game wears its heart on its sleeve and kind of knows what it is. How much actual control you have over proceedings is worrying though; an epic 5 hour game can come down to one correct guess or swing of luck from a single dice. In that regard, the game is simply old, beaten bananas....",
    "timestamp": 1733526000
  },
  {
    "username": "Reggie0",
    "rating": 5.0,
    "comment": "D",
    "timestamp": 1716242400
  },
  {
    "username": "JanSolo999",
    "rating": 5.0,
    "comment": "Familias tratan de hacerse millonarias en una república bananera. Politiqueo, revolución, asesinados y complots. Admite muchos jugadores aunque es un juego de larga duración.",
    "timestamp": 1715032800
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "Junta is a fun and, at times, quite silly game of constant backstabbing. You can raise a coup d'etat and contract killers with one single objective: take possession of your opponents' money. So yes, it's a game of being mean, but in a fun way.\n\nIn junta players form the government of a banana republic. The objective isn't to actually rule the country, but to steal as much money from it as you can. A key mechanism is, whenever you die, you loose all the money you have in your hands. In order for it to be accounted, you need to make it to the bank, to deposit it in your Swiss bank account.\n\nEach turn, the president proposes how to distribute the foreign aid, on which the rest of the players vote. But what if you disagree? What if the voting passed and you didn't liked its outcome? Coup! Another player received more money than you? Coup! But what if you don't feel like starting a coup? Coup! I mean, assassin! It's a game of negotiation and backstabbing, yes, but the atmosphere is so chaotic that you don't feel much like being betrayed: it's simply the natural course.\n\nA coup d'etat starts a mini war game in which players take sides for either the president or the rebels. Don't think about it much though: you can change sides at almost any time. Players are given a certain amount of troops, depending on their office, and must take control of certain strategical locations. The side who controls the most locations wins, moment in which its respective leader chooses someone to be shot. Then the leader may share the loot if he feels keeping all the money would be greedy he won't make it to the bank without creating a couple of extra targets.\n\nThe game's main flaw is its downtime. The game doesn't reward careful planning, it rewards constant backstabbing. Think too much and other players will think you are up to something, thus other players will want to kill you. Thinking is counter productive. The key is making temporary alliances, not planning a master move.\n\nThe game is, at heart, chaotic. If a player fails to accept and embrace its nature, it can ruin its pace. This can be particularly troublesome during coups, where combat is really random and, in the end, it depends on whom sides with whom. Troop positioning is not all that important important: whom wants to backstab whom is.\n\nBasically, this is Junta. The rules are a bit clunky to explain, but very thematic, so you just need to see how a round in action to understand its flow of play. The game's core is so mean spirited the atmosphere is much more relaxed than in other betrayal-prone games. When everyone is constantly at each other's throats, when alliances last mere minutes, betrayals stop feeling personal and become stupidly hilarious.\n\nRating: \nOptimal number of players:\n6~7\n2~4\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "szadiamond",
    "rating": 5.0,
    "comment": "5 - 7 (best 7) players, 240min",
    "timestamp": 1700780400
  },
  {
    "username": "knoxville",
    "rating": 5.0,
    "comment": "Good fun when drunk!",
    "timestamp": 1696111200
  },
  {
    "username": "BronWebb44",
    "rating": 5.0,
    "comment": "Feels like it could use some refinement in design. I don't like that there are various different \"parts\" in the game that feel very unconnected.",
    "timestamp": 1694901600
  },
  {
    "username": "Seenias",
    "rating": 5.0,
    "comment": "The story you create can be fun but it takes way too long. Likely won't play again.",
    "timestamp": 1677106800
  },
  {
    "username": "Zeph!",
    "rating": 5.0,
    "comment": "Odd game",
    "timestamp": 1639782000
  },
  {
    "username": "Illyrien",
    "rating": 5.0,
    "comment": "I used to love it, but now, it just seems \"obsolete\", it lacks a lot of modern features and mechanics\nGive to Stefan",
    "timestamp": 1636066800
  },
  {
    "username": "rapires",
    "rating": 5.0,
    "comment": "InvictaCon 2016 (2nd hand)\n\n\n1985 West End Games English edition, with the old art. Very hard to bring to the table, maybe a sell opportunity.\n\nOut - Micael Sousa",
    "timestamp": 1624226400
  },
  {
    "username": "duckworp",
    "rating": 5.0,
    "comment": "Over long and unpredictable game length. A game of its era which I doubt will get played much these days.",
    "timestamp": 1622498400
  },
  {
    "username": "sevorges",
    "rating": 5.0,
    "comment": "With the right crowd this might work.",
    "timestamp": 1619301600
  },
  {
    "username": "Drakonio",
    "rating": 5.0,
    "comment": "40",
    "timestamp": 1615071600
  },
  {
    "username": "Klocktornet",
    "rating": 5.0,
    "comment": "Given away, 2021-01-08.",
    "timestamp": 1609974000
  },
  {
    "username": "Big Bad Lex",
    "rating": 5.0,
    "comment": "Maybe a bit too much randomness for my liking but a good one for 6-7 players.\nSold Nov 2020",
    "timestamp": 1606518000
  },
  {
    "username": "Ka_el_em_O",
    "rating": 4.9,
    "comment": "too messy, long and cut-throat for my collection",
    "timestamp": 1597096800
  },
  {
    "username": "Red Eye",
    "rating": 5.0,
    "comment": "Was okay - never really got into it that much.",
    "timestamp": 1589234400
  },
  {
    "username": "kps1ny",
    "rating": 5.0,
    "comment": "First nomination is made by game's owner. OmitFromRandomGamePickerApp",
    "timestamp": 1588629600
  },
  {
    "username": "Yoven",
    "rating": 5.0,
    "comment": "Wow. This ran 6+ hours with full player count and we did not even finish. No real wish to try again --> Trade pile",
    "timestamp": 1570744800
  },
  {
    "username": "farchamb",
    "rating": 5.0,
    "comment": "5",
    "timestamp": 1566684000
  },
  {
    "username": "Ayronis",
    "rating": 6.0,
    "comment": "Charming and zany old school game. Diplomatic and over-the-top. Could be a great time with the right group of (6+) players.",
    "timestamp": 1761105120
  },
  {
    "username": "TheJensStein",
    "rating": 6.0,
    "comment": "Good fun if you have lots of friends with lots of time that you can afford to lose.",
    "timestamp": 1759615200
  },
  {
    "username": "Sitnam",
    "rating": 6.0,
    "comment": "Silly ancient game that never-the-less brings back fond memories. There is so much better out there now.",
    "timestamp": 1755813600
  },
  {
    "username": "Mike Tuga",
    "rating": 6.0,
    "comment": "Bz",
    "timestamp": 1744927200
  },
  {
    "username": "halbower",
    "rating": 6.0,
    "comment": "A lot of great ideas in this tongue in cheek game. Unfortunately, the game is prohibitively long.",
    "timestamp": 1734303600
  },
  {
    "username": "Herrschn",
    "rating": 6.0,
    "comment": "- Lange downtimes und lange Spielzeit\n- viel Erklärung für einfache Spielmechanik und simplen Ablauf notwendig\n- immer gleicher Rundenablauf, häufig mit Putsch",
    "timestamp": 1729980000
  },
  {
    "username": "Bertuccia",
    "rating": 6.0,
    "comment": "While I love the theme and the politics, I found the fighting the most boring part. Game lasted way over its welcome.",
    "timestamp": 1726437600
  },
  {
    "username": "LibbyDoe",
    "rating": 6.0,
    "comment": "2nd Cull",
    "timestamp": 1722204000
  },
  {
    "username": "Decato69",
    "rating": 6.0,
    "comment": "A vendre ?",
    "timestamp": 1720994400
  },
  {
    "username": "jimok",
    "rating": 6.0,
    "comment": "This game is a ton of fun. It's too bad it can't be boiled down to an hour or two, as I feel it would have much broader appeal if it didn't take five hours to play. Who doesn't like to steal from the people, assassinate rivals, and hide out with their mistress?\n---\nUpdate, May 2024: I got rid of this during the Great Purge of 2023-24. I had fun with my plays, but not at all the kind of game I want to play these days.",
    "timestamp": 1716501600
  },
  {
    "username": "Richtoven",
    "rating": 6.0,
    "comment": "loved this for a while",
    "timestamp": 1715464800
  },
  {
    "username": "ToBakai",
    "rating": 6.0,
    "comment": "Sehr spezielles Spiel. Sehr viel Interaktion. Illustrationen ist dem Release Datum entsprechend. Wer nichts mit Politik am Hut hat wird hier definitiv nichts mit anfangen können.",
    "timestamp": 1711234800
  },
  {
    "username": "GeeJay7591",
    "rating": 6.0,
    "comment": "(2 3 4) 5 6 *7*",
    "timestamp": 1695333600
  },
  {
    "username": "Qumpelblase",
    "rating": 6.0,
    "comment": "Sei vorsichtig, mit wem du dieses Spiel spielst- es wird durchgehend gelogen, geblufft und gelinkt. Ich versichere, am Ende wird nur ein Spieler am Tisch zufrieden sein, der Rest wird den Sieg nicht anerkennen.",
    "timestamp": 1684879200
  },
  {
    "username": "josephfeller",
    "rating": 6.0,
    "comment": "Games I played age 11-20",
    "timestamp": 1684620000
  },
  {
    "username": "nerdygirl",
    "rating": 6.0,
    "comment": "New, never opened.",
    "timestamp": 1674860400
  },
  {
    "username": "Sedd",
    "rating": 6.0,
    "comment": "Bewertung nach einer abgebrochenen Runde. (Abruch, da Leute dazu kamen und Regeln nicht nochmal erklärt werden wollten)\nIch glaube das Spiel ist nicht wirklich was für mich. Denn der interessante Teil, jmd. anderen zu stürzen weil er schlecht verteilt hat, wird durch viel drumherum abgemildert und ich vermute daher eine hohe Downtime. Vermutlich werde ich eher mal \"Frieses Wucherer\" anschauen. (Oder juntas las Cartas) (Da gehts wohl hauptsächlich um die Abstimmungen)",
    "timestamp": 1671750000
  },
  {
    "username": "szurla",
    "rating": 6.0,
    "comment": "C4",
    "timestamp": 1663884000
  },
  {
    "username": "Samuel Vriezen",
    "rating": 6.0,
    "comment": "I have always had tremendous fun with this bit of cynical backstabbing.",
    "timestamp": 1659045600
  },
  {
    "username": "Dark_Hobbit",
    "rating": 6.0,
    "comment": "Hilarious but way too long",
    "timestamp": 1658872800
  },
  {
    "username": "ssa36",
    "rating": 6.0,
    "comment": "Fun drinking game with right people.",
    "timestamp": 1656972000
  },
  {
    "username": "Boozeroony",
    "rating": 6.0,
    "comment": "2",
    "timestamp": 1644274800
  },
  {
    "username": "Kremik",
    "rating": 6.0,
    "comment": "As soon as all players understand the mechanics, and especially their implications, a game of treachery and manipulation can commence. Sadly, the game is long, and best with 5+ people, who can be hard to assemble.",
    "timestamp": 1637276400
  },
  {
    "username": "benni_jolink",
    "rating": 6.0,
    "comment": "You win by promising your friends to collaborate, and then stabbing them in the back. Not sure it that's a nice way to spend an evening? This is an old-school game with fiddly old-school rules.",
    "timestamp": 1629237600
  },
  {
    "username": "Professor1",
    "rating": 7.0,
    "comment": "A lot of fun but you need 7 players to get the full potential",
    "timestamp": 1759615200
  },
  {
    "username": "Card",
    "rating": 6.5,
    "comment": "[$] Best with 7 (2-7) 240 mins, Age:16, 2.86 [$30] OOP, preorder",
    "timestamp": 1756072800
  },
  {
    "username": "larryonov",
    "rating": 7.0,
    "comment": "Best: 7, 6, 5",
    "timestamp": 1755036000
  },
  {
    "username": "marcx",
    "rating": 7.0,
    "comment": "leuk spel voor als je in een flauwe bui bent. Je probeert, als dictator, je geld naar je Zwitserse bankrekening te brengen. Dat lukt lang niet altijd.",
    "timestamp": 1753912800
  },
  {
    "username": "Bal_505",
    "rating": 7.0,
    "comment": "You can find me in the club, bottle full of bub'",
    "timestamp": 1743976800
  },
  {
    "username": "dER_aAl",
    "rating": 7.0,
    "comment": "5-7 empfohlen\n7 beste\n2,86 weight",
    "timestamp": 1743289200
  },
  {
    "username": "au64",
    "rating": 6.5,
    "comment": "This copy is unpunched.",
    "timestamp": 1742511600
  },
  {
    "username": "oldgoat3769967",
    "rating": 7.0,
    "comment": "this game is all about theme, which is not politiccal correct. The game is political, just more about stereotypes and inappropriateness. The rules for rhis game are complex and meandering in logic. The game play lends itself to randomness.",
    "timestamp": 1732230000
  },
  {
    "username": "James DeBenedetti",
    "rating": 7.0,
    "comment": "Fun game that (like Diplomacy) is more about the players than the game mechanics.",
    "timestamp": 1726437600
  },
  {
    "username": "dash.jp",
    "rating": 7.0,
    "comment": "I've played this game a long time ago that my friend has.",
    "timestamp": 1724018400
  },
  {
    "username": "retiresesame",
    "rating": 7.0,
    "comment": "Setting is very unique. It feels like it is mainly around balancing power and money to keep everyone happy. The plotting and coup attempts are fun, but take a lot of time with 6 players.\nThe rules are written very sloppily. I did not enjoy the fighting phases that much, as everyone is taking super long because you can be betrayed at any time. The cards are pretty unbalanced as some grant you 8 voting power forever and others are a +3 one time voting power bonus or require a lot of prerequisites.\nWith 6 new players we took 4 hours and went through 3 presidentships. This game takes long.",
    "timestamp": 1716588000
  },
  {
    "username": "RaistlinMajere",
    "rating": 7.0,
    "comment": "[I created a homemade version of the game] The game is really fun but it's very long... Backstabbing a gogo...!",
    "timestamp": 1715896800
  },
  {
    "username": "Nodens",
    "rating": 8.0,
    "comment": "If you want to make serious money don't start a revolution.",
    "timestamp": 1757023200
  },
  {
    "username": "moriarty",
    "rating": 7.6,
    "comment": "Simple, but fun. Will play if in the right mood. Not because it's not a good game, but because Junta requires a corrupt mind",
    "timestamp": 1735772400
  },
  {
    "username": "Alquerque",
    "rating": 8.0,
    "comment": "No llegue a jugarlo. Ante la imposibilidad de encontrar grupo interesado salio de la coleccion.Jugado en la asociación, muy divertido si se rolea.",
    "timestamp": 1735426800
  },
  {
    "username": "Aganthyr",
    "rating": 8.0,
    "comment": "2-7 players",
    "timestamp": 1732402800
  },
  {
    "username": "SeboEla",
    "rating": 8.0,
    "comment": "Wohnzimmer",
    "timestamp": 1728684000
  },
  {
    "username": "civil",
    "rating": 8.0,
    "comment": "This game provides unforgetable experiences. A new version that will shorten the game duration is needed.",
    "timestamp": 1716328800
  },
  {
    "username": "Omnipotatoe",
    "rating": 8.0,
    "comment": "Fantastic game! If you are ready to loose your friends,when you play this game with them, then you should give it a go.",
    "timestamp": 1715378400
  },
  {
    "username": "schmitze",
    "rating": 8.0,
    "comment": "Dramatic evenings when I was young!",
    "timestamp": 1709852400
  },
  {
    "username": "MacNial",
    "rating": 7.5,
    "comment": "Gigi",
    "timestamp": 1704927600
  },
  {
    "username": "ketchup61925",
    "rating": 7.5,
    "comment": "Deluxe Raised print box cover from Gen Con",
    "timestamp": 1700866800
  },
  {
    "username": "kijoe",
    "rating": 8.0,
    "comment": "El Presidente, with the right group, this is game is gold!",
    "timestamp": 1699225200
  },
  {
    "username": "Nostradamus71",
    "rating": 8.1,
    "comment": "Junta (2015) AEG, English edition\n2-7 players, best 6-7\n\nFun game of Banana Republic politics, if you can find the right 6-7 cutthroat gamers to play with you! And that's its main problem, finding enough of the right players. The second problem is its length at 4+ hours. But other than that, it's a unique game. I urge you to read more about it on its BGG page.\n\nBig pro: All players remain in contention to the very end, for no one knows who has managed to smuggle (and retain) the most money into their Swiss bank account!\n\nThis 2015 edition has:\nBigger map, some component changes, and a few rule changes (for example, Exile and Combat) have been made to improve the game play.\n\nDo we now have the Ultimate Edition? Hm. Some things may be better than the 1985 German Edition, and some less. I prefer a more readable map, the original family symbols, and the Cold War era setting. However, it's a good quality version of the game and should not deter anyone from purchase.\n\nJunta is one of those rare games that shine best with the full complement of 7 players!\n\nNote:\nJunta: Viva el Presidente! is supposedly a lite version of the original Junta. Appears to be very much changed, not near the same game. The goal/victory condition is quite different (no more embezzling money to your swiss account). There is no city map, which had been used during a putsch attempt. Are there even influence cards in it? Have not played it to be able to give a rating, but I am very doubtful that it can capture the original´s experience.\n\n\n\nvtsaogames wrote:\ngavken wrote:\nI like Junta but I don't love it. In my view the whole coup part takes way too long and distracts from the rest of the game. You can end up playing very long games of Junta because you have coups nearly every round.\nSuggestion: if you find the coup phase too long, have the first rebel roll a die, then the president. Then have each player clockwise around the table declare what side they are on and roll a die. Keep track of each side's total. Once all have declared, if the rebel total is higher, they overthrow the government. Otherwise el Presidente remains in power. You can say the original designer suggested this. But do get the other players to agree before staring the game. From time to time I have seen folks online who talk about playing the coup phase with miniature soldiers and tanks.\n\nIf you don't like the clockwise method, have all uncommitted players roll a die. The highest roll must commit and roll again. Settle ties by a dice-off between tied players.\n\nI do think this will speed up the game at a slight cost in flavor.",
    "timestamp": 1696024800
  },
  {
    "username": "Maximaler",
    "rating": 9.0,
    "comment": "Sehr interaktiv, Spielspaß hängt stark von den Mitspielern ab,",
    "timestamp": 1754776800
  },
  {
    "username": "civil",
    "rating": 8.6,
    "comment": "An amazing, innovative, fun idea, complexed to a Risk-like battle mechanism (for no reason). I really want to see a new version of this!",
    "timestamp": 1716328800
  },
  {
    "username": "Weaks",
    "rating": 9.0,
    "comment": "Divertidísimo juego. Un clasicazo de campeonato. Con muchos jugadores se disfruta un montón.",
    "timestamp": 1714773600
  },
  {
    "username": "montsegur",
    "rating": 9.0,
    "comment": "I really really would like to find a variant where it could be played in 3 hours or so. Or with other game end options. There are so much good ideas in the game that it should be played much more. In the first german rules they \"missed\" the rule that dead presidents or rebel leader have to pass one whole round. Thats makes the game faster, because less coups will occur.",
    "timestamp": 1703026800
  },
  {
    "username": "god_save_the_king",
    "rating": 8.5,
    "comment": "A damned good game with excellent depth and humour built in, well worth a re-release and maybe a rules touch up ,but damned good",
    "timestamp": 1695247200
  },
  {
    "username": "bonillarau",
    "rating": 9.0,
    "comment": "Un juego de intriga política muy divertido en el que gana el jugador que acabe la partida con mayor saldo bancario en Suiza. Como en la realidad. Un diseño sencillo y muy bien equilibrado en el que lo único que puede fallar son los propios jugadores. Para jugar a Junta es preciso tener la actitud adecuada para saber que tienes que esperar tu oportunidad después de perderlo todo en un asesinato y cuando tienes que romper una promesa para ganar la partida. Son cualidades raras que no todo el mundo tiene.",
    "timestamp": 1695160800
  },
  {
    "username": "fitioviedo",
    "rating": 9.0,
    "comment": "Una joya para la familia y para que pase de padres a hijos.",
    "timestamp": 1689458400
  },
  {
    "username": "Thasaidon",
    "rating": 8.5,
    "comment": "2-7p 120'-240' - Collect a bunch of friends and prepare to have serious fun and to hold your belly after too much laughing. Not recommended to people who might resent a little backstabbing...",
    "timestamp": 1680732000
  },
  {
    "username": "hugolin",
    "rating": 9.0,
    "comment": "Only good memories. Fun, chaotic.",
    "timestamp": 1678489200
  },
  {
    "username": "fitioviedo",
    "rating": 9.0,
    "comment": "Una joya para la familia y para que pase de padres a hijos.",
    "timestamp": 1665871200
  },
  {
    "username": "peterparker65",
    "rating": 9.0,
    "comment": "a classic",
    "timestamp": 1648504800
  },
  {
    "username": "casrina",
    "rating": 9.0,
    "comment": "This is one of those must-have games. It is difficult to get 7 players, but when you do.",
    "timestamp": 1630706400
  },
  {
    "username": "Risktaker",
    "rating": 10.0,
    "comment": "Multi - Banana Republic - Political - WEG - Classic - Desert Island Palm",
    "timestamp": 1749074400
  },
  {
    "username": "greelf",
    "rating": 10.0,
    "comment": "Great game for 5 to 7 players! Lot of fun",
    "timestamp": 1732662000
  },
  {
    "username": "Danielusink",
    "rating": 10.0,
    "comment": "",
    "timestamp": 1716328800
  },
  {
    "username": "Cuchulainn1795",
    "rating": 10.0,
    "comment": "What a fantastic game! My Junta career started out with a really old version which had a cloth map for resolving coups. Sadly that one's gone, but I got a copy of the West End English edition, and suddenly it was back to the Banana Republic!\n\nFor me, this game has everything, diplomacy, skulduggery, out-and-out treachery... and of course, lots and lots of money to be diverted to your Swiss Bank Account. When the time comes, and you feel those in government are not \"showing you the respect\" (ie giving you enough loot) you deserve, you can launch a coup with your faction and other powerful families against the tyrants, to become either a great and grand hero of the revolution, or a martyr for the cause!",
    "timestamp": 1708729200
  },
  {
    "username": "mduke",
    "rating": 10.0,
    "comment": "Enormously fun game to share with non-gamers with the proper sense of humor, particularly if those non-gamers are a bit erratic.\n\nThis really needs at least 6 players to work properly, but if you get them, and have a beer and put on some thick skin, you can't have more fun gaming in an evening.",
    "timestamp": 1706137200
  },
  {
    "username": "thelegendarybeng",
    "rating": 9.6,
    "comment": "This, to me, is how you make a diplomacy style game. This game tricks you into thinking its a political war game, but that is simply not the case. The economic card hoarding alliance forming friendship mourning that is junta should be tried by many. Only complaint is the same gameplay is played over and over with little change, making longer games drag a tad. High recommendation from me",
    "timestamp": 1676156400
  },
  {
    "username": "LDO91",
    "rating": 9.5,
    "comment": "Un vrai jeu d'enfoirés\n\nDe la négociation à chaque instant pour tirer la couverture à soi, et se faire des amis, le temps de mettre quelques billets sur son compte suisse sans se faire exécuter, voler, ou destituer.\nIl faut lire le jeu, les joueurs, sentir le vent tourner ou alors provoquer ce retournement, affaiblir les alliés de ses ennemis ou les corrompre. Ça peut devenir très chaotique, ça dépend beaucoup des mentalités autour de la table, ce sont réellement les joueurs qui font le jeu. Mais qu'est-ce que c'est fun au final.\n\nLe jeu est un peu long les premières parties, le temps de le prendre en main mais si on a des bons enfoirés à table, qui ne perdent pas l'objectif de vue, on ne voit pas le temps passer",
    "timestamp": 1671231600
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "2015 aeg version used",
    "timestamp": 1670367600
  },
  {
    "username": "Sidd1",
    "rating": 10.0,
    "comment": "Great game",
    "timestamp": 1658613600
  },
  {
    "username": "Parafly",
    "rating": 10.0,
    "comment": "This is one of those games that I am rating as a group experience.\n\nI will ALWAYS play this game with the right group. It is THAT good.\n\nWhat I love about it:\n* communication is so important\n* politics is so important\n* nobody is safe, everybody mistrusts everybody\n* once you understand the flow of the game and that there are almost no other rules than the flow itself, it is a very easy to play experience.",
    "timestamp": 1644447600
  },
  {
    "username": "alyogali",
    "rating": 9.5,
    "comment": "No",
    "timestamp": 1616799600
  },
  {
    "username": "LittleSchnuki",
    "rating": 10.0,
    "comment": "One of my favourite games for a large group, this one oozes theme and excitement! Takes 4-6 hrs, but every minute is a blast!!!",
    "timestamp": 1601676000
  }
]