[
  {
    "username": "WilcoxDave",
    "rating": 1.0,
    "comment": "This game did not seem very well balanced to me. The mechanics were fine.\n\nOn BSW",
    "timestamp": 1550098800
  },
  {
    "username": "carlo",
    "rating": 1.0,
    "comment": "Played the new edition (2007) - my worst gaming experience... ever! it won the SdJ 20 years ago and those 20 seems like... 40! anyway, it makes you appreaciate all the innovations brought by recent games",
    "timestamp": 1193522400
  },
  {
    "username": "boardmathias",
    "rating": 2.0,
    "comment": "I played this ages ago and did not like it. Pick-up and deliver is not a mechanism I like, which I know since I played this game and have seen in other games later on.",
    "timestamp": 1464991200
  },
  {
    "username": "moramis",
    "rating": 2.0,
    "comment": "Random rubbish.",
    "timestamp": 1458169200
  },
  {
    "username": "sutrebuh",
    "rating": 3.0,
    "comment": "As a family game, it could only be used in the simple version if calculating in the corresponding number range was mastered. But then children will turn to other games. Because even if one you like to see it as a negotiation game, the joy is diminished by the high proportion of luck with dice and event cards. The game lacks such elegance that it no longer stands out from the dull everyday life.",
    "timestamp": 1760133600
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not for me",
    "timestamp": 1635721200
  },
  {
    "username": "v_mihaly",
    "rating": 4.0,
    "comment": "NOT WORTH TO BE SLEEWED",
    "timestamp": 1647039600
  },
  {
    "username": "coyote_BG",
    "rating": 4.0,
    "comment": "クラマーが作った桃鉄",
    "timestamp": 1588975200
  },
  {
    "username": "lexen",
    "rating": 5.0,
    "comment": "wanted low",
    "timestamp": 1749506400
  },
  {
    "username": "Sedd",
    "rating": 5.0,
    "comment": "Auf Achse ist ein Wirtschaftsspiel, bei dem die Spieler als Transportunternehmer Güter durch Mittel-Europa liefern müssen, um Geld zu verdienen und ihre Flotte auszubauen. Dabei geht es darum, die besten Routen und Aufträge zu finden.\nNach Unterhaltung in der Gruppe finden es alle besser wie Zug um Zug, da man trotz Stau und Sperrung andere Wege finden kann.\n\npro:\n-Vermittelt Wissen zu Geographie; neuere Versionen haben auch einen detailierteren ostdeutschen Teil\n-Taktik: Auf-/Ab-Lade-Ziele sollte man so kaufen und anfahren, das man Umwege vermeidet. Karten erwerben ums Spielende plötzlich einzuleiten(wenn man denkt, das mejste Geld zu haben), oder Kartenpreise in die Höhe treiben, um den Gewinn vom Käufer zu schmälern. Der vermeindliche Käufer kann aber auch einfach abspringen und dann sitzt man da mit ner unpassenden Aufgabe.\n-mit der Augenzahl 1 kommt man selber schlecht vom Fleck, kann aber jmd. anderen ggf. zu einem Umweg bewegen.\n-Brummis und Waren erzeugen schöne Tischpräsenz\n-Alles ist gut verstaut.\n-Einsteigerfreundliche Variante im Regelheft vorhanden.\nneutral:\n-Würfel und Kartenglück ist zwar vorhanden, aber nicht so stark ausgeprägt. u.A. sind hohe Würfelwerte gar nicht vonnöten, da Städte nicht so weit weg sind und hohe Augenzahlen einfach minimieren kann.\n-Für sein Alter noch ganz ok, auch das Spielmaterial\nkontra:\n-Optik ist veraltet\n-konfrontativ\n-Großer Spielplan (2xFalten war damals Maximum) machts zum Luftikus. -> Das Tiefziehteil bzw. die Spielebox ist zu Hoch.\n\n\nEdit: mit mehr als 2 spielen.",
    "timestamp": 1741561200
  },
  {
    "username": "teaDorit",
    "rating": 5.0,
    "comment": "Donated to Projekt JoJo-Laden.",
    "timestamp": 1733180400
  },
  {
    "username": "asfhgwt",
    "rating": 5.0,
    "comment": "One of my first Euros. Good for family gaming but nothing else.",
    "timestamp": 1717106400
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 4004618712023\nGL3",
    "timestamp": 1757628000
  },
  {
    "username": "LannisterCrimson",
    "rating": 6.0,
    "comment": "Bling Status ✗\n\nExpansions: -\nPromos: -\nSpecial Edition: -\nUpgraded Components: -",
    "timestamp": 1751320800
  },
  {
    "username": "ponchera69",
    "rating": 6.0,
    "comment": "Maybe one of the best pick-up-and-deliver games I know. Too slow with more than 4 players (too much downtime). 4",
    "timestamp": 1748469600
  },
  {
    "username": "Bajord",
    "rating": 6.0,
    "comment": "Spiel Nominee",
    "timestamp": 1738278000
  },
  {
    "username": "Gravey",
    "rating": 7.0,
    "comment": "An interesting tactical roll-to-move mechanic, plus auctions, random events, some straight-up screwage with the construction sign, and a big colourful board with plastic trucks that can haul their little cubes. This could be the perfect trucking game.",
    "timestamp": 1755036000
  },
  {
    "username": "chaniatreides",
    "rating": 7.0,
    "comment": "199?",
    "timestamp": 1749420000
  },
  {
    "username": "Kotro",
    "rating": 7.5,
    "comment": "Personal rating: 3/5",
    "timestamp": 1750543200
  },
  {
    "username": "xtraturn",
    "rating": 8.0,
    "comment": "This is a light-hearted game, perfect for children and families. The goal is to complete orders and earn money, but detours and accidents can block your path. I always enjoyed this game as a child. Plus, it helps you learn the geographical layout of cities in German-speaking countries. I’m giving it 8 points because BGG’s rating of 6.2 feels too low to me.\nPlaying time 1 hour.",
    "timestamp": 1742857200
  },
  {
    "username": "Robert Osvalds",
    "rating": 9.0,
    "comment": "Great pick up and deliver game. Doesn't take too long either.",
    "timestamp": 1684274400
  },
  {
    "username": "quintessenz",
    "rating": 9.0,
    "comment": "German cult game, Game of the Year 1987",
    "timestamp": 1664575200
  },
  {
    "username": "greengow",
    "rating": 10.0,
    "comment": "Get in a cabin, start the engine, hear the engine roar. Haul your goods across Germany, drive faster than others, fulfill your contracts and get money for them. If you're the highest earner, you win.\n\nGreat game. Win the bidding for contracts. Keep an eye on where they initiate and where they end. Can you pick up all the goods?? No? If you have not enough space on your truck, buy a trailer. Haul more goods. But drive efficiently, because the roads are long and there can be traffic or closed roads or unsuspected events. So get behind the wheel and get moving. Very entertaining game and fun to play. Recommended to all.",
    "timestamp": 1684965600
  },
  {
    "username": "95after5",
    "rating": 10.0,
    "comment": "Played the old copy with the new rules and with the exclusion of some really bad event cards:\n\nA very fun fast moving game that is short to play and is great for a relaxing evening",
    "timestamp": 1503007200
  }
]