[
  {
    "username": "Dr_Colossus",
    "rating": 1.0,
    "comment": "This is the kind of game that seems interesting the first time you play it, but upon subsequent plays descends into pure monotony. I would never inflict this game on even my most hated enemy - and I think publishing this game was the direct cause of Avalon Hill's downfall.\n\nThis game is an unplayable misery burden.",
    "timestamp": 1464386400
  },
  {
    "username": "Dr Brian",
    "rating": 1.0,
    "comment": "For me, this was as bad as Manifest Destiny. Not sure what others see in this game.",
    "timestamp": 1304373600
  },
  {
    "username": "kittykat27",
    "rating": 2.0,
    "comment": "Want to take your opponent's city, roll a six-sided die higher than the other six-sided die. Ugh this kind of combat in a 8hr game is hard to swalllow. I love Advanced Civ, but this \"sequel\" is a giant misstep. Lacked diplomacy, no trading. Everything about this game felt too random, sluggish, and unfortunately outdated.",
    "timestamp": 1529186400
  },
  {
    "username": "heikman",
    "rating": 2.0,
    "comment": "It's not a bad game.. it's just not my kinda game.\nIt feels very much like the old Civilization, except for the very simple dice combat. You expand, try to control the valuable ressources, make money, buy the right tech & thus win the game.\nThe one thing that annoys me about these \"free-for-all\" games (everyone vs. everyone) is that it comes down to a lot of whining about whom everyone should attack instead of attacking you.. and i REALLY don't enjoy that.\nI like a games with a clear opposition or at least some hindrance in being able to attack anyone at will.. because whining and arguing is not my idea of having a good time.",
    "timestamp": 1457910000
  },
  {
    "username": "Samuel Vriezen",
    "rating": 3.0,
    "comment": "Used to play this a fair amount, but I feel it’s out of date now. Too long. Don’t think I’ll play again.",
    "timestamp": 1666821600
  },
  {
    "username": "Preheatedtea",
    "rating": 3.0,
    "comment": "Economic game with cards that say \"war\" or \"armor\". It's not good, rules are not intuitive. Incredibly long play time for a poor experience.",
    "timestamp": 1646434800
  },
  {
    "username": "Mrmisfit",
    "rating": 4.0,
    "comment": "Played it once, looks fugly, map isn't that great, not really that fun to play.",
    "timestamp": 1628978400
  },
  {
    "username": "jacobderosenoir",
    "rating": 4.0,
    "comment": "This is my first real boardgame (after Risk)",
    "timestamp": 1604012400
  },
  {
    "username": "gutrie_es",
    "rating": 5.0,
    "comment": "Considerado por muchos de mi entorno como un clásico, lei las reglas y siendo como es un juego de 1996 no entiendo la longitud del juego, ni la cantidad de calculos que te obligan a realizar, sin contar que para que esté un poco igualado debes realizar unos ligeros cambios en las reglas y en el tablero, cuando se publicó ya era un juego demasiado pesado para ser de negociación, en 1996 ya estaba en el mercado Quo Vadis? y Los Colonos de Catan, si el juego hubiera salido a finales de los 80 sería un clásico sin lugar a dudas, pero actualmente hay juegos de Negociación mucho mejores y mas ligeros, aparte de que una copia puede costarte mas de 90€.\nLo mejor que puede hacerse con el si se encuentra una copia barata es venderlo y sacar beneficios, siempre y cuando no seas coleccionista.\n\nPor cierto, lo vendí.",
    "timestamp": 1749592800
  },
  {
    "username": "coxy_fc",
    "rating": 5.0,
    "comment": "Heavy going and VERY long game with a lot of accounting/phases but interesting gameplay all the same. For the time invested - not one I'll be requesting though!",
    "timestamp": 1635807600
  },
  {
    "username": "JasonC",
    "rating": 5.0,
    "comment": "A very long \"buy all the advances\" civilization game, with set collection and back scratching mechanics. Played this a fair amount with a gaming group that loved it. Highly stylized best play with strong \"screw the leader\" multiplayer mechanics leave a bad taste after repeated plays.",
    "timestamp": 1627682400
  },
  {
    "username": "Michael Ward",
    "rating": 5.0,
    "comment": "01/21/97 Obtained.\n2005: Filling out that status sheet was just so tedious. The game takes longer (6+ hours) than what I'm willing to devote to a game these days. If you'd asked me in 1997 I would have rated it a 7.",
    "timestamp": 1589493600
  },
  {
    "username": "noisycrow",
    "rating": 6.0,
    "comment": "Now that I have all the cards, I can finally get a chance to play it! Just need to round up some folks for a Saturday...",
    "timestamp": 1758319200
  },
  {
    "username": "ainataqe",
    "rating": 6.0,
    "comment": "Riffing off of Advanced Civ. Would like to get more plays of this in 2025.",
    "timestamp": 1750197600
  },
  {
    "username": "machiavelli",
    "rating": 6.0,
    "comment": "Good game. A little too long to be so dice/luck heavy. Only got through the first two epochs in 5 hours. But I enjoyed it.",
    "timestamp": 1746136800
  },
  {
    "username": "ewokracoonbreder",
    "rating": 6.0,
    "comment": "I've lowered my rating of this game recently. It's hard to justify since I now have a group of people I can play Advanced Civ with many times a year. AoR alienates new and old player alike by providing a \"streamlined\" Civ experience which really means - it can just be hard to catch up if you ever get behind. What's worse, is unlike aciv, you won't feel like you're doing anything if you lose the game in the first hour. Not having a catch up mechanism in a 3 hour game is fine - which I believe this game is supposed to take when everyone plays quickly. In practice, this is a 5 hour game and yes, you can lose in the first hour and never recover. Some groups will take much much longer, especially when people are quickly playing cards instead of paying to hoard them. This obviously exacerbates my first point....\n\nA true multiplayer strategy game that requires skill in many areas, most importantly - diplomacy, deal making, tactics, stamina and timing. There is luck, like any good game should have. In this game you must manage your unluckiness and properly plan to take the win at the right moment....or plow over your opponents before they have time to catch you. How greedy can you be before they pull you back?\n\nThe best part? You don't need to play skillfully to enjoy it. I played many rounds loving just expanding, buying my techs and playing my cards.",
    "timestamp": 1744149600
  },
  {
    "username": "pdowen3",
    "rating": 7.0,
    "comment": "Very fond of this game, even if I did get the crap beaten out of me at PrezCon (2009?). I wish it didn't take so long to play. It's very difficult to convince my group to take this one on.",
    "timestamp": 1734130800
  },
  {
    "username": "rizcharger",
    "rating": 7.0,
    "comment": "Strategy game set in Renaissance period. Playable with house-rules and some workarounds. The game provides multiple path to victory for each factions that are different enough with their own unique set of strength and weakness. The asymmetry is shaped by the different geographical starting point and expansion paths. Event cards are often impactful and can swing outcomes in tight race. Battle mechanics are unique, it self-balances against factions that benefit from playing in later rounds. However the depiction of market competition outcome does not get properly represented via its conflict mechanic which was derived from its wargame roots. Market competition does not lead to absolute and exclusive access and market share, unlike a battle. Firms can compete and co-exist within markets despite losing market share.",
    "timestamp": 1733698800
  },
  {
    "username": "bigfranco",
    "rating": 7.8,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "rynelf",
    "rating": 7.5,
    "comment": "--Dec2006-- I owned this for about three years. I attempted to read the manual four times. Each time, I gave up due to the proliferation of references to concepts which had not yet been seen. I was happy to sell my copy.\n--Mar2014-- And, yet... I find myself wanting to give it another shot. Weird, eh? Reacquired.\n--Apr2014-- Volatile, frustrating, amusing: I'm not (yet) sure what to think of it. Slings and arrows of outrageous fortune were certainly flung about; and they landed a bit indiscriminately. I expect - like several games of its vintage - that one gets better at evaluating what's important as the play count increases: so it's likely better than it seemed. But there's definitely an \"acquired taste\" feeling.",
    "timestamp": 1680559200
  },
  {
    "username": "Mofli_Mario",
    "rating": 9.0,
    "comment": "I have special feeling with this game, eurogame with high influence players decisions, trading, wars, terrotoiry....\nI have my own handmade version",
    "timestamp": 1710370800
  },
  {
    "username": "bramadan",
    "rating": 9.0,
    "comment": "Classic",
    "timestamp": 1706050800
  },
  {
    "username": "zacharylky",
    "rating": 10.0,
    "comment": "Also fine at 4. Recommended but very brutal at 6.",
    "timestamp": 1725832800
  },
  {
    "username": "BombJack1984",
    "rating": 10.0,
    "comment": "the best game forever",
    "timestamp": 1689631200
  }
]