[
  {
    "username": "wszp",
    "rating": 1.0,
    "comment": "Would not play again.",
    "timestamp": 1735340400
  },
  {
    "username": "RodimusPrime",
    "rating": 1.0,
    "comment": "I bounced off of this game because I don't like having to remember who bought how many shares of what company.",
    "timestamp": 1626386400
  },
  {
    "username": "Chief_Chemist",
    "rating": 1.0,
    "comment": "In Albion Collection. A Euro",
    "timestamp": 1592604000
  },
  {
    "username": "SirPork",
    "rating": 1.0,
    "comment": "NEVER BUY THIS FOR ME EVER AGAIN!!!",
    "timestamp": 1582930800
  },
  {
    "username": "mdean",
    "rating": 1.0,
    "comment": "I think I admire this design more than I enjoyed playing it; it feels subpar in 2019 but it's not the game's fault it innovated well enough to build on.",
    "timestamp": 1567807200
  },
  {
    "username": "Elephantpool",
    "rating": 1.0,
    "comment": "Wow this is terrible. Almost fell asleep. The single worst game I've tried.",
    "timestamp": 1488582000
  },
  {
    "username": "GoddessInTriptych",
    "rating": 1.0,
    "comment": "Shoot me in the penis, this is boring.",
    "timestamp": 1481756400
  },
  {
    "username": "steggy",
    "rating": 1.0,
    "comment": "Probably the worst game I've ever played. It's all about the lucky pick to be able to merge. Bingo has more strategy.",
    "timestamp": 1480374000
  },
  {
    "username": "KAGE13",
    "rating": 1.0,
    "comment": "only Monopoly & Risk are worse then this game. An illusion of control that is really all luck. A hopeless argument with people that love this game that its all skill. I think yahtzee has more skill.",
    "timestamp": 1364684400
  },
  {
    "username": "SCOBYBryant",
    "rating": 1.0,
    "comment": "In Acquire, players basically all perform the same strategy: create two-square chains and obtain 4 shares upon initiation while either fighting for minority shareholder in another company or buying stock for cheap in a company destined to exist until the end of the game. Who wins? The people that are fortunate to start with tiles near the middle of the board where their company is more likely to get gobbled up sooner? Or even draw the tiles necessary to form a hotel chain at a reasonable time in the first place? (Gotta love those opening turns where first player has no chain so he dumps a random tile which arbitrarily helps another player create one.) Or how about the folks who are fortunate nobody adds to their chain, making it too big to get bought out and thus less profitable because there's no acquisition bonus? It's a monotonous process that becomes chaotic quickly - too many uncontrollables for serious play.",
    "timestamp": 1323298800
  },
  {
    "username": "The Jakster",
    "rating": 1.0,
    "comment": "Terrible game, had to play it several times, loathe it now!",
    "timestamp": 1059861600
  },
  {
    "username": "BoredBeast",
    "rating": 2.0,
    "comment": "Yuck. This game is a snooze-fest, bar none. Random, boring, and plays WAY too long at six players. Hated every second of this one, and it looks like trash on top of the bad gameplay.",
    "timestamp": 1682978400
  },
  {
    "username": "RHelms",
    "rating": 2.0,
    "comment": "I have challenged myself to play 500 different games. This clocks in at 474.\nAbout 90-95% of these are euro/abstract/economic games. This manages to be in my top 5 worst game experiences ever.\n\nIf I could bring three things to a remote island, I'd bring this so I could burn it to keep me warm at night.",
    "timestamp": 1675206000
  },
  {
    "username": "candoo",
    "rating": 2.0,
    "comment": "A very good game that was ahead of its time 45 years ago! Shades of area control (through holding stocks) and hints of Tigris & Euphrates (bigger companies/kingdoms wiping out smaller ones). A real 'modern' classic.\n\nAvalon Hill's latest edition is quite nice with the 7 different coloured buildings to represent the corporations. Very nice. Reprint it already!\n\nUpdate May 2013 from Feb 2009: this was just okay after revisiting it. Downgraded from 7.5 to 6.5. Seems a bit luck dependent. If you draw tiles that can start companies and/or merge companies then you are going to do well.\n\nUpdate May 2022. Dropped from 6 to 2. It hasn’t held up. It’s a BIG luckfest. You must draw tiles that gives you an early merger. Otherwise you’re cash crippled. The game is fundamentally decided by the randomness of the tile draw.",
    "timestamp": 1653688800
  },
  {
    "username": "coryke",
    "rating": 2.0,
    "comment": "Complete lack of player agency unless you're lucky in BOTH tile draws and merger timing. What utter rubbish. Btw: I’ve played more frequently than my one listed play - that represents plays on my own personal physical copy.",
    "timestamp": 1577055600
  },
  {
    "username": "qv92",
    "rating": 2.0,
    "comment": "Do not remember having any interesting decisions. Game felt like it played itself.",
    "timestamp": 1566943200
  },
  {
    "username": "GarfieldKlon",
    "rating": 2.0,
    "comment": "90% luck. If you have bad luck you can never build a hotel chain and get one extra card. If you have bad luck you can never do a fusion. If you are at the wrong place on the table, all players before you buy all the interesting stuff. Totally random and waste of time.\n\nEven my 2nd play couldn't improve my opinion about this game. I prefer watching paint drying.\n\nIt's horrible with 6 players, you wait about 15min for your turn because some people are thinking about 2-3min. And this is a totally waste of time, you also can complete your turn within 20s and you can win.\n\n\nTheme:           I don't feel like a hotel manager\nGameplay:        Very repetitive\nInteraction:     Look where your opponents placing their tiles, that's all\nLuck:            Heavily depends on what tiles you draw\nStrategy:        Try, but it won't help\nComponents:      Ugly plastic shit\nPlay duration:   Way too long\nEasy to teach:   The only advantage\nSetup time:      At least you don't waste to much time here...\nNo downtime:     Depends on players, can be really huge",
    "timestamp": 1538431200
  },
  {
    "username": "ratbulogg",
    "rating": 2.0,
    "comment": "Too much luck of the draw. If you are not in the first two mergers, you will lose.",
    "timestamp": 1525125600
  },
  {
    "username": "eddy_sterckx",
    "rating": 2.0,
    "comment": "2013-12-28 : Acquire is one of those games I don't \"get\" - I find it a random snoozefest",
    "timestamp": 1475013600
  },
  {
    "username": "Lagomorph",
    "rating": 2.0,
    "comment": "I've only played this game twice. I found the theme and strategy dull, the game shockingly dry and overlong. Great game if you're a card counter. For those who like to strategize instead of memorize: skip it.",
    "timestamp": 1468792800
  },
  {
    "username": "CSoren",
    "rating": 2.0,
    "comment": "Place a tile from your hand into a predetermined spot while hoping your tiles can go where they have a chance of being useful.\n\nAfter 3 plays, I can safely say that this is not a game I will ever like, mostly because there is too much luck and randomness.",
    "timestamp": 1420153200
  },
  {
    "username": "Critical Mass",
    "rating": 2.0,
    "comment": "I don't know why this is so highly rated. It is far too luck dependant regarding the tiles needed to cause a merge. It seriously suffers from run away leader with those who do not profit from the first merger virtually out of the game. I'd rather play Monopoly (by the proper rules).",
    "timestamp": 1333404000
  },
  {
    "username": "qtzlboardgamer",
    "rating": 3.0,
    "comment": "I can admit that there is a strategy in this game, but I'm unable to see it.\n\nThis game is as fun for me as rolling a die to see who gets the highest value.",
    "timestamp": 1757368800
  },
  {
    "username": "SWxNW",
    "rating": 3.0,
    "comment": "Deep respect for a design that has stood the test of time, but it's just not for me. There are so many other richer economic games worth my time.",
    "timestamp": 1693605600
  },
  {
    "username": "Steve Sunner",
    "rating": 3.0,
    "comment": "Theme and mechanics seem like a complete disconnect to me. Just don't get it.",
    "timestamp": 1631916000
  },
  {
    "username": "roast",
    "rating": 3.0,
    "comment": "Didn't like at all. Played with 6 people so may have been for that reason. Wasn't explained very well with regards to how you win (explained too quickly), and played with very experienced players. It might be o.k. if everyone had the same experience level. Kind of boring in general though. Too economic/mathy.",
    "timestamp": 1628978400
  },
  {
    "username": "Poaktree",
    "rating": 3.0,
    "comment": "Too slow. You can fall behind with either bad luck or bad early decisions and then you are stuck in a long game where other do things while you watch. Has slow moments when nothing happens. You have to wait for others to decide. Other games can give you the same experience with much more polished mechanics.",
    "timestamp": 1589666400
  },
  {
    "username": "esparver73",
    "rating": 3.0,
    "comment": "Abstract game on connecting squares. Boring.",
    "timestamp": 1588802400
  },
  {
    "username": "bcnevan",
    "rating": 3.0,
    "comment": "Get any version of Acquire but this one. The 1999 version is my preferred version, but the original 3M version is solid and can be had for cheaper.\n\nThe changes and production behind this printing of the game (2016) are just a series of missteps and bad decisions. The largest offender is the game board. It's terrible. The grid is simply not readable. The softer payouts are a matter preference, but it seems to suck a bit of the competition out of the game.\n\nThe original game is a great light stock game that straddles the line between input randomness (tile draw); play time (90 minutes if a bit slow); decisions (expand or merge); and non-gamer approachability.",
    "timestamp": 1569967200
  },
  {
    "username": "koalaguy4566",
    "rating": 3.0,
    "comment": "While I can see on an objective level why people like Acquire, I hate this game. It's so dry and so boring. I just don't care and to be honest don't really understand what is going on while I play. I've played it with large groups of 6 players and with small groups (2 players) and dislike it either way. I can say that I enjoyed it slightly better with 2 players, but not much. I'm not giving up on it, though. I understand that there's something here worth discovering and so many people love it at my game group I'll certainly have more opportunities to learn what's good about it.",
    "timestamp": 1560376800
  },
  {
    "username": "Tree6eard",
    "rating": 3.0,
    "comment": "Since all the action is based on tile play/draw, if you don't draw a tile that lets you merge the companies you want to, you spend a lot of time playing a useless tile, and buying stocks trying to get majority/minority in a corporation that may not do anything. I have the bad \"strategy\" of not getting good tiles, and not buying the right stocks to get money when that illusive merge happens. I'm ok never playing this again.",
    "timestamp": 1559080800
  },
  {
    "username": "rockstar379",
    "rating": 3.0,
    "comment": "Old school design. If you keep drawing bad tiles, or miss out on the first couple of mergers, there is very little you can do to win.",
    "timestamp": 1549580400
  },
  {
    "username": "Fletchard",
    "rating": 3.0,
    "comment": "Good game, but the random draws turn me off and the theme isn't too interesting to me. If I recall it's length is an advantage, it's not too long or short. - When I first got it circa 2006 or 7.\n\nI haven't played this in years, sadly. I used to rate it a 6 but I'm never gearing up to play a game. I might raise it again in the future after I force myself to play it out of respect for Sid Sackson. - 2013\n\nPlayed it again and really didn't enjoy it. It goes on much too long, the turn structure (choosing from your hand of pieces) isn't interesting, the mergers – the only point of excitement in the game – aren't that exciting, and it's all a matter of mathematical calculation as the decision points happen. - 2018",
    "timestamp": 1534629600
  },
  {
    "username": "D_Choo",
    "rating": 4.0,
    "comment": "Acquire is a fun game, but some games fell flat for us. Maybe it’s the (bad) luck of the draw that I’m sure I can mitigate with more experience.\n\nI’m also not a fan of the components for most of the editions. I’d probably want the Avalon Hill version with the first initial of the hotels on the tiles.",
    "timestamp": 1754949600
  },
  {
    "username": "apostateant",
    "rating": 4.0,
    "comment": "Yoo dependent on an early capital influx for me preference, would like to see more options for those who end up on the wrong side of an early merger.",
    "timestamp": 1746655200
  },
  {
    "username": "tbrofromspace",
    "rating": 4.0,
    "comment": "Eat me daddy",
    "timestamp": 1743631200
  },
  {
    "username": "kniziagamer",
    "rating": 4.0,
    "comment": "I really want to like Acquire but in my plays all players usually invested in the same hotel chains which was a bit boring. The luck of the draw also bothers me.",
    "timestamp": 1736290800
  },
  {
    "username": "Mack1993",
    "rating": 4.0,
    "comment": "I find the experience tedious with the drip of actions and tiles. It's got good ideas but isn't as fun in excecution.",
    "timestamp": 1720821600
  },
  {
    "username": "quietcorn",
    "rating": 4.0,
    "comment": "I enjoyed trying to remember who had bought what, giving some tension to the decision about if I was to initiate a merger or not. Ultimately the game didn't hold my attention for long.",
    "timestamp": 1716415200
  },
  {
    "username": "Euroman",
    "rating": 4.0,
    "comment": "Lots of luck involved in trying to get the right building.\nPlay Union Pacific instead.",
    "timestamp": 1706828400
  },
  {
    "username": "Fulminata",
    "rating": 4.0,
    "comment": "Classic trading game. I need to get it back to the table.\n\nEdit: got it back to the table. Wasn't very well received. Feels a bit fiddly with constantly having to count up tiles to determine prices. It is a classic, but with games getting better and better it's largely been left behind at this point.",
    "timestamp": 1700002800
  },
  {
    "username": "Kimball Bent",
    "rating": 4.0,
    "comment": "Acquire has a distinct Kingmaker effect. If you fall behind early, you are basically fucked for the remainder of the game. The rule where a player can keep their shares after a merger \"in case the company gets founded again\" makes no sense and ensures that players out front stay out front.\n\nHaving now played this and Big Boss, I hugely prefer Big Boss.",
    "timestamp": 1699398000
  },
  {
    "username": "Entropology",
    "rating": 4.0,
    "comment": "It's fine, but really shows its age. I think the primary problem is the random distribution of tiles. You can often get hosed or have limited options just because you didn't draw anything useful. We actually played around with auctioning them off, but got unwieldy. Definitely a historical stepping stone, but fails to hold me here and now.",
    "timestamp": 1696888800
  },
  {
    "username": "robinplaysgames",
    "rating": 4.0,
    "comment": "This is a classic for a reason and really a good game. The lack of general theme and aggressive nature of the play on the board will not have me coming back to this one. How ever if you enjoy classic economic games this is definitely worth a play.\n4/10",
    "timestamp": 1693951200
  },
  {
    "username": "PerfectRoll",
    "rating": 5.0,
    "comment": "Played this recently (2025) after not playing it for five years. It's fine, but do not like this type of game as much as before as I don't like the randomness of the tile draws--you can get exactly what you need most of the time or rarely get anything you need.",
    "timestamp": 1758578400
  },
  {
    "username": "ppsacco",
    "rating": 5.0,
    "comment": "obviously no trends in the market...very random play overall, but can give a good feel of market rally and crash.",
    "timestamp": 1757455200
  },
  {
    "username": "Cheezarino",
    "rating": 5.0,
    "comment": "The entrepreneur/businessman aesthetic is NOT my cup of tea but the grid mechanic is cool. The end game comes way too late and merging companies is not very grossing. Not bad just mid overall, never have to play it again.",
    "timestamp": 1757368800
  },
  {
    "username": "tomdabom98",
    "rating": 4.5,
    "comment": "Too much luck involved in this but the stock aspects can be interesting. If it was a bit less mathy it could be a fun party game.",
    "timestamp": 1755986400
  },
  {
    "username": "Napattack",
    "rating": 5.0,
    "comment": "2.49\n3-6\nbest at 4\n90 (90)",
    "timestamp": 1751061600
  },
  {
    "username": "mmychal",
    "rating": 5.0,
    "comment": "Money is a bit difficult to handle - maybe use poker chips? I need to play a few more times before I get a feel for it, but the level of strategic planning is intriguing so far.",
    "timestamp": 1750024800
  },
  {
    "username": "Avid_Equinox",
    "rating": 5.0,
    "comment": "Ok stock game - buying and expanding hotel chains to make the most money\n- Feels quite random and restrictive with what tiles you draw being your only options to play to the board\n- Needs repeat plays to see the depth",
    "timestamp": 1746482400
  },
  {
    "username": "Misiek14",
    "rating": 5.0,
    "comment": "I am not fan of games about stocking. Sometimes too random, but great published",
    "timestamp": 1744495200
  },
  {
    "username": "qzhdad",
    "rating": 5.0,
    "comment": "Got tired of this after too many plays on my Palm Pilot.",
    "timestamp": 1738623600
  },
  {
    "username": "Knoqx",
    "rating": 5.0,
    "comment": "Based on one play",
    "timestamp": 1735858800
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "The og economy game where players trot gain the most money building corporations, buying stocks and merging them.",
    "timestamp": 1732748400
  },
  {
    "username": "parpari",
    "rating": 5.2,
    "comment": "This is a amazing game for it's age. The merging mechanism and being a stock game with this simple rule set is fabulous achievement. However; this game shows it's age for example random tile drawing with wrong numbers can be very devesting. Also, tiles are hidden information does not help either. This days cube rails are completely replace this game.",
    "timestamp": 1732057200
  },
  {
    "username": "Oezz",
    "rating": 5.0,
    "comment": "Quite the juggling act balancing both investing for the end game as well as keeping a steady cash flow to continually acquire stocks. I can understand why this game has stuck around for years. The randomness of lots ensures games play out differently. Theme makes sense, but doesn't really draw you in (neither do the aesthetics).",
    "timestamp": 1723845600
  },
  {
    "username": "PotatoKing_",
    "rating": 5.0,
    "comment": "세월이 흘러도 대체할 수 없는 특별함",
    "timestamp": 1721253600
  },
  {
    "username": "Cheesecakes101",
    "rating": 5.0,
    "comment": "Maybe I need another round?Light stratergy , Throughout the game you'd want to go for the small company's so you get the payout when it's acuired but also be alive in the big one before it becomes too big for the final payout.But also cant go into the big one too early cuz then your money is stuck there , cant liquify it and move it around. Fun but with so many alternative options with the same mechanism but better , wouldn't really go for it.Some of my hard core gamer friends really love it though.",
    "timestamp": 1719352800
  },
  {
    "username": "RebJaenus",
    "rating": 5.0,
    "comment": "Classic stock game. Perfectly fine, but not overly exciting.",
    "timestamp": 1706223600
  },
  {
    "username": "Nickeddy01",
    "rating": 5.0,
    "comment": "Very good game. Building hotels and investing in them. You win by timing your purchases, mergers and acquisitions to perfection... unless of course you don't have the right tile. Then it is all you can do to watch as others build, and merge, and profit themselves away to an impossible lead. Chinatown balances out the luck of the tile draw with negotiation which makes it the better choice if you like negotiating.",
    "timestamp": 1705791600
  },
  {
    "username": "toothpickman",
    "rating": 5.0,
    "comment": "Interesting economic game, one of the best games of it's era, but other games do it better now, and I really need the right group to make this game fun.",
    "timestamp": 1704322800
  },
  {
    "username": "raptors",
    "rating": 5.0,
    "comment": "Awful version of the game with cardboard tiles",
    "timestamp": 1704150000
  },
  {
    "username": "grasa_total",
    "rating": 5.0,
    "comment": "6p is maybe not the way to experience this game (BGG agrees) but I still liked it okay. I think it would be hard to make today, with the arbitrariness of the stock price chart driving some interesting dynamics... but it felt more like a fresh idea than like something too old to appreciate.\n\n[1 play]",
    "timestamp": 1701558000
  },
  {
    "username": "DarkJjay",
    "rating": 5.0,
    "comment": "I'm pleasantly surprised by how well it held up after such a long time, but I'm not sure I necessarily want to play it more often. Glad I played it, but I don't need to own it.",
    "timestamp": 1698620400
  },
  {
    "username": "RobertKeys51",
    "rating": 5.0,
    "comment": "Inventory: AUG 2023",
    "timestamp": 1691359200
  },
  {
    "username": "btasam",
    "rating": 6.0,
    "comment": "Although it's a great game, I'm often shocked by how cheap this game feels on the table. Usually players are overworking to keep track of information that changes every turn. It would be nice to have a shared stockholder info track that also tracks chain size.",
    "timestamp": 1759788000
  },
  {
    "username": "Kveld",
    "rating": 5.5,
    "comment": "Clásico económico de especulación e información limitada, en mi opinión con problemas de vejez por tendencia a la bola de nieve.\nAun así tiene su valor por la sencillez de reglas.",
    "timestamp": 1759269600
  },
  {
    "username": "Gregus48",
    "rating": 6.0,
    "comment": "Missing 2 stock card. Hoping to replace them. EDIT 1: Turns out I'm only missing 1 Stock Certificate. EDIT 2: Got repacement Stock Cert, game now complete. I have yet to play my copy.\n\n02/09/17 Edit: Lowered Rating from 8 to 7.\n\n04/13/17 Edit: Lowered Rating to 6. I just really have little desire to play and no desire to teach. I suppose if someone wanted to play it I would.\n\n9/01/25 bought new version at target for $20",
    "timestamp": 1757714400
  },
  {
    "username": "ZirkvandenBerg",
    "rating": 6.0,
    "comment": "Excellent game. Requires a bit of math.",
    "timestamp": 1751925600
  },
  {
    "username": "smurfodeth",
    "rating": 5.5,
    "comment": "Venerable as it is, I’d rather be playing Stephenson’s Rocket.",
    "timestamp": 1751666400
  },
  {
    "username": "krit1789",
    "rating": 5.9,
    "comment": "True to its name: mergers and acquisitions. An old economic game. I just don't enjoy the theme that much. Stock holding does not interest me.",
    "timestamp": 1750024800
  },
  {
    "username": "heyman31891",
    "rating": 6.0,
    "comment": "6-good to see how it grew into big boss and it's a cool system. But there's a definite rich get richer problem.",
    "timestamp": 1749247200
  },
  {
    "username": "bmchamberlain",
    "rating": 6.0,
    "comment": "In CO",
    "timestamp": 1748469600
  },
  {
    "username": "raptors",
    "rating": 6.0,
    "comment": "2010. Got rid of 2008 version.\n2019. 'Acquired' the 1968 3M Bookshelf version.\n2023. Got rid of 1968 version.",
    "timestamp": 1746914400
  },
  {
    "username": "CannonFodderTed",
    "rating": 6.1,
    "comment": "Took me a little bit to wrap my head around this game at first but once I figured out what was going on, the strategy became apparent. Unfortunately, by then, it was almost too late. And that is the main flaw of this otherwise good game. That being once one company starts to grow really big, it spirals out of control to the point where whomever gets lucky to have had the most early stock in that is at a huge advantage to win the game. That being said, being involved in some early on mergers can swing the tide as well. This is definitely an interesting one and a game I think everyone should try out, but it's not for everyone.",
    "timestamp": 1746482400
  },
  {
    "username": "madkestrel",
    "rating": 6.0,
    "comment": "This is a more recent acquisition for us, but it plays as smoothly as current \"redesigns\" of older games. I can't believe I waited so many decades to play this, or that I wasted so many hours playing Monopoly through the years. I'd give my right eye to have played this instead. All in all, this is a solid economic game with easy rules and a lot of depth. I am excited to have purchased the pretty Hasbro version now, but the game is so solid that any edition works well. This is an Absolute Classic and Highly Recommended!",
    "timestamp": 1745272800
  },
  {
    "username": "cubntin",
    "rating": 6.0,
    "comment": "6 Players",
    "timestamp": 1743289200
  },
  {
    "username": "HairyPotter",
    "rating": 6.0,
    "comment": "Not my cup of tea.",
    "timestamp": 1743202800
  },
  {
    "username": "Sortrose",
    "rating": 6.0,
    "comment": "Acquire is definitely a monopoly killer, but is that in itself enough for it to be a great game? Sadly, the answer is no. It's still a decent stock market game, but it feels a bit dated and it is way too long for what it has to offer.",
    "timestamp": 1742079600
  },
  {
    "username": "ts0ng",
    "rating": 6.0,
    "comment": "Inspired a lot of games I enjoy, so had to try it out. It was interesting, especially for its time. The tile pulls keep me from taking this too seriously. Not a bad game, but I'd sooner play Stephenson's Rocket 100% of the time.",
    "timestamp": 1741561200
  },
  {
    "username": "TMacfarlane26",
    "rating": 6.0,
    "comment": "Super fun game. My only point of criticism is once you are down and out of money, you have a very hard time crawling back up leaving little to no chance of winning.",
    "timestamp": 1741215600
  },
  {
    "username": "jcoopersd",
    "rating": 6.0,
    "comment": "Components in the Avalon Hill edition have a serious readability issue, though I won't hold it against the game.\n\nPlayed this long after having played Stephenson's Rocket, T&E, Y&Y. Comparatively Acquire is the easiest to teach and play - there are very few rules to explain and the scoring is more intuitive, it's not a huge brain burn and plays relatively quickly. It suffers for lack of interesting play though, imo.\n\nIt's got a great arc to it - there's a real sense of progress as more and more tiles get added to the board, especially knowing that they stay forever once they're placed. It was a long buildup to the first merger but once they get started they come quickly. Getting money feels good.\n\nI really don't love how much of the strategy comes from shareholder bonuses though. Either you play with open shares and it's trivial (buy to have more shares than anyone else) or you play closed and it's a memory game. Outside of shareholder majorities, there's the spatial element, which isn't much either - only so much you can do with the tiles you're given - but it's at least interesting to try and predict how to board will evolve over time.\n\nFor a game that came out in the 60's, it's very impressive. I think I like the idea of it a little more than the execution though.",
    "timestamp": 1738882800
  },
  {
    "username": "athanatus",
    "rating": 6.0,
    "comment": "Game of luck. But too much luck.",
    "timestamp": 1738710000
  },
  {
    "username": "janglemangle",
    "rating": 6.0,
    "comment": "there might be nuance, but i don't care for it at all\n\nedit: played it with people who cared, and it's far better than i gave it credit for",
    "timestamp": 1738278000
  },
  {
    "username": "Dtheater1",
    "rating": 5.8,
    "comment": "One play and sold. Left out of the first merger and then didnt draft any good tiles. Ended up playing for 2 hours with no meaningful decisions.",
    "timestamp": 1737241200
  },
  {
    "username": "maxKiBo",
    "rating": 6.0,
    "comment": "Acquire being an old game, there must be a reason why it has survived to this day. It is undeniably excellent as a light strategy game with a party flavor, but as a “stock mahjong” game, first of all, there is a lot of luck involved, and secondly, it is very easy to get stuck with other players and each other's plots. Although there is a certain amount of memorization involved in stocks, it is almost negligible, and everyone can probably remember who holds more shares of that company. These can't be called drawbacks, they should be features of this game.",
    "timestamp": 1736118000
  },
  {
    "username": "RogerDHyman",
    "rating": 6.0,
    "comment": "Good game. Previously owned (& sold) the AH large box ed. Replaced by the newer Renegade Studios edition, which has excellent components. Obviously a classic in every sense.",
    "timestamp": 1735772400
  },
  {
    "username": "whitecatplays",
    "rating": 7.0,
    "comment": "Sackson was so ahead of everyone else.",
    "timestamp": 1760738400
  },
  {
    "username": "Zhod",
    "rating": 7.0,
    "comment": "6p",
    "timestamp": 1760479200
  },
  {
    "username": "adel9591",
    "rating": 7.0,
    "comment": "Really boils down speculation to a simple form. Not sure how much liquidity comes into the picture as it generally seems wise to always buy 3 stocks on the turn and always turn in or sell all shares during a merger.",
    "timestamp": 1760220000
  },
  {
    "username": "Bagherra",
    "rating": 7.0,
    "comment": "Awesome Sid Sackson game.\nThis is the game that should hold Monopoly's honor spot of most purchased and played game in the world.\n\nIt is a decadent game in investment and return on investment. Moreover it's one of the few games that can truly stand the test of time.",
    "timestamp": 1760133600
  },
  {
    "username": "bonster20",
    "rating": 7.0,
    "comment": "[Got it opened but unpunched on eBay.]\nI first played an old copy from the 60s with a pretty large board and cardboard tiles. My copy is from 1989-92. The board is smaller and the tiles are plastic. And instead of flags to mark the hotel chains, it just has flat tokens.",
    "timestamp": 1759874400
  },
  {
    "username": "elongatedmuffin",
    "rating": 7.0,
    "comment": "I love mergers as a game mechanic and Acquire started it all. The strategy is fairly unintuitive with much to think about but in a very easy to learn ruleset. Some have criticized Acquire for the luck of the draw and it's definitely a factor, but it doesn't bother me too much. I have fun trying to deduce what tiles people have based on what they are doing.\n\nBut it's very easy to lock yourself out of the game due to a poor early decision. Which isn't too bad in a game this short, but what bothers me more is it feels like the winner is determined by one or two early to midgame moves. And those moves are often won on some arbitrary turn order thing. Too often the late game feels like going through the motions and all the real decisions have already happened.",
    "timestamp": 1759096800
  },
  {
    "username": "Ehop16",
    "rating": 7.0,
    "comment": "Medium length, this game really holds up in my opinion. I love how you can hold some tiles back and invest in companies you know will get bigger.",
    "timestamp": 1758924000
  },
  {
    "username": "gianlucadario87",
    "rating": 7.0,
    "comment": "B_C6",
    "timestamp": 1758751200
  },
  {
    "username": "Brucie_Lee",
    "rating": 7.0,
    "comment": "2025 - \"25 x 5\" Custom Challenge Pick.\n\nI like the sentiment that I read somewhere that said something to the effect of \"In a different and more just timeline, every house would have a copy of Acquire instead of Monopoly\" as I think this is a very apt description of the game. It is of course not all that similar to Monopoly but I really like the hedging of bets for when to buy into a hotel chain and the fact that you can only sell your stocks once a hotel chain acquires another.\n\nIt's not a difficult game to teach or play and doesn't last all that long. I really like the version I have and only wish it came with poker chips but I have some that I can substitute. I don't think it works well with more than 4 players though as especially in the Classic Mode it is quite difficult for some players to actually make any money if they miss the boat early on.",
    "timestamp": 1758664800
  },
  {
    "username": "Generalkhun",
    "rating": 6.5,
    "comment": "Casual economic games with lots of luck. Though you can get a glimpse of evaluating your investment to some degree, but mostly it depended on tile drawn of you and others. The ending is quite bland and winner determinded around 3/4 of a game. This show an outdated design. But laughable group will make this game enjoinable",
    "timestamp": 1758405600
  },
  {
    "username": "TheSlushySnake",
    "rating": 6.5,
    "comment": "Business Investment, Stock Manipulation, Classic Game.\n3-5 Players. (Best With 4 Players).",
    "timestamp": 1758146400
  },
  {
    "username": "CMagex",
    "rating": 8.0,
    "comment": "1, old 3m bookshelf version\n\nGood game, but not sure if it holds up compared to other economic feeling games such as Irish Gauge, City of the Big Shoulders, etc.\n\nNeed poker chips for money\n\n#63",
    "timestamp": 1760911200
  },
  {
    "username": "Pseudachris",
    "rating": 8.0,
    "comment": "Owned by Amanda",
    "timestamp": 1760911200
  },
  {
    "username": "DeadDomino",
    "rating": 8.0,
    "comment": "Only played a couple of times at 6 players but really enjoyed it and hoping to get back to table again - the new Tycoon mode is definitely worth it with 6 players, especially players newer to the game.",
    "timestamp": 1760738400
  },
  {
    "username": "barnyams36",
    "rating": 8.0,
    "comment": "First impression. Incredibly simple rules that create great interaction. It certainly needs more games to see how the stock and growth of companies really work during the game. You may have a first impression that there is a lot of luck in the tiles you have, but I guess this is just a matter of experience.",
    "timestamp": 1760652000
  },
  {
    "username": "milomilo122",
    "rating": 8.0,
    "comment": "I’m a professional tabletop game designer, and this is one of two games that started it all for me. Without it, I might not have found my career, so it has a very special place in my heart.\n\nIt’s an abstract spatial economic game with simple rules that harbors some kind of ineffable magic. Works amazingly well, but it's hard to say why. With experience, I've found increasingly that the effects of chance are not nearly as strong as it used to seem they should be. Newbies have little chance against experienced players, though these days it’s hard to find experienced players - of any game - because there are so many games and fewer people tend to dive deeply into any individual game. That makes me sad, because the great games can’t really be appreciated without depth of experience.\n\nAnyway I recently got the Renegade 60th anniversary edition, which is super deluxe. I normally don’t go in for expensive deluxe editions but this one is such a special part of my life I made an exception. This version makes the game less fiddly by substituting poker chips for paper money (a giant improvement), and including a nice organizer for the stocks.\n\nThey’ve also added a mode that makes it harder to go broke and get locked out of money, a somewhat brutal feature of the original game that often flummoxes newbies. I appreciate that option.",
    "timestamp": 1760306400
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "2 player variant: https://boardgamegeek.com/filepage/26248/acquire-2-player",
    "timestamp": 1759960800
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "Really enjoyed my first play, will be looking to \"Acquire\" this.",
    "timestamp": 1759442400
  },
  {
    "username": "geschichte",
    "rating": 8.0,
    "comment": "Wanting the new edition/",
    "timestamp": 1759269600
  },
  {
    "username": "Rygel",
    "rating": 8.0,
    "comment": "I have the 1999 version.\n\nExcellent stock game.",
    "timestamp": 1758837600
  },
  {
    "username": "rozmiarek",
    "rating": 8.0,
    "comment": "New edition looks great until you put everything out from this nice box and observe black Ouija board and depressing Scrabble like tokens that are the core of the game. The idea for the game is good and simple but also extremely luck dependant. Everything is about merging companies, those who are fortunate enough will grab money required for future investments, while others has to wait hoping to draw more useful plot markers. Having majority in shares provides huge bonus income so you will always try to collect more of them than others. In a way it's pretty cool stock exchange game but at the same time very dry and requires a bit of calculations. We used printed player aid for checking the value of each share and poker chips that boosted our gaming experience and quite frankly I cannot imagine playing Acquire without those. The game felt a bit dull, almost dead for me, it reminded me of Bingo sessions when you just wait for something to happen (and these breakthroughs do not feel exciting enough). I would happily try it again as I would love to see how well would I play once I know the rules well, but it's one of those games that I don't care that much about. I get why it's still printed and why people enjoy it but I miss a bit of fun here. For now I will give it 6.5/10.\nEDIT second play with was so much better, simple rules and yet such a thinky puzzle. I highly recommend it and am looking forward to playing it again",
    "timestamp": 1758319200
  },
  {
    "username": "djsturz",
    "rating": 8.0,
    "comment": "The definition of a class. This is the step into the hobby from Monopoly.",
    "timestamp": 1758060000
  },
  {
    "username": "zepphit",
    "rating": 8.8,
    "comment": "Oct 2025 9 -> 8.75",
    "timestamp": 1760911200
  },
  {
    "username": "BubbleheadAmber",
    "rating": 9.0,
    "comment": "PROS:\n- The hand management of the grid tiles has a lot of depth, with a lot of considerations to timing, cost-benefit analysis and a touch of gambling\n- Very interactive as you need to look at what stocks others have and make sure you getting the best outcome\n- Game has very simple rules, but with tons of interesting decisions and depth\n- Strategy feels very unknowable and very interesting to explore\n\nCONS:\n- Theme feels dry and at times unthematic\n- The late-game feels quite rote and lacks the depth of early game\n\nFINAL THOUGHTS:\nSuch a classic game, can't believe this game came out in the 1960s. Good primer to the stock-manipulating strategies of 18xx games, but still feels very different with the area-control, tile-laying mechanisms",
    "timestamp": 1760824800
  },
  {
    "username": "StupidRatCreature",
    "rating": 9.0,
    "comment": "",
    "timestamp": 1760565600
  },
  {
    "username": "Arctic00",
    "rating": 8.7,
    "comment": "Acquire is such a fun game! The speculation when playing the tiles, the balance between wanting your chains to be taken over vs. wanting your chains to grow, working with others to put certain hotels out of business, the anticipation of awaiting each new tile placement, it all just makes for such an engaging game. This game takes longer, time-wise, than most of my games, but it doesn't feel like it. It truly is an enjoyable experience from start to finish.",
    "timestamp": 1759269600
  },
  {
    "username": "ismailegler",
    "rating": 8.5,
    "comment": "a classic? I want to see if it is",
    "timestamp": 1759010400
  },
  {
    "username": "Bonnie777",
    "rating": 9.0,
    "comment": "Fun\n- Exciting moments 1\n- Short downtime 0\n- Meaningful choices 1\n- Randomness 1\n- Balance 1\n\nAesthetics\n- Great artwork, nice components and organizers 1\n\nThematic ties 1\n- Mechanism fits the theme.\n\nReplayability 1\n- Every game is significantly different\n\nInteractions 1\n- Necessary and beneficial\n\nRules 1\n- Crystal clear",
    "timestamp": 1758232800
  },
  {
    "username": "setoBG",
    "rating": 8.5,
    "comment": "https://www.notion.so/24e2e5d476cf8098b613dcb80f26cca7?v=8d3...",
    "timestamp": 1757973600
  },
  {
    "username": "Hunter_P",
    "rating": 9.0,
    "comment": "A daring game of strategic risks and speculation as you try to control and contain the growth of stocks held by you and your opponents. Requires foreplanning to stay ahead and a few tries to get the hang of the game, absolutely worth the investment in my opinion.",
    "timestamp": 1757282400
  },
  {
    "username": "cptkilljoy",
    "rating": 9.0,
    "comment": "Vinted",
    "timestamp": 1756418400
  },
  {
    "username": "themisterbutton",
    "rating": 8.5,
    "comment": "Juego para todos.",
    "timestamp": 1755813600
  },
  {
    "username": "Henroot",
    "rating": 9.0,
    "comment": "6",
    "timestamp": 1754863200
  },
  {
    "username": "moonerie",
    "rating": 9.5,
    "comment": "2-6 players (rec 3-6; best 4)\n7.4 rating\n2.49 complexity\n90 mins\n\nNotes: Kind of like monopoly on steroids, if monopoly was actually good. Really, really enjoyed it, and did not ruin any friendships (LOL). Rating subject to change, once I get to play it again with more brain cells/sanity than 3AM me.",
    "timestamp": 1760306400
  },
  {
    "username": "Hamboard20",
    "rating": 10.0,
    "comment": "참신하고 너무 재밌음",
    "timestamp": 1760306400
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "I understand why this is the classic that it is. You really need to play it to see both the elegance of design and the counter-intuitive strategy. The influence this game has is apparent, from other economic games to T&E. You should try at least once.",
    "timestamp": 1759269600
  },
  {
    "username": "OGRussHood",
    "rating": 10.0,
    "comment": "My 2025 Top 250: #16\nMy 2024 Top 250: #13\nMy 2023 Top 250: #8\nMy 2022 Top 250: #7\nMy 2021 Top 250: #12\nMy 2020 Top 250: #25\nMy 2019 Top 200: #95",
    "timestamp": 1758492000
  },
  {
    "username": "Godgaming",
    "rating": 10.0,
    "comment": "One of the best games I have ever played and I have probably played about 100 board games (not an exaggeration), rules are quite simple for a 90 min game but there is so much depth and so much to explore.\nHowever some editions have reward for 3rd owner which makes the game considerably worse.",
    "timestamp": 1757887200
  },
  {
    "username": "Dasoogle",
    "rating": 10.0,
    "comment": "3-4 players definitely. 5-6 players is a maybe, need to try\n\nA good mix of luck and strategy. It was intially hard to process how the game was to be played, which is really the only knock I have against it. Players just need to know from the beginning (1) not to overinvest early, (2) stockholder bonuses is where the majority of money comes from, and (3) it can take some time before the board builds up and mergers start popping off.",
    "timestamp": 1756159200
  },
  {
    "username": "jim.brooks10",
    "rating": 9.5,
    "comment": "Before there were \"German\" games there was Sid. Excellent game that has stood the test of time.",
    "timestamp": 1754776800
  },
  {
    "username": "Ecogreen010OKR",
    "rating": 10.0,
    "comment": "Great Game. I played it again and again. Keep the numbers adjacent.",
    "timestamp": 1752271200
  },
  {
    "username": "pdrseuss",
    "rating": 10.0,
    "comment": "Genius! Very addicting!! I wish I discovered this years ago!! Easy to learn, not easy to master.\n\nYears ahead of its time when this came out. Could seem boring to many folks. You must keep track of the going rates of the corporations' stocks.\n\nMany awesome people have produced downloadable helps like scoresheets and information cards to use with tokens for visual aids. I dare you to try this game.",
    "timestamp": 1750629600
  },
  {
    "username": "4characters",
    "rating": 10.0,
    "comment": "I started playing this as a kid with my dad and his old book-style edition, which was vandalized by my uncle in an act of poor sportsmanship and also has a missing Festival share... and we continue playing today on that same old copy with my kids and my dad at the same time, three generations of gamers at the same table on the same copy of this classic game. Perhaps it's only a nostalgic 10 rating but I give credit to the design, back when it came out in the early 1960's or late 50's it was way ahead of its time and it still holds up today.",
    "timestamp": 1750456800
  },
  {
    "username": "Guydeloimbard",
    "rating": 10.0,
    "comment": "This game could have been created last year and be a winner, with heavy gamers and families alike. I can't see how it could not be loved.",
    "timestamp": 1749074400
  }
]