[
  {
    "username": "JacobiteCat",
    "rating": 1.0,
    "comment": "Used to own it and played a dozen or more times. Wanted to like it, tried to like it, but realized I don't like it one bit.\n\nWay too generic for my tastes and way too simplified for my tastes. It's 100% game, 0% simulation, with only the thinnest veneer of history thrown on top almost as an afterthought.\n\nWhen you remove any pretense of historical reality you remove all of my interest.",
    "timestamp": 1725141600
  },
  {
    "username": "Gryfon",
    "rating": 2.0,
    "comment": "When I have the urge to play an Ancients scrap, I would play Great Battles of Alexander or SPQR over this any day. It might be simple, but I see no point in game that is essentially a dice-off.",
    "timestamp": 1378332000
  },
  {
    "username": "ThreeTwoOne",
    "rating": 3.0,
    "comment": "Rules unclear. People who play the game and comment on public forums don't understand what the rules say. Avoid.",
    "timestamp": 1693951200
  },
  {
    "username": "pdowen3",
    "rating": 4.0,
    "comment": "Favorite miniatures game of all - light, quick, not expensive to get into, vast historical range, portable, teachable, reasonably good game in its own right. Some play balance issues among certain armies, certainly some dice luck, but always fun.",
    "timestamp": 1755640800
  },
  {
    "username": "bonzillou",
    "rating": 5.0,
    "comment": "DIGIT 2.0",
    "timestamp": 1681509600
  },
  {
    "username": "philip.dutre",
    "rating": 5.0,
    "comment": "I never was a real fan of the DBx wargames engine.",
    "timestamp": 1552258800
  },
  {
    "username": "SultanSevy",
    "rating": 6.0,
    "comment": "The appeal here is ultra-fast playing time for a miniatures wargame, the small number of figures required for a mass-battle game, the ability to use any ancients/medievals models you have, and a very complete rules-set that's jam-packed with army lists. However, the rules writing borders on incomprehensible at times and the combat is fairly bland. I still don't understand why this is the most popular set of ancients rules on the planet. Odd.",
    "timestamp": 1747173600
  },
  {
    "username": "Muadh",
    "rating": 6.0,
    "comment": "Tabletop Rules",
    "timestamp": 1716847200
  },
  {
    "username": "Sitnam",
    "rating": 7.0,
    "comment": "A great simple miniatures wargame. Tons of nationalities for eras from the stone age to musket & pike. Miniatures are no longer my thing, but I've kept the book(pamphlet) around because the last few pages has simple rules for a multiplayer campaign that has always been my dream to try at least once. Maybe some cutout card board stands with just the unit written on them or something.",
    "timestamp": 1739228400
  },
  {
    "username": "Mijjy",
    "rating": 8.0,
    "comment": "The games are over so fast that there is no emotional investment in the game & the nature of the game does not really allow for wibbles in the way that DBM (or DBMM or FoG) allow. It is therefore the ideal tournament game and for that reason I've re-evaluated the score & raised it to 8. If someone makes me hate them in 30 minutes over a game of DBA, they must really be trying. When I go to the major conventions, I'd rather play 6 games of DBA per day than 2 games of anything else, little to pack (unlike say the 40K players who bring industrial trolleys etc), a few bits of terrain, dice & you're good to go. Plus the fast games leaves you time to visit the traders \n\nThere is no battlefield economics with this as there is in army sized points driven games, each side gets 12 elements & each will be useful in different situations in a \"paper, scissors, rock\" resolution sort of way. In that context, the game is quite chess like from a perspective of \"material\".\n\nNow into v3, all sorts of minor fixes here & there but the basic strategy & tactic remains no matter what DBx game you play, know when to commit your troops, (roll higher than your opponent) & you'll consistently be competitive in every game",
    "timestamp": 1736118000
  },
  {
    "username": "COBOLProgram",
    "rating": 9.0,
    "comment": "Many speak about how the rules are dense. I wish to address this from the opposite direction. Within the past year, I have been unofficially re-writing the rules for both DBA and DBMM in a style that was popular with my students: ordered outline form, similar to the programmed instruction in AH games. At first, I tried looping all relevant content together (all visibility rules in one place, removing rules from unit descriptions). But then the game required all modules to play! I tried gutting the rules to \"minimally playable\" and \"additional rules\", and found that all I had done was reorganize the book. Barker's style seems to be the most reasonable compromise such that the rules do not take up three times the space. (That said, the number of conditionals that are helped by expanding them into checklists, charts, or bullets is noticeable, weather in DBMM being a major one I just looked at.)\n\nA lot of the content feels well developed, and the prospect of balancing is spent on simply saying, \"Try to play realistic battles, and the game will feel better.\" I (and many others) have several armies for the game, and every time the chance to play presents itself, I've taken someone up on it.",
    "timestamp": 1747173600
  },
  {
    "username": "will64",
    "rating": 10.0,
    "comment": "Games are fun, fast, and bloody. Learning to play is quite simple, but mastering your army’s capabilities, and knowing your enemy’s, is the real challenge. Just when you think you’ve nailed it, the chaos of battle changes your army’s fate in an exciting instant!!",
    "timestamp": 1760220000
  }
]