[
  {
    "username": "Big Bad Lex",
    "rating": 1.0,
    "comment": "Unfortunately on 26-11-2009, BGG were instructed to remove all uploaded files on all GW games. Even those files with no copyright material.\n\nThe games might be OK but the company attitude to it's customers is definitely broken. All my GW game ratings are reduced to '1's until GW mend their piss poor attitude to their client base and files are allowed to be reinstated..",
    "timestamp": 1423609200
  },
  {
    "username": "Silver Avocado",
    "rating": 2.0,
    "comment": "The concept of this game is deeply alluring. You play a royal bloodline, including many generations of individuals. Manage alliances, economic trade, and a bit of conflict. Everything in the game is done long form, right down to drawing the crests on the provided marriage certificates. So of course the game is a huge, bloated mess, with all kinds of convoluted rules, and an unbalanced start situation that needs to be balanced with diplomacy. But unfortunately your nearest neighbour is too busy making sure their heraldry is as realistic as possible to pay attention to your pleas for an alliance to prevent their other side neighbour romping away with the win...\n\nA product of its time and there are now surely better games to offer a similar experience.",
    "timestamp": 1717884000
  },
  {
    "username": "Bagherra",
    "rating": 3.0,
    "comment": "Game drags on forever and is mainly a lesson in paper pushing.\nI'd rename it \"Secretary\".",
    "timestamp": 1226530800
  },
  {
    "username": "calandale",
    "rating": 4.0,
    "comment": "This is a very flawed design. Too much work for too little representation.\nAdditionally, it is basically a fantasy world - not even in abstract true to the history.\n\nAs a beer and pretzels game, it's way too much effort. Though that's the best it manages. There's a reason why this didn't get a remake - the core concept is wedded to its failings. A very different design could be either accurate or fun (probably not both) - but this managed neither.",
    "timestamp": 1614294000
  },
  {
    "username": "GeminiWeb",
    "rating": 5.0,
    "comment": "Only have tried to play this a few times in my teens. I think we didn't quite grasp the rules and seem to spend all our time growing the royal families and marrying them off to make alliances which made it too hard to do anything ...\n\nCould be convinced to trade it if the right offer game up.",
    "timestamp": 1754863200
  },
  {
    "username": "Grunge67",
    "rating": 4.9,
    "comment": "Think bought this in a fit of enthusiasm. Played with some D&D types(their game), decided I liked it and bought my own copy. Not played with any of my regular gamers, and eventually relegated to the shelf if shame. Ok enough, but imho the rules had a few holes",
    "timestamp": 1593727200
  },
  {
    "username": "PMBorisStoke",
    "rating": 6.0,
    "comment": "Super fun idea that's a bit too complex and long for its own good.",
    "timestamp": 1748815200
  },
  {
    "username": "Manolito",
    "rating": 6.0,
    "comment": "We had a good time playing it long ago, although it was bloated and overlong. But the family tree thing is well made and fun !\n\nToday, it retains the great nostalgic value of these Games Workshop golden days games...",
    "timestamp": 1737586800
  },
  {
    "username": "Cryvens",
    "rating": 6.5,
    "comment": "5",
    "timestamp": 1572994800
  },
  {
    "username": "mi_de",
    "rating": 8.0,
    "comment": "Great game of negotiation with a little hack-n-slash thrown\nin. I really like the variable abilities of the offspring. How many play without event cards? Wish I could combine this and Carver's other game, Warrior Knights.\n\nWish it had more spaces to fight over, more rules to flesh it out. Gains only last a short while, and you really need the full complement of players to work best. The family structure is great, and the ratings pf the children is brilliant. The aging mechanisms are also great. But an early death can be crippling for some time.",
    "timestamp": 1706396400
  },
  {
    "username": "Exaltofulgor",
    "rating": 9.0,
    "comment": "Interesting diplomatic system to manage deals. Enjoy contracting between players and sign a marriage contract to get even richer.",
    "timestamp": 1635980400
  },
  {
    "username": "Mantuanwar",
    "rating": 10.0,
    "comment": "A 10 for the basic game, which works pretty darned well without tinkering. But also much appreciation for the sheer generosity, imagination, and exuberance of the whole package of the advanced rules and the Bounden to the Holy See church rules from White Dwarf. Can you imagine this being produced as a standalone game now? Expansions and stretch crap would abound. Some of the optional advanced rules have gaps and need major clarification to make them usable, but the advanced rules are not necessary, though highly flavourful. This is a game of huge importance to me though I have only played it thrice. The three sessions I had in the 80s clarified for me what I valued as my favourite types of game: deep, with role-playing immersion in the theme, diplomacy and strategy. Though the long game sessions needed to get the most from the game have to be admitted as a practical hindrance to playing, they are an asset in many other ways.\nDon't even think of inflicting it on the wrong type of gamer for this type of game (you would be sharing their discomfort for some time, unless they walked out), but cultivate a group of the right sort, lay aside a full weekend, and enter an imagined medieval dynastic world. Its well past time that I did that again myself.\nI have given the advanced rules a major workover with house rules and clarifications to make them workable, but it really does operate pretty smoothly straight out of the original rules as long as you stick to the basic game i.e if you stick to the game that Derek Carver designed!",
    "timestamp": 1726869600
  }
]