[
  {
    "username": "kanishknishar",
    "rating": 1.0,
    "comment": "Absolutely not.",
    "timestamp": 1747778400
  },
  {
    "username": "SWxNW",
    "rating": 1.0,
    "comment": "It's a competitive slide puzzle. Fuuuuuuuuuck no.",
    "timestamp": 1636239600
  },
  {
    "username": "stiltr01",
    "rating": 1.0,
    "comment": "Collectively stare in silence for 5 minutes trying to do a spatial reasoning in your head. Scored 1 only because this defies classification as a game. It's a puzzle.",
    "timestamp": 1613689200
  },
  {
    "username": "Ryan Keane",
    "rating": 1.0,
    "comment": "This is barely a game - excruciatingly boring if you're bad at it like me, and if you're good at it, why play with other people? Might be a good solitaire iOS game for people that like it - go play it by yourself.",
    "timestamp": 1604962800
  },
  {
    "username": "Wolfram",
    "rating": 1.0,
    "comment": "No game, puzzle, MPS",
    "timestamp": 1551222000
  },
  {
    "username": "GameOrWatch",
    "rating": 1.0,
    "comment": "Makes me dizzy",
    "timestamp": 1533506400
  },
  {
    "username": "lordalatar",
    "rating": 1.0,
    "comment": "The definition of a bad game, or is there rely a game in the box?",
    "timestamp": 1478905200
  },
  {
    "username": "killoqpasa",
    "rating": 1.0,
    "comment": "Le pongo esta nota porque se me da fatal. Practicamente es como si no jugara, porque cuando todavía estoy mirando los demás ya han encontrado el camino mejor.",
    "timestamp": 1477868400
  },
  {
    "username": "Hulk1484",
    "rating": 1.0,
    "comment": "Horrible game",
    "timestamp": 1477432800
  },
  {
    "username": "Picon",
    "rating": 1.4,
    "comment": "It's a puzzle solitaire. Not interesting, I could play a video game in lieu.",
    "timestamp": 1454626800
  },
  {
    "username": "tempar",
    "rating": 1.0,
    "comment": "mutant meeples is better (acrroding to Tom vasel)",
    "timestamp": 1446678000
  },
  {
    "username": "kenosis",
    "rating": 1.0,
    "comment": "If this is a board game we might as well say that 6 people staring at a Magic Eye puzzle until one of them yells, \"I see it! It's a schooner!\" is a board game.",
    "timestamp": 1382220000
  },
  {
    "username": "cymric",
    "rating": 1.0,
    "comment": "Khet for more players but then without the cool lasers. This game is not my cup of tea. For a game to be a game, I expect some laughter, activity, movement, interaction. I also expect there to be a clear goal on how to win. RR has a goal which you need to satisfy in order to win, but human-based heuristics are almost completely useless here. Ricochet Robots is about being entranced in mapping routes on the gameboard in your head in total silence, and then more or less losing interest as a player has found an efficient route which needs to be proven wrong within one minute. This blatant min-maxing is best left to a computer. It's not unlike playing Kakuro or Sudoku Challenge.\n\nIf you want a fun and doable puzzle of this kind, I recommend Cities. Just as much puzzling, but at least interactive in the way that something is said from time to time, and that you can actually see what the others are doing.",
    "timestamp": 1357772400
  },
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "Blecch.",
    "timestamp": 1346018400
  },
  {
    "username": "xanalor",
    "rating": 1.0,
    "comment": "Not a game, IMHO. I like puzzles as much as the next person. Logic puzzles, cryptograms, Sudoku, etc. But I like to do those things on my iPhone or in the paper to kill time by myself. Doing solo logic puzzles while I pretend I'm playing a game with other people? Not so much.",
    "timestamp": 1283205600
  },
  {
    "username": "undefinedmonkey",
    "rating": 1.0,
    "comment": "I flipping hate this game.",
    "timestamp": 1282600800
  },
  {
    "username": "Zadok13",
    "rating": 1.0,
    "comment": "I just didn't enjoy this game at all. Everyone just sits in silence staring at the board. Its about as antisocial of a game as I have ever played, which to me defeats the purpose of playing boardgames.\n\nI don't like giving out one's to just any game, but the more I think about it, this really did not feel like a game to me at all. I couldn't recommend this to anyone.",
    "timestamp": 1252101600
  },
  {
    "username": "Thorwolf",
    "rating": 1.0,
    "comment": "Timed puzzle solving. Blecch.",
    "timestamp": 1195686000
  },
  {
    "username": "storvik",
    "rating": 1.0,
    "comment": "This is not a game.",
    "timestamp": 1169334000
  },
  {
    "username": "Numskull",
    "rating": 1.0,
    "comment": "Sit on your hands with jaw agape while the one person who's good at the \"game\" does everything by him or her self. Wheeee!!!",
    "timestamp": 1141254000
  },
  {
    "username": "sumo",
    "rating": 1.0,
    "comment": "A puzzle game of mind blowing tedium.",
    "timestamp": 1122674400
  },
  {
    "username": "landrobot",
    "rating": 1.0,
    "comment": "I'm not sure what's worse: Ricochet Robot or Roborally. I love some robots (heck, look at my name), but these games are not entertaining for me.",
    "timestamp": 1117663200
  },
  {
    "username": "MysteryDough",
    "rating": 1.0,
    "comment": "this doesn't qualify as a game, as far as i'm concerned.",
    "timestamp": 1097445600
  },
  {
    "username": "Pardu",
    "rating": 1.0,
    "comment": "Zzzzzzzzzz. Not a game really. A puzzle (if you like puzzles which obviously I don't)",
    "timestamp": 1043622000
  },
  {
    "username": "PScipio",
    "rating": 2.0,
    "comment": "Simplistic.",
    "timestamp": 1729548000
  },
  {
    "username": "zepa77",
    "rating": 2.0,
    "comment": "Sebastien's version",
    "timestamp": 1723068000
  },
  {
    "username": "MatteAce",
    "rating": 2.0,
    "comment": "what's fun about a game that punishes newcomers by preventing them to play at all? if you play against somebody who knows the game, all you do is to stare at the board in silence and wait for the game to end. horrible design.",
    "timestamp": 1682546400
  },
  {
    "username": "Chuggas",
    "rating": 2.0,
    "comment": "Really not a fan of this game. Might be better if it stopped after someone scores 5 or so.",
    "timestamp": 1671663600
  },
  {
    "username": "ccmonter",
    "rating": 2.0,
    "comment": "This is a puzzle, not a game. Stare at the board.",
    "timestamp": 1620684000
  },
  {
    "username": "ratbulogg",
    "rating": 2.0,
    "comment": "Roborally with the fun removed.",
    "timestamp": 1525212000
  },
  {
    "username": "datefruit",
    "rating": 2.0,
    "comment": "(1999) 1-99 players",
    "timestamp": 1523052000
  },
  {
    "username": "Legomancer",
    "rating": 2.0,
    "comment": "Rated this a \"1\" since, in my opinion, there's no game here, just simultaneous puzzle solving. The only decision one makes is whether or not to \"play\". From there you all just stare at a board until either someone solves the puzzle or the sweet release of death saves you from more \"fun\".",
    "timestamp": 1520290800
  },
  {
    "username": "jdegtiareva",
    "rating": 2.0,
    "comment": "This might be ok as a solitaire puzzle (pro tip: there is a free phone app with exactly the same puzzle). As a multiplayer game it's horrible for the following reasons:\n* No player interaction whatsoever.\n* Less experienced players WILL end up with a total score of 0 and hate the game. I.e. only playable with a group of roughly similar skill level. (The only way to score is to find the best solution in the shortest amount of time among all players. No chance for the new guy in the group.)\n* There is no mechanic to influence the game state other than earning score. The players who fall behind might as well stop playing. They can't make any difference.\n* Only one game mechanic. Extremely repetitive. Combine this with previous points, and half the players will drop out halfway through.",
    "timestamp": 1486940400
  },
  {
    "username": "guardianz",
    "rating": 2.0,
    "comment": "Sux. I can't even start to rant about this.",
    "timestamp": 1484262000
  },
  {
    "username": "Canales",
    "rating": 2.0,
    "comment": "2-10 | (4-6) | 30 min | 10+ | Alex Randolph\nGood training for developing spacial thinking. In fact, this is a puzzle, a mental challenge, but not a game. It fails to amuse me.",
    "timestamp": 1471903200
  },
  {
    "username": "balijan2",
    "rating": 2.0,
    "comment": "Nem rossz, de sajnos nem sok ember van, akivel játszani tudom. Nem annyira játék, inkább csak feladvány.",
    "timestamp": 1453935600
  },
  {
    "username": "walterdonovan",
    "rating": 1.5,
    "comment": "Not a game, it's a math puzzle better solved by a computer. Could be a good solitaire game if you are a mathematician.",
    "timestamp": 1437256800
  },
  {
    "username": "wkover",
    "rating": 2.0,
    "comment": "\"Richochet\" implies action. Staring at a board for minutes on end is the least action-y thing that I can imagine.\n\nAnd while it's possible to get better, it's not possible to make the game more fun.",
    "timestamp": 1425078000
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "Played 5+ times. Initially I was pleasantly surprised since I had assumed that a \"puzzle\" board game would be of no interest to me. Once I started playing it, I changed my mind completely...but lately I am reverting to my initial prejudice: I like games, not puzzles posing as games.",
    "timestamp": 1416610800
  },
  {
    "username": "CorinnaS",
    "rating": 2.0,
    "comment": "Bought at gameskeeper in Oxford",
    "timestamp": 1408744800
  },
  {
    "username": "Stas",
    "rating": 2.0,
    "comment": "Rating based on one play : April 2014\n\nMight be a great game for puzzle-heads, but I'll never play again. Not my thing at all.",
    "timestamp": 1398549600
  },
  {
    "username": "davestephens",
    "rating": 2.0,
    "comment": "RICOCHET ROBOTS\nThis might make a good puzzle, but as a boardgame it stinks. Play 'Roborally' instead.",
    "timestamp": 1395010800
  },
  {
    "username": "sobriquett",
    "rating": 1.5,
    "comment": "Hated this game. We had a few attempts, but didn't seem to be able to find a middle ground between unbelievably easy and impossibly difficult. I doubt I could ever be persuaded to play it again, although I know some of my friends are fond of it.",
    "timestamp": 1386889200
  },
  {
    "username": "SteveK2",
    "rating": 2.0,
    "comment": "Something prompted me to think of this 'game' 6 years after my only play, so I downgraded my rating to remind myself never to play it again.\n\nThe game? Every player looks at a picture, then someone says \"I can solve this in 5\", then everyone gets a minute to make a better bid, then everyone watches the winning bidder to see if they can actually deliver, then everyone does it all over again.",
    "timestamp": 1367186400
  },
  {
    "username": "gixmo",
    "rating": 2.0,
    "comment": "Don't like Science",
    "timestamp": 1345500000
  },
  {
    "username": "Osku77",
    "rating": 2.0,
    "comment": "This is probably an excellent brain exercise, but I just can´t keep track of my programmed robot movements further than a couple of moves. This makes impossible for me to play the game.",
    "timestamp": 1333317600
  },
  {
    "username": "maxknu",
    "rating": 2.0,
    "comment": "Boring, non-social.",
    "timestamp": 1320966000
  },
  {
    "username": "sirkerry",
    "rating": 2.0,
    "comment": "not something I ever care to experience again",
    "timestamp": 1319580000
  },
  {
    "username": "Joyful_Gamer",
    "rating": 3.0,
    "comment": "I like the thought of being better at this game, so I would want to play again as like a brain exercise and strengthener. However, solely for that purpose. Would not be a game I choose to play for fun, so I may not like brain teaser games.",
    "timestamp": 1759096800
  },
  {
    "username": "Lizziereads54",
    "rating": 3.0,
    "comment": "This might be an unfair rating, but it’s a fair warning for folks like me who can’t tell left from right. The special aspect is frustrating and impossible to overcome. But I can see how others enjoy its simple design and challenge to be a quick thinker.",
    "timestamp": 1747087200
  },
  {
    "username": "kaszkiet",
    "rating": 3.0,
    "comment": "2024-11-16 - 3 - it got very old. I guess it could be more appealing before smartphone era, where we got a lot of similar puzzle games, that are more interesting, more attractive and just better.\nWhat's more - playing Ricochet Robots with more players than 1 seems like a big waste of time.",
    "timestamp": 1731711600
  },
  {
    "username": "mbick",
    "rating": 3.0,
    "comment": "This is a pure puzzle where the timer is the people you are playing with. It's not a puzzle I enjoy. The fact that others are your timer makes it confrontational in a way that is completely uinteresting. And, I don't even really enjoy watching people's turns as much as I do in other multiplayer solitaire games.\n\nIt doesn't help that I think this is a game that I am quite bad at because I am quite poor at calculating solutions. It was very stressful for me to have to balance being the first one to bid a solution while trying to double check my work to ensure I counted correctly.\n\nIt does however set up extremely quickly and it is nice that people can drop in and out freely in a party-like setting.",
    "timestamp": 1721512800
  },
  {
    "username": "Hashimaru",
    "rating": 3.0,
    "comment": "Jeu qui demande une certaine capacité à prédire les moves dans l'espace. Je n'ai pas cette capacité malheureusement ou alors mon cerveau est limité. Pas la patience pour retenter.",
    "timestamp": 1697666400
  },
  {
    "username": "A2ALostInTranslation",
    "rating": 3.0,
    "comment": "This game is probably like my personal torture as far as a game goes. I just don't feel capable of seeing enough steps in my head to be competitive. My friend who owns it enjoys playing it but I think he usually just beats everyone else.",
    "timestamp": 1689458400
  },
  {
    "username": "fabericus",
    "rating": 3.0,
    "comment": "More than 10 games looking at others playing while beeing flabergasted.\n\nThis game might be fun. I guess. I see others having fun playing it.\nHowever my very own neural network is underperforming in this kind of tasks, while others in my gaming group are especially gifted. I thus feel, if not discriminated, at least humilated everytime any one of these games hits the table (yes Factory Fun, that's about you as well).\nI love \"slow\" puzzle games (i.e. videogames like lemmings, infernal machines and similar titles) and I love real-time fast games based on visual cues (such as jungle speed, speed, pit, spot it, time'n'space or captain sonar...). But that \"thing\" is no game for me.",
    "timestamp": 1673996400
  },
  {
    "username": "Andrew96",
    "rating": 3.0,
    "comment": "Sulinak megvan",
    "timestamp": 1671750000
  },
  {
    "username": "Galecki",
    "rating": 3.0,
    "comment": "Whole game runs in tense silence. Not fun.",
    "timestamp": 1667430000
  },
  {
    "username": "jaffawahha",
    "rating": 3.0,
    "comment": "Boring",
    "timestamp": 1652565600
  },
  {
    "username": "Epochend",
    "rating": 3.0,
    "comment": "It's more of a 'me' problem than anything to do with the game itself, but I'm just too bad at this to derive any enjoyment from it. However, I think that does still say something about the design - if you can't think as fast as the other players, then essentially you're just going to be staring at a sand timer for half an hour instead of actually doing anything, and you'll really notice how unnecessarily long it is for such a repetitive experience.",
    "timestamp": 1649455200
  },
  {
    "username": "Blue_Sauerkraut",
    "rating": 3.0,
    "comment": "Honestly kind of boring, would be interesting as a solo time burner but otherwise not much point.",
    "timestamp": 1635112800
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Nie podoba mi się",
    "timestamp": 1624312800
  },
  {
    "username": "Mestremuten",
    "rating": 3.0,
    "comment": "Rating:\n2/5\nProduction value:\n1/4\nIs the game in my collection/Love to have?:\n0/1",
    "timestamp": 1594418400
  },
  {
    "username": "Furan",
    "rating": 3.0,
    "comment": "Simultaneous puzzle solving? I'd rather play Ubongo...",
    "timestamp": 1590962400
  },
  {
    "username": "das_ulicorn",
    "rating": 3.0,
    "comment": "This is one of those games where your kids will always beat you because their brains are faster at this sort of thing. I had expected a RoboRally knockoff and got… disappointed.",
    "timestamp": 1580770800
  },
  {
    "username": "Banannaball",
    "rating": 3.0,
    "comment": "I got it for almost nothing at a convention, and there's a reason for that. The \"gameplay\" is really more just staring at a board with your friends for five minutes tracing lines with your eyes and shouting out numbers. Probably good for people who like games based on spatial awareness, puzzles, or proving to their friends how smart they are.",
    "timestamp": 1579561200
  },
  {
    "username": "HeavyAdge",
    "rating": 3.0,
    "comment": "Don't actually own this or have a desire to buy, but i've played it enough to review and i'm willing to play it. Very puzzely game that can make you feel dumb staring at a board with 4 robots on it and not figuring out how to move said robot to a spot. Makes me feel even more dumb when someone figures out an optimal path that i cannot see. I wouldn't say i'm terrible or good at this game, and for me to play i need others on my level. Someone dominating this game can break it IMO. That said i see the genius of the design and this is the sort of game that has very little middle appeal. You either love puzzles and programmable movement or it's a convoluted mess and want no part.",
    "timestamp": 1569362400
  },
  {
    "username": "xyoxyo",
    "rating": 3.0,
    "comment": "I don't like speed test game like this.",
    "timestamp": 1559858400
  },
  {
    "username": "dtolman",
    "rating": 3.0,
    "comment": "Requires the memorization of complicated moves - which is beyond me. Great for people who can memorize huge sequences of moves, I guess.",
    "timestamp": 1557525600
  },
  {
    "username": "Bridge83",
    "rating": 3.0,
    "comment": "I guess I can see how competitive puzzle-solving could be construed as a game, but it doesn't feel like a game to me, just a tedious exercise.",
    "timestamp": 1528668000
  },
  {
    "username": "jazontan",
    "rating": 3.0,
    "comment": "I don't even think this should be a boardgame. It's a puzzle game and somewhat reminiscence of slide puzzles. What's the point of just staring at a board and basically play a solitaire game of finding the shortest path on the board? Your friends are there to basically be your \"timer\". Lame.",
    "timestamp": 1491170400
  },
  {
    "username": "mondauge",
    "rating": 3.0,
    "comment": "Ugh. Maybe as a puzzle for playing solo. Ultimately, finding shortest routes is a skill that you can train, and the game is then just showing off your skill.\n\nAcquired this in 2016 for teaching purposes. Still not interested in actually playing it myself.",
    "timestamp": 1477173600
  },
  {
    "username": "qwheeler",
    "rating": 3.0,
    "comment": "Just not my kind of game. It really only works if everyone playing is of the same skill level. Otherwise the better players will be the only ones that have any fun, and the others will just be frustrated.",
    "timestamp": 1470002400
  },
  {
    "username": "Nodens",
    "rating": 4.0,
    "comment": "Memory for grown ups. +1 for families",
    "timestamp": 1757282400
  },
  {
    "username": "paulclarke339",
    "rating": 4.0,
    "comment": "I don't enjoy this type of game",
    "timestamp": 1753826400
  },
  {
    "username": "Migmeister",
    "rating": 4.0,
    "comment": "It's a race to see who can find the best path, the fastest... I don't like real time game... It's just not for me...",
    "timestamp": 1750284000
  },
  {
    "username": "D Erasmus",
    "rating": 4.0,
    "comment": "2007:\nTried it with my brother-in-law who was waaay better than I was. Its definately different, but what a brain burning, no dialog, no fun experience. I was tired of it by the time we were done. Just not my thing. Immediate trade away.",
    "timestamp": 1738623600
  },
  {
    "username": "camidon",
    "rating": 4.0,
    "comment": "Thought I would like the puzzle aspect and would get some good solo plays out of it, but there's not enough to the game. I enjoy the chunky robot pawns. Neat idea, but don't see myself pulling out much solo or with others.\n\nTRADED",
    "timestamp": 1734908400
  },
  {
    "username": "grasa_total",
    "rating": 4.0,
    "comment": "Like many other staring games (e.g. Set) a person can be simply better at the underlying task in a way that the gameplay won't interfere with. So it's sort of mental arm-wrestling: who's the best at this thing?\n\nYou might ask, aren't all games like that in some way? I guess yes. There's just a particular feel that they have when it's so stark, and when the footing each player plays from at a given moment is necessarily unvaried -- we're all trying to solve the same puzzle, I don't have any different a task than you do at this moment.\n\nWhich I guess brings me to the fact that I don't enjoy this particular task, and maybe that's my real beef with it.\n\n[5 plays]",
    "timestamp": 1715551200
  },
  {
    "username": "krit1789",
    "rating": 4.4,
    "comment": "Puzzle solving activity. Dry. It does not appeal to me as a fun game.",
    "timestamp": 1667862000
  },
  {
    "username": "stenole",
    "rating": 4.0,
    "comment": "(Any P) A puzzle game about moving robots towards their destination. Players will try to find the minimum amount of moves to win the reward.",
    "timestamp": 1652824800
  },
  {
    "username": "CharlieMnemonic",
    "rating": 4.0,
    "comment": "It's a fun puzzle, not much of a game IMO.",
    "timestamp": 1649887200
  },
  {
    "username": "OGNOG",
    "rating": 4.4,
    "comment": "OGness undecided. (Rating non-indicative of game quality.)",
    "timestamp": 1649109600
  },
  {
    "username": "disposable.superhero",
    "rating": 4.0,
    "comment": "I played this at a friend's house. He was very excited about me trying it because I like games (Caylus, Puerto Rico, El Grande, Tigris and Euphrates). I dislike this game very much. I won. In fact, in a three-player game with me, a construction manager, against two computer geeks I went on a five turn winning streak and won with 7 shortest routes, or whatever they are called. I’d say more about this game but I don’t want to waste any more time with it.",
    "timestamp": 1647990000
  },
  {
    "username": "GeorgW",
    "rating": 4.0,
    "comment": "Wonderful game to play when drunk or with large groups, it's a simple idea that's well executed, but can get boring after a while.\n\nPros:\nThe puzzle is plain fun and solving it competitively genuinely works because there's usually a simple solution that someone fast can find and a more advanced solution that's better that needs to be found under time-pressure.\n\nCons:\nThis game gets less fun the better you get at it, especially when playing with new players. As I've played it a few times and are generally good at these types of puzzles, I don't really want to play this more.",
    "timestamp": 1632261600
  },
  {
    "username": "jodokast4",
    "rating": 4.0,
    "comment": "Someone suggested this to me after playing Mutant Meeples. For me, it really fell flat. I loved the variable abilities of the pieces in Mutant Meeples as well as the theme they put on there. This...not so much.",
    "timestamp": 1618783200
  },
  {
    "username": "kevan",
    "rating": 4.0,
    "comment": "Elegant rules for generating and competitively solving computer-game-feeling puzzles from cardboard. But there's too much short-term memory strain for too little enjoyment, for me. Would be fine as a record-your-move videogame.",
    "timestamp": 1580684400
  },
  {
    "username": "matpe",
    "rating": 4.0,
    "comment": "This is completely not my type of game at all. Does not feel like a game. Fastest brain wins.",
    "timestamp": 1572390000
  },
  {
    "username": "Blackbane",
    "rating": 4.0,
    "comment": "The type of game that you need to play lots of time to get good at it. Unfortunately, I have no interest in playing it in the first place.",
    "timestamp": 1556661600
  },
  {
    "username": "hoehermann",
    "rating": 4.0,
    "comment": "This feels like players are competitively and concurrently calculating Djikstra's algorithm or A* in their head. Not my idea of recreational computing.",
    "timestamp": 1529791200
  },
  {
    "username": "Mijjy",
    "rating": 4.0,
    "comment": "Not for the mathematically, dimensionally & spatially challenged. Cold hard logic really, not really a game as such, but played every 4 or 5 years & it won't wear out its welcome.\n\nStrangely though, I would encourage kids to \"play\" this, it would help develop systematic thinking.",
    "timestamp": 1520031600
  },
  {
    "username": "ousgg",
    "rating": 4.0,
    "comment": "Utterly fails as a game because the same player will win 100% of the time.\n\nI enjoy it as a brief diversion, but that is all.\n\nTraded as part of bundle for Last Train to Nuremberg",
    "timestamp": 1495144800
  },
  {
    "username": "bigbenmeaige",
    "rating": 4.0,
    "comment": "This game is not fun unless everyone playing is at about the same level of experience. If you are not familiar with the mechanics and the board layout, you are at an extreme disadvantage. So games become a blowout for or against you.",
    "timestamp": 1494453600
  },
  {
    "username": "Dennis Murray",
    "rating": 4.0,
    "comment": "A competitive puzzle that's timed...I really disliked it. Not my kind of thing at all.",
    "timestamp": 1489878000
  },
  {
    "username": "mi_de",
    "rating": 3.8,
    "comment": "Nice puzzle, but not so much fun, in my mind. Unless players evenly balanced, it's a waste. More for the video game generation.",
    "timestamp": 1484175600
  },
  {
    "username": "jcarvin",
    "rating": 4.4,
    "comment": "Much more a puzzle than a game, I don't see what the draw is.",
    "timestamp": 1456786800
  },
  {
    "username": "katsuben",
    "rating": 4.0,
    "comment": "Checked it out on Android where you can move around testing pathways trying to solve, then simply reset when it inevitably doesn't work out. People seriously 'play' this in groups? Get together, stare at the board, figure out as many as 20+ moves in their head, until someone declares Bonanza! or somesuch, demonstrates their efficient route, then... everyone starts all over again? Wow. That's some tepid gaming sessions I'm missing.",
    "timestamp": 1446332400
  },
  {
    "username": "tar heel",
    "rating": 5.0,
    "comment": "This works fine with one player. I have to say, though, it is not so much a game as it is a puzzle. I guess a competitive puzzle is a game.\n\nTraded away",
    "timestamp": 1761044040
  },
  {
    "username": "RhodesN7",
    "rating": 5.0,
    "comment": "Reminds me of one of my favorite old Dreamcast games- Chu Chu Rocket. Definitely a unique theme for a board game though. I really have to be in the perfect state of mind to enjoy this one, otherwise I'll get stressed out failing to find the right moves. I actively hate the catch-up mechanic in this game.",
    "timestamp": 1758232800
  },
  {
    "username": "tommynomad",
    "rating": 5.0,
    "comment": "It's really a race puzzle, but not an unengaging one. The ability to challenge the first answer makes what could be very dry multiplayer solitaire something more. What I'm not sure yet, but something.",
    "timestamp": 1755986400
  },
  {
    "username": "SirGrenadealot",
    "rating": 5.0,
    "comment": "Great logical puzzle, but not fun as a game for me. In particular when you play with people who have played this a lot.",
    "timestamp": 1752789600
  },
  {
    "username": "cenny",
    "rating": 5.0,
    "comment": "It’s not bad, but it is like solving a Zelda dungeon puzzle with others watching and on a time limit. I rather play Zelda.",
    "timestamp": 1747519200
  },
  {
    "username": "mariuslundberg",
    "rating": 5.0,
    "comment": "(Købt af Simonekål) (Apr 2020)",
    "timestamp": 1744063200
  },
  {
    "username": "SpnshInqstn",
    "rating": 5.0,
    "comment": "More of a solo puzzle than a game. Really great design. Not for me.",
    "timestamp": 1735945200
  },
  {
    "username": "ErikLevin",
    "rating": 5.0,
    "comment": "You have to solve an optimization problem as quickly as possible in your head. It's not much fun if the players' skill in doing that varies too much, then some players will basically not get to play. If that problem doesn't occur, it's all right.",
    "timestamp": 1725314400
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 5.0,
    "comment": "First impression. I didn't hate it, but I didn't really warm to it either.\n\nSecond impression, I came closer to hating it.\n\nThird attempt: Actively avoid…",
    "timestamp": 1725141600
  },
  {
    "username": "teabo",
    "rating": 5.0,
    "comment": "This is barely a game at all. More like a puzzle.",
    "timestamp": 1712095200
  },
  {
    "username": "hanru",
    "rating": 5.0,
    "comment": "碰撞機器人。是一款訓練學生邏輯思考的遊戲，需要思考要如何移動才能讓機器人到達目的地，機器人須根據移動規則在最短時間內找到最短的捷徑，個人認為需要邏輯推理能力較好的學生適合玩。",
    "timestamp": 1702854000
  },
  {
    "username": "Procyon_lotor",
    "rating": 5.0,
    "comment": "Thrifted $3",
    "timestamp": 1691618400
  },
  {
    "username": "Derek_P",
    "rating": 5.0,
    "comment": "Holy shit, this game...",
    "timestamp": 1690149600
  },
  {
    "username": "booned",
    "rating": 5.0,
    "comment": "This was one of my first hobby game purchases, on the recommendation of a distant gamer friend who said it was a must-buy. I took a chance that it'd be the kind of game my wife would like -- she loves racing to find a solution a la Clue. She found it too much work though. Me too, honey.\n\nI'm not surprised its rating is as high as it is, though. I do think this would be very popular with the right crowd.",
    "timestamp": 1688680800
  },
  {
    "username": "Darklaw90",
    "rating": 4.5,
    "comment": "a perfect \"brain burner\"",
    "timestamp": 1683496800
  },
  {
    "username": "MadeByhMan",
    "rating": 4.5,
    "comment": "Mostly just staring silently at a puzzle in a group. Interesting design but ultimately pretty boring.",
    "timestamp": 1673132400
  },
  {
    "username": "JadedAria",
    "rating": 5.0,
    "comment": "My partner would rate this higher.",
    "timestamp": 1670540400
  },
  {
    "username": "Kukko",
    "rating": 5.0,
    "comment": "Surprisingly fun for a puzzle, as the pace is a bit more relaxed compared to Ubongo and such games with a really tight timer. Perfect game night starter, people can drop in and out midgame.",
    "timestamp": 1665612000
  },
  {
    "username": "rosewild",
    "rating": 5.0,
    "comment": "Played in 2021",
    "timestamp": 1650060000
  },
  {
    "username": "Gelete",
    "rating": 5.0,
    "comment": "Yep, a star with a 6. A perfect game if you like to solve these kind of puzzles. I dont and thus I dont enjoy it, but the game could be a winner in many many collections. Nothing wrong with it.",
    "timestamp": 1636326000
  },
  {
    "username": "KanpaiToThat",
    "rating": 5.0,
    "comment": "Need to play this when I'm more awake. This would be super cool to play with people who are spatially intelligent.",
    "timestamp": 1615503600
  },
  {
    "username": "vilanova72",
    "rating": 5.0,
    "comment": "Local-(370)",
    "timestamp": 1613430000
  },
  {
    "username": "GregDarcy",
    "rating": 5.0,
    "comment": "An interesting game, but is shows up the fact that I don't think quickly.\n\nI have played this about half a dozen time before I started logging games.",
    "timestamp": 1605135600
  },
  {
    "username": "Born-of-Ashes",
    "rating": 5.0,
    "comment": "This can be a fun warmup activity, but I don't think I'd call it a game any more than Name That Tune. The components are nice pawns, the board is generic. Interest wanes quickly on this repetitive puzzle.",
    "timestamp": 1602108000
  },
  {
    "username": "lescarp2",
    "rating": 5.0,
    "comment": "Game is well done, just not my cup of tea.",
    "timestamp": 1595887200
  },
  {
    "username": "salomewinguetai",
    "rating": 5.0,
    "comment": "✔︎：具有挑戰性，適合喜歡向高難度挑戰的玩家\n✘：難度蠻高的，所以大家很容易陷入僵局，卡關太久容易對遊戲失去趣味",
    "timestamp": 1591394400
  },
  {
    "username": "bneffer",
    "rating": 5.0,
    "comment": "It's ok. Fun for a couple minutes as an app.",
    "timestamp": 1590444000
  },
  {
    "username": "Yenling",
    "rating": 5.0,
    "comment": "碰撞機器人\n對一個空間邏輯概念不優的人來說是一個折磨，不過想到老師在教我們時，說了一句很有道理的話，「答案就在眼前，只是我們找不到或看不到。」，或許需要轉動腦筋，但其實答案就近在眼前，只需要做一點努力就可以達成目標，覺得這就是人生的寫照。",
    "timestamp": 1590271200
  },
  {
    "username": "emike",
    "rating": 5.0,
    "comment": "More of a puzzle than a game, and I would prefer to concentrate on a puzzle rather than be distracted by the game's timer.",
    "timestamp": 1578783600
  },
  {
    "username": "bnordeng",
    "rating": 5.0,
    "comment": "This is really a puzzle and not really a game. It's okay as a puzzle and we play it more together than in competition... at least, so far.",
    "timestamp": 1559512800
  },
  {
    "username": "LordBobbio",
    "rating": 4.5,
    "comment": "A competitive puzzle... even though there are enough elements to classify it as a game in the BGG taxmonomy, it still feels like a puzzle, or an exam question on a standardized test, meant to weed out the brightest of the 1st percentile from the 2nd percentile of MIT math and physics nobel-prize winners.... not for the feeble-minded like myself. Or three other hard-core gamers who tried it out tonight. Yuck, we all said, please let us play something else.",
    "timestamp": 1553814000
  },
  {
    "username": "Fribian",
    "rating": 5.0,
    "comment": "I took this game out and studied it a little and found it a puzzle of sorts. It is interesting to see how many moves you can dwindle it down too. I may get around to playing it one fine day. On the other hand, I don't know. I'm not really sure I like this kind of game.",
    "timestamp": 1551740400
  },
  {
    "username": "TwentySides",
    "rating": 5.0,
    "comment": "I simply do not enjoy this in any way.",
    "timestamp": 1545346800
  },
  {
    "username": "Ranior",
    "rating": 5.0,
    "comment": "Ricochet Robots is a fine game I will play here and there. It's essentially a series of puzzles and whomever solves them the fastest wins. Which is quite fine for some fun here and there but just doesn't get me super excited or pumped to play. Overall it's rarely the sort of experience I am looking for while gaming.",
    "timestamp": 1543359600
  },
  {
    "username": "littlechandler",
    "rating": 5.0,
    "comment": "For people who are a fan of figuring the least number of turns optimization puzzle for a robot to go from one spot to another (which is the entire game here), and want to do it faster than others rather than having an app that tells you the absolute minimum number of turns and can create more varied maps, this is a fine game. For people who suck at it like me, this game is really frustrating as you end up being able to do nothing. Enjoyability of playing is about a 3 for me, but I also appreciate its design so hence the 5.",
    "timestamp": 1541718000
  },
  {
    "username": "Zeph!",
    "rating": 5.0,
    "comment": "More of a randomly setup puzzle than a game with very limited player interaction. It certainly sets aside the logical thinkers of the group. I always want to play Robo Rally instead.",
    "timestamp": 1537480800
  },
  {
    "username": "malayet2",
    "rating": 5.0,
    "comment": "Fun puzzle. Not really a game.",
    "timestamp": 1506808800
  },
  {
    "username": "KingArv",
    "rating": 4.5,
    "comment": "Purchase/Selling History:\n\nRating: 4.5\nDesign rating: 2.5\nComponent rating: .5\nWillingness to play rating: .5\nFun rating: 1\n\nPlayer considerations:\nNeed people who can think fast and like the race aspect of this game. Similar to SET in that fashion.\n\nMy thoughts:\nAn intense mini thinking game that is also fun! I enjoyed this game the first time I played it Jan '08 at Jenn's house, because it wasn't what I expected (not like robo rally at all).",
    "timestamp": 1484521200
  },
  {
    "username": "Mikkelinski",
    "rating": 5.0,
    "comment": "Now this is a great coffee game if you have the right group of people! I can see how the \"stare in silence, say a number, prove your case\" thing won't work for everyone but for me this was a pure delight. Maybe if I play it more I see patterns repeat too much but I doubt I'll get to that point so. A real treat of a puzzle, not so much of a game but who cares when it delivers a great time! Could be played in cooperative fashion just to puzzle with.",
    "timestamp": 1484262000
  },
  {
    "username": "Asasel",
    "rating": 5.0,
    "comment": "Makes my head hurt keeping track of the path the robot takes ricocheting around...",
    "timestamp": 1483484400
  },
  {
    "username": "Anakin1981",
    "rating": 5.0,
    "comment": "I'm very confused about this one... A very good puzzle game but that's the only thing about it. A clever idea but I wasn't enthousiastic about it.",
    "timestamp": 1482274800
  },
  {
    "username": "kupomarci",
    "rating": 5.0,
    "comment": "Hát, elég agyzsibbasztó volt, az tuti  Az 1. játék után rá kellett, hogy jöjjek, ez a játék nem kerülne elő nálunk szinte soha. Nem morfondíroztam, továbbadtam.",
    "timestamp": 1481842800
  },
  {
    "username": "ToadInTheWoods",
    "rating": 5.0,
    "comment": "Bought this by accident--I was thinking of Robo Rally. I'm going to keep it rather than returning it for an exchange, but I can't recommend it. It's a puzzle, not a game. Good for solo brain calisthenics. I wouldn't have bought it, but I don't mind having it. But make no mistake--it's overpackaged, would be better as a $2 app, and it's really not a game.",
    "timestamp": 1480633200
  },
  {
    "username": "amg100",
    "rating": 5.0,
    "comment": "Being two seconds slower than someone has the exact same effect as not playing the game at all.",
    "timestamp": 1475618400
  },
  {
    "username": "Proglin",
    "rating": 5.1,
    "comment": "Puzzle",
    "timestamp": 1475186400
  },
  {
    "username": "Locu",
    "rating": 5.0,
    "comment": "Just not my kind of game. Others love it, I think it's not fun, even though I'm not that bad at it.",
    "timestamp": 1473717600
  },
  {
    "username": "Albarc",
    "rating": 5.0,
    "comment": "Traded\nInteresting puzzles, but not my type of game. Little interaction, even talk, between players.",
    "timestamp": 1466978400
  },
  {
    "username": "meeplemonkey",
    "rating": 5.0,
    "comment": "Hurts my head! An interesting challenge/puzzle, something I would be willing to play only from time to time.",
    "timestamp": 1466200800
  },
  {
    "username": "kirasira",
    "rating": 6.0,
    "comment": "PNP",
    "timestamp": 1752444000
  },
  {
    "username": "pennincao",
    "rating": 6.0,
    "comment": "Haley",
    "timestamp": 1749852000
  },
  {
    "username": "maritn",
    "rating": 6.0,
    "comment": "+ Works really well at bigger player counts.",
    "timestamp": 1748988000
  },
  {
    "username": "rharn",
    "rating": 6.0,
    "comment": "Can be a brain-burny puzzle, but there's not enough interaction vs other players in this game to be worth revisiting.",
    "timestamp": 1746741600
  },
  {
    "username": "littlekeylime",
    "rating": 6.0,
    "comment": "Brain burner. Robots are really cute.",
    "timestamp": 1739746800
  },
  {
    "username": "Mease19",
    "rating": 6.0,
    "comment": "Great concept, but I don't like competative speed games.",
    "timestamp": 1739228400
  },
  {
    "username": "rainbowflight",
    "rating": 6.0,
    "comment": "Race to solve the maze puzzle on your head.",
    "timestamp": 1737586800
  },
  {
    "username": "makid79515",
    "rating": 6.0,
    "comment": "Japanese Edition (ハイパーロボット)",
    "timestamp": 1737500400
  },
  {
    "username": "juanitogan",
    "rating": 6.0,
    "comment": "Speed puzzle solving. So, really, just an IQ test. If you're good at that sort of thing, you'll love it. Otherwise, you'll hate it. Thus, no broad appeal and the low-ish score I give it.\n\nMatt's mods:\n- Note the BGG FAQ about single-move solutions not being allowed:\n\n> Immediately returning a robot back in the opposite direction it has just travelled from is an illegal move; \"...it may move back the way it came only after another robot moves.\" (source: RGG 2nd edition rules)\n> An active robot (the robot that currently corresponds to the target space) must ricochet (\"turn right or left\") off an obstacle at least once before it is even allowed to reach the target space. (In other words, if it could reach the target space without ricocheting, another route must be chosen).\n> So, finishing a set-up in one straight move is not allowed. Neither is it legal to move the active robot in the opposite direction only to return it to the target space after moving another robot; while these moves would be legal in themselves, the solution would be illegal as the active robot would not have ricocheted on the way to the target space.\n\nIt's a nice attempt at trying to prevent them... but not complete. It assumes it can only happen from an open space. Thus, it could be better to say that you must always come in from the direction other than the single-move direction (that is, assuming destination spaces always have 2 walls next to them--I haven't looked at the game enough to know).\n\n- In addition to the above, consider banning anything with 3 moves or less with only the active bot (throw it back in the pot and select a new target--if not the last target, that is--otherwise... see first bullet, I suppose, and it is what it is).\n\n- If you are talented at this game and playing with new players, don't be the first to announce a solution. Hold off on that until the other players are up to speed.\n\n- To add an element of luck to broaden the appeal of the game... the best I have so far is for each player to choose a color they cannot move (not silver/black). This adds 10-20% luck (still far short of the 40-60% that is preferred by most). Then, when it is \"your color's\" turn to move, you have two rule options: (easier) skip that turn, or (harder to adapt to) you are allowed to move all colors. I suggest the former--skip that turn.",
    "timestamp": 1729893600
  },
  {
    "username": "Pekuis",
    "rating": 6.0,
    "comment": "May 2020: 7\nJul 2024: 6",
    "timestamp": 1721685600
  },
  {
    "username": "Donnerdrummel",
    "rating": 6.0,
    "comment": "Leihe",
    "timestamp": 1715551200
  },
  {
    "username": "RiccB",
    "rating": 6.0,
    "comment": "Dont like the bidding for first go. It would work better if everyone got a fair shot at achieving the objectives. A good game otherwise",
    "timestamp": 1715464800
  },
  {
    "username": "ZacharyRD",
    "rating": 6.0,
    "comment": "I’m terrible at this but good mechanics",
    "timestamp": 1715292000
  },
  {
    "username": "David_Artrex",
    "rating": 6.0,
    "comment": "Eigentlich nur ein Puzzle, das alle gleichzeitig im Kopf zu lösen versuchen. Interessant Konzept, das gut funktioniert.",
    "timestamp": 1712440800
  },
  {
    "username": "AudunAG",
    "rating": 6.0,
    "comment": "Clever, but i'm not a big fan of timers. Fun puzzle solving!",
    "timestamp": 1711407600
  },
  {
    "username": "seepieceeggshell",
    "rating": 6.0,
    "comment": "More activity than game, but a great activity",
    "timestamp": 1707951600
  },
  {
    "username": "uigrad",
    "rating": 6.0,
    "comment": "Many puzzles don't work well as games. This one is actually quite decent. It's certainly worth it's cheap price, but it isn't at the top of my list of things to play, thus the lower score.",
    "timestamp": 1699657200
  },
  {
    "username": "chaoticgood4life",
    "rating": 6.0,
    "comment": "Imagine going on a work assignment to a faraway country where you don’t speak the language. Your local contact has decent English (thank goodness) and you get the project off to a great start.\nAt the end of the day he mentions that he’s hosting a board game night at his place and asks if you want to join. Why not, you say. It’s not like you’ve much else going on.\nWhen you arrive at game night, you’re greeted by an enthusiastic group of 10 locals. They are just about to start a game of Codenames - amazing, a game you already know!\nAs soon as they set up, you realize that there is a problem: this is a localized version and you can’t even begin to decipher any of the words. What’s worse is that none of the guests seem to have any interest in speaking English so for a good 90 minutes you just sit and watch them yell at each other and have a riot while you try your very best to pretend that you understand what is going on.\n\nThat’s what playing this game feels like to me. My brain can’t do it. Must be fun though… 6/10 for the unique concept.",
    "timestamp": 1695506400
  },
  {
    "username": "Checco",
    "rating": 6.0,
    "comment": "Sold",
    "timestamp": 1693864800
  },
  {
    "username": "Nitaooii",
    "rating": 6.0,
    "comment": "是一個需要動腦的遊戲，玩一盤就會覺得好累。",
    "timestamp": 1686607200
  },
  {
    "username": "chg21012",
    "rating": 6.0,
    "comment": "I have friends who adore this puzzle game. For me, it's solid, but I get why some people might be really excited about it.",
    "timestamp": 1683842400
  },
  {
    "username": "AceOfHeartsGames",
    "rating": 6.0,
    "comment": "Best with 3 - 4 players.",
    "timestamp": 1681682400
  },
  {
    "username": "rynelf",
    "rating": 6.0,
    "comment": "--Sept2004-- Finally dragged this out after months without a play. Tried it with two different audiences; one loved it, the other didn't get it at all. I think it's fun.",
    "timestamp": 1680559200
  },
  {
    "username": "LaLunateca",
    "rating": 6.0,
    "comment": "En La Lunateca",
    "timestamp": 1679954400
  },
  {
    "username": "eadred",
    "rating": 5.5,
    "comment": "Yes, it's more of a puzzle than a game, but it's reasonable fun for about half an hour.",
    "timestamp": 1670972400
  },
  {
    "username": "brueh",
    "rating": 6.0,
    "comment": "This game can be really good for some people. Sadly, I cannot play it at all.",
    "timestamp": 1665957600
  },
  {
    "username": "Raoulinho82",
    "rating": 6.0,
    "comment": "P: [3-5] (9) Competitive",
    "timestamp": 1665180000
  },
  {
    "username": "SeanC",
    "rating": 6.0,
    "comment": "Rating based on vague recollection. It seemed better than RoboRally at times, but not as good as RoboRally at other times.",
    "timestamp": 1652911200
  },
  {
    "username": "propane train",
    "rating": 6.0,
    "comment": "Definitely a mental puzzle that feels a little too solitaire for my liking. Reminds me of those Pokemon ice gym puzzles of my childhood.",
    "timestamp": 1651096800
  },
  {
    "username": "Susurrous_76",
    "rating": 6.0,
    "comment": "⭐",
    "timestamp": 1649368800
  },
  {
    "username": "SeerMagic",
    "rating": 6.0,
    "comment": "This is an ok puzzle game. I hear Mutant Meeples is much better. I would certainly like to try it.\n\n Creates complicated puzzles with simple ruleset\n Due to changing board, not gonna have repeat puzzles\n\n Too simple",
    "timestamp": 1646175600
  },
  {
    "username": "luija",
    "rating": 6.0,
    "comment": "10+",
    "timestamp": 1645484400
  },
  {
    "username": "mesenius",
    "rating": 6.0,
    "comment": "This is a really solid game. I'm dreadful at it and would never buy it myself, but I respect the design.",
    "timestamp": 1645398000
  },
  {
    "username": "x_nielleified",
    "rating": 6.0,
    "comment": "i am comically bad at these types of games",
    "timestamp": 1641164400
  },
  {
    "username": "spixel",
    "rating": 6.0,
    "comment": "best with 4,5,6\n?",
    "timestamp": 1640818800
  },
  {
    "username": "charlest",
    "rating": 6.0,
    "comment": "Surprisingly good. The game is really a mental exercise which you must complete before your opponents. Didn't expect to like the game but found it pretty fun and the time went by quick. This is solid skill though and there is no luck, so beware if that will turn you off.",
    "timestamp": 1640041200
  },
  {
    "username": "Independentfool",
    "rating": 6.0,
    "comment": "Only made it to the table once in the years ive had it. Much too difficult for my kids. Traded away.",
    "timestamp": 1638831600
  },
  {
    "username": "FutureSpec",
    "rating": 6.0,
    "comment": "Neat concept. I like how it doesn't use many components. Only reason I have it as low as a 6 is because it's VERY thinky and kind of exhausting. You have to be in the mood for something quiet and intense.",
    "timestamp": 1634594400
  },
  {
    "username": "supergraci",
    "rating": 6.0,
    "comment": "Buen pasatiempo cuya mayor virtud es que el número de jugadores es infinito. Al final acaba aburriendo. Vendido.",
    "timestamp": 1633989600
  },
  {
    "username": "Zinabi",
    "rating": 6.0,
    "comment": "Moved to brothers collection",
    "timestamp": 1629928800
  },
  {
    "username": "tiagoVIP",
    "rating": 6.0,
    "comment": "About Ricochet Robots:\n\n1) What is it?\nI admit: I once, and until a few time ago, thought Ricochet Robots was a dexterity game in which players needed to flick the bots in order to hit others to order to take them out of the board or to a given place. I truly did. Now I know how wrong I was. Because Ricochet Robots only uses the dexterity of the mind, in a very puzzle-y type of game.\n\nThere is no luck in Ricochet Robots, just thought - hard, continuous path-making, number counting, 1000 brain-rpms. A good computer program will probably crush you, so if you are those that don't like games were computers are simply better, well, skip this one.\n\nRicochet Robots is a game for those looking to challenge their spatial awareness, coupled with the time pressure of beating the others to the answer - but it doesn't have to be the \"correct\" one, just the smallest one anyone could find.\n\n2) How do you play?\nThe round starts when a token is revealed and put in the center of the board. The token says the color of the bot that must be moved and also the place to take it. The goal of each round is to take a given bot to a required place on the board in as few movements as possible, considering the bots always move until they hit a wall or another bot. Other bots can be moved also, even if, say, the goal is to lead the green bot, you can move the red and blue, to allow the green to reach its proper place. The person that calls for the smallest number and actually delivers the bot correctly in that number, takes the token.\n\nThe bots moved stay in the place they finish. Then another round starts.\n\nThe winner will be the person with the most tokens when all of them were taken.\n\n3) Which are the decisions made during play?\nWhere to move the bot and if moving the other bots will help (most of the time, it does). Do this as fast as possible.\n\n4) What are the good things in the game?\n- Nice production value - the tiles and tokens are OK and the bots are neat;\n- Straightforward gameplay - small set of rules, easy to teach and to play, with no exceptions to the main rules;\n- No luck;\n- Can work both as a game for game night, or as a teaching tool.\n\n5) Which are the bad news?\n- Playing time is short, but can be extend due to lots of thinking;\n- Can be frustrating (more on that bellow);\n- With the no luck element, different skills will normally provide the same end result.\n\n6) How do you feel while playing?\nLike you are in a math contest, doing equations. The chalk hits the blackboard with fury, as you try to do the calculations faster than your opponents. You can't say if they are ahead of you or not. The tension is high. You finish first, yelling to the jury: \"Fourteen!\" You notice you are the first to speak and are beaming with joy. Then someone else says: \"Twelve.\" You freeze. The jury rises, walks to you both, slowly. Then she extends her hand, to shake the hand of your opponent.\n\nFor the most part in a play of Ricochet Robots you will be staring at the board, in deep silence, making additions and paths in your head, trying to figure out the best way to lead a bot to its required place. Then this can turn into three possible scenarios:\na) elation: you said a number no one else could lower, and you actually were able to meet what you said and get the token;\nb) frustration: you are still crawling your way to the proper place for the bot, when someone else says: \"Twelve!\". Wait, what? Twelve?! You are still in the \"three\" and leagues away from the point you want to take the bot to. You then stare at the board, dumbfounded, trying to come up with a miracle, but the added pressure of the timer only helps to make you have even more difficulty to do the task. You accept your destiny and just let it be, frustrated;\nc) elation to frustration: you said a number, the lowest one, that you simply couldn't fulfill, due to a mistake. You are ashame and frustrated with yourself.\n\nI get similar feelings with Ubongo and its brothers - and this is why I usually avoid playing them. Not that other type of games don't have these feelings also: when a long-planned strategy fails due to a wrong action/move, I also get frustrated, and when it works, it rocks. However, the frustration usually only happens once, while in Ubongo is an exercize in how much of it can i handle in 45 minutes.\n\nRicochet Robots allows for some great quiet times, and works really well to develop spatial inteligence - a friend of mine used it in a teaching program used in several schools, with big success: it was amazing to see a whole class of loud-mouths kids and teens stop and be silent while trying to finish the puzzle.\n\nOverall, Ricochet Robots isn't a game I'm keen on revisiting, but this is due to my shortcomings and preferences than about the game itself, as it works perfectly for its intend purposes, being smart, clean and challenging. It can truly be a total winner for you, in more than one way.",
    "timestamp": 1627768800
  },
  {
    "username": "Abdul",
    "rating": 5.5,
    "comment": "A satisfying spatial puzzle, though I can't see this working well as a social experience.",
    "timestamp": 1624831200
  },
  {
    "username": "WatsonChao",
    "rating": 6.0,
    "comment": "燒腦計算步數偶爾玩玩還可以。",
    "timestamp": 1619733600
  },
  {
    "username": "dpzOnline",
    "rating": 6.0,
    "comment": "One of my daughters loves this, the other one hates this. I think it comes down to who you are as a gamer, compared to other games where it is more about the game feeling itself. So the rating would be between 2 and 8 dependign on who you are.",
    "timestamp": 1609542000
  },
  {
    "username": "gmcnish",
    "rating": 6.0,
    "comment": "Have owned and traded this away twice. Good thinky puzzle.",
    "timestamp": 1607382000
  },
  {
    "username": "arguset",
    "rating": 6.0,
    "comment": "A good classical game which surprises me every time.",
    "timestamp": 1604962800
  },
  {
    "username": "lorna",
    "rating": 6.0,
    "comment": "Possibly the game I play the worst. In fact I'm so bad, the game is terribly boring as I mostly just stare at the board until someone wins the game. Might enjoy more if I could get my brain to work the right way to play it.",
    "timestamp": 1594504800
  },
  {
    "username": "cheetah760702",
    "rating": 6.0,
    "comment": "本遊戲是在競爭環境下，每人抽象思考如何讓機器人使用最少步數走到標記，機器人每一步都只能走到碰壁才能轉彎，最先想到走法的人可以喊出步數，然後倒轉沙漏，其他玩家則須趕在沙漏滴完前想出更少的步數，不然就得棄權，最終由想出步數最少的玩家來執行操作。本遊戲非常困難，其實不太適合幼兒，因為就連成人玩就覺得很有挑戰度，光是要在腦中抽象的模擬步數就非常燒腦，還要在競爭及時間限制下完成，需要運用非常多的抽象思考能力和記憶力，兒童的認知和智力發展未成熟，要參與這樣的遊戲確實比較吃力，可能需要配合兒童簡化規則或降低難度，才比較適合。",
    "timestamp": 1593036000
  },
  {
    "username": "Ramp_",
    "rating": 7.0,
    "comment": "For Multiplayer: RR is a very interesting puzzle / activity. No matter how many times I play this game, I always enjoying my time with it. Moreover, even if it's a 1999 game, it proves that something can be so simple, yet so engaging, Elegant and fun at times.\n\nThere are two downsides that should be considered first though. The first one is that you HAVE to \"test\" this game in a boardsgame cafe, where there are high chances you will find it. Test it with you gaming buddy (-ies), the people you are playing the most. You HAVE to see whether you all are liking it, because it's one of those games where you either like it or hate it. That's something understandable since it's a puzzle where specific parts of your brain are engaging in solving the visual routing/mapping challenges. Some people are not good at it and they will not like it, so before buying, make sure you play it somewhere else.\n\nThe 2nd downside is IMO the high price of it. You see a lot of games are being released nowdays with many components, new ideas etc. etc which are cheaper than this. Here in my country, this is usually priced at €40 - €45, which is kind of a bummer, since there are so many games out there with much more componets and a better price, ultimately making RR not a VFM game.\n\nFor Solo: If you play this as a solo, then you open the chips and try to find the solution until the timer runs out. I played this ~ 5 times (including the maps with the coloured barriers) and I won easily most of them. Whether its mebeing good at these puzzles or this game being easy once you get the hang of it, I wouldn't suggest it as a primary solo game, except if you like such puzzles so much, while you are not so good at them, therefore you want something that may challenge you, finding it as a mental practice as well.",
    "timestamp": 1760824800
  },
  {
    "username": "peterlevi",
    "rating": 7.0,
    "comment": "3-8\n(open)\n\nIt's a fun activity to do from time to time. Kids enjoy this too. Works well with larger groups too.\n\nBut I'd always prefer a \"real\" strategic game to it.",
    "timestamp": 1758060000
  },
  {
    "username": "Rogon",
    "rating": 7.0,
    "comment": "H",
    "timestamp": 1757887200
  },
  {
    "username": "we3die",
    "rating": 7.0,
    "comment": "KA",
    "timestamp": 1754258400
  },
  {
    "username": "Gazuo",
    "rating": 7.0,
    "comment": "Un juego fácil de jugar, tenso en cada momento al ser el primero resolver los puzzles y apto para cualquier público.",
    "timestamp": 1750975200
  },
  {
    "username": "JohnGrimes",
    "rating": 7.0,
    "comment": "Viel zu lange nicht gespielt! Wackelkandidat",
    "timestamp": 1750802400
  },
  {
    "username": "MI38156",
    "rating": 6.5,
    "comment": "Big39",
    "timestamp": 1742166000
  },
  {
    "username": "Netlimpopo",
    "rating": 7.0,
    "comment": "Very brain burning, but interesting concept. I like java applets like \"ricocht robot challenge\" that can be played online like a puzzle.",
    "timestamp": 1741302000
  },
  {
    "username": "DLijoi",
    "rating": 7.0,
    "comment": "Good game but I'm not good at it.",
    "timestamp": 1737759600
  },
  {
    "username": "basejester",
    "rating": 7.3,
    "comment": "Nicely unique programming game.",
    "timestamp": 1733785200
  },
  {
    "username": "Zombiegod",
    "rating": 7.0,
    "comment": "BRAIN EXERCISE!!! Amazing Spatial Awareness exercise, but more of a puzzle than a board game.\n\nCreated Cyberboard version.",
    "timestamp": 1732143600
  },
  {
    "username": "DestinyThinker",
    "rating": 6.8,
    "comment": "I was intrigued with the puzzle aspect of trying to figure out how to get the robots to line up in an efficient manner. I think if I was smarter / better able to quickly see connections, I would like this game a lot more.\nI'd be interested in using this as a solo puzzle to solve how to get a robot to its next location.",
    "timestamp": 1731366000
  },
  {
    "username": "yob23",
    "rating": 7.0,
    "comment": "#최단경로 #암산",
    "timestamp": 1722981600
  },
  {
    "username": "Thrift Thopter",
    "rating": 7.0,
    "comment": "Purchased from yolandavi",
    "timestamp": 1720994400
  },
  {
    "username": "stormwarrior21",
    "rating": 7.0,
    "comment": "Nice brain-burner. Good abstract system but not for all times.",
    "timestamp": 1719871200
  },
  {
    "username": "cherdan",
    "rating": 7.0,
    "comment": "I love how easily players can join in. Not sure I love the puzzle itself.",
    "timestamp": 1719180000
  },
  {
    "username": "kencox",
    "rating": 7.0,
    "comment": "Be the first find a robot's quickest path home.\n\n>Real-time party puzzle game\n>Player Count: 2 to 12\n>Difficulty Level: Gamer Easy\n>BGG Top 50 Abstract Game",
    "timestamp": 1713823200
  },
  {
    "username": "uwen",
    "rating": 7.0,
    "comment": "機器人只能照著規則移動，並在腦中想好最佳途徑，很需要集中注意力。一開始玩的時候大家會很安靜，若有玩家快速的解出最佳路徑，大家會驚呼覺得對方太厲害，我個人很喜歡這遊戲",
    "timestamp": 1703113200
  },
  {
    "username": "p6232056",
    "rating": 7.0,
    "comment": "有難度的遊戲，考驗玩家的空間概念及邏輯推理，因推理時間有限制，因此會很緊張，也容易因為一直想不到答案而卡在那裡，這是一款需要在精神很好需要動腦的遊戲，對於不喜歡思考的玩家而言稍有難度",
    "timestamp": 1702940400
  },
  {
    "username": "Blackbaby",
    "rating": 7.0,
    "comment": "這一組遊戲會讓空氣安靜很~久，感覺比較適合用在資優班，說不定拿到建中數理資優班玩，在旁邊觀賽的人應該可以看得很過癮。",
    "timestamp": 1702508400
  },
  {
    "username": "Black Alexidor",
    "rating": 7.0,
    "comment": "Decent puzzle game, but too quiet and thinky... Might be good as a 2-3 player game with non-talkative people.",
    "timestamp": 1696111200
  },
  {
    "username": "Schmitter",
    "rating": 7.0,
    "comment": "Trade Box",
    "timestamp": 1694296800
  },
  {
    "username": "Druivenclub",
    "rating": 7.0,
    "comment": "Hans",
    "timestamp": 1693605600
  },
  {
    "username": "alethic",
    "rating": 7.0,
    "comment": "An enjoyable competitive puzzle",
    "timestamp": 1691359200
  },
  {
    "username": "tilouboy",
    "rating": 8.0,
    "comment": "One of a kind game. I'm really bad at it. Or everyone around me is exceptionnaly good at it.",
    "timestamp": 1759356000
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Good group abstract. This really is my kind of activity: just stare at a situation until something clicks.",
    "timestamp": 1759356000
  },
  {
    "username": "destro",
    "rating": 8.0,
    "comment": "k",
    "timestamp": 1756245600
  },
  {
    "username": "horarp",
    "rating": 8.0,
    "comment": "Ez egy agyrák játék, de nagyon jó",
    "timestamp": 1754431200
  },
  {
    "username": "Nicocolithophoride",
    "rating": 8.0,
    "comment": "Simple, efficient, fun and extra appreciated",
    "timestamp": 1750284000
  },
  {
    "username": "PaperDesigner",
    "rating": 8.0,
    "comment": "Simple rules, but very brain burning. You have to try to solve visual puzzles faster than your opponents. Love it or hate it. Have some trouble finding the right opportunity to play it.",
    "timestamp": 1748383200
  },
  {
    "username": "WhiteSeal",
    "rating": 7.5,
    "comment": "1-99 spelers (best 3-6)\n10+",
    "timestamp": 1746828000
  },
  {
    "username": "MatroidX",
    "rating": 8.0,
    "comment": "I admire the clever design, but find it a bit dry.\n\nPossible improvements:\n\n1) Every time you win, your handicap increases by 1 (i.e. with handicap added to all your future solution scores). This helps balance the game for players of different skills (e.g. if play to 10 points, highly unlikely one player can keep winning; the weaker ones should be able to grab at least a few points, and personal progress can be measured by reducing the handicap gap).\n\n2) The solution length could be computed as the maximum movement of any single robot (rather than summed movement of all robots). This leads to more interesting solution possibilities, since it incentivizes more robots to move. (When I play online, optimal solution is usually 1 or 2 robots moving; but 3+ moving is more interesting imo.)",
    "timestamp": 1746136800
  },
  {
    "username": "oursino",
    "rating": 8.0,
    "comment": "A jouer à plusieurs ça motive pour trouver plus vite. Au fil du temps, des petits trucs apparaissent pour raccourcir le chemin.",
    "timestamp": 1744927200
  },
  {
    "username": "Juanmau5",
    "rating": 8.0,
    "comment": "PnP",
    "timestamp": 1740006000
  },
  {
    "username": "soul2197",
    "rating": 8.0,
    "comment": "Players: 2-8 (best 3-6)\nPlaying time: 30 min",
    "timestamp": 1739228400
  },
  {
    "username": "SaraCV",
    "rating": 8.0,
    "comment": "Acquired this in a trade in Sept 2009 and has become one of my favourites. It's a brilliant game which tests route finding and problem solving skills and can be played by any number of players at once, keeping everyone engaged!",
    "timestamp": 1733094000
  },
  {
    "username": "ShiannLin",
    "rating": 8.0,
    "comment": "1999 Meeples Choice Award Nominee",
    "timestamp": 1733094000
  },
  {
    "username": "Zengoeroe",
    "rating": 7.5,
    "comment": "As a fan of puzzly games, this one hits the right spot. Just one simple mechanic, try to position the robots in such a way that the colored robot reaches its colored token space. This is a classic one for me and you can pull it out very quickly for a couple of rounds. And for people who do not like this, take its concept as it is, it's a thinky puzzly game, do not expect hilarious interaction and dice and gigantic mini's and hidden traitors etc., just puzzle away :-).\n\nAs to the remarks of the non-fans that the best player always takes the win, that's not necessarily true. The timer makes sure of that.\n\nIf AI would play this game, you would completely be destroyed by it :-D.\n\nRIP Alex Randolph.",
    "timestamp": 1730156400
  },
  {
    "username": "cosmolsmith",
    "rating": 7.5,
    "comment": "Nice logic puzzle. I like how thinky it can get and some solutions feel quite creative. The board/game is a little bland though.",
    "timestamp": 1730070000
  },
  {
    "username": "hultsfret",
    "rating": 8.0,
    "comment": "3p 4p",
    "timestamp": 1729375200
  },
  {
    "username": "HerbertML",
    "rating": 7.8,
    "comment": "Great brain burner.\n/*#J4*//*stay*/",
    "timestamp": 1727042400
  },
  {
    "username": "sanderkerel",
    "rating": 8.0,
    "comment": "Brillian puzzle game, that can be loads of fun with a group where everyone really gets in the game. I have also had several occasions where the other players could not see the fun of it.",
    "timestamp": 1726092000
  },
  {
    "username": "Rontuaru",
    "rating": 8.0,
    "comment": "I guess people either love or hate this MPS-real-time-puzzle-race-thing. It gets big ups from me.",
    "timestamp": 1725573600
  },
  {
    "username": "Haivic",
    "rating": 8.4,
    "comment": "Artwork 7\nFun 9\nGame progression vs. time 9\nMechanics 10\nPackaging size 3\nQuality 10\nReplay appeal 9\nSet-up time vs. playing time 10\nTheme 9\n-----------------\nRate 8.44\n==========",
    "timestamp": 1714946400
  },
  {
    "username": "MikeKoro",
    "rating": 8.0,
    "comment": "5th Play Thoughts  8  (Feb 2023):\n\nRicochet Robots is a melt your brain puzzle game that is very fun for me, but not for everyone. The puzzle of the game and trying to beat other players is very fun and satisfying, but some players can feel dumb if they can't figure it out round after round. I really enjoy that you can play the game with any number of people, and the table is dead silent until someone shouts out a random number, then it is 30 seconds of frantic calculating in your head. It is also really fun to see at the end of the round the different paths you take vs your opponents. Love breaking this game out to work my brain.\n\n2022: #69 of Top 100 NEW!\n\n2023: #71 of Top 100\n-2 Spots (from 2022)",
    "timestamp": 1713996000
  },
  {
    "username": "Mangosteen",
    "rating": 8.0,
    "comment": "A brilliant abstract puzzle-generator game with more than one solution—but some solutions are better than others. It can accommodate a big group, but I also like to play it solo.",
    "timestamp": 1709506800
  },
  {
    "username": "brentisarobot",
    "rating": 8.0,
    "comment": "99+ player",
    "timestamp": 1707865200
  },
  {
    "username": "Lemem",
    "rating": 8.0,
    "comment": "Ricochet Robots is a quirky logic puzzle that somehow, someway works phenomenally as a game. Although turns are taken entirely in the player's minds, there's a lot of tension and enjoyment as everyone around the table scrambles to figure out the solution. We've opted to having this set up as people arrive for game day, jumping in when they can, and in those situations Ricochet Robots shines marvelously.",
    "timestamp": 1704668400
  },
  {
    "username": "KonstantinosD",
    "rating": 9.0,
    "comment": "Simple, clever, masterfully designed, and offering a unique (and silent) playing experience.",
    "timestamp": 1759528800
  },
  {
    "username": "Irtal",
    "rating": 9.0,
    "comment": "One of my favorite",
    "timestamp": 1759010400
  },
  {
    "username": "Ashkit",
    "rating": 9.0,
    "comment": "very compelling puzzle game without any rng",
    "timestamp": 1756936800
  },
  {
    "username": "papb",
    "rating": 8.5,
    "comment": "4 min per player",
    "timestamp": 1756072800
  },
  {
    "username": "MenHunlahun",
    "rating": 9.0,
    "comment": "With many plays at different player counts now and despite this is not a game for everyone, I can say Ricochet Robots is one of my favorite abstract games, showing how a game can be a real brain burner with just a few quality components and a clever rule set. Excellent game, really attractive to people when they see it and always more challenging than expected.",
    "timestamp": 1750284000
  },
  {
    "username": "england611",
    "rating": 8.5,
    "comment": "Why do I love this so much?",
    "timestamp": 1746136800
  },
  {
    "username": "Bliss4u",
    "rating": 8.5,
    "comment": "One of the best modern abstract strategy games.",
    "timestamp": 1743458400
  },
  {
    "username": "bboyafu",
    "rating": 9.0,
    "comment": "easy to teach, fast filler",
    "timestamp": 1741215600
  },
  {
    "username": "ygram",
    "rating": 9.0,
    "comment": "Multiple plays: Really unique and thinky game. No downtime as everybody plays at the same time. 100% skill based and balanced. Players need to be evenly skilled as it is no fun if you are never close to winning a tile.",
    "timestamp": 1722290400
  },
  {
    "username": "Seb123123",
    "rating": 9.0,
    "comment": "Very nice! Easy to play, plays fast, intensive brain burn puzzle game.",
    "timestamp": 1722031200
  },
  {
    "username": "Ma_cite_ludique",
    "rating": 9.0,
    "comment": "Si simple, si complexe. J'adore ce jeu de course où l'on doit être le premier à trouver une solution. Le palpitant embarque lorsque le sablier se vide !",
    "timestamp": 1721253600
  },
  {
    "username": "bounderyan",
    "rating": 9.0,
    "comment": "ONLY 50 GAMES\nI found this game very frustrating and not fun; that is, until I found the two-player turn-based variant on the Geek. It completely changes the game to a very tense, fast, race game where one is trying to get all of their colored chits first.\n\nWith the original rules I give it a 7, with this variant it is hovers between a 9 and a 10.\n\nCheck it out, especially if the game has lost its appeal for you. Its a totally different and, IMHO, much better game.",
    "timestamp": 1710543600
  },
  {
    "username": "JK_Riki",
    "rating": 9.0,
    "comment": "This is a tricky game to rank, because it's the sort that comes to the table now and then and could be overplayed if you're not careful, but when it comes out the right amount it's terrific. Also the fact that you can play for as long as you like, jump in and out, etc. and it really makes you use your brain is great. This is one of those games I doubt we'd ever get rid of; it always has a place on our shelf.",
    "timestamp": 1709593200
  },
  {
    "username": "kikaytete",
    "rating": 9.0,
    "comment": "10-2\n84%\n\nhttp://loquenomegustadel.blogspot.com.es/2012/03/ricochet-ro...",
    "timestamp": 1708729200
  },
  {
    "username": "markbesada",
    "rating": 9.0,
    "comment": "Top 50 Games of All Time 2023: #47\nTop 50 Games of All Time 2022: #34\nTop 50 Games of All Time 2021: #45\nTop 50 Games of All Time 2020: #37\n\n(11/15) 9. A fantastic game that I can just set up at a gathering and have people gravitate to. Love the thinkyness and sandboxed brain burn of it.\n\n(9/17) 9. Still a great game that I don't bring out nearly as much as I should. Love it.\n\n(1/19) 9. My #61 Game of All Time",
    "timestamp": 1708210800
  },
  {
    "username": "mederickl",
    "rating": 9.0,
    "comment": "Love that game, it challenges your brain, and could play for hours, by myself or with a big group.",
    "timestamp": 1707692400
  },
  {
    "username": "Euroman",
    "rating": 9.0,
    "comment": "Think fast! Can play as many as can see the board.",
    "timestamp": 1707692400
  },
  {
    "username": "Patwick",
    "rating": 8.8,
    "comment": "A very likeable filler, which everyone I've taught it to enjoys.",
    "timestamp": 1705186800
  },
  {
    "username": "cathy4728473",
    "rating": 9.0,
    "comment": "很喜歡,類似網路玩過的遊戲 機器人只能直行，花最少步抵達目的地的得分，有點燒腦，但會不自覺的想要找到路線",
    "timestamp": 1704841200
  },
  {
    "username": "JoshuaStarr",
    "rating": 9.0,
    "comment": "A thinky party game? While I'm sure most would bounce off of this game, it's quick, can adapt to any player count, and is non-committal (you can walk away from the table at any time without disrupting the game). Every time I fail to see a solution I am just taunted by the game to keep playing to figure out the next one. Perhaps one of the greatest thinky fillers out there and one that continually finds its place at my table.",
    "timestamp": 1704409200
  },
  {
    "username": "Citery",
    "rating": 8.5,
    "comment": "Demanding, exhausting, cerebral communal puzzle that is played almost entirely in the players' heads. A singular design that doesn't appeal to everyone, but remains one of the most unique games in my collection.",
    "timestamp": 1693864800
  },
  {
    "username": "cjswo3060",
    "rating": 9.0,
    "comment": "퍼즐 게임 추천\n\n내돈내산",
    "timestamp": 1693864800
  },
  {
    "username": "FuetterMeinEgo",
    "rating": 9.0,
    "comment": "German version\n\nWith a Countdown-Timer with acoustic signal it will get 10 Point rating!",
    "timestamp": 1687989600
  },
  {
    "username": "kdean1",
    "rating": 9.0,
    "comment": "Easy to teach. Multiple player counts. Usually quiet, but raucous fun when a lengthy solution is in the works.",
    "timestamp": 1685916000
  },
  {
    "username": "whitecatplays",
    "rating": 10.0,
    "comment": "The sokoban dopamine hit of ould.",
    "timestamp": 1760738400
  },
  {
    "username": "galuth",
    "rating": 10.0,
    "comment": "I love this game. I used to play it back in 2004 when I was a university student, in a nice place with a long-lost friend of mine. He moved to another country, and playing this game always brings back those memories.\n\nA few years ago, around 2–3 years back, I bought it again. I still enjoy it just as much as I did then. I like it as much as chess, maybe even more.\n\nWhat I really appreciate is that in this game, the only thing you rely on is your own thinking. Of course, chess requires deep thinking too, but at higher levels, players often depend heavily on memorized openings and famous combinations rather than pure creativity.\n\nWith this game, there are no shortcuts or ways to cut corners—you simply have to focus and think. That’s what makes it truly special!",
    "timestamp": 1759615200
  },
  {
    "username": "CommanderDarken",
    "rating": 10.0,
    "comment": "Great logic game. One of few Games I Never give away.",
    "timestamp": 1759442400
  },
  {
    "username": "glenartrock",
    "rating": 10.0,
    "comment": "Very good filler, too many of my programmer friends feel like they're at work fixing bugs when they tackle this game.",
    "timestamp": 1750975200
  },
  {
    "username": "mattbain31",
    "rating": 10.0,
    "comment": "One of my favorite games of all time. If you enjoy logic puzzles and sudoku, this is your jam. But this is not for everyone. Hard to find a copy these days. Try this great online implementation. https://revenge.jcpmcdonald.com/",
    "timestamp": 1738969200
  },
  {
    "username": "azeem",
    "rating": 10.0,
    "comment": "Ricochet Robots rewards players for being good at one thing. It's an understandably polarizing game. Solving a puzzle in one's head doesn't sound like it should be fun. However, with the right group, Ricochet Robots allows players to mesmerize others with creative solutions.\n\nSometimes, players abandon their competitive nature and work together to solve a challenging puzzle.\n\nAnd all of this is before introducing the silver robot, to create your own variants!",
    "timestamp": 1726524000
  },
  {
    "username": "realityfoible",
    "rating": 10.0,
    "comment": "Brilliant. I can feel my brain shifting to a fundamentally different form of problem solving.\nSimultaneously hyper competitive and Zen. For puzzle masters and casual conversationalists alike. When RR is on the table, everyone in the room is playing, even if they don't realize it.",
    "timestamp": 1725228000
  },
  {
    "username": "BeepoisonGameMadness",
    "rating": 10.0,
    "comment": "Despiadado juego de rapidez mental, donde hay que competir para encontrar una ruta óptima, combinando rapidez e ingenio.\n\nSin turnos, suerte o excusas, no apto para mancos como el Chumbeque. La falta de aleatoriedad puede alejar a muchos.",
    "timestamp": 1723154400
  },
  {
    "username": "lexay1415",
    "rating": 10.0,
    "comment": "Love. Speed puzzle? Could be short, could be long depending on the board. Z-man version with silver robot and rubber meeple is best.",
    "timestamp": 1720216800
  },
  {
    "username": "Lina1991",
    "rating": 10.0,
    "comment": "Really nerdy",
    "timestamp": 1718143200
  },
  {
    "username": "timori",
    "rating": 10.0,
    "comment": "It takes a particular person to enjoy Ricochet Robots, and an even more particular group of people to make it their main attraction at game night, but my friends just so happen to be that. We get together, bust out the board and then sit in silence and as we count robots flying around in our mind, praying we don't forget where we started from.\n\nIf you ever wanted to role play as a Dune Mentat, this is for you.",
    "timestamp": 1701990000
  },
  {
    "username": "Niroth36",
    "rating": 10.0,
    "comment": "One of my favourite games ever! It requires extreme focus to find the fastest route or at least to find the route at all! I really enjoy playing it with friends!",
    "timestamp": 1694296800
  },
  {
    "username": "isaevale",
    "rating": 9.5,
    "comment": "Epic game of thinking ahead pure logic where who can see further and faster wins. A fascinating game more like a puzzle with no player limit. A must have for your collection!",
    "timestamp": 1694210400
  },
  {
    "username": "Siridas",
    "rating": 10.0,
    "comment": "Always down for a short round.",
    "timestamp": 1689717600
  },
  {
    "username": "PauloSantoro",
    "rating": 9.8,
    "comment": "",
    "timestamp": 1687298400
  },
  {
    "username": "Msjr5461",
    "rating": 10.0,
    "comment": "Best Game Ever!!!",
    "timestamp": 1676156400
  },
  {
    "username": "TriangularCube",
    "rating": 10.0,
    "comment": "In Dune Imperium Expansion Box",
    "timestamp": 1657317600
  },
  {
    "username": "Duch",
    "rating": 10.0,
    "comment": "Love it.\nVery good multiplayer puzzle. Not everyone will like it, but with people who will, it's a great game.\nSmall minus for not resolving the problem with short, easy to find routes which sums up to \"whoever will shout it first\".",
    "timestamp": 1653602400
  },
  {
    "username": "deepfry89",
    "rating": 9.5,
    "comment": "The best spacial-awareness game out there.",
    "timestamp": 1650751200
  },
  {
    "username": "Na_Bi",
    "rating": 10.0,
    "comment": "all time favorite, a community classic.\none million + plays.",
    "timestamp": 1649973600
  },
  {
    "username": "Hanamigi",
    "rating": 10.0,
    "comment": "I love this game, it is an always enjoyable experience of competitive puzzle solving. I would play it anywhere and anytime, since a single \"round\" lasts between some minutes and some seconds.\nRules are minimal and can be taught in 2 minutes.\n\nIt definitely is not for everyone, since it does focus on a spatial puzzle experience, and who are slower in solving this kind of puzzle will always be at a disadvantage here.\n\nStandard game components are identical in shape and colour-coded, which makes it hard or impossible to play for colourblind people.",
    "timestamp": 1646607600
  },
  {
    "username": "dgrverrant",
    "rating": 10.0,
    "comment": "My favorite game. By far. Infinitely replayable.",
    "timestamp": 1645398000
  },
  {
    "username": "tosione",
    "rating": 10.0,
    "comment": "Queimada",
    "timestamp": 1641682800
  },
  {
    "username": "balugoci",
    "rating": 10.0,
    "comment": "SS.GM.CL",
    "timestamp": 1632088800
  }
]