[
  {
    "username": "apuity",
    "rating": 1.0,
    "comment": "An atrocity",
    "timestamp": 1735081200
  },
  {
    "username": "amon1223",
    "rating": 1.0,
    "comment": "for 3-player\npass over opponent's cones\nremove and re-enter that column later on",
    "timestamp": 1676329200
  },
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "A \"game\" for babies and the mentally challenged.",
    "timestamp": 1654120800
  },
  {
    "username": "fabtor86",
    "rating": 1.0,
    "comment": "A literally nonsense game.\nWorst \"push-your-luck\" I've ever played, you have no meaningful choice during the entire game.",
    "timestamp": 1618956000
  },
  {
    "username": "kuhrusty",
    "rating": 1.0,
    "comment": "No. Not again, not ever, not at any player count. There is nothing I care less about than the outcome of this activity.",
    "timestamp": 1590012000
  },
  {
    "username": "mOCHU035",
    "rating": 1.0,
    "comment": "1 Play",
    "timestamp": 1551740400
  },
  {
    "username": "letsdance",
    "rating": 1.0,
    "comment": "i had to add one game that i could rate 1 without doubts =)",
    "timestamp": 1308088800
  },
  {
    "username": "Simon Mueller",
    "rating": 1.0,
    "comment": "Too much downtime, nothing more to do than rolling the dice - push your luck my ass.",
    "timestamp": 1254088800
  },
  {
    "username": "metelo",
    "rating": 1.0,
    "comment": "Dice fest. It is a push your luck game. No skills, no tactic, jusr plain dumb luck",
    "timestamp": 1221084000
  },
  {
    "username": "gsong",
    "rating": 1.0,
    "comment": "Can't stand it.",
    "timestamp": 1079218800
  },
  {
    "username": "Neokarasu",
    "rating": 2.0,
    "comment": "Not much of a game. Either the dice works out or it doesn't. Very minimal decision making by the player.",
    "timestamp": 1701558000
  },
  {
    "username": "kitsuneFY",
    "rating": 2.0,
    "comment": "會想到用交通錐代替玩家，一方面呼應桌遊名稱can't stop覺得很特別，是一套風險評估管理桌遊，但因為不是自己喜歡的桌遊類型，覺得玩過一次也就夠了，不會想推薦出去。",
    "timestamp": 1666562400
  },
  {
    "username": "jam3319",
    "rating": 2.0,
    "comment": "Oh I definitely can stop.",
    "timestamp": 1649455200
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1624572000
  },
  {
    "username": "Atagaka",
    "rating": 2.0,
    "comment": "I find the game to be very frustrating. It's a \"race to the top\", without any real player interaction, decision making or strategy. It's your typical old-school 80s board game, where you just roll the dice and move your pawn(s).",
    "timestamp": 1614553200
  },
  {
    "username": "kissgg",
    "rating": 2.0,
    "comment": "I hate this game. The worst kind of gambling.",
    "timestamp": 1587506400
  },
  {
    "username": "Technon",
    "rating": 2.0,
    "comment": "Too slow, not fun",
    "timestamp": 1584140400
  },
  {
    "username": "Capeguy",
    "rating": 2.4,
    "comment": "Just roll one 6 sided die before the game, 1-3 you win, 4-6 they win ( scale die accordingly for number of players). Rinse and Repeat. Save 15 minutes of your life without going thru this root canal work. Don't start.",
    "timestamp": 1562968800
  },
  {
    "username": "bluebottle",
    "rating": 2.0,
    "comment": "dice game, not very fun",
    "timestamp": 1357599600
  },
  {
    "username": "rockfordphile",
    "rating": 2.0,
    "comment": "Don't start and you won't have to worry about stopping. I like dice as much as the next guy, but this is a little too mindless and repetitive for my taste.",
    "timestamp": 1339538400
  },
  {
    "username": "rharn",
    "rating": 3.0,
    "comment": "As soulless as playing slots at a casino.",
    "timestamp": 1753048800
  },
  {
    "username": "benzidrine",
    "rating": 3.0,
    "comment": "Very boring plain gameplay. That out stays its welcome.",
    "timestamp": 1742338800
  },
  {
    "username": "MrBigos",
    "rating": 3.0,
    "comment": "I've played it as tutorial game on BGA. Don't remember a thing, except that it wasn't exciting.",
    "timestamp": 1739487600
  },
  {
    "username": "BoardGamingCouple",
    "rating": 3.0,
    "comment": "3/5",
    "timestamp": 1733612400
  },
  {
    "username": "Razorgirl",
    "rating": 3.0,
    "comment": "Taps into the same parts of the brain that gambling does by giving you a rush when you “beat the odds” and reach the top. I’m not sure this is a healthy game for people to play.",
    "timestamp": 1721858400
  },
  {
    "username": "MarshallStaxx",
    "rating": 3.0,
    "comment": "Boring - barely even counts as a 'game', more like an idle passtime.",
    "timestamp": 1709852400
  },
  {
    "username": "Plei",
    "rating": 3.0,
    "comment": "played once",
    "timestamp": 1702508400
  },
  {
    "username": "Romek010",
    "rating": 2.5,
    "comment": "wersja print & play",
    "timestamp": 1697925600
  },
  {
    "username": "laexpls",
    "rating": 3.0,
    "comment": "To be honest.. I expected more from a well known classic like Can't Stop. It wasn't fun for me at all.",
    "timestamp": 1677366000
  },
  {
    "username": "qrayx",
    "rating": 3.0,
    "comment": "One of the purest Push Your Luck games (a mechanism I don’t care for).\n\nLots of Dice Rolling (which I also generally don’t care for).\n\nLong downtime between turns.",
    "timestamp": 1661810400
  },
  {
    "username": "HoserBelow",
    "rating": 4.0,
    "comment": "BGA",
    "timestamp": 1756850400
  },
  {
    "username": "Punchiiez",
    "rating": 4.0,
    "comment": "Weight: 1\nPlayer: 2-4",
    "timestamp": 1750716000
  },
  {
    "username": "bandit_boy7",
    "rating": 3.5,
    "comment": "Sold (& shipped) via BGG Marketplace, 2/2019.",
    "timestamp": 1748124000
  },
  {
    "username": "Freshcactus",
    "rating": 4.0,
    "comment": "2**",
    "timestamp": 1747951200
  },
  {
    "username": "Piranesaye",
    "rating": 4.0,
    "comment": "It's alright. Played on BGA.",
    "timestamp": 1744149600
  },
  {
    "username": "Ginewra",
    "rating": 3.5,
    "comment": "bga",
    "timestamp": 1739746800
  },
  {
    "username": "Chorume",
    "rating": 4.0,
    "comment": "Not that great. The decisions to stop or continue are obvious, so you don’t agonize about your decision nor do you regret it if it doesn’t work out. You just had bad luck.",
    "timestamp": 1738278000
  },
  {
    "username": "tectactoe",
    "rating": 4.0,
    "comment": "THE press your luck game. Fun and easy enough for anyone to play. Only potential issue is that splitting/adding the dice can become cumbersome once your options get more limited, but that's a very minor \"issue\". Only reason my rating isn't higher is because the game isn't very deep and can wear itself thin rather quickly. But it's still a very good time.",
    "timestamp": 1735426800
  },
  {
    "username": "tiagoVIP",
    "rating": 4.0,
    "comment": "Can't Stop might just be one of the most frustrating game I have ever played! The frustration is built in the game itself: you roll 4 dices and must use sets of them to form number from 2 to 12. In our turn you have three rows to put your markers - you decide the rows, but the choice is limited by the numbers rolled, so say you rolled 3, 5, 5 and 6 - you could chose to put your markers in the 8, 9, 10 or 11. Once you put all your three markers, the subsequential rolls will serve only to advance the marker in the said roll. You can roll the dice as many times as you wish, but, if happens that you cannot form a duo of dice that advance one of your markers, you lose all the advance you have made so far in said turn.\n\nSo your choices are limited by the dice, but also the choices must be made regarding two things: probability and the advance made by the other players. The rows for 2 and 12 are the smallest ones, and the row for the 7 is the biggest. So roll a 7 is a lot easier, but the game requires many more rolls that add to 7 than those that add to 2, 4, 10, 11 and others. Also, you know that a roll of 6, 7 or 8 is easier to get, but what if your fellow players are already well advanced in all of them? Once a player reaches the end of the row (and ends its turn while the marker is in the topmost position - this is important, as the player can continue to roll and lose the advance that would win the row for him/her) all the advancement made by the others are lost. However, having one of your three markers in the said rows, might grant you more opportunities to get the numbers you really want, as they can \"save\" your turn (for example, you really want a 4 or a 10, but the dice showed 2, 4, 4 and 5 - if you have a marker in the 6 or the 8 row, you could advance it and continue rolling to get the number you want).\n\nAll of this makes for some though choices - when you have them - but also for some really frustrating, well, no-choices. No amount of calculation can save you from the (bad) luck of the roll: the blind luck of someone can win a row, that you couldn't manage to win even after 4 rounds, in a single turn. Making you lose not only the row, but also end your chances there. I have games were I was well posicioned in two rows, and lost both to players that not even started their turns with markers there. In a single round I went from a good position, to having nothing, being behind everyone else in all the other rows. Sure, this can go both ways - I also won rows and games that I wasn't really invested in.\n\nCan't Stop is a short game, but more than once I had no chance to win after the first round - and by \"no chance\" consider \"I just couldn't stop until amazing results happened\", which, sometimes, did, but many more times, don't.\n\nI don't say it is a bad game - it isn't. Can't Stop is easy to teach, to play, have some (light) decisions to be made and you can laugh at the greed of your fellow players (and your own). I just found it a little less fun than I thought (I don't see myself playing this over Diamant, for instance - being a game that is also in the type of press your luck, that accommodates up to 8, with much, much less downtime, and the aspect of the fun is the same).",
    "timestamp": 1732489200
  },
  {
    "username": "Deus_Ex_Machina",
    "rating": 4.0,
    "comment": "Kinda suprised. It's handled as a classic, and I could see why just from how it's played; it's a very pure and simple push your luck game. It did, however, fail to meet my expectations by quite a bit despite us knowing exactly what it is we are playing (meaning no false assumptions on how much of it is luck and skill, noone expected anything but a fun filler). It felt entirely too long for what it is and I wasn't really engaged or excited about other people's turns. I could play Ra or Port Royal in that time and bith are so much better it's not even funny. The one thing it has going for it is that can't stop is extremely easy, and you could likely deduce all rules by watching 2-3 turns of play. But ease of explanation never was important in my groups. Probably a better experience with the monopoly/munchkin crowd or grandparents, and I don't mean that as an insult.",
    "timestamp": 1727992800
  },
  {
    "username": "Stersy",
    "rating": 5.0,
    "comment": "Not my version!",
    "timestamp": 1760392800
  },
  {
    "username": "Mbyron7",
    "rating": 5.1,
    "comment": "2-4 Player\n30 Min\n\nMisc:\n- No cards",
    "timestamp": 1760306400
  },
  {
    "username": "ansu1910",
    "rating": 5.0,
    "comment": "Spielprinzip gefällt. Online auf BSW doof. Analog noch nicht gespielt.\nUpdate 28.07.25: online auf BGA gespielt. Deutlich besser als auf BSW aber auch nix Besonderes irgendwie.",
    "timestamp": 1753653600
  },
  {
    "username": "bootleby",
    "rating": 5.0,
    "comment": "Played it once in person and it was horrible. I've played it far too many times electronically, though. Excellent push your luck game with calculations changing (in a fun way) as the game progresses.",
    "timestamp": 1752616800
  },
  {
    "username": "goonzo",
    "rating": 5.0,
    "comment": "3d printed variant.\nBGA: 10 plays",
    "timestamp": 1752012000
  },
  {
    "username": "VioletSquirrel",
    "rating": 5.0,
    "comment": "[only played on BGA]\n\n[checked out - tried]\nlost sparkle too fast, decision options are too limited for my taste\n\nwill choose mountain goats over this",
    "timestamp": 1751148000
  },
  {
    "username": "EllenCaroline",
    "rating": 5.0,
    "comment": "used to own",
    "timestamp": 1750802400
  },
  {
    "username": "Avid_Equinox",
    "rating": 5.0,
    "comment": "It's a dice-rolling game where you push your luck to race to the top of tracks.\nThe randomness/luck is strong, but you can't get mad because you chose to risk your progress by continuing to push your luck.",
    "timestamp": 1745877600
  },
  {
    "username": "poleary238",
    "rating": 5.0,
    "comment": "This is a good reminder that a 5 rating is usually the starting point for me in ranking a game. In BGG's description, a 5 is an average game, take it or leave it.\n\n5 to me means this was 'a game' and I like games as opposed to spending time doing other things. But also some games are nothing more than that. I think Can't Stop is the best example of this kind of game.",
    "timestamp": 1744322400
  },
  {
    "username": "rogerramjet3361",
    "rating": 5.0,
    "comment": "Some fun, but just too light for me. The mat for the player board is irritating as it has to be stored rolled up, then it won't lay flat while playing. Terrible production choice.",
    "timestamp": 1744322400
  },
  {
    "username": "MaxxoBass",
    "rating": 5.0,
    "comment": "Can't Stop ist ein Glücksspielspiel, das zwar Entscheidungen zulässt, aber insgesamt wenig Raum für emergentes Gameplay bietet.",
    "timestamp": 1743631200
  },
  {
    "username": "YlumsGuardian",
    "rating": 5.0,
    "comment": "Good, but can't get past the fact that the first person to roll 6/7/8 is going to definitely have an advantage. Not a game breaker, but I think I prefer Las Vegas for dice. Solid, and I loved the app (while it lasted), but pretty dry. Still better than most roll-and-writes, though.\n\nUpdate: Sold; Can get my fix on BGA. Las Vegas is just a better dice game.",
    "timestamp": 1743202800
  },
  {
    "username": "BradJacobs",
    "rating": 5.0,
    "comment": "Fun short game of push your luck. Problem is that the interaction is non existent.",
    "timestamp": 1742166000
  },
  {
    "username": "DoctorPhil",
    "rating": 5.4,
    "comment": "Rules and gameplay 9\nStrategic avenues 5\nMechanisms 6\nThematic integration\nVariability 3\nReplayability 7\nFun factor 7\nPlayer interaction 3\nSkill ceiling 3\nOverall 5.4 out of 10",
    "timestamp": 1740351600
  },
  {
    "username": "hiimjosh",
    "rating": 5.0,
    "comment": "Not exactly thrilling but fine.",
    "timestamp": 1738537200
  },
  {
    "username": "jauggy",
    "rating": 5.0,
    "comment": "Game is decent but I dislike the turn order advantage",
    "timestamp": 1732748400
  },
  {
    "username": "Shazinga186",
    "rating": 5.0,
    "comment": "Played on a home made version with zero visual appeal. Can go a bit long.",
    "timestamp": 1731970800
  },
  {
    "username": "cataast",
    "rating": 5.0,
    "comment": "no muy entretenido",
    "timestamp": 1730934000
  },
  {
    "username": "dsumw01",
    "rating": 5.0,
    "comment": "1980 2P 5% 1P-98%",
    "timestamp": 1728511200
  },
  {
    "username": "fliegen5",
    "rating": 4.5,
    "comment": "Not a fan",
    "timestamp": 1728252000
  },
  {
    "username": "shmonkey",
    "rating": 6.0,
    "comment": "Dice roller where you are trying to be first to the top of 3 columns. decent push your luck element in a quick and easy to learn game.",
    "timestamp": 1760824800
  },
  {
    "username": "Ludotecaro",
    "rating": 6.0,
    "comment": "Giocato al Play di Bologna 2025. Simpatico.",
    "timestamp": 1760392800
  },
  {
    "username": "cif8589",
    "rating": 6.0,
    "comment": "We had a fun run of the game. The imagery on the board truly is beautiful. But I will say the magnetic l-board is frustrating. It was our first play, so maybe it will straighten out and get better over next plays, but so far that was the worst part of the game. It seems they could keep their small game /box size by replacing the l-board with a cloth board. The same imagery would look beautiful and keeps it current size.",
    "timestamp": 1760133600
  },
  {
    "username": "Card",
    "rating": 6.0,
    "comment": "[$]",
    "timestamp": 1759788000
  },
  {
    "username": "mondauge",
    "rating": 6.0,
    "comment": "I have cooled on this one after playing it a bunch via BGA. Now feels more like an exercise in discrete math.",
    "timestamp": 1759442400
  },
  {
    "username": "FeiJai24",
    "rating": 6.0,
    "comment": "Played on Board Game Arena",
    "timestamp": 1759442400
  },
  {
    "username": "jarmoaulu",
    "rating": 6.0,
    "comment": "Only played online. Quite boring. (Dec 2016)",
    "timestamp": 1758924000
  },
  {
    "username": "Kerbster76",
    "rating": 6.0,
    "comment": "Such a pure push your luck game!",
    "timestamp": 1758060000
  },
  {
    "username": "DSC14",
    "rating": 6.0,
    "comment": "Push your luck in a simple but fun form.",
    "timestamp": 1757541600
  },
  {
    "username": "zedeemia",
    "rating": 6.0,
    "comment": "It certainly lives up to its name and there are wow moments when you get the exact roll you need. But downtime seems quite high particularly at 3 and 4 players. Also bad rolling can really make this drag on a bit.",
    "timestamp": 1756072800
  },
  {
    "username": "Txirristra",
    "rating": 6.0,
    "comment": "Pros:\n+ Facil de enseñar, facil de jugar.\n+ Emocionante.\n\nContras:\n- Rango de jugadores bajo comparado con otros puch your luck.\n- Ligeramente caro para lo que ofrece.\n\nA tener en cuenta:\n* Push your luck puro.\n\n\n2 jugadores - 7/10\n3 jugadores - ?\n4 jugadores - 5/10",
    "timestamp": 1755640800
  },
  {
    "username": "jeannedarc",
    "rating": 6.0,
    "comment": "It is perfect at what it does, it's fun while you're playing it, but I don't feel like playing this one particularly much or a lot. Maybe in person it would be a different feeling. But if you're looking for a couple of fun 'push-your-luck' minutes, this is great.",
    "timestamp": 1755381600
  },
  {
    "username": "islanddave2",
    "rating": 5.5,
    "comment": "2-Player",
    "timestamp": 1755122400
  },
  {
    "username": "Chandlerwp",
    "rating": 6.0,
    "comment": "Korean Playte version. Gen Con 2025",
    "timestamp": 1754344800
  },
  {
    "username": "Cone Defense",
    "rating": 6.0,
    "comment": "Feels like an old game, which it is. Decent little dice chucker, with some push your luck.",
    "timestamp": 1753048800
  },
  {
    "username": "midnightfaerie",
    "rating": 6.0,
    "comment": "2025",
    "timestamp": 1752962400
  },
  {
    "username": "getareaction",
    "rating": 6.0,
    "comment": "Surprisingly good little dice game. The paragon of push your luck. Bought in December 2023.",
    "timestamp": 1752962400
  },
  {
    "username": "mauropino",
    "rating": 5.5,
    "comment": "Custom Edition 3D Printed",
    "timestamp": 1751234400
  },
  {
    "username": "Regai",
    "rating": 6.0,
    "comment": "A great press your luck game. I've expanded my copy to allow for six players using pieces from Advanced to Boardwalk (which are the exact same size and shape but in two additional colors).",
    "timestamp": 1749938400
  },
  {
    "username": "lukeheineman99",
    "rating": 6.0,
    "comment": "Great casual family game",
    "timestamp": 1749679200
  },
  {
    "username": "whitecatplays",
    "rating": 7.0,
    "comment": "You don’t need a theme.",
    "timestamp": 1760738400
  },
  {
    "username": "Ateckentrup",
    "rating": 7.0,
    "comment": "Flea market buy, for the family (who dont like to play deep strategy games against a boardgame addict). Quite fun push your luck.",
    "timestamp": 1760306400
  },
  {
    "username": "odie73",
    "rating": 7.0,
    "comment": "The classic push-your-luck game and for good reasons. Intuitive rules, great tension, a bit of tactical decisions, certainly always happy to pull that out with casual gamers for some easy dice-rolling.\n\nOnly knocks: The large box which makes carrying it to a gaming event a bit of a challenge and downtime becomes a bit of an issue with 4 players.",
    "timestamp": 1760220000
  },
  {
    "username": "HistorianTeacher",
    "rating": 7.0,
    "comment": "A model push-your-luck classic and a sterling example of why Sid Sackson is a giant in game design. Very easy to learn and, at least for the digital implementation on Board Game Arena, quick playing.",
    "timestamp": 1760133600
  },
  {
    "username": "wooloo1",
    "rating": 7.0,
    "comment": "I like the wooden pieces in the Eagle-Gryphon edition. The neoprene game mat also makes it very travel friendly.",
    "timestamp": 1759874400
  },
  {
    "username": "btasam",
    "rating": 7.0,
    "comment": "I'm a sucker for dice gambling. It's good, but best played digitally.",
    "timestamp": 1759788000
  },
  {
    "username": "HughCross",
    "rating": 7.0,
    "comment": "PnP. brilliant, fun and simple push your luck game, ideal as filler and new gamers. Personally would never play with more than 3 players to avoid downtime and it lose steam after a few plays. I have a PnP version that works perfectly",
    "timestamp": 1759701600
  },
  {
    "username": "Griffted",
    "rating": 7.0,
    "comment": "This elegant, evergreen, dice-roller has stood the test of time - but let's be honest, the game can drag.",
    "timestamp": 1759269600
  },
  {
    "username": "Ideology",
    "rating": 7.2,
    "comment": "Online plays",
    "timestamp": 1759269600
  },
  {
    "username": "Kroomiester",
    "rating": 7.0,
    "comment": "One of Sid Sackson’s best games, and a perfect example of push your luck done well. The illusion of probability always tells the player it’s safe to roll again… you can’t stop\n\nThe game can drag, and the more balanced the game is, the longer it will be because more possibilities are being removed, meaning you are more likely to bust on your first few rolls",
    "timestamp": 1758492000
  },
  {
    "username": "Dasoogle",
    "rating": 8.0,
    "comment": "Dice are just so satisfying to roll. Nevertheless, I tend to prefer Cards to Dice (in board games). Can't Stop makes dice feel right, where other games make dice feel wrong.",
    "timestamp": 1761015000
  },
  {
    "username": "fazermozg",
    "rating": 7.5,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "latschediwes",
    "rating": 8.0,
    "comment": "I love how quickly the rules disappear. Within minutes, the game becomes gasps, groans and laughter. It’s fast and full of energy. The fun doesn’t come from design gimmicks or intricate systems, but from the simple, universal tension between greed and risk taking. You chase numbers, you tempt fate, you cheer and curse.\n\nWhat’s brilliant is how Can’t Stop creates all this emotion with almost nothing. Just four dice, a couple of markers and the heartbeat of risk and reward. It reminds me of what games used to be, namely social, immediate and joyful.",
    "timestamp": 1760306400
  },
  {
    "username": "bnordeng",
    "rating": 8.0,
    "comment": "Push your luck at its simplest and best. I introduced this game to my kids at 5 and 3 years old and it worked great. It's a go-to game for my wife and I to play and it's just plain great for what it is. Works with gamers, non-gamers, friends, neighbors, family, everyone.",
    "timestamp": 1760220000
  },
  {
    "username": "Schandi",
    "rating": 8.0,
    "comment": "Sid Sackson rules!\nCheck out \"Rule of 28\" if you want to become better at Can't Stop.",
    "timestamp": 1759960800
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "Kids 9+\n\nSolo: https://boardgamegeek.com/filepage/55595/cant-stop-solitaire\n\nor\n\nhttps://boardgamegeek.com/thread/524490/article/5015164#5015...\n\nIt's just okay.",
    "timestamp": 1759960800
  },
  {
    "username": "Anifer15",
    "rating": 7.5,
    "comment": "Great game to travel with and pull out while waiting on a meal or just hanging out with friends at a brewery.",
    "timestamp": 1759788000
  },
  {
    "username": "pastorarod",
    "rating": 8.0,
    "comment": "Pnp!",
    "timestamp": 1759788000
  },
  {
    "username": "smriera",
    "rating": 8.0,
    "comment": "Versión Sain-Am Peak",
    "timestamp": 1759701600
  },
  {
    "username": "Astronica",
    "rating": 8.0,
    "comment": "Really good push-your luck game, it's really stripped down to the absolute minimum which makes it so easy to play and brings the \"gambling\" aspect front and center. Very nice game to just pull out and start throwing some dice. Korean version is quite nice too.",
    "timestamp": 1759615200
  },
  {
    "username": "DianeQuiTonne",
    "rating": 9.0,
    "comment": "Édition coréenne.\nUne édition au top pour un grand classique. Une sorte d'hommage rendu à ce grand ancien indétrônable, jeu de stop ou encore et de course au sommet. Les bonzes ont été remplacés par des tentes et des petits piolets. Le boitage est fabuleux. Produit d'importation (de Corée), ce jeu revient cher mais il fera sans aucun doute office de cadeau de qualité.",
    "timestamp": 1760479200
  },
  {
    "username": "badassbr",
    "rating": 9.0,
    "comment": "Que joguinho simples e divertido!\nForçar a sorte no seu mais puro estado!\nAcho que esse jogo tinha que estar em todas estantes por ai, ele é extremamente versátil.",
    "timestamp": 1760306400
  },
  {
    "username": "Marlharr",
    "rating": 8.5,
    "comment": "Excellent light family/party game. A bit long at 4 players.",
    "timestamp": 1759701600
  },
  {
    "username": "Ddyraw",
    "rating": 9.0,
    "comment": "Classic push your luck goodness, always a good time. Can feel a bit slow when your not playing as the calculations and decisions take a bit to bring it back to your turn.",
    "timestamp": 1759356000
  },
  {
    "username": "Motsu253",
    "rating": 9.0,
    "comment": "愛すべきチキンレースダイスゲーム",
    "timestamp": 1759356000
  },
  {
    "username": "kwalzl",
    "rating": 8.5,
    "comment": "7A",
    "timestamp": 1758664800
  },
  {
    "username": "Shagz",
    "rating": 9.0,
    "comment": "2025: made my own travel copy out of spare parts from other games. Small and easy to pack, now one of my go tos for traveling.\n\n2014: Heard this was a classic, and the people weren't wrong!! Super fun! Just enough control to feel like you have control, and enough dice rolling to make it dramatic and keep the skill ceiling low. Love it!",
    "timestamp": 1758319200
  },
  {
    "username": "SecretSquirrel2",
    "rating": 8.5,
    "comment": "An amazing push your luck game that will always make you say, “Can’t stop won’t stop!!”. Great for opening up to get people ready for an amazing game night that will get them excited and motivated.",
    "timestamp": 1758319200
  },
  {
    "username": "gachzorge",
    "rating": 9.0,
    "comment": "Stop? … Can’t stop.",
    "timestamp": 1758232800
  },
  {
    "username": "eVcLm",
    "rating": 9.0,
    "comment": "This is a 9 for me right now because of how good the implementation on BGA is - quick to pick up a game, no friction to playing. I think playing in person would drop it down very quickly to more like a 6 or 7. The push your luck is fun and addictive when it's quick, but with in person decision making pushing the game length to more like 30 minutes instead of 8, I doubt I would find it as fun\n\nApril 24: Dropping this to an 8, think I have overplayed it.\n\nSept 25: moving my review to the Korean L board copy now that I own it, been loving playing this offline",
    "timestamp": 1757973600
  },
  {
    "username": "DiceLord",
    "rating": 10.0,
    "comment": "Board game",
    "timestamp": 1759701600
  },
  {
    "username": "Ineken",
    "rating": 10.0,
    "comment": "So simple and pure in it's mechanics, but so fun and engaging.\n\n10 is for the old Ravensburger edition with the plastic board. Newer editions would probably get an 8",
    "timestamp": 1759356000
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "The push-your-luck game, I suppose. There's not much to the game, but it's still extraordinarily fun. You can play the odds as much as you want, but sure-things don't exist. Giant clunky stop sign board is awesome.",
    "timestamp": 1759269600
  },
  {
    "username": "OGRussHood",
    "rating": 10.0,
    "comment": "My 2025 Top 250: #15\nMy 2024 Top 250: #14\nMy 2023 Top 250: #10\nMy 2022 Top 250: #11\nMy 2021 Top 250: #13\nMy 2020 Top 250: #17\nMy 2019 Top 200: #27\nMy 2018 Top 100: #36",
    "timestamp": 1758492000
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "It's kind of clever how filling up the board can help trailing players catch up. But when the board gets too full, it swings back to dangerous. How many boardgames even have an arc? Some players will overdo the probability calculations, then hilariously bust anyway.\n\nThe most amazing session of this I ever had was after a few columns had been claimed, someone with 0 points said they had to go anyway, but they'll do 1 more turn just to see what happens. They became unstoppable, climbing and getting 3 points in one turn, winning instantly. Not many games even come close to that.",
    "timestamp": 1757800800
  },
  {
    "username": "SkullNBones12",
    "rating": 10.0,
    "comment": "Always willing for a game. Perfect filler push your luck game. Can't stop!",
    "timestamp": 1755208800
  },
  {
    "username": "dbc65",
    "rating": 10.0,
    "comment": "I consider this game nearly perfectly designed for what it aims to do. In particular, I love that if four players manage to get two columns completed each, there are 3 numbers left, so everyone's turn becomes just as if you chose those three numbers during your turn.",
    "timestamp": 1753221600
  },
  {
    "username": "KyberPearl",
    "rating": 10.0,
    "comment": "This was bought in a group of 6 from GeekMarket. I had to average each game out from the total.\n\nAveraged Cost: $21.10",
    "timestamp": 1753135200
  },
  {
    "username": "Table43",
    "rating": 10.0,
    "comment": "Can't Stop is a classic that I prefer at two or three players. With four the down time is too much.",
    "timestamp": 1750716000
  },
  {
    "username": "D3C6",
    "rating": 10.0,
    "comment": "Fun game to throw dice around.",
    "timestamp": 1745100000
  }
]