[
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Another forgettable Knizia",
    "timestamp": 1710802800
  },
  {
    "username": "LittleMisfit",
    "rating": 1.0,
    "comment": "Knizia must have taken 5 minutes to come up with this game. It's about as exciting as watching grass grow. Even though I got this game for free, I still feel like I didn't get my moneys worth. Everyone I played the game with agreed. They couldn't wait for it to be over.",
    "timestamp": 1245621600
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "Played 1 time. NOT a 2-player game. Light filler, mildly interesting, cure art in Out of teh Box edition. Reminds me of Locco with less tension. [con]",
    "timestamp": 1416697200
  },
  {
    "username": "larryjrice",
    "rating": 2.0,
    "comment": "Eh, for a quick filler its okay. Its best with 4-5 players. Still, way too much luck in the draw with limited decision making available in the game and there are far more better fillers.",
    "timestamp": 1218146400
  },
  {
    "username": "sisteray",
    "rating": 3.0,
    "comment": "It seems like a prototype that you hope someone will develop into a good game.\n\nDraw the right cards to win!\n\nThere are a couple moment of opportunity that can pop up, where you get to make a tactical decisions. The rest of the time the game plays you. It sure is nice to get the big gold cards...",
    "timestamp": 1371852000
  },
  {
    "username": "alzsara",
    "rating": 3.0,
    "comment": "The first game I played of Knizia's that I really didn't care for. It's not so much an outwitting game but a falling into luck game.",
    "timestamp": 1275948000
  },
  {
    "username": "Kieranslack",
    "rating": 4.0,
    "comment": "Moved on, very simple Knizia, not especially exciting or interesting",
    "timestamp": 1688853600
  },
  {
    "username": "Nameless",
    "rating": 4.0,
    "comment": "5$",
    "timestamp": 1551654000
  },
  {
    "username": "TedW",
    "rating": 5.0,
    "comment": "For kids, a \"9\".",
    "timestamp": 1723068000
  },
  {
    "username": "solarisphase",
    "rating": 5.0,
    "comment": "It's a quick filler game.",
    "timestamp": 1716933600
  },
  {
    "username": "Awkward_Meeple",
    "rating": 4.6,
    "comment": "Complete\nOut of the Box English edition (2002)\nOnce all mines are claimed, what's the point of continuing to play cards unless you are allowed to claim jump to a different mine?",
    "timestamp": 1714946400
  },
  {
    "username": "ThroughTheDeckGlass",
    "rating": 5.0,
    "comment": "Feels like there are a few too many fools gold cards at half of the total gold cards. I want to alter the odds and try again.",
    "timestamp": 1662415200
  },
  {
    "username": "theblobb",
    "rating": 6.0,
    "comment": "Gold Rush",
    "timestamp": 1756159200
  },
  {
    "username": "lingersky",
    "rating": 6.0,
    "comment": "簡單又心機的小品，有時候要盡快布局，有時候要賭一波。不建議加入三張手牌的變體規則，用原版或是人物黃金分開的就好了。",
    "timestamp": 1754344800
  },
  {
    "username": "flamejuggler",
    "rating": 6.0,
    "comment": "charming af production. simple slight filler game.",
    "timestamp": 1747260000
  },
  {
    "username": "gidorah",
    "rating": 6.0,
    "comment": "03.2025\n\nI sort of love the fact that Knizia’s first design is a commodity speculation game. Players flip cards to get gold (worth some value from 1 to 8); fool’s gold (worth nothing); or a prospector (the means by which you can speculate in a mine’s worth). A mine can only have 5 gold/fool’s gold cards; and you can only speculate in that mine when you flip a prospector; and you only have three chips to prospect. Very simple and very luck-driven but also a dollop of shared incentives which, when paired with the speculation, floats my boat.\n\nThat said, there are a number of other filler-type games I’d much rather play, but it’s just the sort of thing that I can get my family to play and we all have an enjoyable time.\n\n(Also, play with the original Goldrausch rules.)",
    "timestamp": 1743717600
  },
  {
    "username": "ToreDenmark",
    "rating": 7.0,
    "comment": "Great little filler game",
    "timestamp": 1737154800
  },
  {
    "username": "AJSGeek",
    "rating": 7.0,
    "comment": "A fun card game that plays quickly. I love the art style and western motif.",
    "timestamp": 1674687600
  },
  {
    "username": "GypoNolan",
    "rating": 7.5,
    "comment": "Using the origin rules (just draw and play, no three card hand). This is a perfect example of what a true filler is supposed to be. A burst of excitement with easy to teach rules. One friend compared it to a better example of what the game \"war\" does, and the card flipping excitement is the key. However there are some decisions of interest involving shared incentives, push your luck, and ever changing probabilities. The hallmarks of Knizia there from the start. This isn't just a collectors novelty, it's a genuinely good option to end a game night especially among non gamers, friends, and family.",
    "timestamp": 1741474800
  },
  {
    "username": "keatsmon",
    "rating": 8.0,
    "comment": "To reflect the rating of \"Gold Rush\"",
    "timestamp": 1740870000
  },
  {
    "username": "Boardgameswithb7",
    "rating": 9.0,
    "comment": "Gold Rush is a delightful and wonderful game! I can't recommend it enough!\nRead my review here:\nhttps://boardgamegeek.com/thread/3578169/fortune-awaits-in-t...",
    "timestamp": 1759615200
  },
  {
    "username": "cardshark28800",
    "rating": 9.0,
    "comment": "Neat little card game by Reiner.",
    "timestamp": 1399413600
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "I like the dilemma in this game, not wanting to jump in a mine too early or too late. And if a mine gets too rich, everyone will jump into it and dilute the profit. Gamers will complain because they don't get enough choices per turn, but the whole point is being a FAST card game. I think this is a fascinating early example of what Knizia would become the best in, how players will help or hurt each other.",
    "timestamp": 1731711600
  },
  {
    "username": "Leeroy_Porkins",
    "rating": 9.5,
    "comment": "Fun Area Control Card Game.",
    "timestamp": 1581289200
  }
]