[
  {
    "username": "keithm",
    "rating": 1.0,
    "comment": "A total abstract farce! Can't lick the boots of AETO.",
    "timestamp": 1272405600
  },
  {
    "username": "Michael Ward",
    "rating": 1.0,
    "comment": "05/08/93 Bought. The two map sheets are way too big for any table I own. I found the game overly complex and unplayable.",
    "timestamp": 1235948400
  },
  {
    "username": "Xenophobic_Luddite",
    "rating": 2.0,
    "comment": "\"Hitler's War\" is more my speed for this topic.",
    "timestamp": 1670367600
  },
  {
    "username": "Dr Brian",
    "rating": 2.0,
    "comment": "I use to have a problem playing 3R ... and this one didn't capture the flavor of a grand campagin game either. So I sold it.",
    "timestamp": 1304373600
  },
  {
    "username": "svic64",
    "rating": 3.0,
    "comment": "Far too complex for me. Better mor modern options available.",
    "timestamp": 1739487600
  },
  {
    "username": "HiTracey",
    "rating": 3.0,
    "comment": "Development of the classic strategic WW2 in Europe game.\n\nComplexity - 7/10",
    "timestamp": 1695420000
  },
  {
    "username": "yangtze2000",
    "rating": 4.0,
    "comment": "Buckets of dice in 3R? Yuck! A great game ruined. I shall be sticking with third edition with fourth edition rules.",
    "timestamp": 1717624800
  },
  {
    "username": "_Mark_",
    "rating": 4.0,
    "comment": "Too much complex, practically impossible to play. Maybe the rule book can be easily managed by a computer so I can imagine this would be a very beautiful PC game.",
    "timestamp": 1480287600
  },
  {
    "username": "Philip Jelley",
    "rating": 5.0,
    "comment": "Another monster game that I never got round to playing despite its reputation. Too large, too involved and too demanding of your complete attention.",
    "timestamp": 1756245600
  },
  {
    "username": "Comrade_Sarayev",
    "rating": 5.0,
    "comment": "Too much of a good thing? A leap in complexity kept me playing 4th edition.",
    "timestamp": 1707865200
  },
  {
    "username": "Bolkonsky",
    "rating": 5.0,
    "comment": "Not by committee, rather by the masses.",
    "timestamp": 1682805600
  },
  {
    "username": "SeanC",
    "rating": 5.0,
    "comment": "Just not that interesting. Quicker to play (20-30 hours) than WiF (120-200 hours) but not nearly as stimulating. Maybe the new GMT version \"A World at War\" plays better, but it's a real rules brute.",
    "timestamp": 1660514400
  },
  {
    "username": "catosulla",
    "rating": 5.5,
    "comment": "See my comments under Empire of the Rising Sun about this system.\nreacquired 7/20/19.\nAuction sale 11/16/21",
    "timestamp": 1639004400
  },
  {
    "username": "Jim_Lucas",
    "rating": 6.0,
    "comment": "I no longer crave these big strategic war games but at the time this was like the holy grail.",
    "timestamp": 1593468000
  },
  {
    "username": "Scotteric21",
    "rating": 6.0,
    "comment": "Bought the original in 1981 at the Gamekeeper in the Glendale Galleria. Played with my friend Charlie all summer when we were 12 years old. It was amazing but it's only useful for the memories now to me.",
    "timestamp": 1586988000
  },
  {
    "username": "sushidog",
    "rating": 6.0,
    "comment": "Played a bit of 3R back in the day and enjoyed it. Never found an opponent for this and not sure anyone plays it any more as Bruce Harper has moved on to more refinements of his system into further titles.",
    "timestamp": 1573254000
  },
  {
    "username": "Half_Amateur",
    "rating": 7.0,
    "comment": "A rollicking good time for those who've internalized the rules. One of the best multiplayer hex&counter grand strategy WW2 games available. If you are looking for a good GAME this is your monster. Well balanced with loads of nail-biting choices punctuated by ecstatic highs and devastating lows. Prepare to lose a weekend or two conquering or defending Europe.",
    "timestamp": 1753826400
  },
  {
    "username": "Kaiser116",
    "rating": 7.0,
    "comment": "AH",
    "timestamp": 1736982000
  },
  {
    "username": "curtnic",
    "rating": 8.0,
    "comment": "PC version only. Lots of glitches but great game on the old CPU.",
    "timestamp": 1757196000
  },
  {
    "username": "JayTaylor210",
    "rating": 8.0,
    "comment": "I like the look and feel of this game.",
    "timestamp": 1696543200
  },
  {
    "username": "ttribuzi",
    "rating": 9.0,
    "comment": "Played it only once after a ton of the original. It was great!",
    "timestamp": 1745100000
  },
  {
    "username": "The Tick",
    "rating": 9.0,
    "comment": "I despair of the reviews here that mention the length of the rulebook. As wargames go, Third Reich has always had a reputation for its high level of complexity. It goes without saying that this is not a game for everybody.\n\nWith that said, Advanced Third Reich is the granddaddy of them all. The expanded rules for air and naval combat, strategic warfare, diplomacy, limited offensives, supply rules and the use of variants add a lot of flavor to this old classic and break it out of stereotypical play. The Germans can actually do a lot more with their surface fleet. The Soviet and American force pools have been adjusted to present a much more historically accurate simulation. No two games will play the same way.\n\nDefinitely NOT for either the faint of heart or beginners. This is a game for true History buffs and fanatics who are interested in the many aspects of the Second World War in Europe.",
    "timestamp": 1743890400
  },
  {
    "username": "Macximus",
    "rating": 10.0,
    "comment": "The counters are currently MIA.",
    "timestamp": 1750716000
  },
  {
    "username": "DimitrisT",
    "rating": 10.0,
    "comment": "Το έχω φτιάξει όλο το παιχνίδι από το μηδέν, το έχω μεταφράσει στα ελληνικά και τα έχω ανεβάσει όλα εδώ, μέσα στο 2019.\nΣτους κανονισμούς και τα Παραρτήματα έχουν περαστεί εξαρχής από το μέλος του BGG, τον κύριο Camustafa (ο οποίος έκανε το ανέβασμα αυτών των αρχείων εδώ στα αγγλικά), όλες οι αλλαγές αυτών από την εταιρεία του παιχνιδιού που γίνανε από την κυκλοφορία του παιχνιδιού το 1992 μέχρι το κλείσιμο της εταιρείας του το 2000.\nΗ μετάφρασή μου στην ελληνική βασίστηκε στα αρχεία του κυρίου Camustafa και έγινε με όλες τις αλλαγές περασμένες αντίστοιχα σε Κανονισμούς και Παραρτήματα.\n\nI have create from scratch all of this historic, great board game. Also, I translated the board game in Hellenic (Greek) language, search in the files area of the board game here in BGG.",
    "timestamp": 1656799200
  }
]