[
  {
    "username": "Boardgamer80",
    "rating": 1.0,
    "comment": "This game was a 9 for me. But the alternative gameplay does not make sense. So weird, please remove the alternative rules",
    "timestamp": 1750456800
  },
  {
    "username": "chaeseo",
    "rating": 1.0,
    "comment": "racist",
    "timestamp": 1744927200
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "A fun two-round auction. I like the 2nd half a little bit more (like a more gamey Hol's der Geier), but the 1st half is enjoyable too. Despite that the number progression in the 1st half is weirdly scripted, and I kinda hate this about Stefan Dorra's auction games. But it's super quick and leads to the fun 2nd half, I shouldn't complain.\n\nFinding it a bit weird that everyone compares EVERY auction game to this one.\n\nNow I'm just wondering why don't I just play Hol's der Geier instead and.... hrmm. Good question. Just like in Biblios, why play a crappy setup round with different rules just to get to the fun part? When other games jump ahead immediately?? To be fair, For Sale is still so much better than Biblios, but now this sticks out and makes me question this bizarre design decision. And why Eurofans love this concept in particular. I guess they prefer that players start the bids with different options (no wonder asymmetry and variable setup would become huge), and its a flaw if everyone has the same cards. Even though that’s where the groupthink is waiting (auctions! dynamics!), but they can’t identify that. But if you start with different hands from a randomized deck, like in a card game, then that’s UNFAIR and flawed. Gotta draft your opening hand, even though that doubles the game length.\n\nWhat bothers me is how the bidding isn't interesting enough, usually half the player pass to get a card for free, the standard euro arc of not fighting to get a consolation prize. I guess the main problem is the strict money supply, so players don't have nearly enough money in the 1st half to bother competing for bids.\n\nAnyway, it’s okay. I just resent this for what it’s done in the long run.",
    "timestamp": 1735858800
  },
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "I would have been embarrassed to call my own creation, and some of mine (P&Ps) are pretty weak.",
    "timestamp": 1696197600
  },
  {
    "username": "GamerGirl2021",
    "rating": 1.0,
    "comment": "Very boring - like what's the point.",
    "timestamp": 1650751200
  },
  {
    "username": "AmesGames",
    "rating": 1.0,
    "comment": "Immensely boring. I have no idea why this game is loved by so many.",
    "timestamp": 1601157600
  },
  {
    "username": "postkarma",
    "rating": 1.0,
    "comment": "The card art was pretty good. Good box too. Ok, so it's probably a good one for the kiddies.\n\n*No Thanks! (it's cheaper too). The card art sucks, though.",
    "timestamp": 1553900400
  },
  {
    "username": "Doctorspektor",
    "rating": 1.0,
    "comment": "Lauded auction game that loses its charm very quickly. Proceed with caution!",
    "timestamp": 1460412000
  },
  {
    "username": "tarkvara",
    "rating": 1.0,
    "comment": "Yet another moronic auction game.",
    "timestamp": 1125180000
  },
  {
    "username": "MaxTurbo4600",
    "rating": 2.0,
    "comment": "I'd heard this described as the \"ultimate filler game\", and man was I disappointed. Maybe it was the groups I tried playing this in, but nobody ever had fun, including myself. It's just a very simple auction game without many interesting decisions to be made.",
    "timestamp": 1710370800
  },
  {
    "username": "bainewedlock",
    "rating": 2.0,
    "comment": "Rating 2 = To someone with a simliar taste like me: Don't waste your time with this.",
    "timestamp": 1679180400
  },
  {
    "username": "ldpaulson",
    "rating": 2.0,
    "comment": "Never want to play. Never.",
    "timestamp": 1628114400
  },
  {
    "username": "x3000gtx",
    "rating": 2.0,
    "comment": "I really regret buying this. It's not fun at all and it's as basic as a game can be",
    "timestamp": 1624140000
  },
  {
    "username": "erikclaes1981",
    "rating": 2.0,
    "comment": "I really hate auction games, but this one is the worst.",
    "timestamp": 1577401200
  },
  {
    "username": "subarubrem",
    "rating": 2.0,
    "comment": "auction games but feel like push your luck. boring",
    "timestamp": 1552690800
  },
  {
    "username": "claspin",
    "rating": 2.0,
    "comment": "My family hated this game, they thought it was boring and had no challenge. They also seem to not like the bidding aspect.",
    "timestamp": 1534543200
  },
  {
    "username": "tlarraya",
    "rating": 2.0,
    "comment": "We didn´t enjoy it. The art was ok. We won´t play this again.",
    "timestamp": 1501970400
  },
  {
    "username": "mgreen02",
    "rating": 2.0,
    "comment": "Unengaging.",
    "timestamp": 1434924000
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Packs a reasonable amount of clever bluffing and mind games into a radically short time. A palate cleanser, for sure, but a fairly good one at that, and something not so devoid of tactical agency as to be otherwise a random number generator. Randomness plays a part, sure, but not as large as one might initially guess; there are much larger benefits to be gained by correctly reading your opponents and knowing exactly how aggressive or risky they either will or won't be.",
    "timestamp": 1739142000
  },
  {
    "username": "bigfranco",
    "rating": 2.6,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "OthelloKeys",
    "rating": 3.0,
    "comment": "OK, I guess? Never found this interesting.",
    "timestamp": 1728424800
  },
  {
    "username": "Emil1979",
    "rating": 3.0,
    "comment": "Wanted to like this so bad, but none of my casual or gamer friends did. I do very much enjoy the theme and art, but the game just wasn't that much fun.",
    "timestamp": 1682892000
  },
  {
    "username": "andrewus",
    "rating": 3.0,
    "comment": "10",
    "timestamp": 1678230000
  },
  {
    "username": "BestBunza",
    "rating": 3.0,
    "comment": "Eh. It's fine.",
    "timestamp": 1670799600
  },
  {
    "username": "angia93",
    "rating": 3.0,
    "comment": "boring",
    "timestamp": 1656885600
  },
  {
    "username": "yeahtobi",
    "rating": 3.0,
    "comment": "Don't get it - the auctions don't feel very interesting.",
    "timestamp": 1630274400
  },
  {
    "username": "netes",
    "rating": 3.0,
    "comment": "La versión mala de No Thanks!",
    "timestamp": 1618005600
  },
  {
    "username": "darkk_",
    "rating": 4.0,
    "comment": "Game play can be easy for new players, if maximum values are known.\n\nCaptivating ❌\nEngaging ✅\nReplayability ✅\nRules ✅\nQuality ❌",
    "timestamp": 1759096800
  },
  {
    "username": "rinanagashima",
    "rating": 4.0,
    "comment": "I don't reach for this much for some reason but it's a great filler game.",
    "timestamp": 1747778400
  },
  {
    "username": "ourmove123",
    "rating": 4.0,
    "comment": "A super simple auction game. Perhaps too simple because I think it was super repetitive after just two plays. I don't ever seek to play this game. There's not much to it.\n\nThe theme is boring. The art is bland. The game play loop is not interesting. Nothing excites me about this game. The components are not interesting, and sometimes seem extremely plain, like the money cards used when you sell your properties.\n\nI personally do not resonate with this game.",
    "timestamp": 1747605600
  },
  {
    "username": "honeybeast25",
    "rating": 4.0,
    "comment": "Not a big fan of bidding games",
    "timestamp": 1733007600
  },
  {
    "username": "Butscher96",
    "rating": 4.0,
    "comment": "Not my favourite",
    "timestamp": 1721167200
  },
  {
    "username": "Sugarberrybaby",
    "rating": 4.0,
    "comment": "3-6",
    "timestamp": 1720821600
  },
  {
    "username": "SierraMey",
    "rating": 4.0,
    "comment": "Ok, very short, but I think the turn order makes a huge difference.",
    "timestamp": 1689717600
  },
  {
    "username": "Hoopyy",
    "rating": 4.0,
    "comment": "Played on BGA, wasn't much to it",
    "timestamp": 1676847600
  },
  {
    "username": "Bazzisbazz",
    "rating": 4.0,
    "comment": "It's okay I guess? The problem for me is that card games that shine at higher player count (5-6p would probably be best here), have to compete with nimmt6! and those are some large shoes to fill. So I get the excitment for this game, probably wouldn't turn down a game of it if asked (it is very short anyways), but yeah what can I say, it just doesn't have the same tension and screwage nimmt6! provides.",
    "timestamp": 1670972400
  },
  {
    "username": "Vovker",
    "rating": 5.0,
    "comment": "Party",
    "timestamp": 1760220000
  },
  {
    "username": "Beefy79",
    "rating": 5.0,
    "comment": "Tried at T&V",
    "timestamp": 1758146400
  },
  {
    "username": "PolarDad",
    "rating": 5.0,
    "comment": "Weird game that feels awkward at first and seems to have no strategy and little point. Starts to make sense and reveal a little depth near end of game. Cute art work. Super quick game.\n\nLast played 2025",
    "timestamp": 1753653600
  },
  {
    "username": "JSaa",
    "rating": 5.0,
    "comment": "I'm not fan of auction mechanicsm, but For Sale is still alright. Bit too long to be filler.",
    "timestamp": 1752098400
  },
  {
    "username": "Bison2022",
    "rating": 5.0,
    "comment": "Auction game where you bid on properties then leverage or mortgage those properties to bid on stocks/victory points. Solidly fun with five players or larger groups. Press-your-luck kind of dynamics so you can crush one game and then lose hard the next game. Easy to teach, 10 minutes to play so nice warm-up or amuse bouche.",
    "timestamp": 1747605600
  },
  {
    "username": "Narstrand",
    "rating": 5.0,
    "comment": "It's genious how much game you get out of a small stack of cards. Low rating due to it being so simple, and barely any people I've played it with want to play again because of it.",
    "timestamp": 1746223200
  },
  {
    "username": "jdtaylor",
    "rating": 5.0,
    "comment": "A game of two phases. Phase 1: bidding on cards of indeterminable value (which is guessing). Phase 2: blind simultaneous bidding (which is guessing). A \"winner\" is then announced, and everyone shrugs because it didn't feel like there was much agency involved.",
    "timestamp": 1745272800
  },
  {
    "username": "Hoyu",
    "rating": 5.0,
    "comment": "Notes:\n- Best at 6P",
    "timestamp": 1743804000
  },
  {
    "username": "cubntin",
    "rating": 5.0,
    "comment": "3-6 players",
    "timestamp": 1743289200
  },
  {
    "username": "MeepleSmuggler",
    "rating": 5.0,
    "comment": "Just another mediocre filler.",
    "timestamp": 1736118000
  },
  {
    "username": "schrifterz",
    "rating": 5.0,
    "comment": "There are better filler games. Kinda random.",
    "timestamp": 1735599600
  },
  {
    "username": "lushchords",
    "rating": 5.0,
    "comment": "Cleverly designed auction puzzle game, but it's too dry for me.",
    "timestamp": 1733439600
  },
  {
    "username": "pezboy",
    "rating": 5.0,
    "comment": "SELL - A4 - SELL 13? - Board game gift exchange",
    "timestamp": 1732230000
  },
  {
    "username": "bjsully6",
    "rating": 5.0,
    "comment": "Played online and my friends have it. It is ok but not one I would suggest. Bide and buy property then try to claim the most victory points using property values to win tricks. Concept is not bad it is probably more not my style than anything with the game itself.",
    "timestamp": 1730156400
  },
  {
    "username": "Douggy",
    "rating": 4.5,
    "comment": "Un jeu d'enchères et de qui dit mieux. Je lui mets une note assez basse car je trouve que c'est très vite redondant et que là aussi il y a une seule stratégie viable qu'il faut appliquer systématiquement et avoir de la chance dans le tirage des cartes.",
    "timestamp": 1725400800
  },
  {
    "username": "Scifi66",
    "rating": 5.0,
    "comment": "Initial rating. This seems like an excellent family filler that I've somehow missed playing.",
    "timestamp": 1724796000
  },
  {
    "username": "kvarclovag",
    "rating": 5.0,
    "comment": "A Micsoda pech jobbnak tűnik nála, de azt még nem próbáltam.",
    "timestamp": 1723327200
  },
  {
    "username": "Pekuis",
    "rating": 5.0,
    "comment": "May 2020: 6\nJul 2024: 5",
    "timestamp": 1721685600
  },
  {
    "username": "MissP1ggy",
    "rating": 6.0,
    "comment": "Family favorite.",
    "timestamp": 1760565600
  },
  {
    "username": "wangwei726",
    "rating": 6.0,
    "comment": "最佳5人 备用",
    "timestamp": 1759269600
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "The game has some nice & positive player interaction. It's not the most involved game out there, but it's tense, the flow is smooth and everything makes perfect sense - You bid on property and then you sell property for profit. There are risk/reward considerations and it's open to psychology.",
    "timestamp": 1759269600
  },
  {
    "username": "bdavid0127",
    "rating": 6.0,
    "comment": "P",
    "timestamp": 1759183200
  },
  {
    "username": "FranzK",
    "rating": 6.0,
    "comment": "Fun quick filler with two distinct phases and potential for a lot of tension in the second phase.",
    "timestamp": 1758405600
  },
  {
    "username": "The Flame of Error",
    "rating": 6.0,
    "comment": "Average game.",
    "timestamp": 1757282400
  },
  {
    "username": "Saume",
    "rating": 6.1,
    "comment": "Fine filler game where the main mechanic is an auction system.",
    "timestamp": 1756764000
  },
  {
    "username": "roric32",
    "rating": 6.0,
    "comment": "Buy the outhouse.",
    "timestamp": 1755381600
  },
  {
    "username": "chickenwang",
    "rating": 6.0,
    "comment": "print",
    "timestamp": 1755208800
  },
  {
    "username": "Coralouwho",
    "rating": 6.0,
    "comment": "#LetterF\n#Houses #RealEstate\n#BGA #Tutorial",
    "timestamp": 1752616800
  },
  {
    "username": "Username2024",
    "rating": 6.0,
    "comment": "No thanks! cousin\nBoth fun betting games you can play in under 15 minutes, I wouldn't know which to choose tho",
    "timestamp": 1751234400
  },
  {
    "username": "sherlock_221b",
    "rating": 6.0,
    "comment": "Okay starter game.",
    "timestamp": 1750975200
  },
  {
    "username": "Napattack",
    "rating": 5.5,
    "comment": "1.25\n3-6\nbest at 5\n30 (150)",
    "timestamp": 1750024800
  },
  {
    "username": "Regai",
    "rating": 6.0,
    "comment": "I really like the two auction steps in this game. Becomes a real guessing game with how much to bid. Your purchases in the first auction set up your capabilities in the second step. A little risk taking is required to maximize a marginal hand.",
    "timestamp": 1749938400
  },
  {
    "username": "lexen",
    "rating": 6.0,
    "comment": "nice auction game, but as so many out there these types are hard to get on the table with some groups.",
    "timestamp": 1749506400
  },
  {
    "username": "NormandyWept",
    "rating": 6.0,
    "comment": "Fun little auction game that can be explained in minutes but remains interesting even to experienced players.",
    "timestamp": 1748815200
  },
  {
    "username": "trawlerman",
    "rating": 6.0,
    "comment": "I'll agree to play this only because it's so short.",
    "timestamp": 1748728800
  },
  {
    "username": "fliegen5",
    "rating": 6.0,
    "comment": "on BGA, short auction game",
    "timestamp": 1748296800
  },
  {
    "username": "dthipp",
    "rating": 6.5,
    "comment": "Sold on FB Marketplace.",
    "timestamp": 1760911200
  },
  {
    "username": "Card",
    "rating": 7.2,
    "comment": "[$] Best with 5 (3-6) 30 mins, Age:10, 1.25 [$30]",
    "timestamp": 1759788000
  },
  {
    "username": "DaMaHa",
    "rating": 7.0,
    "comment": "➤ 3-6 (Best: 5)\n➤ 30 (Set-Up: 5, Teach: 5)\n➤ 1.30 (Low)\nTAGS: Auction, BadgerDeck",
    "timestamp": 1759701600
  },
  {
    "username": "viridon",
    "rating": 7.0,
    "comment": "+ Fun auction aspect\n+ High replayability\n+/- Quick games",
    "timestamp": 1759442400
  },
  {
    "username": "Kazz711",
    "rating": 7.3,
    "comment": "Good fast card game, fast bs open bidding into even faster more bs blind bidding.",
    "timestamp": 1759356000
  },
  {
    "username": "Pupupakia",
    "rating": 7.0,
    "comment": "Party",
    "timestamp": 1758578400
  },
  {
    "username": "UnluckiestCat",
    "rating": 7.0,
    "comment": "A classic - auction filler game, ideally for 4-6 people.",
    "timestamp": 1758492000
  },
  {
    "username": "Eenhoek",
    "rating": 7.0,
    "comment": "BGA",
    "timestamp": 1758405600
  },
  {
    "username": "rafaelpaz",
    "rating": 7.0,
    "comment": "Light, fun, and strategic, with just the right amount of luck. It all depends on timing and memorizing the cards already drawn. A game far ahead of its time, it has aged very well, despite its simplicity.\nA truly excellent brazilian version by Paper Games, with incredible art!",
    "timestamp": 1758232800
  },
  {
    "username": "Drb89_",
    "rating": 8.0,
    "comment": "Auction\nHand management\nBack-to-back auctions work quite well",
    "timestamp": 1760911200
  },
  {
    "username": "fazermozg",
    "rating": 7.8,
    "comment": "+",
    "timestamp": 1760652000
  },
  {
    "username": "nielsvanoch",
    "rating": 8.0,
    "comment": "Best with 5,6,4,3",
    "timestamp": 1760565600
  },
  {
    "username": "smithbc19",
    "rating": 7.5,
    "comment": "Top five family game for us. Nice length for short attention spans. Keeps everyone involved throughout. Good art on the cards. The top filler auction game in my opinion.",
    "timestamp": 1760565600
  },
  {
    "username": "pibastro28",
    "rating": 8.0,
    "comment": "Sempre divertente.",
    "timestamp": 1760047200
  },
  {
    "username": "thefatcyclist",
    "rating": 8.0,
    "comment": "***VI-4",
    "timestamp": 1760047200
  },
  {
    "username": "glanfam",
    "rating": 8.0,
    "comment": "Looking for another copy of the original game.\nMPC. I have the original version in the red box.\nGreat gateway game. Newbies find it engaging and fun.\nAnd it's fast. And enjoyable for gamers as well.",
    "timestamp": 1759701600
  },
  {
    "username": "Unitoch",
    "rating": 8.0,
    "comment": "What a masterwork. Easy to teach, easy to learn, and easy to play. Pretty much perfect for filler. Enough interesting decisions that strategic players will enjoy it, but enough variability that it goes down easy with players who are looking for something light. High player count that doesn't drag with six. I'll gladly play this anytime folks are looking for a filler.",
    "timestamp": 1759528800
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "Played online only.\n\nNeeds family play and game group play.",
    "timestamp": 1759356000
  },
  {
    "username": "Jordan_Varbev",
    "rating": 9.0,
    "comment": "Party, light, +I, +M\n#4**, #5***, #6*",
    "timestamp": 1760220000
  },
  {
    "username": "lewelen",
    "rating": 9.0,
    "comment": "A leader in its genre. Smart, quick auction game that gets right to the good stuff. Can't ask for a better filler or night starter.",
    "timestamp": 1759874400
  },
  {
    "username": "royaljayhawk",
    "rating": 9.0,
    "comment": "For Sale is easily one of my top-tier filler games. It packs a ton into a short runtime, essentially offering two mini-games in one: a fast-paced property auction followed by a clever blind bidding phase. It plays lightning quick but still manages to present some genuinely tough decisions along the way.\n\nWhat makes it shine is how accessible it is. It is very intuitive, easy to teach in just a few minutes, and the gameplay always clicks with both casual and experienced players. The shift in auction styles between phases keeps things fresh, and the artwork on the properties adds just the right touch of charm to bring the whole experience together.\n\nIt’s one of those games that somehow feels satisfying every single time. No small feat for something that plays in about 20 minutes.",
    "timestamp": 1759701600
  },
  {
    "username": "sephirot_86",
    "rating": 9.0,
    "comment": "https://www.youtube.com/watch?v=ZH54R8P3g_E",
    "timestamp": 1759010400
  },
  {
    "username": "MDLuigi",
    "rating": 9.0,
    "comment": "A very light, tight and elegant game that never fails to instantly captivate any non-gamer after the first round.",
    "timestamp": 1759010400
  },
  {
    "username": "TheSlushySnake",
    "rating": 8.5,
    "comment": "Property Flipping-Themed, 2-Part Auction Game. (Classic Auction For House Cards, Then Blind Auction For Money Cards).\n3-6 Players. (Best with 5 Players).",
    "timestamp": 1758146400
  },
  {
    "username": "IsolatedPawn",
    "rating": 8.5,
    "comment": "Always a good time, on more than one occasion has someone at the table ordered it after one or two plays. I compare it directly to High Society, and while I think HS is the stronger design, For Sale creates a more fun atmosphere.",
    "timestamp": 1757196000
  },
  {
    "username": "cenealon",
    "rating": 9.0,
    "comment": "2024 Top Games\n2025 Top Games",
    "timestamp": 1757023200
  },
  {
    "username": "invervegas",
    "rating": 9.0,
    "comment": "Complexity √ - Kids quite liked this - can't keep every game!",
    "timestamp": 1756850400
  },
  {
    "username": "Anks",
    "rating": 10.0,
    "comment": "New Solo Mode",
    "timestamp": 1759960800
  },
  {
    "username": "eldub",
    "rating": 9.5,
    "comment": "This one literally never fails to impress. Everyone I've ever shown this to loves it and immediately wants to play again. Not much brain power required, but there is enough player interaction in the auction to generate some fun tension throughout both phases if you're paying attention while also being breezy enough to simply pass the time in a fun way if you're not.",
    "timestamp": 1759442400
  },
  {
    "username": "btasam",
    "rating": 9.5,
    "comment": "Great filler with some tricky nuances for driving up bids and losing bids well.",
    "timestamp": 1759183200
  },
  {
    "username": "Undecent",
    "rating": 10.0,
    "comment": "Dans For Sale, les joueurs vont acheter des maisons aux enchères, puis proposer leurs biens aux acquéreurs. L’agent immobilier le plus riche à la fin de la partie sera sacré meilleur chasseur d’appart!\n\nFor Sale est un jeu sympathique qui plaira assurément aux joueurs de Poker. Si vous aimez bluffer, l’immobilier et l’émission Storage Wars, vous aimerez ce jeu. Iello nous livre ici un bon opus dans sa gamme Mini.\n\nRetrouvez l'article complet sur le blog!\n\nhttps://undecent.fr/2020/07/24/for-sale-qui-pourra-battre-pl...",
    "timestamp": 1755122400
  },
  {
    "username": "Fl3shIntoG3ar",
    "rating": 10.0,
    "comment": "A perfect design: simple, anyone can play, short",
    "timestamp": 1752098400
  },
  {
    "username": "jaceycole",
    "rating": 10.0,
    "comment": "8.0 - Half a dozen plays on BGA - Such a clever little filler. Definitely there's a lot of double guessing, and I do think there's probably a lot of luck, but it at feels like you have control (similar to 6Nimt!). The bidding system where you get back half your coins unless you win is brilliant. Evaluating what to bid in either phase A or B based on the current selection is a very difficult decision. Very eager to see how it goes over in person with my group!\n\n8.0 - 2 live plays with 5 and 2 more with 4 - Went over really well in both groups. The decisions are so good in such a quick package! Both phases have great moments with a different feel. I like that the first phase is more calculating and the second for of a donkey space. I suspect this'll be my go to filler!\n\n9.0 - 13 plays - This is the perfect filler. The decisions are so agonizing.",
    "timestamp": 1751320800
  },
  {
    "username": "cotomel",
    "rating": 10.0,
    "comment": "Wow, the epitome of less is more.",
    "timestamp": 1748988000
  },
  {
    "username": "sculley",
    "rating": 10.0,
    "comment": "Fun. Short. Fast.",
    "timestamp": 1748815200
  },
  {
    "username": "warlock000",
    "rating": 10.0,
    "comment": "The ultimate multiplayer filler game - it's quick, compact (I own the travel edition which I consider to be THE BEST version of For Sale) and super easy to teach, but at the same time it offers just the right number of meaningful decisions. The artwork is great and really enhances the theme of the game. A lovely package, I will play For Sale anywhere, anytime and with anyone.\n\n/update, March 2019: 35 plays in and I can't get tired of it. This game has never let me down and has proven to be a fantastic party game countless times. I couldn't ask for a better filler, it's a stellar game in its category.\n\n//update: I've had so much success with this game over the years (I've played it 80 times). This is the best filler game of all time.",
    "timestamp": 1748124000
  }
]