[
  {
    "username": "bentlarsen",
    "rating": 1.0,
    "comment": "My rating of \"1\" needs a review in order to be fully supported. Briefly, this is the first time I have played a Columbia block game and had a negative experience. I wanted to like this game; here is why I did not:\n\n1) The board is much too much too small, given the number of blocks included with the game.\n\n2) In the 1862, history has a slim chance of repeating itself.\n\na) I will have to \"do the math,\" but I believe that the North is outgunned in the 1862 scenario if the South opts for the March reinforcements.\n\nb) Count up what the South has in the Bowling Green area with what the North as in the Louisville area; this is not history, this is a farce.\n\nMore to come . . . Blah!\n\nNever mind, it is not worth the time, but to hear others praise it to the heavens makes me want to hurl an equal distance.",
    "timestamp": 1391036400
  },
  {
    "username": "rajungamer",
    "rating": 2.0,
    "comment": "Liked the fog of war the block games give you but for this one that is about it. Once you get to campaign on land, the strategic options are ok, but the map plays tight for the West.\n\nThe Union river movement rules prevent the Union from accomplishing what they did repeatedly. The rivers act as strategic barriers instead of a strategic highway for invasion. In trying to simulate the problems at Vicksburg where the difficulty was there wasn't enough dry ground for the troops to deploy, they caused problems everywhere else on the map. Also the design is thinking of Virginia where the rivers ran across the axis of advance instead of along it and generally were not navigable.\n\nWhile the union gets more action/replacement points the requirement to use strategic movement for river movement and higher command costs more than balance out the advantage. I could never simulate any 1862 Union breakthroughs (Island #10, Ft Donaldson, Bowling Green - Nashville) let alone all of them - I've usually abandoned the game by mid summer 1862. Usually the confederates have stuffed all the union attacks by then and are in great shape for a counter offensive.\nMost of the engagements do not have enough units to make effective use of the battle board. So it adds little, the line 'em strategy of A house divided gives you works just as well.\nGave it to a friend who had Bobby Lee.",
    "timestamp": 1359154800
  },
  {
    "username": "MattSouthSt.Louis",
    "rating": 3.0,
    "comment": "Bobby Lee's slightly broken sister game. The early war is nutty hard for the North if the South knows what to do. If you going to play this, start in 1863. Works better for the campaign game played side by side with Bobby Lee as the North can send units over . . . but so can the South.",
    "timestamp": 1392591600
  },
  {
    "username": "BradyLS",
    "rating": 4.0,
    "comment": "Disappointing and extremely long block game of the Western Theater of the American Civil War. Probably didn't help that I played on a team of anlaysis-paralysis players that absolutely would not carry the attack to the Confederacy. Even so, the rules and play felt a bit wonky in comparison to some other block games I've played.",
    "timestamp": 1247090400
  },
  {
    "username": "jens_hoppe",
    "rating": 5.0,
    "comment": "The Western theater complement to Bobby Lee. For some reason, this didn't click with me the way Bobby Lee did...",
    "timestamp": 1580252400
  },
  {
    "username": "da pyrate",
    "rating": 5.0,
    "comment": "If I am going to play with blocks (and I really enjoy some block games) I want area movement or point-to-point movement - hexes just don't seem to work.",
    "timestamp": 1217800800
  },
  {
    "username": "Gareth00Simon",
    "rating": 6.0,
    "comment": "Cannot get the hang of this game. A historical opening move doesn't appear to work.",
    "timestamp": 1538690400
  },
  {
    "username": "Mythologem",
    "rating": 6.0,
    "comment": "Interesting ACW. See also Bobby Lee (which is a little better imho).\n\nRate:",
    "timestamp": 1510614000
  },
  {
    "username": "collezionista",
    "rating": 7.0,
    "comment": "45",
    "timestamp": 1728424800
  },
  {
    "username": "Wiseguy4187",
    "rating": 8.0,
    "comment": "Doesn't get the credit it deserves. The 1862 scenario is actually a lot of fun as the Union in figuring out how to move down (up?) the Mississippi while holding Kentucky.",
    "timestamp": 1751234400
  },
  {
    "username": "elijah234",
    "rating": 9.0,
    "comment": "This game, together with its sister game Bobby Lee, gives a broad brush stroke coverage to the Civil War. I like it because it's considerably less fiddly than For The People, and still gives a strong sense of the challenges both sides faced during the war. Creative thinking is needed here to prevent getting bogged down in a slugfest, so novices may become frustrated with the game.",
    "timestamp": 1189202400
  },
  {
    "username": "Stip1134",
    "rating": 9.5,
    "comment": "I just played this linked with Bobby lee in the grand campaign with 4 players and I gotta say this is THE way to play this! It’s super cool how you can help your ally out in the other theater by giving them part of your replacement pints or by moving people via the rail road system and it totally changes up the games and makes it feel like the war is a really wide spread situation. Plotting and scheming with your ally in the other theater makes for some very different gameplay than what you would get with just 2 players playing one theater. I’d like to see more people write about the combined game in the forums but as it is it seems most people that have played this have not done this. Sam Grant by its self is not nearly as good as it is when you combine it with the eastern theater. I and my ally played as the confederates and with our combined work we were able to win the war within 5 months. Things in the west are a bit more of a slog than in the east but the crucial victory we achieved in the west was helped largely due to the union deciding to invade kentucky which gave the militia to us. After we gained control we sent them up to Cincinnati where they got double defense and took away 3 victory points from the union and kept them pre occupied which gave me the flexibility to commit 3 of my blocks to the eastern theater which by the 5th month helped the confederate army take advantage of a weakness in the union lines and charge into Washington DC which scored us 6vp’s and then gave us an easily defendable target that the union was compelled to attack. After that we got the win when the union lost a huge number of troops trying to take dc. Our opponents were way mor focused on their own theaters and I think only shared rp’s once. Had they worked together more as a team I have little doubt that game could have been made much more difficult for us. Also the Forrest cavalry block is God tier and probably the most valuable unit in the entire game. It served both theaters very well.",
    "timestamp": 1749247200
  }
]