[
  {
    "username": "Irondell",
    "rating": 1.0,
    "comment": "Every Survivalists game of choice. Room for only one game in the bunker? This is the one.",
    "timestamp": 1729548000
  },
  {
    "username": "SYGF",
    "rating": 1.0,
    "comment": "nationalism",
    "timestamp": 1716415200
  },
  {
    "username": "tjshields",
    "rating": 1.0,
    "comment": "I tapped out on Risk type rollers years ago. I don't get stoned and sit in the dorm doing repetitive stuff like this anymore. There just isn't any surprise in rolling the 100,000th dice to see what comes up.\n\nAsynchronous factions, the invaders taking cities & keeping them; the American's must take calculated gambles, with militia & the Star Wars lasers, to retake cities and find a foothold in the West or South or the riptide will pull them under.\n\nFun with the right people & in the spirit of Red Dawn.\n\nAlternative/post-apocalypse history is attractive, but couldn't overcome the Risk-like play.",
    "timestamp": 1403042400
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1632002400
  },
  {
    "username": "stoneart69",
    "rating": 2.0,
    "comment": "double UG!",
    "timestamp": 1544828400
  },
  {
    "username": "geoffhanna",
    "rating": 2.0,
    "comment": "Usable only as a two-player game no matter what the box may actually say",
    "timestamp": 1305324000
  },
  {
    "username": "HiTracey",
    "rating": 3.0,
    "comment": "Fun and exciting light wargame works well if Allies cooperate. For better balance needs a couple of tweaks in favour of the Yanks.\n\nComplexity - 2/10",
    "timestamp": 1702767600
  },
  {
    "username": "Zapata",
    "rating": 3.0,
    "comment": "Bought it 20 years ago just because I loved the typical ameritrash theme. Thought it would be a kind of A&A meets Mel Brooks. It was just a poor game.",
    "timestamp": 1504130400
  },
  {
    "username": "bgchafin",
    "rating": 3.0,
    "comment": "The most unbalanced of the Gamemaster Series. Half a dozen plays and the US hasn't come close to losing.",
    "timestamp": 1501365600
  },
  {
    "username": "4ndroid",
    "rating": 4.0,
    "comment": "$100, could be more depending on condition",
    "timestamp": 1721426400
  },
  {
    "username": "dragooned",
    "rating": 4.0,
    "comment": "\"I love working on American soil, Daniel. Haven't had this much fun since Woodward & Bernstein\", (Commedian in Watchmen). For fans of RED DAWN? Lazers & reenforcement cards for recapturing cities doom the Axis effort. I give US $1 per city held & cards cost $10. Eliminate the lasers. Simple, playable combat system. WHERE IS CANADA? More fun & educational if areas were based on States instead of watersheds.",
    "timestamp": 1661378400
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "prolonged playtime\n dice drama",
    "timestamp": 1627941600
  },
  {
    "username": "jimok",
    "rating": 5.0,
    "comment": "Haven't played since college back in the '80s. Not nearly as much fun as A&A, but the pieces are just as cool.\n---\nUpdate, May 2024: Dumped during the Great Purge of 2023-24.",
    "timestamp": 1738969200
  },
  {
    "username": "Javajoesworld",
    "rating": 5.0,
    "comment": "Was a favorite of friends in HS. I would play another time for nostalgia",
    "timestamp": 1735340400
  },
  {
    "username": "Arlique",
    "rating": 5.0,
    "comment": "Never really came to enjoy this one, but the figurines come in handy for our extended tech rules for Axis & Allies (https://giddygamer.com/aaa/index.html) such as the helicopters, king tanks and personnel carriers",
    "timestamp": 1734476400
  },
  {
    "username": "Unitoch",
    "rating": 5.0,
    "comment": "Creepy, what with the extremely jingoistic tone of the theme and even of the introduction, but a pretty good game nonetheless. If you can manage to get past the flag-waving and see to the lighter nature and into the absolute ridiculousness of the situation, it's a neat play. The attacking rules are neat, clearly derived from games like fellow Gamemaster Series member Axis & Allies, but the twist of being able to temporarily go over the stacking limit if you attack from two or more countries make it feel more unique than just another clone. The dynamic of slow retreat, coupled with opportunistic attacking for the Americans is the type of just hold 'em off defense game that always appeals to me. This is not just a kids game, rather this is a pretty solid medium to light wargame. Just, please, make sure you don't buy too much into the theme.",
    "timestamp": 1713477600
  },
  {
    "username": "Harley57",
    "rating": 4.5,
    "comment": "The old Saddam Hussein edition",
    "timestamp": 1701990000
  },
  {
    "username": "gizmobj",
    "rating": 5.0,
    "comment": "Least favourite of the gamemaster series.",
    "timestamp": 1684188000
  },
  {
    "username": "Arakal",
    "rating": 6.0,
    "comment": "The wife always won.",
    "timestamp": 1755554400
  },
  {
    "username": "jukejudlow",
    "rating": 6.0,
    "comment": "Sadly, sold in the first purge (that is, the first time I gave up boardgaming for one reason or another). . . .\n\n**Reacquired 4/22",
    "timestamp": 1745272800
  },
  {
    "username": "dcpepp",
    "rating": 6.0,
    "comment": "Oh how I loved the hover tanks!",
    "timestamp": 1740351600
  },
  {
    "username": "DonJunk",
    "rating": 6.0,
    "comment": "Last Verified\nFebruary 8, 2025\n\n~$45 - $150",
    "timestamp": 1739055600
  },
  {
    "username": "Frankcastle1978",
    "rating": 6.0,
    "comment": "In Germany",
    "timestamp": 1727992800
  },
  {
    "username": "JohnMark1971",
    "rating": 6.0,
    "comment": "really difficult if you play USA because everyone is against you, but it is possible to win.",
    "timestamp": 1711922400
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "I have fond memories of Fortress America. I think it is really just a gussied up 2-player game. But the game is reasonably balanced, and fun in a RISK-esque way. It also works pretty well as a solitaire game.\n\nNon-essential",
    "timestamp": 1757628000
  },
  {
    "username": "wread",
    "rating": 7.0,
    "comment": "Nostalgia",
    "timestamp": 1748210400
  },
  {
    "username": "Silverminer",
    "rating": 7.0,
    "comment": "Classic war game with lots of dice chucking",
    "timestamp": 1746050400
  },
  {
    "username": "BreaultGamesLLC",
    "rating": 8.0,
    "comment": "This is my favorite of the MB GameMaster games! Quick to get started, easy to learn, fast playing. I like the 1 v 3 asynchronous gameplay too.",
    "timestamp": 1760738400
  },
  {
    "username": "rubendario5",
    "rating": 7.9,
    "comment": "4P",
    "timestamp": 1737846000
  },
  {
    "username": "gramsdad",
    "rating": 8.0,
    "comment": "Reagan Era paranoia crossed with the trashiest of Milton Bradley Ameritrash. Its best to grab some McDonalds and play the crappiest country music that you can find (Lee Greenwood comes to mind)while playing this. Then revel in the greasy glory. That being said, its actually a really fun game, great components and a lot of strategy.Wolverines!!!!!!",
    "timestamp": 1736204400
  },
  {
    "username": "yambab",
    "rating": 9.0,
    "comment": "6",
    "timestamp": 1707174000
  },
  {
    "username": "JasonToronto",
    "rating": 9.0,
    "comment": "As a person who loves Axis and Allies, I actually like this game better. Unfortunately, this game has limited repeatability, can only be played maybe 4-5 times and then you're done for good.",
    "timestamp": 1704236400
  },
  {
    "username": "TVal",
    "rating": 8.5,
    "comment": "Great older game. Balance is well done.",
    "timestamp": 1694383200
  },
  {
    "username": "UnluckyNumber",
    "rating": 10.0,
    "comment": "My personal favorite of the Gamemaster series. Awesome production quality and very solid gameplay with combined arms, endangered supply lines, and frontlines wavering back and forth. In fact, this is probably one of my favorite war boardgames of all time due to its countdown feel. The Invaders, with their large but ever shrinking reinforcements, must race across the map to strike down the weaker American player whose ever growing never ending reinforcements will eventually overwhelm them if given long enough while the American player must do all he can to stall and delay the enemy advance. I love this game.",
    "timestamp": 1753394400
  },
  {
    "username": "hobbes24",
    "rating": 10.0,
    "comment": "WOLVERINES!!!!",
    "timestamp": 1671750000
  },
  {
    "username": "Red Shirt Ensign",
    "rating": 10.0,
    "comment": "Infinitely replayable, with changing strategy each game depending on setup and resupply variables.",
    "timestamp": 1642633200
  }
]