[
  {
    "username": "Glamorous Mucus",
    "rating": 1.0,
    "comment": "I am completely at a loss as to why this game is often held in such high regard. It's supposed to be a bluffing game, but successfully bluffing does not put you in a position to win. A totally banal game, at least among adults. Kramer himself in 1989 singled out Heimlich & Co as a game that wasn't really one of his favorites, despite its commercial success.",
    "timestamp": 1217109600
  },
  {
    "username": "wanne",
    "rating": 2.0,
    "comment": "bei Barbara gespielt",
    "timestamp": 1743544800
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Played with the basic game. Would definitely better with the variant so that players are incentivised to hide their identity",
    "timestamp": 1755727200
  },
  {
    "username": "schachn",
    "rating": 4.0,
    "comment": "Got this from my parents. Solid game for this age.",
    "timestamp": 1709938800
  },
  {
    "username": "Nodens",
    "rating": 5.0,
    "comment": "There was no way they could find me unless I had toilet paper stuck to my shoe...damn.",
    "timestamp": 1758146400
  },
  {
    "username": "Joka61",
    "rating": 5.0,
    "comment": "BR 1984",
    "timestamp": 1752876000
  },
  {
    "username": "noisycrow",
    "rating": 6.0,
    "comment": "I like it, even though I am not very good at it. Seems to be best with less than the maximum.",
    "timestamp": 1758060000
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 8717249191964\nGL8",
    "timestamp": 1757973600
  },
  {
    "username": "grognard72",
    "rating": 7.0,
    "comment": "One play so far. Played with the grandsons, who prefer Spy Alley. That has more thematic aspects while this one is a bit too abstract for them I suspect. Also, it is harder to control your destiny in this one… basic game appears to be somewhat unpredictable. Need to try again before rating.\n\nAn interesting historical note, from BGG's profile page on the designer Wolfgang Kramer...\nIt is said that Kramer's Heimlich & Co. was the first to use a victory point track going around the board (known among German gamers as a Kramerleiste). (See westpark-gamers.de interview.)\nLive link is on the designer page.",
    "timestamp": 1760738400
  },
  {
    "username": "Kieranslack",
    "rating": 8.0,
    "comment": "Great family game.\n\nNice player count and always a great laugh.\n\nOne not to take too seriously as so much of it is out of your hands.\n\nLove the guessing towards the end of the game as you try to figure out who is who. Helps to prompt a great post game chat.\n\nDefinitely worth picking up as it's often pretty cheap and can be played with almost anyone.",
    "timestamp": 1747346400
  },
  {
    "username": "Stehmansmith5",
    "rating": 8.5,
    "comment": "A criminally underrated social deduction game from the 80s.",
    "timestamp": 1751925600
  },
  {
    "username": "ShiannLin",
    "rating": 10.0,
    "comment": "1986 Spiel des Jahres Winner",
    "timestamp": 1736982000
  }
]