[
  {
    "username": "TDaver",
    "rating": 1.2,
    "comment": "I haven't been this bored since elementary school math class.",
    "timestamp": 1446418800
  },
  {
    "username": "sommese",
    "rating": 1.0,
    "comment": "Very bad game!!!!",
    "timestamp": 1202079600
  },
  {
    "username": "crafty_nicky",
    "rating": 2.0,
    "comment": "The basic concept is good, but it falls apart quickly.\nThe clue exchange/collection mechanic is mediocre and gets boring very fast. What kills the game are the completely unbalanced winning conditions.",
    "timestamp": 1701212400
  },
  {
    "username": "Fhiros",
    "rating": 2.0,
    "comment": "Creo que lo que menos me ha gustado de todo lo que he jugado. Muy aburrido.",
    "timestamp": 1645830000
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Deduction game with good ideas but end up feeling a bit overwrought and too arbitrary.",
    "timestamp": 1750802400
  },
  {
    "username": "verandi",
    "rating": 3.0,
    "comment": "I prefer my deduction games more spartan- for example Black Vienna. The obvious counter-example would be Clue, which has a lot of BS in the mechanics that has nothing to do with the deduction aspect. Inkognito is more like Clue, in my view. There is all this crap like pawns moving around the board, silly limitations to your movement based on some thingamabob that you shake each turn to see what color balls - representing your movement options - are available this turn.\n\nI hated my one and only play of this- it felt like I had to wait forever just to do anything thanks to the random limitations on what actions I could take. It isn't fun when you pass 4 turns in a row (equivalent to about 20 minutes sitting at the table) because the one action you need doesn't randomly come up. In Black Vienna there are random limitations to the kinds of questions you can ask but it is not nearly as constricting and actually introduces an interesting card management problem.\n\nI would play this again to see if my experience was a statistical anomaly but to be honest - above and beyond my issues with the randomness - I found the structure of the game itself to be fundamentally uninteresting. There are just other better deduction games out there. You can keep the plastic bits and nice board- I'll keep the better game.",
    "timestamp": 1646607600
  },
  {
    "username": "NVRAM",
    "rating": 4.0,
    "comment": "A slightly improved version of the classic \"Clue\" game. After one play, I'd probably never play again - and if I do, only at exactly 4 players.\n\nPRO:\n- \"show 3 cards\" makes it a more clever puzzle,\n- the pairing and missions adds a level of weight.\n\nCON:\n- AFAICT the manual omitted absolutely critical details so we had to make it up.\n- the flaw (as in Clue) that if you cannot \"co-locate\" with another character, your turn is a dud.\n- showing 3 (or 2) cards makes a very messy tally/record sheet.\n- luck, of movement and location, is very high.\n- the idea that a player must prove when someone has shown them the same 3 cards again - meaning that they reveal their sheet and hence all of the details they know so far in the game?\n- the layout of the player tally/record sheet seemed poorly designed.\n\nBut as a re-release, these flaws should have been addressed.",
    "timestamp": 1741906800
  },
  {
    "username": "Kiro",
    "rating": 4.0,
    "comment": "2 - 4",
    "timestamp": 1725228000
  },
  {
    "username": "oursino",
    "rating": 5.0,
    "comment": "Les règles sont simples, et il faut découvrir qui est notre allié et aller sur un lieu défini par un code. Une belle part de hasard concerne la distribution des billes qui permettent de faire des actions. La seule partie que j'ai faite aurait pu se finir en 10 minutes puisque nous avons découvert notre alliance avec mon coéquipier après un tour de jeu.... le hasard des cartes et des boules! C'est pourquoi je pense qu'Intrigues à Venise est très hasardeux malgré un concept plutôt sympa.",
    "timestamp": 1744840800
  },
  {
    "username": "greetingsfrombergen",
    "rating": 5.0,
    "comment": "NOK 140",
    "timestamp": 1743030000
  },
  {
    "username": "draculove",
    "rating": 5.0,
    "comment": "its fine, pretty easy, the company is what makes it fun",
    "timestamp": 1733094000
  },
  {
    "username": "jcameron",
    "rating": 5.0,
    "comment": "After figuring out who is on what team (the most brilliant part of the game), the game devolves into a slough of moving based on \"rolling\" the balls.",
    "timestamp": 1721685600
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "Rules summary: https://boardgamegeek.com/filepage/121654/universal-head-ink...\n\nIt's just okay.",
    "timestamp": 1759874400
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 5010995017742\nIJK1",
    "timestamp": 1758319200
  },
  {
    "username": "Joka61",
    "rating": 6.0,
    "comment": "BR 1988",
    "timestamp": 1752876000
  },
  {
    "username": "thepinch",
    "rating": 5.7,
    "comment": "Beautiful board & pieces.\n\nThe game actually can work with only 4 players, as much as I want to like it, it's not that good, a bit long for what it is.\n\nInteresting teams based game, but the deduction is not that interesting.",
    "timestamp": 1745618400
  },
  {
    "username": "MoMahili",
    "rating": 7.0,
    "comment": "Sale",
    "timestamp": 1759874400
  },
  {
    "username": "ripley3",
    "rating": 7.0,
    "comment": "Partite : 2",
    "timestamp": 1747864800
  },
  {
    "username": "ginkhoma",
    "rating": 8.0,
    "comment": "Don ludothèque",
    "timestamp": 1760824800
  },
  {
    "username": "Morcar1986",
    "rating": 8.0,
    "comment": "Gran bel investigativo per esclusione di Colovini; bellissimi i materiali; le regole più recenti sono superiori a quelle originali che non consentivano mosse con le sfere bianche, assurdo in un gioco investigativo e non di percorso; inoltre consente di giocare con l'ambasciatore che però resta un po' troppo avvantaggiato.",
    "timestamp": 1741474800
  },
  {
    "username": "LG_Annapura",
    "rating": 9.0,
    "comment": "Growing up with this",
    "timestamp": 1740351600
  },
  {
    "username": "nanobastaddo",
    "rating": 9.0,
    "comment": "Unexpected well done ambientation and mistery game when i was a kid",
    "timestamp": 1738796400
  },
  {
    "username": "Benjismama",
    "rating": 10.0,
    "comment": "I love this game! Played with my mother in law, we had so much fun even though i tipped the wrong partner, after 5rounds finally nailed it.\n\nI love the math deduction here, very elegant. The dicing gadget is fun though the map of venice felt almost unnecessary.",
    "timestamp": 1719007200
  },
  {
    "username": "angrynerd",
    "rating": 10.0,
    "comment": "This one just got me from the first time I played it. I like deduction games in general, but this is the first game I've played in a while that actually felt tense to me. The unknown partnership feature is unique and interesting. This is not to say it's without its faults: aside from the usual pitfalls of deduction games (player error in showing cards or tracking answers), the movement mechanic can totally starve out some players, and the pictures on the cards could be a bit more distinctive (it's easy to confuse skinny and tall, or short and fat, for example). Overall, I found it interesting and well worth playing.",
    "timestamp": 1639090800
  }
]