[
  {
    "username": "PeterTheUnGreat",
    "rating": 1.0,
    "comment": "Just didn't seem to work - dissapointingly",
    "timestamp": 1625954400
  },
  {
    "username": "thorium",
    "rating": 1.0,
    "comment": "Now you can be bored with 2 players instead of 3 - 4!",
    "timestamp": 1335304800
  },
  {
    "username": "jaderaistlin",
    "rating": 1.0,
    "comment": "Too many stacks, too many exceptions, for what it really is.",
    "timestamp": 1317765600
  },
  {
    "username": "thorndor",
    "rating": 1.0,
    "comment": "There are some fun things about Settlers but they are all missing from this pointless exercise.",
    "timestamp": 1250805600
  },
  {
    "username": "dead jawa",
    "rating": 1.0,
    "comment": "Settlers themed Memory. Broken and useless, unless you actually want to play Memory, but then the other mechanics interfere with it making it something less then Memory. I formerly had this rated at .01, as it is my most hated game, but BGG seems to have modified the system to make 1 the lowest viable rating. Of all the myriad games I've played over the years, this is the worst. This game's existence makes me angry.",
    "timestamp": 1198450800
  },
  {
    "username": "kevhoffer",
    "rating": 1.0,
    "comment": "not so good.",
    "timestamp": 1024610400
  },
  {
    "username": "Streuselkuchen168",
    "rating": 2.0,
    "comment": "Broke the game very quickly. The cards are not well balanced at all. Some are extremely overpowering and others basically worthless. I forgot the respective names but I remember that you can get 1 victory point each for obtaining the red/blue dice and there were many cards specifically designed to obtain these special victory points. However 1 victory point was just way too little to even bother. Felt like a big part of the game was just wasted.",
    "timestamp": 1694988000
  },
  {
    "username": "ERPriest",
    "rating": 2.0,
    "comment": "I don't usually rate after only 1 play but I'm not sure I want to play this again. I could never get the resources I needed, my card draws were crap, and my wife just kept destroying and stealing everything I would build or collect. I eventually got so far behind it was hopeless. A very long and frustrating experience with a runaway leader problem and no fun at all.\n\nI want to hope that it is not always like this, but it seems that the combination of this much luck and this much direct confrontation can allow for a pretty unbalanced and unpleasant game.\n\nWilling to try again.....maybe.\n\n2nd play (6 years later, hah!):\nWe played \"nicely\" this game, but there still appears to be a runaway leader problem. Once the momentum is going it seems hard to stop. Upgraded to 5 stars.\n\n3rd play (6 more years later)\nAnother yuck. Dropped back down to 2 stars. Seems way too unbalanced and once one play gets ahead, there is no way to catch up. Bye-bye game.",
    "timestamp": 1689976800
  },
  {
    "username": "Greenflash21",
    "rating": 2.0,
    "comment": "Could not figure out how to play it and just fell flat",
    "timestamp": 1675638000
  },
  {
    "username": "Fencejummper",
    "rating": 2.0,
    "comment": "No decisions and a lot of luck. Takes a mediocre game and makes it worse.",
    "timestamp": 1654380000
  },
  {
    "username": "Wyckyd",
    "rating": 2.0,
    "comment": "Too much of a table hog and rules overhead for the amount of game.",
    "timestamp": 1640127600
  },
  {
    "username": "TheScando",
    "rating": 2.0,
    "comment": "I thought it was okay. I don't really need to try more versions of Catan, but I guess whatever.",
    "timestamp": 1640041200
  },
  {
    "username": "Nodens",
    "rating": 3.0,
    "comment": "I sat across from someone for two hours and never looked at them.",
    "timestamp": 1757887200
  },
  {
    "username": "Deltonbrack",
    "rating": 3.0,
    "comment": "Update: Why?\n\nThis is okay. It's obviously not Catan, but it is a good intro for people not ready for Catan.",
    "timestamp": 1748901600
  },
  {
    "username": "purplecow55",
    "rating": 3.0,
    "comment": "A card based game of catan.",
    "timestamp": 1746655200
  },
  {
    "username": "Bagherra",
    "rating": 3.0,
    "comment": "interesting variation on the theme and mechanics",
    "timestamp": 1745272800
  },
  {
    "username": "Gokkus",
    "rating": 3.0,
    "comment": "The game leaves little room for strategy among the many random elements that quickly outbalance it.",
    "timestamp": 1742857200
  },
  {
    "username": "Duraznito94",
    "rating": 3.0,
    "comment": "Esperaba mas, quedé corto en la expectativas",
    "timestamp": 1741734000
  },
  {
    "username": "GabiGames",
    "rating": 4.0,
    "comment": "Hours of fun in what used to be an excellent 2p game at the time. We enjoyed the development-element in this game. However, does not live up to our gaming standards anymore.\n\n5 euro",
    "timestamp": 1749592800
  },
  {
    "username": "HerrMeyer",
    "rating": 4.0,
    "comment": "Sehr langweilig. Sehr frustrierend.",
    "timestamp": 1736550000
  },
  {
    "username": "trebor61",
    "rating": 4.0,
    "comment": "10 dollars",
    "timestamp": 1731452400
  },
  {
    "username": "WiLLPiTT33",
    "rating": 3.5,
    "comment": "Not my cup of tea. I didn’t finish my game. I felt long and boring. Definitely prefer the table game.",
    "timestamp": 1726524000
  },
  {
    "username": "habanero86",
    "rating": 4.0,
    "comment": "Never played",
    "timestamp": 1722031200
  },
  {
    "username": "Ctrlalt",
    "rating": 4.1,
    "comment": "It turned out to be incredibly bad or boring due to minimal complexity",
    "timestamp": 1719093600
  },
  {
    "username": "Card",
    "rating": 4.5,
    "comment": "[$] Best with 2 (2) 60-120 mins, Age:10, 2.44 [$15] OOP",
    "timestamp": 1756072800
  },
  {
    "username": "MOZGOBOY",
    "rating": 5.0,
    "comment": "На продажу",
    "timestamp": 1755468000
  },
  {
    "username": "GeminiWeb",
    "rating": 5.0,
    "comment": "Okay game that didn't grab me",
    "timestamp": 1754863200
  },
  {
    "username": "Bal_505",
    "rating": 5.0,
    "comment": "I remember playing it a couple times with my dad back in the day. Nothing too special, but I liked the retro look of the card art.",
    "timestamp": 1741820400
  },
  {
    "username": "bigfranco",
    "rating": 5.0,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "Khumbanigash",
    "rating": 5.0,
    "comment": "I remember this game being quite good in the beginning (I even bought some of the expansions). But after a few more plays it became somewhat boring. There is not much interaction. You just build your stuff and then someone wins.",
    "timestamp": 1724104800
  },
  {
    "username": "Ddavebowman",
    "rating": 5.0,
    "comment": "Eladó",
    "timestamp": 1717452000
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "Most likely you'll be thinking if the card game version of Settlers is as good as the board game. Well, I would say the possible strategies and tactics are varied and interesting. Also, the game is slightly less luck driven and has a lot of interesting mechanisms and conflict in between players, but lacks something: The great socialising aspect of the original. This doesn't surprise me at all, as I can't see how a trading game can work with just two players.\n\nGiven that, it's almost impossible to tell if you'll like this one solely based on your feelings towards the original. Both games seem to share a lot: the resources are the same, you still build roads, settlers, cities and all, but all the negotiations and trade are gone. When you are learning to play, you'll find a lot of familiar things, but after several turns you soon discover that it's a different experience.\n\nBut, is it a good game? For me, the answer is yes: the 5 piles from which the buildings are and how all the draws/discards are handled not only is unique, but also reduces luck drastically and opens a lot of strategies. The offensive cards are very nasty and powerful, which shoots the conflict and the \"take that\" feeling a lot. The main flaw is the length: reducing it by 30 minutes would have been great.\n\nAll in all, a good game for two players that is fun and, while not too deep, definitely interesting, but maybe a wee bit too long.\n\nRating: \n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "ReptilianSamurai",
    "rating": 5.0,
    "comment": "A reasonably fun 2-player Catan-style game. Best with expansions. A bit too much heavy and takes too long to play, there are more fun games at this level.",
    "timestamp": 1708902000
  },
  {
    "username": "astrobolism",
    "rating": 5.0,
    "comment": "I like it, but sort of wishing we had the updated version.\n\nUpdate: Not feeling the need for an updated version of this.",
    "timestamp": 1708729200
  },
  {
    "username": "Turbo Pascal",
    "rating": 5.0,
    "comment": "Card game re-implementation of Settlers Of Catan for 2 players. Uses some of the ideas from the original Settlers but this is essentially a unique game. Rotation of the resource cards is a clever mechanic to keep track of collected resources. Played several times over a summer trip in 2004 but haven't revisited since. We found the game ok, but nowhere near as special as Settlers. Game length is also fairly significant for a card game (1-2 hours). Decided to trade - traded along with expansion for \"Tsuro\" at Montreal Mathtrade February 2009.",
    "timestamp": 1707865200
  },
  {
    "username": "Garlance_",
    "rating": 5.0,
    "comment": "Etagère",
    "timestamp": 1707692400
  },
  {
    "username": "MoMahili",
    "rating": 6.0,
    "comment": "Sale",
    "timestamp": 1759874400
  },
  {
    "username": "Pura_Vida",
    "rating": 6.0,
    "comment": "Pretty adequate twoplayer implementation of Catan. I still kinda hate the dice.",
    "timestamp": 1756677600
  },
  {
    "username": "Kaengi",
    "rating": 6.0,
    "comment": "A very interesting take on a 1v1 game in the Catan realm.\n\nI really enjoy that the knights get a lot more personality and utility in this game and that there are also tons of Add-Ons.\n\nBut you really have to play it yourself to get a feeling of whether this is something for you or not.\n\n-> just because you like the normal Catan, does not mean this is the game for you.\n\n\"Nirgends klingeln Kassen süßer\"\n~Handelskontor",
    "timestamp": 1754949600
  },
  {
    "username": "jonnyalpha",
    "rating": 6.0,
    "comment": "Wall Kallax 2B",
    "timestamp": 1751320800
  },
  {
    "username": "AudunAgnar",
    "rating": 6.0,
    "comment": "Played this a lot as a kid. It is fun, and very nostalgic for me. Maybe a bit unbalanced, but fun!",
    "timestamp": 1749765600
  },
  {
    "username": "kyrastormfury",
    "rating": 6.0,
    "comment": "Left at junk trade at April 2025 Montreal math trade.",
    "timestamp": 1745013600
  },
  {
    "username": "pnpbackup",
    "rating": 6.0,
    "comment": "This is another good quite different game from the original and I won my first game!",
    "timestamp": 1738018800
  },
  {
    "username": "vorlayn",
    "rating": 6.0,
    "comment": "m",
    "timestamp": 1736550000
  },
  {
    "username": "EntwistleJohn",
    "rating": 6.0,
    "comment": "Me gusta esta versión de Catán, que solo juego a 2 jugadores. Cambia el juego tradicional por un filler que rellena un cuarto de hora; a veces la bola de nieve es imparable y las mecánicas de negociación se cambian por unas alternativas relativamente resultonas, aunque distintas a las originales. Lo de la carta del destino no me gusta y nunca he llegado a usarla (aunque, como digo, siempre lo he jugado a 2, por lo que tampoco tiene utilidad en mis partidas). Para mí, eso sí, tiene un inmenso valor sentimental que hace que vaya a conservarlo siempre, y que siempre lo mire con cariño.",
    "timestamp": 1733353200
  },
  {
    "username": "Nortelephan",
    "rating": 6.0,
    "comment": "In Seefahrer Box",
    "timestamp": 1728684000
  },
  {
    "username": "fopa",
    "rating": 6.0,
    "comment": "Great game for 2 players!! Engaging and fun which can not be said for a lot of 2 player games. It is true we never play it anymore, because we always prefer to play Summoner Wars...",
    "timestamp": 1726783200
  },
  {
    "username": "hxbx",
    "rating": 6.0,
    "comment": "At least the expansions help the replayability. Too simple for me now.",
    "timestamp": 1725400800
  },
  {
    "username": "J_Clay",
    "rating": 7.0,
    "comment": "2025",
    "timestamp": 1760392800
  },
  {
    "username": "RomanN",
    "rating": 7.0,
    "comment": "Played only one round and enjoyed, happy to explore the game more",
    "timestamp": 1759269600
  },
  {
    "username": "stofke",
    "rating": 7.0,
    "comment": "R003",
    "timestamp": 1758492000
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet, in metalen doos\nEAN 8717249192398\nGL1",
    "timestamp": 1757368800
  },
  {
    "username": "Bragallot",
    "rating": 6.5,
    "comment": "A classic in my collection and my preferred Catan game. Rather random in places but I like how the game moves through different phases of expansion, early engine building and then the final push for victory where attack cards start playing a bigger role.",
    "timestamp": 1757023200
  },
  {
    "username": "Sjeng",
    "rating": 6.5,
    "comment": "New Dutch edition secondhand at Spelfabriek 2025 for €10.",
    "timestamp": 1751407200
  },
  {
    "username": "Math_ijs",
    "rating": 8.0,
    "comment": "Minstens even tof als het originele spel. Is een meer serieus spel voor 2 spelers waar je wel eventjes zoet mee bent. Persoonlijk een van mijn favorieten. De geluksfactor ligt wel erg hoog, met enkele kaarten die een groot negatief effect kunnen hebben.",
    "timestamp": 1760392800
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Two-Player Game\n\nAn interesting variant on the Settlers theme. I find it to be much more satisfying than regular Settlers (which I refuse to play without Cities and Knights). There is still a die rolling factor, but without the bell curve and with each player starting with every resource, it is highly minimized. The deck draw system takes getting used to, but the deck build is interesting enough to make for some good thinking.",
    "timestamp": 1759356000
  },
  {
    "username": "Ternal2",
    "rating": 8.0,
    "comment": "R3",
    "timestamp": 1755727200
  },
  {
    "username": "Gernial",
    "rating": 8.3,
    "comment": "Must have for 2 player game fans. You need Politic&Intrigue and some more expansion to have a really great game of 8.5.\nThis is just a prelude.",
    "timestamp": 1754604000
  },
  {
    "username": "Joka61",
    "rating": 8.0,
    "comment": "KS 1996",
    "timestamp": 1752876000
  },
  {
    "username": "muncleuncle",
    "rating": 8.0,
    "comment": "Only 2 / 60-120 min\n\nIM SAUERLAND",
    "timestamp": 1751580000
  },
  {
    "username": "adamolanna",
    "rating": 9.0,
    "comment": "E' stato a lungo uno dei miei preferiti, ci ho giocato più di 100 volte (e sono tante), poi l'ho regalato e adesso lo ricordo come un gioco che mi ha dato molte ore di divertimento",
    "timestamp": 1755122400
  },
  {
    "username": "tickbite",
    "rating": 9.0,
    "comment": "Best thing: for once this is a decent and challenging game for two! I actually enjoy this a lot more than the Settlers boardgame, mainly because it eliminates the tedious and endless trade discussions among players. Also, the knights are a lot more interesting than they were in the original.",
    "timestamp": 1734476400
  },
  {
    "username": "PoeppelRudi",
    "rating": 9.0,
    "comment": "Players: 2",
    "timestamp": 1726956000
  },
  {
    "username": "Vitamine_jeu",
    "rating": 9.0,
    "comment": "Je me demande parfois si je ne préfère pas cette version avec cartes!",
    "timestamp": 1713909600
  },
  {
    "username": "LifeSiphon",
    "rating": 8.5,
    "comment": "This was a brilliant re-implementation of the board game for just 2 players. It maintains the essence of the original while improving upon depth and reducing the luck factor. It mostly does away with trading, but has other mechanics which allow you to build out your tableau.",
    "timestamp": 1711580400
  },
  {
    "username": "Magagpa",
    "rating": 9.0,
    "comment": "In den 90ern und frühen 2000ern eindeutiges Lieblingsspiel. Mit Erweiterungen deutlich aufgewertet!",
    "timestamp": 1692223200
  },
  {
    "username": "EllenCaroline",
    "rating": 10.0,
    "comment": "To me this is nothing like regular Catan with the exception of using the same resources. I dislike the mechanisms of regular Catan, but I love the methods used in this game to gain and spend resources. I think the variety of cards is very good.",
    "timestamp": 1735599600
  },
  {
    "username": "Cyranodejavier",
    "rating": 10.0,
    "comment": "Genial!! Supera al Catan tradicional aunque no su fetichismo en tablero y piezas pero le añade una gran cantidad de cartas de acción y de edificios que le dan un dinamismo grandísimo.",
    "timestamp": 1724364000
  },
  {
    "username": "Raaph",
    "rating": 10.0,
    "comment": "First game ever, my fav",
    "timestamp": 1704322800
  },
  {
    "username": "mesh242",
    "rating": 10.0,
    "comment": "Ich liebe dieses Spiel! Es gefällt mir wesentlich besser, als das Standard-Brettspiel. Auch wenn meine Ausgabe schon in die Jahre gekommen ist. Ich muss es eindeutig öfter auf den Tisch bekommen!",
    "timestamp": 1683928800
  },
  {
    "username": "Pentelitha",
    "rating": 10.0,
    "comment": "4/4/2023: I had never rated this before and today in memory of Klaus Teuber I’m compelled to do so. I love this game and played so much of it in the past. It’s been a while since but in my mind it’s always been a ten! This game has influenced how uplifted I feel about games in general. Thinking of it always makes me smile. To the point that I’ve given copies to others just to spread its goodness and I’ve always bought a new copy for myself. I now own the 2016 version Rivals for Catan.\nRest in Peace Mr. Teuber.",
    "timestamp": 1680645600
  },
  {
    "username": "Christine Biancheria",
    "rating": 10.0,
    "comment": "This is a great 2-player although after time, you do need the expansions to avoid getting stuck in a strategy rut.",
    "timestamp": 1677798000
  }
]