[
  {
    "username": "berniethered",
    "rating": 1.0,
    "comment": "too frenetic, leaving me feeling like I can't control my fate well enough,\n\nAnd the El Grande is the biggest waste of a game component.",
    "timestamp": 1757196000
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Bounced off this one, hard. Just too much chaos for me to enjoy. For something similar with a little more excitement and shorter play time, look at Condottiere.\n– For a cube pusher the tempo is slow with lots of downtime. There is the understanding the cards stage, figuring out how the cards intersect with the board state, then blind bidding for turn order, then action phase. Repeat, repeat. A 5p 3 hour game of this would be torture.\n– Kingmaking is huge in this game. Unless everyone is playing to some sort of agreed code and has some game skill.\n– Hidden trackable information. Not a problem for me but some players hate this.\n– Super tactical game and there will be a lot of bash the leader, given it is not always obvious who is in front this leads back to king making and a general feeling of total chaos.",
    "timestamp": 1736031600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Was way more abstract than all the hype led me to believe. There's a lot of chaos, but it feels like most of that is injected by the special cards, rather than the system itself.",
    "timestamp": 1726264800
  },
  {
    "username": "roninjotatan",
    "rating": 1.0,
    "comment": "Terrible game",
    "timestamp": 1720389600
  },
  {
    "username": "Despermado",
    "rating": 1.0,
    "comment": "Too old. Don't believe everyone who says that it still relevant.",
    "timestamp": 1663538400
  },
  {
    "username": "eagerbeaver",
    "rating": 1.0,
    "comment": "Did nothing for me. There are some interesting mechanisms but overall, this game just wasn't stimulating enough. It is probably between a 2 and 3 for me; but I need to account for the hype before playing the game, and the disappointment that followed upon playing it.\n\nIt felt monotonous, definitely has issues with kingmaking, and suffers from too much downtime. HBTI serves as the icing on the cake. Definition of obsolescence. There were times during the game where I would have rather watched grass grow; far more interesting.\n\nThere's 3 hours I'm never getting back.",
    "timestamp": 1605999600
  },
  {
    "username": "SCOBYBryant",
    "rating": 1.0,
    "comment": "{ P - 2 3 [4] 5 }\n[CK]\n\nArea control is a mechanic that appeals to me when I play games like Louis XIV, Struggle of Empires, and Age of Empires III. However, those games involve the development of infrastructure or additional mechanics like worker placement; by comparison, El Grande is an exercise in pure tactical area control. What I find occurs in such games is that players place their influence or use screw-your-neighbor opportunities to keep everyone else in check and the guy picked on least by his opponents will win.\n\nAfter a few scorings someone is out in front, and players must bash the leader because if unhindered he will maintain first place and ultimately win. Put another way, when a player gets an opportunity that scores him extra points, in all likelihood the action is actually worthless because he will lose points later that he otherwise would have scored because his opponents are obligated to target him. If this process is performed effectively, players' scores will remain within a small range, and big plays around the third scoring will decide the game.\n\nEl Grande's excessively tactical nature has other issues. The value of a Mobile Scoring tile varies wildly depending on whether the other two copies of it are lurking right below. A typical plan to drop '13' and have the last word on the King's whereabouts can be arbitrarily thwarted by Royal Advisor. Decay of Authority is extremely nasty and fear of the card nullifies an actual strategy like playing 1-3 within the first half of the game to enable 10-13 for the second half. Turn order introduces problems as well; many turns nobody selects the 1-stack, screw-your-neighbor actions because of the restriction on piece placement but when a player is dropping '1' this turn no matter what to prepare for next turn's pre-scoring '13' he'll often be stuck picking between the 1-stack or some crappy 2-stack card so he'll take the screw-your-neighbor - a completely situational shaft if you happen to be that neighbor encroaching on what he considers his turf.",
    "timestamp": 1581462000
  },
  {
    "username": "Frozen Flesh",
    "rating": 1.0,
    "comment": "I came here, because of all the people rating games like KD:M or Hate with a 1, just because of their mature theme.\nI’m offended by how boring the theme of this game is!",
    "timestamp": 1547074800
  },
  {
    "username": "SandorClegane",
    "rating": 1.0,
    "comment": "King of kingmakers... worst game I've ever played",
    "timestamp": 1363993200
  },
  {
    "username": "Plaks",
    "rating": 1.0,
    "comment": "I feel only one thing while playing this game: hatred\n...towards the game.\n\nI hate the downtime, when you have to wait scratching your hair, unable to plan anything because the other players' choices will affect you so greatly.\nThe game art looks rather depressing and just guess who had to sit behind of THE GREAT CASTILLO (or what was its name..) trying to see the game board over it.\nAnd that Castillo scoring? Idiotic factor, bad idea forged into a worthless game component.\n\nA game totally worth its rating! I won't give 1 since I'm pretty hopeful that there is something worse than this game.\n\nEdit: Nothing worse found after over 300 different games played. This is an achievement of a sort.",
    "timestamp": 1235257200
  },
  {
    "username": "Simon Mueller",
    "rating": 1.0,
    "comment": "I know I played this game, but I don't remember anything about it.",
    "timestamp": 1197241200
  },
  {
    "username": "khepriq",
    "rating": 2.0,
    "comment": "Flimsy box. Patent pending Hans im Glück meeple™ are hard to count vs cubes. Or maybe because of the map region colors, idk",
    "timestamp": 1752530400
  },
  {
    "username": "hiimjosh",
    "rating": 2.0,
    "comment": "I hate El Grande. It's long, it's slow, you have to get up to read the cards every round, it's chaotic, it's got a lot of multiplayer targeted attacking, but it's too opaque to even really grok how to to target properly. No thanks.",
    "timestamp": 1748728800
  },
  {
    "username": "Yriel",
    "rating": 2.0,
    "comment": "I totally dislike my game. It's old fashionned and relatively borring in my opinion. Strongly dependent of luck.",
    "timestamp": 1680645600
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "-WEG\n60–120 Min 2–5 Players p2 p3 p4 p5 Weight: 3.05 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "billy_baroo",
    "rating": 2.0,
    "comment": "I am incompatible with this game",
    "timestamp": 1470952800
  },
  {
    "username": "imoo",
    "rating": 2.0,
    "comment": "邦題：　エルグランデ",
    "timestamp": 1447369200
  },
  {
    "username": "Aroquesada",
    "rating": 2.0,
    "comment": "Varias partidas no registradas.\n\nEs el juego de mayorías por excelencia, pero si no te gustan los juegos de mayorías, como a mí, entonces el juego no te gustará...\nLa edición decenial tiene muchos añadidos para poner o quitar a gusto del jugador. Unos funcionan bien, pero otros empeoran el juego original.",
    "timestamp": 1381528800
  },
  {
    "username": "jayjon",
    "rating": 2.0,
    "comment": "yuck",
    "timestamp": 1366236000
  },
  {
    "username": "Bownage",
    "rating": 2.0,
    "comment": "\"ya know son, I was playin this when you was still poopin ya pants!\" That's probably the only reason this heap of junk is rated that highly. Like Settlers, it might have been good \"back in the day\", but not any longer. Unlike Settlers, I will never play this game again. This is not a strategy game. I HATE the pretense! It's just a little tactics and lots of semi-random take-that screwage.",
    "timestamp": 1330297200
  },
  {
    "username": "johker49",
    "rating": 2.0,
    "comment": "Tried it for some time, but returned it to shop.\nCouldn't understand the charm of it.",
    "timestamp": 1320620400
  },
  {
    "username": "mrivera",
    "rating": 2.0,
    "comment": "One play was way more than enough for me. As bad as Puerto Rico, Hansa Teutonica, et al. Classic example with what is wrong with so many Euros. Why do Euro designers feel that dry, abstract mechanics, analysis paralysis and pasted on theme make a fun game. Throw in that once you fall behind, you are essentially out of the game. THIS IS NOT FUN AT ALL! Attention Euro designers, games are meant to be fun, not just interesting. Games like these will always be inaccessible and prevent our hobby from growing.",
    "timestamp": 1297897200
  },
  {
    "username": "Ephorus",
    "rating": 3.0,
    "comment": "What I like:\n- One of the first area majority games.\n- Castillo offers a nice element of surprise.\n\nWhat I dislike:\n- Too chaotic, too long, too much down time without anything to think about since the board state will usually change so much. This is mainly due to the special action cards that add lots of randomness and are very tactical.",
    "timestamp": 1758232800
  },
  {
    "username": "oursino",
    "rating": 3.0,
    "comment": "J'ai dû passer à côté de quelque chose là. Les cartes tirées apportent un hasard difficile à gérer.",
    "timestamp": 1744840800
  },
  {
    "username": "SgtTackleberry",
    "rating": 3.0,
    "comment": "Majority control game. Old design that does the trick but honestly board games evolved a lot. We played Nanty Narking after this one and it has more juice to squizee and it is more thematic.",
    "timestamp": 1738191600
  },
  {
    "username": "opinicus",
    "rating": 3.0,
    "comment": "More effort than it is fun, plus I found the cards to be lacking. Will never play again.",
    "timestamp": 1723500000
  },
  {
    "username": "JessicaSquirrel",
    "rating": 3.0,
    "comment": "Not a fan. Players choose from 5 rows of cards that have a very limited variety. Turn based game with meeples. Always choose Castillo.\nDo not want to play again.",
    "timestamp": 1717192800
  },
  {
    "username": "purplecow55",
    "rating": 3.0,
    "comment": "Euro with area control.",
    "timestamp": 1712872800
  },
  {
    "username": "English Teechur",
    "rating": 3.0,
    "comment": "Too much chaos and runaway leader issue. Not fun.",
    "timestamp": 1711580400
  },
  {
    "username": "Dan61",
    "rating": 3.0,
    "comment": "Played on BGA and with Kaj in KGA",
    "timestamp": 1705273200
  },
  {
    "username": "gamer-stu",
    "rating": 3.0,
    "comment": "A game of cube shuffling that is very disconnected from its theme. I normally don't mind chaos, \"take that\", area majority, tactics vs strategy, and king making... but all of those aspects combined with a very light theme and really no other way to score points hurts my opinion of this game. Way too long for the pain.",
    "timestamp": 1677279600
  },
  {
    "username": "UragGroShub",
    "rating": 3.0,
    "comment": "I just don't fucking get it. Almost completely random bullshit.",
    "timestamp": 1646780400
  },
  {
    "username": "savedbygrace1521",
    "rating": 3.0,
    "comment": "boring area control",
    "timestamp": 1645138800
  },
  {
    "username": "dj_koen",
    "rating": 4.0,
    "comment": "This game is simple to a fault but otherwise not bad",
    "timestamp": 1759528800
  },
  {
    "username": "EllenCaroline",
    "rating": 4.0,
    "comment": "used to own",
    "timestamp": 1750802400
  },
  {
    "username": "NotThatSalem",
    "rating": 4.0,
    "comment": "Frankly, I don't get the love. It's a mean game of fairly simple area control. There are also some annoying memory elements. Not my cup of tea at all. And I did win the one time I played.?",
    "timestamp": 1749592800
  },
  {
    "username": "Ginewra",
    "rating": 4.3,
    "comment": "bga",
    "timestamp": 1739055600
  },
  {
    "username": "johnclark",
    "rating": 4.0,
    "comment": "Of you love pure area-majority games then this is for you. I don't like pure area-majority games but this is about as good as it gets. Like all such games, massively prone to AP but I'm doubtful how much control you really have.",
    "timestamp": 1738364400
  },
  {
    "username": "sgosaric",
    "rating": 3.5,
    "comment": "Time to revisit the comment.\n\nOr why I like area majority, but not El Grande.\n\nBasically - everything El Grande does wrong, CitoW does right.\n1. No idiotic turn order auction. Seems like a thing that was antiquated in 1995. Plus the whole units to court to board nonsense. Ugh. CitoW corrects this by Khorne goes first because He Is The Blood God, now shutup! Dominant Species corrects this by - worker placement space for becoming first player.\n2. Adjacency matters in CitoW - you can move to areas next to your areas. In 16th century Spain however cabelleros can teleport all over the map, but only in areas next to king, but not where the king which represents historic situation of who the hell knows.\n3. 16th c. Ibiza paratroopers. Huh?\n4. The action cards - no theme to it, so you have to memorise them. Also their effect are tactical and unpredictable, so there's lots of AP and downtime. CitoW and DS solved this more elegantly (in Citow each god has their own deck and a hand of cards, DS - bidding for cards is part of a long phase so the card effects can be mitigated).\n\nLater Kramers are better as well - Mexica and Torres - No turn order nonsense, cards in Torres are simpler and the spacial relations make much more sense making the whole thing is more intuitive to grasp.",
    "timestamp": 1728424800
  },
  {
    "username": "Maglinkinpark",
    "rating": 4.0,
    "comment": "Feels like it..\n\nA) Overstays its welcome\n\nB) Just isn't that interesting from turn to turn.. and..\n\nC) Is too chaotic from round to round to really have much of a strategy.",
    "timestamp": 1711234800
  },
  {
    "username": "bainewedlock",
    "rating": 4.0,
    "comment": "Rating 4 = To someone with a simliar taste like me: Play this game if you don't have anything else to do.\n\nNot bad but the artwork did not age well.",
    "timestamp": 1703545200
  },
  {
    "username": "chicagometh",
    "rating": 3.8,
    "comment": "Hmmm...let's see...is it the cube pushing that I hate? Or is it the expansion of 1 pissing contest into 12 pissing contests? Or is it the bash-the-leader that ires me? Or perhaps it is the droll card auction mechanic? Or maybe it is the 100% tactical gameplay? I just can't decide which part of this turd is brownest...it is very brown though. The cubes are bright colors. I think that must be what draws people to it. It plays like a game for people with no memory or attention span. Each round would be exactly the same if you just randomly set it up and asked each player to evaluate the game state and make the least sub-optimal choice. So this is fun then? Look at me, I'm having fun...",
    "timestamp": 1703113200
  },
  {
    "username": "Thies",
    "rating": 4.0,
    "comment": "Didn't like this -- just wasn't very much fun. Don't know why this is called a strategy game. Due to the amount of chaos/changes that go on between turns, this is entirely a tactical exercise with little ability to make and carry out long term plans. On top of that, it is slow to play with lots of downtime as others ponder their changed situations. I'm willing to give it another try before writing it off completely, but I'm very skeptical that my rating will improve.",
    "timestamp": 1700262000
  },
  {
    "username": "Yokiboy",
    "rating": 4.0,
    "comment": "I finally played this after it being in my collection for six years, and loved the very tough decisions you faced each turn. This is a very good area control game.",
    "timestamp": 1698706800
  },
  {
    "username": "ethanbg20",
    "rating": 4.8,
    "comment": "It was okay - maybe i'd enjoy it more in more playthroughs.",
    "timestamp": 1760306400
  },
  {
    "username": "Piranhaswarm",
    "rating": 5.0,
    "comment": "Old, Not Gold. Mechanic wise its a 10, but when u play it you dont feel very much, except its dryness, because it is. So its a Game you could play, and you wont waste your time, but even smaller games let me feel more excitement than this, so i wouldnt recommend it. A Game which reminds me and is quite similar is Mission: Red Planet, which has the little Extra´s to be really intresting, so i would highly recommend playing this instead.",
    "timestamp": 1758578400
  },
  {
    "username": "Nodens",
    "rating": 5.0,
    "comment": "Classic family game. Stop counting the cubes, dad!",
    "timestamp": 1757023200
  },
  {
    "username": "DiceMind",
    "rating": 5.0,
    "comment": "Only played online (BGA, App, etc)",
    "timestamp": 1755813600
  },
  {
    "username": "Anconed",
    "rating": 4.6,
    "comment": "Best: 5 Players",
    "timestamp": 1753567200
  },
  {
    "username": "SkyGlad",
    "rating": 4.5,
    "comment": "Action cards have the potential to be crazy powerful. Makes this feel a little like area majorities with a significant lean in the direction of crazy card powers. It’s fine, can certainly be dramatic near the top. Definitely possible to be out of contention by the end of the first scoring on the bottom end, though. I can think of plenty of area majority games I’d rather play. The final three rounds have so many cubes on the board and such potential for huge swings with the action cards that there is a serious potential for AP to really bog this down.",
    "timestamp": 1752184800
  },
  {
    "username": "Roozbeh17sep1989",
    "rating": 5.0,
    "comment": "2025/06/27\n337",
    "timestamp": 1751061600
  },
  {
    "username": "gram_niebieskim",
    "rating": 5.0,
    "comment": "My BGG:\n10 - excellent game, always have a great time\n7 - enjoyable game, I'm willing to play again\n5 - not bad but it's not my cup of tea\n2 - won't play ever again",
    "timestamp": 1743717600
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "Pardon me, but your area majority is showing.",
    "timestamp": 1736982000
  },
  {
    "username": "NMR_NMR",
    "rating": 5.0,
    "comment": "2x BGA",
    "timestamp": 1733266800
  },
  {
    "username": "MMPeuchen",
    "rating": 5.0,
    "comment": "Nope, nope, nope",
    "timestamp": 1733094000
  },
  {
    "username": "BoltKey",
    "rating": 5.0,
    "comment": "Didn't really like it. Not a fan of area coverage in general, and this was not different. Really hard to see through the effects, and plan for future.",
    "timestamp": 1728684000
  },
  {
    "username": "SenorBivins",
    "rating": 5.0,
    "comment": "Big Box",
    "timestamp": 1727128800
  },
  {
    "username": "flutegirl",
    "rating": 5.0,
    "comment": "Area control is not my thing, and this game reminds me of that fact.",
    "timestamp": 1727042400
  },
  {
    "username": "beaslera",
    "rating": 5.0,
    "comment": "Revised in 2023: It's fine, but not deep enough or special enough to play.\nVery easy to explain/learn. Great replayability. Up to 5 players, but with 5 it's too chaotic for my tastes. Lots of strategy and tactics. Each decision has significant effects. No broken rules. I'm not sure I can come up with anything I don't like about this game except the short version feels too short and it's too long with 5 players.",
    "timestamp": 1712613600
  },
  {
    "username": "WillBePlayin",
    "rating": 5.0,
    "comment": "Yikes. I do appreciate it for the fact it's from 1995, but other than that, it's not a particularly great game. There's been quite a few area control games that I like more. It's also just a tad too long for what it is.\n\nHow on earth does this have a 3.0 weight rating is beyond me.",
    "timestamp": 1710284400
  },
  {
    "username": "rayzg",
    "rating": 5.0,
    "comment": "2024-02-17. Second time playing this after about 12 years!\n\nNot my style of game. I'm not a fan of drafting actions not area majority. And I find the game moves too slowly, especially because of the phase where players determine turn order.",
    "timestamp": 1708210800
  },
  {
    "username": "CharlyMorgoth",
    "rating": 4.8,
    "comment": "I acknowledge it’s a great game, sharp and innovative. But simply I do not like majority games, it is so unpredictable and out of control",
    "timestamp": 1705705200
  },
  {
    "username": "Captain883",
    "rating": 5.0,
    "comment": "Needs three players to be effective. Otherwise is like monopoly on steroids",
    "timestamp": 1703718000
  },
  {
    "username": "zigmoose",
    "rating": 5.0,
    "comment": "Too chaotic, didn't feel like there was adequate room for longer term planning. Would like to try König & Intrigant.",
    "timestamp": 1700434800
  },
  {
    "username": "sh4mike",
    "rating": 5.0,
    "comment": "Disliked the 3-time scoring mechanic, I prefer instantaneous or end-game scoring to avoid the feeling of repetitive loops.",
    "timestamp": 1699916400
  },
  {
    "username": "Nathardicus",
    "rating": 5.0,
    "comment": "I feel too restricted playing this game. Not a big fan of this and would rather play many different area control games instead.",
    "timestamp": 1658872800
  },
  {
    "username": "rharn",
    "rating": 6.0,
    "comment": "It's been outclassed by simpler and snappier area majority games like Sardegna and Rumble Nation.",
    "timestamp": 1760479200
  },
  {
    "username": "Auroric",
    "rating": 6.0,
    "comment": "Tactical area control, with a high skill ceiling and bland production.\n\nI love area control, and I see why this is such a classic. It's swingy, tactical, and rewards repeated plays. I love how interactive it is, and the card play is different and interesting. The tower being hidden is silly, it just adds a memory/info tracking element for no good reason.\n\nUltimately i find it pretty dry and unexciting, but I can see that there's a good game here. Wouldn't choose it over other titles, but wouldn't be particularly opposed to playing it.",
    "timestamp": 1760392800
  },
  {
    "username": "Mr Mjeh",
    "rating": 5.5,
    "comment": "Fun game that is intriguing each time around.\n\nUpdate: pretty boring area control game that is no longer anything special. Poor score track without Numbering.",
    "timestamp": 1760220000
  },
  {
    "username": "smurfodeth",
    "rating": 6.0,
    "comment": "Great, classic area majority game, although I’m less inclined to invest the time in it these days.",
    "timestamp": 1760220000
  },
  {
    "username": "tomdabom98",
    "rating": 6.4,
    "comment": "Would basically only play this game asynchronous on bga. There isnt enough decision space to make me feel like i have much agency over the outcome of the game. The king action in 5 players is usually the best option and as a result pretty OP. It is a good game, but i don't feel that the decision space to the amount of time the game takes is worth it as far as owning the material game and playing in person.\n\n\nUpdate 10/5/2025\nI played this game once and honestly want to give it a go again. The first play did feel pretty lackluster however, I only played it once and I think there may be a bit more strategy here than I initially thought, but i am expecting a pretty chaotic game. Maybe if it played in an hour I would be down to keep it around, but our first game took like two hours which was too long for how chaotic this is.",
    "timestamp": 1759615200
  },
  {
    "username": "MorelliBuendia",
    "rating": 6.0,
    "comment": "Good area majority game, but dry and ugly as hell. Very chaotic and I'm not crazy about the HTI bit of the castle. I would like to revisit it and give it another try though, since my tastes have changed a lot and I think I would enjoy it more nowadays, so take my rating with a grain of salt.\n\nMogul Scale: 2/C.",
    "timestamp": 1759528800
  },
  {
    "username": "Noboe",
    "rating": 6.0,
    "comment": "Very old school area control game.",
    "timestamp": 1759356000
  },
  {
    "username": "cantbelikewater",
    "rating": 6.0,
    "comment": "Players try to score points by having the most workers on different areas on the map. However workers can only be deployed adjacent to the king (not in the same region as the king). Players can also put workers in the castle, which gets opened at the end of a round and deployed to a certain region (only the player with the most workers deploys those units). At the start of each round players take turns selecting powerful actions such as moving the king, changing the points scored on each region\n\n\nMust be played at 5 according to the review",
    "timestamp": 1756677600
  },
  {
    "username": "paulastoria",
    "rating": 6.0,
    "comment": "Ok",
    "timestamp": 1755554400
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "bga win",
    "timestamp": 1754085600
  },
  {
    "username": "whatsabandicoot",
    "rating": 6.0,
    "comment": "A classic for good reason. Recent games have felt a little flat, however.\n\nParticular kudos to the recent reprint - being excellent in terms of quality and aesthetics, while also being responsibly produced. An exemplary example of how to do it by Hans im Glück.",
    "timestamp": 1753308000
  },
  {
    "username": "Joka61",
    "rating": 6.0,
    "comment": "BR 1995",
    "timestamp": 1752876000
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "The players’ actions lack any meaningful connection to the setting or narrative. The core concept or story that underpins the gaming experience is weak. The game’s mechanisms and rules are disconnected from the setting or theme. In other words, the game feels out of sync and neither cohesive nor immersive.\n\nAdditionally, the flow of the game is somewhat clumsy, with elements that don’t quite fit together. The concept of auctions for turn order, the division of the three game zones—province, court, and map—the restrictions on placing and moving the caballeros, and the fact that successful play depends on memorizing the different card decks are all examples of how the game feels a bit disjointed.\n\nIt also perplexes me that there still isn't a proper edition of this classic. The old edition looks like cauliflower, and the latest version is a pastel-colored disaster. While I can tolerate the meeples, even if their shape offers no clear advantage over cubes, the map’s colors are a different matter. They are overly bold and, in some cases, even match the player colors, making it difficult to distinguish the pieces: green figures on a green background, red figures on a red background, and so on. It feels as though the map was designed based on market research by an AI with no real understanding of board game design.\n\nWhat sets it apart is its accessibility and the high level of player interaction. El Grande has a distinct advantage in that it’s easy to pick up and play, it’s relatively straightforward with clear goals — which I also find increasingly valuable as time goes on.",
    "timestamp": 1752530400
  },
  {
    "username": "Weirdsalmon",
    "rating": 6.0,
    "comment": "6/10: dudes on a map, pretty pure area control game. Draft from a set of cards(there needs to be more options for me to play this more than 5 times without becoming bored.).\n\nI really enjoy the keep (?) mechanic of dropping guys in and being able to deploy them at the end. I’m truly terrible at predicting what people are going to do but it’s fun!\n\nIm no good at these and they often create an intensity that is simply too much for me. I don’t like how these games make me feel.\n\nBut with the right group, knowing it’s gonna push me, I can enjoy this and make sillier moves while still trying to win.",
    "timestamp": 1751925600
  },
  {
    "username": "arubioh",
    "rating": 6.0,
    "comment": "El Grande takes a simple core mechanic and puts it in medieval Spain, though the theme and aesthetic are somewhat bland.\nThe game presents you with interesting trade-offs in terms of acting earlier or later in the round, and which regions you want to compete for. Unfortunately, the action cards you are choosing from are often uninspiring... The king-moving card brings a lot of game, but a lot of other cards just fall short, including a lot of duplicates. In the version I've played, the text on some cards is actually incomplete, and you have to look for the full text in the rules.\nTo conclude, El Grande is a game I can have fun playing, but it's not one I'll be suggesting to bring to the table.",
    "timestamp": 1746568800
  },
  {
    "username": "kareds",
    "rating": 6.0,
    "comment": "There is a lot I like about El Grande. The turn order bid is wonderful, as is the variety of effects that will turn up. It's a very economical design that explores its few mechanisms fully without becoming overbearing or cumbersome.\n\nDespite all of that, I just do not find the gameplay compelling enough to make up for the near absence of narrative or humor. Creativity and self expression are punished, and the game starts to give the familiar euro experience of trying to do the same thing as everyone else, but better. I simply do not find these sorts of games interesting.\n\nFor a hot take: this would be better with player elimination, such as in Age of Steam or Ankh.",
    "timestamp": 1745272800
  },
  {
    "username": "TForever",
    "rating": 6.0,
    "comment": "Good for it's time, but I consider it to have player rubber banding, 'cause the last player just takes the least popular turn, which is still good. There's only 5 cards you can select each turn. So it's like a pathway game.",
    "timestamp": 1744408800
  },
  {
    "username": "topher2u2",
    "rating": 6.0,
    "comment": "This game needs more players than we can bring to the table. It's just not great at two.",
    "timestamp": 1743804000
  },
  {
    "username": "wanne",
    "rating": 6.0,
    "comment": "bei Frank gespielt",
    "timestamp": 1743544800
  },
  {
    "username": "Aleogod",
    "rating": 6.0,
    "comment": "—> El Grande 2.0",
    "timestamp": 1743202800
  },
  {
    "username": "Krevillen",
    "rating": 6.0,
    "comment": "Want to Play.\n\nBGA.",
    "timestamp": 1742598000
  },
  {
    "username": "Magneton",
    "rating": 5.5,
    "comment": "We played only the 2 player version, so it has a LOT of potential to get a higher score.",
    "timestamp": 1741734000
  },
  {
    "username": "DSC14",
    "rating": 7.0,
    "comment": "Classic area/majority control game with interesting action selection mechanism.",
    "timestamp": 1761047940
  },
  {
    "username": "RaffertyA",
    "rating": 7.0,
    "comment": "Excellent game that's easy to play but with shifting fortunes and lots of opportunities for strategic bidding. Catching a clear leader is very difficult unless ALL players see the need to slow him down.\n\nUpdate: Disgusting game to play when the leader isn't being slowed (unless you are the leader).\n\nSome of the cards are potentially very unbalancing, may cause a drop to a 6.\n\nI wish I played better...\n\n(Only a 7 with 3 players)",
    "timestamp": 1760738400
  },
  {
    "username": "Tobias_H",
    "rating": 7.0,
    "comment": "wird online gespielt",
    "timestamp": 1759788000
  },
  {
    "username": "kReal92",
    "rating": 7.0,
    "comment": "Sleeved\nStart Player Marker missing\n//\nOld but gold.",
    "timestamp": 1758492000
  },
  {
    "username": "mkchu243",
    "rating": 7.0,
    "comment": "Pretty fun and easy to learn and still has meaningful choices.",
    "timestamp": 1758405600
  },
  {
    "username": "Jesse Terrell",
    "rating": 6.9,
    "comment": "7.0/ (bga.)",
    "timestamp": 1757368800
  },
  {
    "username": "Sondari_Wobble",
    "rating": 7.0,
    "comment": "2-5 spillere",
    "timestamp": 1756504800
  },
  {
    "username": "Peekstrom",
    "rating": 7.0,
    "comment": "Old, easy to play, high player interaction.",
    "timestamp": 1755554400
  },
  {
    "username": "gamerdoge",
    "rating": 7.0,
    "comment": "prefer the old version than the new version",
    "timestamp": 1755295200
  },
  {
    "username": "StefanieB",
    "rating": 7.0,
    "comment": "Schrank",
    "timestamp": 1755295200
  },
  {
    "username": "ItsMagic",
    "rating": 7.3,
    "comment": "look El Grande Big Box",
    "timestamp": 1755208800
  },
  {
    "username": "Chris Barnard",
    "rating": 8.0,
    "comment": "Easy to learn (from sample game card supplied) or to teach. Quality components. I'd bought other euros before this one but El Grande bowled me over with its clever and original mechanics and beautiful board.\n\nA pity it's now only available in \"Big Box\" format with six unwanted expansions and an £80 price tag! What a rip-off! I much prefer the earlier edition as I only want to play the base game and I usually play brown and that colour has been replaced by shocking pink in the new edition.",
    "timestamp": 1760824800
  },
  {
    "username": "bamftw",
    "rating": 8.0,
    "comment": "Remade into P&P: Netstorm\n\n#5p",
    "timestamp": 1760565600
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "Solo: https://boardgamegeek.com/thread/480466/soloplay-variant-el-...",
    "timestamp": 1759960800
  },
  {
    "username": "tatooinehermit",
    "rating": 7.5,
    "comment": "A very fun and approachable area control game. I love how the fight for space unfolds as a battle of wits and mind games between players.",
    "timestamp": 1759442400
  },
  {
    "username": "destro",
    "rating": 8.0,
    "comment": "s",
    "timestamp": 1759096800
  },
  {
    "username": "ivanelfaker",
    "rating": 8.0,
    "comment": "Juego de dominación y mayoría, fue una partida a 4 y la gracia del castillo le da una tensión adicional, normas facilitas y picón.",
    "timestamp": 1758837600
  },
  {
    "username": "canemarrone",
    "rating": 7.5,
    "comment": "Played once (5p) with a mix of gamers and non-gamers. Seemed difficult to understand and enjoy for the inexperienced players.\nI was ahead of everyone's else for most of the time but nobody tried to undermine my position. It's not a casual game, it demands a certain focus and commitment. The player in the last position felt bad.\n\nThe cards are small and difficult to see if you're sitting far. The fact they change every turn slows down the game quite a bit until you roughly remember the effects.\n\nI see a lot of potential for fun but I'm still trying to understand if I enjoy it. I need to play it again at least a couple of times. Maybe it's too serious and confrontational.",
    "timestamp": 1758664800
  },
  {
    "username": "Mentatgamer",
    "rating": 7.5,
    "comment": "Area majority with fantastic auction mechanic.",
    "timestamp": 1758492000
  },
  {
    "username": "FiveEels",
    "rating": 8.0,
    "comment": "Very good game. Would like to play it more, especially with people who know the game well.",
    "timestamp": 1758492000
  },
  {
    "username": "Jediskills",
    "rating": 8.0,
    "comment": "It’s easy to see why this game is a classic area majority game. It’s easy to teach but the mechanism are solid. Good player interaction, replay value and just a fun game!\n\nUpdate: After many years and games later, I recently bought the new edition. Tried it with my newer gaming group and they really liked it. It’s one that will stay relevant decades from now and will keep in my collection. The nicer map gives it a fresher and modern look.",
    "timestamp": 1758146400
  },
  {
    "username": "TowersAlez",
    "rating": 8.0,
    "comment": "Pueblo",
    "timestamp": 1758060000
  },
  {
    "username": "ismailegler",
    "rating": 9.2,
    "comment": "great game in all aspects",
    "timestamp": 1760911200
  },
  {
    "username": "blaice",
    "rating": 9.0,
    "comment": "#15\n\nThis game is avant-garde.\n\nZ-Man Games / Big Box Edition (2015)\n+ Grand Inquisitor and Colonies (1997)\n+ Intrigue and the King (1997)\n+ Intrigue and the King: Special Cards (1997)\n+ Intrigue and the King: Players' Edition (1998)\n+ Grandissimo (2000)",
    "timestamp": 1760652000
  },
  {
    "username": "strongbadia",
    "rating": 9.0,
    "comment": "X",
    "timestamp": 1760565600
  },
  {
    "username": "Wrecktangled",
    "rating": 9.0,
    "comment": "I love area control games and this one does it so well. The airdropping your cubes into an area before scoring from the Castillo is pure fun. Surprisingly simple game for what it offers. I look forward to every chance I get to play this game.",
    "timestamp": 1760479200
  },
  {
    "username": "ShiannLin",
    "rating": 9.0,
    "comment": "1996 Spiel des Jahres Winner",
    "timestamp": 1759788000
  },
  {
    "username": "hockeyjones",
    "rating": 8.9,
    "comment": "64\n\nPlayed in 2024",
    "timestamp": 1759615200
  },
  {
    "username": "toarukun",
    "rating": 9.0,
    "comment": "Great area control, a lot of interactions. Simple-ish rules. Calculation and guessing! Up to 5!!",
    "timestamp": 1759442400
  },
  {
    "username": "Harley57",
    "rating": 9.0,
    "comment": "Big Box Version",
    "timestamp": 1759442400
  },
  {
    "username": "blake33",
    "rating": 8.9,
    "comment": "Very solid guys night game",
    "timestamp": 1759269600
  },
  {
    "username": "viridon",
    "rating": 9.0,
    "comment": "+ Clean, simple art\n+ Tight area control and negotiation\n+/- Mean",
    "timestamp": 1759183200
  },
  {
    "username": "TheKilljoy",
    "rating": 9.0,
    "comment": "It's unfortunate that the term \"classic\" is too often applied to the forgettable and the mediocre. That El Grande, published in the twilight of the 20th century, continues not only to endure but to command reverence, is a welcome exception.\n\nThis is a game that dispenses with the superfluous. There are no dice here to absolve you of poor judgment, no novelties to distract from one central fact: you are wielding power. Not an anemic simulacrum of power offered by lesser designs, but a raw contest for dominance over a disunited Spain, where every move is a deliberate calculation, and, if you're playing well, an act of subterfuge.\n\nWhat distinguishes and elevates El Grande is that it demands from you what all worthy games demand: attentiveness, adaptability, and above all, an understanding of timing. The game is won not by the accumulation of power alone, but by its judicious deployment. It trusts you to think, to plan, to manoeuvre. To assert your will. And that is rare enough in this age of incessant gratification and gaudy design.\n\nIn short, it is a triumph of form and function; a reminder that sophistication in design requires the courage to do less and say more. The ghost of Philip II might well look on approvingly.",
    "timestamp": 1759010400
  },
  {
    "username": "PenaltyKick",
    "rating": 10.0,
    "comment": "✓✓✓✓✓",
    "timestamp": 1760652000
  },
  {
    "username": "Sachtman",
    "rating": 10.0,
    "comment": "L'ancêtre du jeu de majorité ! Exceptionnel !",
    "timestamp": 1760479200
  },
  {
    "username": "SamuraiCoyote",
    "rating": 10.0,
    "comment": "Deserved the fame. Easier than what they say and ioncredibly approachable.",
    "timestamp": 1760220000
  },
  {
    "username": "Gabrisimpson",
    "rating": 10.0,
    "comment": "Masterpiece.\n\nIt's incredible how a game from 1995 can deliver such a clean, elegant and fun experience.\n\nYou can teach El Grande in 10 minutes to anyone, then you got yourself right into a deep, tight experience with a highly cutthroat interaction. Yes, it can be swingy and yes, there can be a lot of \"bashing the leader\" if someone start to run forward but hey, don't make yourself too many enemies too fast \n\n5p is the ideal player count but you can enjoy it a lot also on 4p and still playing at 3p with some an easy variant which combines two of the decks.\n\nI think most of newer area majority games are just harder to learn, play less smoothly and only have big and good looking miniatures.\n\nI played the first German edition at Play Fair in Italy and suddenly bought the same version on second hand market for less than 20 bucks. Don't get yourself fooled by the simple and old looking board, if you like highly interactive, easy to learn but deep games, El Grande will be a bust!",
    "timestamp": 1760047200
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "Prime area-majority, with clean, direct mechanics and really fun components (basically, referring to just the Castillo). There's a lot of good interaction and a lot of variability, both good signs for a Euro. El Grande is a worthy classic.\n\nI own the Decennial Edition.",
    "timestamp": 1759356000
  },
  {
    "username": "VibroChimp",
    "rating": 10.0,
    "comment": "Brilliant game…easy to learn, heavily interactive, tense from beginning to end. Lots of trying to get into the heads of other players. The mechanics are straightforward but interwoven in a very clever way.\nThe first few plays felt very chaotic, but now I realize that there’s more long-term strategy than first meets the eye. There is some randomness in the card draw that can spoil one’s plans, but an experienced player can hedge against these events by getting their caballeros out early and carefully distributing them across the board. Knowing the cards (especially the “score immediately” ones in stack 3) is essential to determining where to put your caballeros.\nI will also say that the 4 player game is just as good as the 5 player game; although it doesn’t feel quite as tight, it plays quicker and is less chaotic, thanks to the Intrigue cards mostly going unplayed.",
    "timestamp": 1758837600
  },
  {
    "username": "angstyzebra",
    "rating": 10.0,
    "comment": "Area Control/Action Drafting",
    "timestamp": 1758578400
  },
  {
    "username": "geekymlee",
    "rating": 10.0,
    "comment": "[90] 43x67 popcorn black label sleeve\n[55] 56x87 popcorn sleeve",
    "timestamp": 1757196000
  },
  {
    "username": "rongbeo93",
    "rating": 10.0,
    "comment": "In my opinion, this is a modern classic. It’s a simple area control game with a surprising amount of strategy. Each game feels different and is highly interactive, which is exactly what I look for. Easy to learn but hard to master, it offers incredible replayability and interaction.",
    "timestamp": 1756677600
  },
  {
    "username": "Phija",
    "rating": 10.0,
    "comment": "Love it so far. Needs many more plays!",
    "timestamp": 1756072800
  },
  {
    "username": "DeadDomino",
    "rating": 10.0,
    "comment": "El Grande is El Grande.",
    "timestamp": 1755554400
  }
]