[
  {
    "username": "Ryan Keane",
    "rating": 1.0,
    "comment": "I thought this would be fun, but it fell flat. It's a speed game that speed doesn't really matter. Just not sure what's the point.",
    "timestamp": 1604962800
  },
  {
    "username": "Beyak",
    "rating": 1.0,
    "comment": "The most absurd waste of time I could ever imagine.",
    "timestamp": 1238709600
  },
  {
    "username": "Octavian",
    "rating": 1.0,
    "comment": "More like \"Failing\".",
    "timestamp": 1216072800
  },
  {
    "username": "brianfs",
    "rating": 1.0,
    "comment": "Useless, oh wait, it makes good fire starter.",
    "timestamp": 1199746800
  },
  {
    "username": "Randy Cox",
    "rating": 1.0,
    "comment": "Rating after 0 plays. That's right. Zero. Read the rules and knew I never wanted to play it at all. Frantic, real-time card tossing? No thank you very much.",
    "timestamp": 1153087200
  },
  {
    "username": "cberg",
    "rating": 2.0,
    "comment": "Clever idea, but ultimately I didn't like it. I'm not normally a fan of real time games, but I have been surprised by a few. This one just didn't cut it for me.",
    "timestamp": 1694383200
  },
  {
    "username": "Board_All_The_Time",
    "rating": 2.0,
    "comment": "A game that may have been fun in it's original release era that has been completely surpassed in design in the 25 years since then. It's also weirdly unwieldy to teach and hard for players to grasp at first.",
    "timestamp": 1661292000
  },
  {
    "username": "Fencejummper",
    "rating": 2.0,
    "comment": "Luck driven game, but fun enough. Friend got it for a dollar at a garage sale.",
    "timestamp": 1654380000
  },
  {
    "username": "Ranior",
    "rating": 2.0,
    "comment": "I think the game itself is bad, but even worse than that, I don't think the real time part is even true. Too many of the card and effects effectively require the game to pause or react to what's happening, so while you can try to keep things real time, it's a very strange blend.\n\nPlayers also really can't do much, you kind of just hope you can play some cards and that somehow those cards will help you win, but really I think you're essentially all just moving cards around and until someone randomly wins. I don't think the rules are that intuitive or easy to grasp, so you also kind of muddle around until the group gets it, which makes the initial play(s) a bit funky since you can't well pause or handle rules issues during a real time game.",
    "timestamp": 1650837600
  },
  {
    "username": "ljhms",
    "rating": 2.0,
    "comment": "Nothing you do matter, it all comes down to the luck of the draw in the end.",
    "timestamp": 1577574000
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "(goblin version) Cute art, but terrible game. One player just held the skip card and played it at the end, and did literally nothing else, and he won by hitting the ground last. Do not recommend.",
    "timestamp": 1718920800
  },
  {
    "username": "lee elektrik",
    "rating": 3.0,
    "comment": "Very fast-paced and intense. Everybody plays at the same time against everybody else and this pesky gravity. The dealer/gravity is in fact the most important thing here. If he's no good, the game ain't.\nWhen leaving the exploding airplane in mid-air, please use the designated emergency exits. And do not leave your anvil behind. You might need it on the way down.",
    "timestamp": 1706655600
  },
  {
    "username": "Zepheus",
    "rating": 2.8,
    "comment": "Amusing concept, but random gameplay.",
    "timestamp": 1688594400
  },
  {
    "username": "kwalzl",
    "rating": 3.0,
    "comment": "*UFG*",
    "timestamp": 1665871200
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not my theme",
    "timestamp": 1640386800
  },
  {
    "username": "ratbulogg",
    "rating": 4.0,
    "comment": "Clever but ultimately falls flat (LOL).",
    "timestamp": 1754776800
  },
  {
    "username": "Yokiboy",
    "rating": 4.0,
    "comment": "Funny theme, as you struggle to be the last to splat into the ground while falling together in a real-time game. Real-time competitive games tend to get messy. This was a better idea, than a well implemented game that you wan to return to again.",
    "timestamp": 1745704800
  },
  {
    "username": "heartofanartichoke",
    "rating": 4.0,
    "comment": "Initial Thoughts: Falling is a real-time game that is both morbid and dumb. Taking it seriously enough to come up with a rating and write up goes against what this game is trying to do. Learning the game likely took 3-4 times longer than playing. A dealer deals players cards faceup. Players can then decide to pick up the top card into their one-card limited hand which they can play later. These cards have special powers when played, like skip which causes the dealer to skip over a specific person or hit which forces the dealer to deal 2 cards to a person. The bottom of the deck has \"ground cards\" Players are jockeying to be the last person the \"hit the ground,\" i.e. be dealt a ground card. This is my lowest rated new-to-me game of PaxU, but also the one I'd most likely return to again again for end-of-the-night silliness. (2024-12-08)",
    "timestamp": 1733612400
  },
  {
    "username": "mi_de",
    "rating": 4.0,
    "comment": "A race game but too convoluted for what it is. The splitting of stacks into multiple piles only causes confusion (did you have two or three stacks?) Tempo dictated by the dealer. Not enough card variety for me. Not as much stealing and giving cards as would have been appreciated.",
    "timestamp": 1678316400
  },
  {
    "username": "FreezenFire",
    "rating": 4.0,
    "comment": "Gave it away",
    "timestamp": 1566511200
  },
  {
    "username": "oursino",
    "rating": 5.0,
    "comment": "Bou Diou, ça va vite tout ça... s'il n'y a pas de triche entre les tours, je me les mords... Trop rapide pour mon cerveau ! Mais l'idée est assez novatrice et géniale. Quelle note mettre... 5?!? (je sais c'est un peu dur!).",
    "timestamp": 1744840800
  },
  {
    "username": "happyjosiah",
    "rating": 5.0,
    "comment": "It's been a very long time since I played this one, but there's still not much quite like it. James Ernest was on a roll for a while coming up with real-time games, well before such things were commonplace. This game lasts no longer than five minutes, and has a chaotic slapjack kind of feel, with plenty of take that. It's a thematically amusing premise and it doesn't overstay its welcome, though there are just a rule or two too many for how much player control is actually present.",
    "timestamp": 1724018400
  },
  {
    "username": "rseater",
    "rating": 5.0,
    "comment": "real time madness...yet boring after a play or two",
    "timestamp": 1719093600
  },
  {
    "username": "AletheaAurora",
    "rating": 5.0,
    "comment": "Suffers from the same problem most 'real time' games do; until everyone is proficient no-one is having fun.",
    "timestamp": 1684792800
  },
  {
    "username": "Stevemould",
    "rating": 5.0,
    "comment": "fun filler.",
    "timestamp": 1649800800
  },
  {
    "username": "MrSarcastic",
    "rating": 5.0,
    "comment": "Hilarious concept. Works best when the dealer can keep the players in line and not cheating.",
    "timestamp": 1621720800
  },
  {
    "username": "hippiephysicschick",
    "rating": 5.0,
    "comment": "Free/gift guild card",
    "timestamp": 1583017200
  },
  {
    "username": "Mutiemoe",
    "rating": 5.0,
    "comment": "Not that entertaining game really.",
    "timestamp": 1522015200
  },
  {
    "username": "fuzzyfife",
    "rating": 5.0,
    "comment": "from Jeremy Goldberg at UNTITY XVII",
    "timestamp": 1506117600
  },
  {
    "username": "PopeBrain",
    "rating": 5.0,
    "comment": "(3 plays) It's an interesting game, but it just doesn't ever seem to \"work\". Maybe good for the right group.",
    "timestamp": 1483398000
  },
  {
    "username": "adamphipps11",
    "rating": 6.0,
    "comment": "4-8 Players\nBest: 6",
    "timestamp": 1757455200
  },
  {
    "username": "Golob",
    "rating": 6.0,
    "comment": "Unique in its setup and dynamics, super fun when played correctly, but unfortunately it is very difficult to do so: all players must be proficient at rules and bookkeeping at high speeds without a miss.",
    "timestamp": 1754258400
  },
  {
    "username": "Raul Catalano",
    "rating": 6.0,
    "comment": "Very good idea and mechanics, but with a low replay factor.",
    "timestamp": 1753653600
  },
  {
    "username": "Kiyote",
    "rating": 6.0,
    "comment": "Gen Con 1998",
    "timestamp": 1739919600
  },
  {
    "username": "ZargonDDG",
    "rating": 6.0,
    "comment": "Sold to Olga for $5",
    "timestamp": 1731193200
  },
  {
    "username": "Necho",
    "rating": 6.0,
    "comment": "Francja",
    "timestamp": 1695592800
  },
  {
    "username": "facit",
    "rating": 6.0,
    "comment": "Really fun party game. Quick and chaotic.",
    "timestamp": 1682719200
  },
  {
    "username": "Chris Sjoholm",
    "rating": 6.0,
    "comment": "Of the friends to whom I've taught the game, the folks who I made sit through a \"training\" session, where I gradually introduced each type of card and sped up the tempo really like it. The ones who just tried to learn it all at once don't like it. Hmmm....",
    "timestamp": 1675810800
  },
  {
    "username": "Schwenkstar",
    "rating": 5.5,
    "comment": "A positive or negative experience with this game is solely dependent on the players involved.\n\nOver the course of several plays, I have come across three types of player-reactions to this game: (1) there are those who really love the chaotic and frantic nature of its real-time gameplay; (2) there are others who simply get overwhelmed by its insanity and don't even try to play; (3) and then there are the worst perpetrators who get so riled up that they stop following the rules and break the darn game!\n\nAs a result, I have played this game and had it go over quite well - when everyone is on board with its insanity - but have also played it and had the game fall flat on its face - when I had to stop the game every ten seconds to fix someone's error.\n\nOne comment regarding the rules - even though the gameplay is rather intuitive once you learn it, explaining the actual mechanics of the gameplay to novices is rather cumbersome. It truly does take about three plays - like the rulebook suggests - to get a handle on the proceedings. Usually they'll get their bearings by then.\n\nMy suggestion - before you buy, ensure that you know a group of gamers who enjoy playing at a supremely chaotic pace. If not, this will collect dust on your shelf.\n\nFor those who enjoy a frame of reference, think Pit but entirely antagonistic.",
    "timestamp": 1668207600
  },
  {
    "username": "OMD56",
    "rating": 6.0,
    "comment": "Initial Score: 6",
    "timestamp": 1655071200
  },
  {
    "username": "Bigfifty",
    "rating": 7.0,
    "comment": "I love this game, but I can't get too many people to play with me. It does have a tendency to break people's brains.",
    "timestamp": 1643929200
  },
  {
    "username": "ColinONeill",
    "rating": 7.0,
    "comment": "BEST FEATURES:\nFast, adredaline-driven action in this 90 second game.\n\nWORST FEATURES:\nA bit of a learning curve. You have to play a couple times before you get the hang of it.",
    "timestamp": 1624485600
  },
  {
    "username": "Posco",
    "rating": 6.8,
    "comment": "X",
    "timestamp": 1596405600
  },
  {
    "username": "naturestee",
    "rating": 7.0,
    "comment": "I really like this game, but the friends I played it with were just confused by the chaos caused by the real-time aspect. I think real-time games are a great concept.",
    "timestamp": 1566511200
  },
  {
    "username": "ZuluForce",
    "rating": 7.0,
    "comment": "Quick rounds. Good player interaction.",
    "timestamp": 1551049200
  },
  {
    "username": "mocopila",
    "rating": 7.5,
    "comment": "Very fun card game with quite unique mecanism.",
    "timestamp": 1718748000
  },
  {
    "username": "emcglohon",
    "rating": 8.0,
    "comment": "Still one of my favourite Cheapass card games. Very few good \"realtime\" games out there.",
    "timestamp": 1680127200
  },
  {
    "username": "LaSJ",
    "rating": 8.0,
    "comment": "Infinite fun with the right crowd.",
    "timestamp": 1553727600
  },
  {
    "username": "hatchitt",
    "rating": 8.0,
    "comment": "Original edition",
    "timestamp": 1514415600
  },
  {
    "username": "SamLL",
    "rating": 8.0,
    "comment": "One of the first real time card games - fun, fast, good for parties, usually enjoyed by a wide range of people, with a comical and appropriate theme. High variance.",
    "timestamp": 1501711200
  },
  {
    "username": "grasa_total",
    "rating": 9.0,
    "comment": "It could be less good than I remember -- I haven't played it since long before I was using BGG.\n\nBut I couldn't bring myself to rate it lower on speculation, because way back when, this was a true favorite.\n\nI remember loving it in a way that resonates with my modern tastes, too! People's eyes get wide when you start to describe it, like, how could that even work? And it's quick enough that even an antsy group would usually play a few times in a row and start to develop a metagame. Plus, I still love real-time games. Who knows, maybe I can even talk some people into trying it with me now.\n\n[lots of plays, long ago]",
    "timestamp": 1750888800
  },
  {
    "username": "bsabik",
    "rating": 9.0,
    "comment": "So much fun, the best amusing graphics in polish edition !",
    "timestamp": 1664661600
  },
  {
    "username": "genuinelyanf",
    "rating": 9.0,
    "comment": "Excellent surprise present from the Farrars",
    "timestamp": 1538431200
  },
  {
    "username": "thugbert",
    "rating": 9.0,
    "comment": "fast and silly.",
    "timestamp": 1464904800
  },
  {
    "username": "codersaur",
    "rating": 9.0,
    "comment": "Home-made HHGTTG version. Very fast, light game with unique mechanic. Brilliant filler game. Can play this for hours.",
    "timestamp": 1421967600
  },
  {
    "username": "killerkonnat",
    "rating": 10.0,
    "comment": "I have only played the \"Goblins\"-edition, I don't know if it has any rule changes from the original. Super short rounds. A full game only takes a few minutes. Fantastic filler game for 4+ players. Game is surprisingly strategic contrary to how it looks on first glance.",
    "timestamp": 1489100400
  },
  {
    "username": "davethegame",
    "rating": 10.0,
    "comment": "The Goggles! They do nothing!",
    "timestamp": 1416524400
  },
  {
    "username": "JustinA",
    "rating": 10.0,
    "comment": "Fast, frenetic, and a ton of fun. The game can be a little complicated (although not particularly difficult) to teach to new players due to the real-time play, but it's worth it for the exciting and varied play that follows.",
    "timestamp": 1377295200
  },
  {
    "username": "hugo",
    "rating": 10.0,
    "comment": "Now that's a great theme! Hilarious game if you have a minute (literally). It's also a total revenge on the persons in your gaming group who usually need to think for half an hour before making a move.\n\nA common misunderstanding from people who have just tried the game once or twice is that you can't affect the outcome of this game other than by the last card played. This is not so! There are several ways of giving yourself a better chance of winning.",
    "timestamp": 1162249200
  },
  {
    "username": "gnoccarello",
    "rating": 9.5,
    "comment": "Hurry!",
    "timestamp": 1100818800
  }
]