[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Oh no, three rows are frozen with high numbered cards, so now we're just playing on a single row for most of the hand!\n\nAfter playing it a bunch, I can't say any interesting play emerges. I can think of a ton of simple games that get way more intense after playing them a lot, while this just stays exactly the same. While still being too meek and time-consuming to be a wild gambling game. Like my first thoughts are Hols der Geier and No Thanks, those are much more exciting than this. It's fine, nothing more.",
    "timestamp": 1731193200
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Easy to teach, but simple, chaotic and a bit mindless with too many players, yet you need a bunch of players to generate the fog that makes the game.",
    "timestamp": 1723068000
  },
  {
    "username": "Euroman",
    "rating": 1.0,
    "comment": "This game is ridiculous! There is absolutely no way to plan for anything. To prove it, I played a game by putting my cards in a pile face down and played the top card every turn. And I won!!! Will not play again. Rivals Xactica and Phase 10 in being the worst card game I've ever played.",
    "timestamp": 1707174000
  },
  {
    "username": "MarkyX",
    "rating": 1.0,
    "comment": "It's just a slot machine. No skill involved here. Probably one of the worst card games I have ever played.",
    "timestamp": 1668121200
  },
  {
    "username": "Rex_Lui",
    "rating": 1.0,
    "comment": "Card",
    "timestamp": 1664056800
  },
  {
    "username": "CascadeHush",
    "rating": 1.0,
    "comment": "9",
    "timestamp": 1652306400
  },
  {
    "username": "FOTCH",
    "rating": 1.0,
    "comment": "Уберите это от меня :`((",
    "timestamp": 1613084400
  },
  {
    "username": "Silver Avocado",
    "rating": 1.0,
    "comment": "There might be something I just don't get about this game.",
    "timestamp": 1606086000
  },
  {
    "username": "MatthewJohnsonApps",
    "rating": 1.0,
    "comment": "There is probably some strategies here, because some people seem to do better than others, but it's so bland I couldn't be bothered trying to figure out what they are. It's actually more fun to break the game and see how quickly you can lose, but I expect that would get tedious pretty quickly.",
    "timestamp": 1553986800
  },
  {
    "username": "Bien",
    "rating": 1.0,
    "comment": "Blind random play is better than calculated thought in about half of the games.",
    "timestamp": 1236294000
  },
  {
    "username": "nschroedl",
    "rating": 1.0,
    "comment": "I'd rather drink dog vomit",
    "timestamp": 1229036400
  },
  {
    "username": "lswaage",
    "rating": 1.0,
    "comment": "8/2004: Even for a party game this is too abstract, boring and plain stupid. Some planning is possible with 3-4 players; but 10 (?!) one just play a card and see what happenes.",
    "timestamp": 1153432800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\nThis game is fun and easy, but there is not much to it to retain replayability.",
    "timestamp": 1740610800
  },
  {
    "username": "tectactoe",
    "rating": 2.0,
    "comment": "Decent little tabletop romp, largely luck based but also somewhat deductive (however slight) and meta-dependent - yes I truly believe that how well you \"know\" your fellow players can (and will) affect your decisions. Which is why it's actually a tad more exciting to play this with total strangers.",
    "timestamp": 1735081200
  },
  {
    "username": "firebound12",
    "rating": 2.0,
    "comment": "Very light filler game. Not much choices. The better you are at the game, the longer it goes... why??",
    "timestamp": 1706828400
  },
  {
    "username": "bozso0426",
    "rating": 1.9,
    "comment": "BGA-n játszható",
    "timestamp": 1705791600
  },
  {
    "username": "galfridus",
    "rating": 2.0,
    "comment": "Frustratingly random; once you get a lot of points you have little chance of winning but must keep playing. The edition in the tin is very pretty.",
    "timestamp": 1699743600
  },
  {
    "username": "eddy_sterckx",
    "rating": 2.0,
    "comment": "2015-11-03 : I fail to see why this game is popular - there's no strategy and just one or two tactical tricks that once you know them, you just employ .. or not - and hope for the best.\n\nWe played it with the expansion which adds the decimal cards and this is a neat addition to the game\n\n2023-10-14 : Played another game of it because the group seems to like it. Employed the \"strategy\" of always playing my lowest card, no matter what and was in contention for the win after 2 rounds, which proves this is not a game, but a mindless activity. Score lowered from a \"4\" to a \"2\"",
    "timestamp": 1697407200
  },
  {
    "username": "EinGlasWurstWasser",
    "rating": 2.0,
    "comment": "{\n\"min_duration\": 5,\n\"max_duration\": 20,\n\"players\": [5,6]\n}",
    "timestamp": 1690668000
  },
  {
    "username": "MorelliBuendia",
    "rating": 2.0,
    "comment": "I didn't really see the point in this game.",
    "timestamp": 1684620000
  },
  {
    "username": "ning0216_06",
    "rating": 2.0,
    "comment": "我覺得這個遊戲有點難懂也很難玩，我在玩的時候都看不懂怎麼玩就隨便亂抽牌。",
    "timestamp": 1650751200
  },
  {
    "username": "tycygo",
    "rating": 2.0,
    "comment": "I dont see the appeal, luck is strongly present here. Yes some planning and thinking, but no, nothing real. More players leads to more madness and unpredictability. Keep that in mind.",
    "timestamp": 1647212400
  },
  {
    "username": "John Rogers",
    "rating": 2.0,
    "comment": "Boooooooooooo",
    "timestamp": 1636239600
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "45 Min 2–10 Players p2 p3 p4 p5 p6 p7 p8 p9 p10 Weight: 1.21 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "FranzK",
    "rating": 3.0,
    "comment": "Not a very interesting game but I can see playing it occasionally as a filler.",
    "timestamp": 1758405600
  },
  {
    "username": "DrafGrakula",
    "rating": 3.3,
    "comment": "Универсальная игра",
    "timestamp": 1736204400
  },
  {
    "username": "michla",
    "rating": 3.0,
    "comment": "pl: Szósty bierze!",
    "timestamp": 1729461600
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "Get lucky to set someone else up to claim the bomb with all the negative points. Not much happening here.",
    "timestamp": 1699311600
  },
  {
    "username": "Sir Pent",
    "rating": 3.0,
    "comment": "More of a party game than a strategy game. Playing larger cards while trying NOT to add the 6th card to a row. Too dependent on random card draw, and with large player counts, there's really no way to plan ahead.",
    "timestamp": 1681855200
  },
  {
    "username": "ubRtstcl",
    "rating": 3.0,
    "comment": "A bit of tension.",
    "timestamp": 1680818400
  },
  {
    "username": "bainewedlock",
    "rating": 3.0,
    "comment": "Rating 4 = To someone with a simliar taste like me: Play this game if you don't have anything else to do.",
    "timestamp": 1679180400
  },
  {
    "username": "Manic_Pangolin",
    "rating": 3.0,
    "comment": "Objectively this is probably a decent game, but I don’t enjoy it. The entire game is about negative reinforcement and avoiding punishment, which I find stressful and exhausting, much more than games where you earn points or otherwise get those positive little dopamine hits. Even when it’s other players being punished, I don’t find myself enjoying the game… I just feel a moment of relief that it wasn’t me.",
    "timestamp": 1672959600
  },
  {
    "username": "Entropology",
    "rating": 3.0,
    "comment": "Ratio of luck to decisions little too heavy for me for themeless number game. Just not my jam.",
    "timestamp": 1671490800
  },
  {
    "username": "TUM_bag",
    "rating": 3.0,
    "comment": "Played this alot with my 1st bf and our friends and siblings. Quick filler.",
    "timestamp": 1667862000
  },
  {
    "username": "kika80_Litwa",
    "rating": 3.0,
    "comment": "7 EUR\nVasel",
    "timestamp": 1662674400
  },
  {
    "username": "DanFred",
    "rating": 3.0,
    "comment": "A dumb card game with a lot of luck and randomness. Played a few times on BGA, but is a dumb, stupid, random game.",
    "timestamp": 1661464800
  },
  {
    "username": "swingingsteel",
    "rating": 4.0,
    "comment": "So many other filler card games I would rather play.",
    "timestamp": 1754517600
  },
  {
    "username": "kilianbognar",
    "rating": 4.0,
    "comment": "Card games with obvious plays an no agency tend to not be my jam.",
    "timestamp": 1748556000
  },
  {
    "username": "thierrydms",
    "rating": 4.0,
    "comment": "SPA-II lente 2024 (Piet, Luc, Peter, Franky, ikke).\nSPA-III lente 2025 (Piet, Luc, Peter, Franky, ikke). (extra spelregel)\nVind ik nog steeds minder leuk.",
    "timestamp": 1742511600
  },
  {
    "username": "BoardGaymesJames",
    "rating": 3.6,
    "comment": "\"Mechanics: 4: Disjointed - Functional but not enjoyable.\nApproachability: 4: Challenging - Manageable but requires effort to understand.\nReplayability: 4: Minor - Slight variation but mostly repetitive.\nTheme & Art: 3: Weak - Disconnected from the gameplay.\nEnthusiasm: 3: Disinterested - Only play if necessary; little interest.\"",
    "timestamp": 1738364400
  },
  {
    "username": "MarshallStaxx",
    "rating": 4.0,
    "comment": "Pure random chaos. Just close your eyes, play random cards, and keep on drinking.",
    "timestamp": 1735772400
  },
  {
    "username": "yamaraus",
    "rating": 4.0,
    "comment": "It's fine I guess. Has some good strategy for what cards to put out in order to avoid taking stacks, and to try to take smaller point stacks. Just...not my thing.",
    "timestamp": 1734303600
  },
  {
    "username": "DaneTheBeast",
    "rating": 4.0,
    "comment": "Played (IRL & TTS)",
    "timestamp": 1731366000
  },
  {
    "username": "MatroidX",
    "rating": 4.0,
    "comment": "Nice light filler, and I can see how it would be very friendly intro to the hobby for non-gamers/family/significant other. But for my tastes, a bit too light and luck-based (e.g. initial cards dealt, sequence and distribution / painted into corner, etc).",
    "timestamp": 1730242800
  },
  {
    "username": "Irskel",
    "rating": 4.4,
    "comment": "Overall - 4.4\n\n(19%) fun - 3\n(17%) replay value - 4\n(15%) interactivity - 4\n(13%) downtime - 8\n(11%) skill/luck - 4\n(08%) quality/look/atmosphere - 3\n(08%) depth/challenge - 4\n(05%) 2-player - 4\n(03%) beginner-friendly - 10\n(01%) price-performance - 5",
    "timestamp": 1729288800
  },
  {
    "username": "esayitch",
    "rating": 4.0,
    "comment": "1) Select the proper card that makes you avoid taking rows of cards while forcing your opponents to do just that.\n2) Every turn, players select a card from their hand they wish to play in secret. Cards are revealed together and arranged in ascending order, then added to one of 4 rows. Once a row is full, the person who played the last card in it takes it and scores all of the points on the cards that were in it. A couple more wrinkles complete the ruleset, with the game ending after the round a player has accrued enough points. Player with the lowest points wins.\n3) I loved: Much more tense than No Thanks!, there are multiple ways to think about the cards you have. Cards in hand can be good or bad depending on the situation, and sometimes playing a bad card to come away with 1 point only is not a bad play. Looking in horror as, after waiting for the last round to play a card, a row is taken and suddenly you find that card completing another row!\n4) Could be improved: Really needs a fixed group to evolve the groupthink and to guess and outguess each other. When played with a new group every time, it may seem a bit random. On the other hand it is not the type of game I wish to play repeatedly to really develop that groupthink or to really get good at for that matter.\n5) A great filler for large groups, more involved than No Thanks! but in that ballpark. Likely still prefer LLAMA.",
    "timestamp": 1727215200
  },
  {
    "username": "Quang17",
    "rating": 4.0,
    "comment": "This game is super random. There is basically no strategy that you can employ that would help you take less points. I don't hate the game but, I also don't love the game either. It's a fun play the game for a couple of rounds every couple of months but, I wouldn't play more than that.",
    "timestamp": 1726610400
  },
  {
    "username": "jokris",
    "rating": 4.0,
    "comment": "BGA (board game arena)\nDid not enjoy",
    "timestamp": 1714341600
  },
  {
    "username": "alexs34",
    "rating": 5.0,
    "comment": "Acceptable filler. I was taught the wrong rules, so I haven't yet played this with the correct rules.",
    "timestamp": 1758146400
  },
  {
    "username": "seb_48784",
    "rating": 5.0,
    "comment": "After a few games on BGA: A very simple game that allows a surprisingly high player count. It’s very luck-driven, yet still offers enough suspense to keep you engaged. It serves a similar purpose to the much newer Flip 7, but gives you more to think about in comparison. I have the strange feeling that I haven’t yet fully grasped its tactics. And somehow it annoys me to get penalty points. It makes me feel stupid. And I feel increasingly little motivation to go through these numbers in my head and optimize my move. The theme – an ox – doesn’t appeal to me; I associate it with aggression, hypermasculinity, and animal cruelty, none of which are pleasant.",
    "timestamp": 1756591200
  },
  {
    "username": "adamolanna",
    "rating": 5.0,
    "comment": "Giocato tantissime volte in BSW, ero molto scarso però",
    "timestamp": 1756159200
  },
  {
    "username": "couchlife",
    "rating": 5.0,
    "comment": "It's fine! Inspires zero real emotion in me.",
    "timestamp": 1753912800
  },
  {
    "username": "Gtaops",
    "rating": 5.0,
    "comment": "1.20\n\nLE STATISTICHE DELLE PARTITE INIZIANO DAL 01/01/2018",
    "timestamp": 1753826400
  },
  {
    "username": "mudville9",
    "rating": 5.0,
    "comment": "I was a little let down by this one after years of hearing it mentioned as a classic filler like For Sale, No Thanks, Coloretto, etc. It's certainly a bit more random than those and less interesting. There's other wacky unforeseen consequences games I'd rather play, like Gravwell or Hot Streak.",
    "timestamp": 1753048800
  },
  {
    "username": "spencyrrh",
    "rating": 5.0,
    "comment": "2025-04-25 | 12 plays at 3-7 | BGA & Gigamic French 2017 e | I teach:  5  \n\nYou play a card face down simultaneously with all other players, and then they are added in chronological order to the row, of several, which has the next lowest number as its rightmost card. If you would add a sixth card to a row, you take the whole row in front of you into your scoring pile. Some cards have more points on than others. Lowest points at the end wins.\n\nI like the concept but I don't think I've had a good game of this. You can play a calculating async game online, but what should run raucous in person has never fully come off, in my experience. I perhaps teach the game too seriously. I've played with a bunch of variants. I like using only the cards matching the number of players, multiplied by 10, plus 4. Other rules seem to complicate the core appeal. The 'professional' variant (you can play a card to either side of a row) becomes a wholly other game, which I can't assess without a lot more plays.\n\nAny version works. The game doesn't look pretty.\n\nI just like to play one round, because 30+ minutes of this feels absurd. It suffers the fate of many classics: too many ways to play. You may find that your preferred rules repulse gamers, and casual players don't care about the game one way or another. I consider it a 4-8 player game. At 4p, I'd place three rows, and have players take a row once the fifth card gets placed, because otherwise the game gets flabby. Or, honestly, play something else.",
    "timestamp": 1745532000
  },
  {
    "username": "quefue",
    "rating": 5.0,
    "comment": "Mítico filler de números y un poco de suerte.",
    "timestamp": 1740870000
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "Nope",
    "timestamp": 1738191600
  },
  {
    "username": "crocko33",
    "rating": 5.3,
    "comment": "6 nimmt!",
    "timestamp": 1737414000
  },
  {
    "username": "JKlitte",
    "rating": 5.0,
    "comment": "1,20",
    "timestamp": 1737241200
  },
  {
    "username": "marliv",
    "rating": 5.0,
    "comment": "just OK game, will play for nostalgic reasons.",
    "timestamp": 1737154800
  },
  {
    "username": "muzrobertson",
    "rating": 5.0,
    "comment": "More a random card draw than a game, sadly.",
    "timestamp": 1736377200
  },
  {
    "username": "YlumsGuardian",
    "rating": 5.0,
    "comment": "Original (6.8): \"6 Nimmt!\" edition. Light as can be, but fast and fun. Good amount of \"gotcha!\" moments that aren't strictly \"take that!\"\n\nUPDATE: Sold. Just a little *too* simple. Plenty of other light games that I prefer.",
    "timestamp": 1735945200
  },
  {
    "username": "Kovie2",
    "rating": 5.0,
    "comment": "Quick, but basic game. Can have some fun moments, it's just not getting much play.",
    "timestamp": 1735426800
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "Category 5 (Slide 5) with a different name. Good game with a large group. Simple math with a bit pf luck needed.",
    "timestamp": 1731538800
  },
  {
    "username": "adel9591",
    "rating": 5.0,
    "comment": "There's some strategy here somewhere but I haven't picked it up yet",
    "timestamp": 1731452400
  },
  {
    "username": "nokomment",
    "rating": 5.0,
    "comment": "Soltvadkert",
    "timestamp": 1730934000
  },
  {
    "username": "SpaceSheep4",
    "rating": 5.0,
    "comment": "Pretty meh for me. It can be fun but there is too much luck involved, for my taste.",
    "timestamp": 1730329200
  },
  {
    "username": "rikicorgan",
    "rating": 5.2,
    "comment": "(15x) ENJOYMENT:                         Forgettable     Outstanding\n(10x) DEPTH (IN RELATION TO COMPLEXITY): Lacking         Meaty\n (5x) LUCK FACTOR:                       All Luck        All Skill\n (3x) REPLAYABILITY:                     Nil             Limitless\n(10x) MECHANICS:                         Boring          Interesting\n (4x) PLAYER INTERACTION:                Low             High\n (4x) PLAYER COUNT PERFORMANCE:          Not Balanced    Balanced\n (2x) GAME LENGTH:                       Too Short/Long  Just Right\n (2x) CLARITY OF RULES:                  Mud             Crystal\n (5x) COMPONENT QUALITY:                 Cheap           World Class\n\nINITIAL RATING (sum(Criteria Rating x Criteria Weight)/Total Weight) = 5.2",
    "timestamp": 1726437600
  },
  {
    "username": "Seboss",
    "rating": 5.0,
    "comment": "Average filler game to play with casual players. Easy to pick up and play, but ultimately it feels very random and gets old pretty fast.",
    "timestamp": 1725228000
  },
  {
    "username": "rockhill_smokers",
    "rating": 5.0,
    "comment": "ez nem az én játékom....\nTeljesen random, minimális ráhatásod van arra, hogy mi történik.\nLegfőbb előnye, hogy nagyobb társasággal is lehet játszani, néhány fröccs/sör után is. De kb. ennyi.\nÉrdemes egyszer kipróbálni úgy, hogy a kiosztott lapokat megnézés nélkül, teljesen vakon fordítják fel a játékosok :-) Akkor sem lesz se jobb, se rosszabb az eredmény.",
    "timestamp": 1724104800
  },
  {
    "username": "goetzinb",
    "rating": 5.0,
    "comment": "I could Take 6! or leave it.",
    "timestamp": 1721512800
  },
  {
    "username": "sthompson022",
    "rating": 5.0,
    "comment": "I own the version published by Mayfair games from 2015 called 6Nimmt - same game, just a different more recent version.",
    "timestamp": 1718316000
  },
  {
    "username": "StrongbowGold",
    "rating": 6.0,
    "comment": "6...le prendi!",
    "timestamp": 1760738400
  },
  {
    "username": "mondauge",
    "rating": 6.0,
    "comment": "One play is enough.",
    "timestamp": 1759442400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "A fast and mean card game which is probably a lot less random than it feels. You do have complete agency over your plays each turn, but it's largely just determining how unlucky you might be.",
    "timestamp": 1759356000
  },
  {
    "username": "Ephorus",
    "rating": 6.0,
    "comment": "What I like:\n- Accommodates many players without being a party game.\n- Lots of groans when someone lays down the 6th cards. Hilarious moments.",
    "timestamp": 1757714400
  },
  {
    "username": "CotB",
    "rating": 6.0,
    "comment": "Rankings\n58th Best Game 2019\n59th Best Game 2020\n76th Best Game 2021\n109th Best Game 2022\n127th Best Game 2023\n136th Best Game 2024",
    "timestamp": 1757109600
  },
  {
    "username": "AfarOca",
    "rating": 6.0,
    "comment": "JUGADORES: 5-6\nTIEMPO: 45\n\nPARTIDAS GANADAS/PERDIDAS\nOca 19/40\nNavir 15/43\nVictoria 5/10\nTabli 4/4\nAngel 3/6\nJose Victoria 3/12\nJose Angel 2/1\nMª Angeles 2/7\nLoli 2/9\nFina 1/0\nTamara 1/1\nElfo 1/1\nAlba 1/1\nManolo 1/4\nConchi 1/4\nJavijavi 1/5\nPepon 1/9\nJose 1/10\npicassojac 0/1\nPipe 0/1\nCarlos Jose 0/1\nZsanet 0/1\nLucía 0/2\nLuisa 0/2\nAlvaro 0/2\nFénix 0/2\nDavid 0/2\nCristina 0/2\nRiderwind 0/2\nRoberto 0/3\nAlex 0/3\nAntonio Navajas 0/5\nPatri 0/9",
    "timestamp": 1756332000
  },
  {
    "username": "Azovic",
    "rating": 5.5,
    "comment": "6 nimmt!\n\nFamilienspiel",
    "timestamp": 1755900000
  },
  {
    "username": "Sir_Ramirez",
    "rating": 6.0,
    "comment": "Wygrane:\n\nAsia - 4/12\nJa - 2/13\nŻylon - 3/12\nEwa - 3/10\nFelix - 1/13",
    "timestamp": 1755468000
  },
  {
    "username": "Dorsett_Case",
    "rating": 6.0,
    "comment": "Box C",
    "timestamp": 1754776800
  },
  {
    "username": "tinayamy",
    "rating": 6.0,
    "comment": "14",
    "timestamp": 1754690400
  },
  {
    "username": "1llus1on1st",
    "rating": 6.0,
    "comment": "Not great at 2 players\nBetter at 3-7 players\nGood for beginners",
    "timestamp": 1753653600
  },
  {
    "username": "Username2024",
    "rating": 6.0,
    "comment": "Another nice Amigo card game\nAlways good to have a few of them to end an afternoon",
    "timestamp": 1753135200
  },
  {
    "username": "VioletSquirrel",
    "rating": 6.0,
    "comment": "Starting hand takes some time to sort out and see the board and decide on strategy. After that moves can go fast if people are quick to decide. Wouldn't say it's 45 min thing.\n\nCauses laughter if you start celebrate getting cows \n\nEntertaining, needs only number comparisons and some attention, depends on luck too. Funny. Dynamic.\n\nGood for several rounds.",
    "timestamp": 1752616800
  },
  {
    "username": "NewBerserker",
    "rating": 6.0,
    "comment": "Sympas a découvrir, je n'y passerais pas ma vie mais pour une partie de trmps en temps pourquoi pas !",
    "timestamp": 1750888800
  },
  {
    "username": "Kaffedrake",
    "rating": 6.0,
    "comment": "Another of these elegant German card games, specifically simultaneous card selection reminiscent of Turn the Tide. If it has a problem I think it's the part where a player playing a low card selects a row to take, with all other cards visible. This open calculation - and potentially choosing a player to target - seems at odds with the rest of the game.\n\nThrifted on 19/12 2015, 3/5 2016, 27/3 2018, 16/7 2022 and 12/6 2025.",
    "timestamp": 1749679200
  },
  {
    "username": "Rhaeide",
    "rating": 6.0,
    "comment": "Interesting design, fast-paced, definitely fun, but it feels too random. Not to be taken too seriously.",
    "timestamp": 1749506400
  },
  {
    "username": "Beercy",
    "rating": 6.0,
    "comment": "Pretty basic but in a very good way, I had fan. Usually not as huge of a fan of such barebone design but the amount of thinking and choices to which row you should put your cards and how mess with someone else plans made it simple game suprisingly more deep then I anticipated",
    "timestamp": 1749506400
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "The game has a good reputation in many gamer circles, but it's difficult to assess what skills this game asks for. You can probably come up with a strategy based on counting cards. Otherwise you lay down cards and hope for the best. It's not what I would call a social game either.\n\nHowever, there can be little disagreement on one point that the game as a specific addictive quality to it. I suppose it's something similar to gambling in the sense that one wants to play just ONE more game and see how it turns out. In addition, the game creates a certain kind of tension and relief, which is neat. I also find that it tends to hold peoples attention better than other light card games.\n\n-----\n\nI decided to try out 6 Nimmt again. I wasn't impressed, but it wasn't bad either. We'll see how it goes.",
    "timestamp": 1748296800
  },
  {
    "username": "Hatricvs",
    "rating": 6.0,
    "comment": "6 Nimmt version. Fun card game that can get very tense as you realise you're going to be the one picking up that pile of nasty bull's horn cards! It's a shame but most of the people I know aren't too keen on this one so it doesn't get the play it deserves!\n\nRe-acquired December 2018 on basis of needing a game that can accommodate upto ten players at a Christmas Party. Let's see how it goes down with a new audience!\n\nOwned: 20 years (2 Years This time Around).\nPlayed: 142\nLast play: 05/01/2025",
    "timestamp": 1748296800
  },
  {
    "username": "floro_",
    "rating": 6.0,
    "comment": "Entretenido pero demasiado caotico",
    "timestamp": 1747864800
  },
  {
    "username": "ciceroni",
    "rating": 6.0,
    "comment": "creates groans and laughter but the outcomes each round feel a bit too unpredictable for my tastes. i suspect the variant with fewer cards to solve this but haven‘t tried it so far.",
    "timestamp": 1746568800
  },
  {
    "username": "brw12",
    "rating": 6.0,
    "comment": "4 plays:\n\nHas a nice combination of trick taking strategy and opportunity cost considerations, a la Lost Cities. Seems like it can be played decent with no sophisticated strategy, but at the same time it rewards strategic thinking as deeply as you care to push it; a great combination. The uncertainty of which cards might be in play reduces the opportunity for analysis paralysis, and helps the game flow.\n\nNote that for 2 players, I took the advice of a bgg post and adapted the rules slightly: only the cards 1-37 are in play; 3 rows instead of 4; 12 cards each; first to 42 cattle points loses.\n\nI find it hard to get friends and family to play abstract card games that don't use regular playing cards.\n\nLightness (1)-Heaviness (5) rating: 2",
    "timestamp": 1745445600
  },
  {
    "username": "TMacfarlane26",
    "rating": 6.0,
    "comment": "Fun game but will only play on BGA. Too much work to play in person.",
    "timestamp": 1745445600
  },
  {
    "username": "dorafans91",
    "rating": 6.0,
    "comment": "It was tested that the performance of a player is comparable to a blind, random play, which is a prove that this game requires no real decision.",
    "timestamp": 1745013600
  },
  {
    "username": "aPilgrim",
    "rating": 7.3,
    "comment": "Works well in a big group.\n[56]3-10",
    "timestamp": 1760911200
  },
  {
    "username": "paimon616",
    "rating": 7.5,
    "comment": "룰의 견고함이 훌륭하다.\n더불어 대부분의 사람들과 플레이하기에 좋다.",
    "timestamp": 1760652000
  },
  {
    "username": "strongbadia",
    "rating": 7.0,
    "comment": "X",
    "timestamp": 1760479200
  },
  {
    "username": "turnover",
    "rating": 7.0,
    "comment": "Buys any group, any number of players.\n\nEven good for 2p or 3p, with 1-24, 1-34 variants.",
    "timestamp": 1759442400
  },
  {
    "username": "achkomm",
    "rating": 7.0,
    "comment": "ausgeliehen aus der Bücherei/Bücherhalle",
    "timestamp": 1759269600
  },
  {
    "username": "luisbarraco",
    "rating": 7.0,
    "comment": "Lisboa",
    "timestamp": 1759183200
  },
  {
    "username": "gianlucadario87",
    "rating": 7.0,
    "comment": "B_CAM",
    "timestamp": 1758751200
  },
  {
    "username": "stofke",
    "rating": 7.0,
    "comment": "R020",
    "timestamp": 1758492000
  },
  {
    "username": "smurfodeth",
    "rating": 6.5,
    "comment": "Completely un-serious affair that exists to provide laughs at everyone’s expense.",
    "timestamp": 1758232800
  },
  {
    "username": "PiecesOfToast",
    "rating": 6.5,
    "comment": "Easy to learn and play game. Consider this as a light game to enjoy and strategize before playing your larger games",
    "timestamp": 1758146400
  },
  {
    "username": "miha_lis",
    "rating": 7.0,
    "comment": "3-10 игроков",
    "timestamp": 1758060000
  },
  {
    "username": "trodat123",
    "rating": 7.0,
    "comment": "perfect game to play with non-gamers. Everyone gets it really quickly and it does not take long to play. Gets played often within longer games or to end the evening",
    "timestamp": 1757887200
  },
  {
    "username": "TwiznessAsUsual",
    "rating": 7.5,
    "comment": "CARDS w/ COLUMNS & ROWS ~ [AVOID] TRICK-TAKING (aka BULLS aka Beath the Heat, so many akas) ~ Lorne owns\n{ordered 2 copies for $15 - gifted a copy to Joanna}",
    "timestamp": 1760911200
  },
  {
    "username": "janglemangle",
    "rating": 8.0,
    "comment": "the only problem is the 66pt ending\n\ni'm curious to test how it ends after x amount of rounds. to hit a 15 min footprint, i'll try 3 rounds",
    "timestamp": 1760911200
  },
  {
    "username": "rharn",
    "rating": 8.0,
    "comment": "Fun lightweight simultaneous card action selection game. Has a penchant for producing funny stories. At player counts higher than 5p, the metagame changes drastically and you kinda have to let go of any notion that you have any control at all over your fate.",
    "timestamp": 1760479200
  },
  {
    "username": "YoLYcmqZ",
    "rating": 7.5,
    "comment": "Tag(s): Card Game, Simultaneous, Quick Play\nBest Player Count: 4-10, {5-6}\nRating: 7, +0.5\nOwn: Physical",
    "timestamp": 1760392800
  },
  {
    "username": "Asselmeier_1",
    "rating": 8.0,
    "comment": "Small card game (110 cards I think) in a small box. Easy to learn, quit quick to play (4-6 rounds, each about 5-10 minutes long) and pretty strategic. Losing doesn't feel bad, as there is of course a luck element to it. But epic rounds are possible and also teasing the opponent(s). Overall a nice little mix of elements and always fun to play.",
    "timestamp": 1760392800
  },
  {
    "username": "Ateckentrup",
    "rating": 8.0,
    "comment": "Family classic for big groups, up to 10 players. Rather quick because of simultanous picks and only 10 cards.",
    "timestamp": 1760047200
  },
  {
    "username": "shmonkey",
    "rating": 8.0,
    "comment": "Played 4x on BGA. Simple game with interesting decisions about how to best dump your hand without taking points. Players alternate, taking rows that they are forced to fill, or picking a row to take if they cannot throw a card larger than one of the rightmost cards in the rows.",
    "timestamp": 1759874400
  },
  {
    "username": "Fucile",
    "rating": 7.5,
    "comment": "Je mehr Runden man spielt, desto mehr wird der Glücksfaktor eliminiert den eine einzelne Runde mit sich bringt. Eine gute Strategie und richtige Entscheidungen zahlen sich langfristig aus.",
    "timestamp": 1759701600
  },
  {
    "username": "Fireballed",
    "rating": 8.0,
    "comment": "Goes over very well in mixed gamer and non-gamer groups, which is important for many of us with different friend/ family groups. Decisions are meaningful, but sometimes you are just burned by luck. The luck somehow feels better than in some highly lucky games. You still feel like you could have chosen differently or more wisely when you hit some back luck. Fun.",
    "timestamp": 1759701600
  },
  {
    "username": "Griffted",
    "rating": 8.0,
    "comment": "Incredible filler card game that plays an impressive 10 players, without adding more game time.",
    "timestamp": 1759269600
  },
  {
    "username": "shawnmackay1593",
    "rating": 7.5,
    "comment": "I believe this is the same as 6 Nimnt which is one of my favorite filler type games. There can be some luck but it's quick and fun, especially on BGA.",
    "timestamp": 1759096800
  },
  {
    "username": "marciusfabiani",
    "rating": 8.0,
    "comment": "Kramer at his best.",
    "timestamp": 1758319200
  },
  {
    "username": "sparker",
    "rating": 9.0,
    "comment": "Playable in the Badger Rainbow Deck",
    "timestamp": 1759788000
  },
  {
    "username": "DiceLord",
    "rating": 9.0,
    "comment": "Card game",
    "timestamp": 1759701600
  },
  {
    "username": "UnluckiestCat",
    "rating": 8.5,
    "comment": "Great double-think, hand management card game that shines with larger groups (5 players, up to 10) and creates lots of laughter.\n\n104 cards (values 1-104), each player gets 10, four are placed face-up to start four rows. Players simultaneously choose a card and reveal it. Starting with the lowest value, then the 2nd lowest, until the highest, cards are added to the rows following two rules: (1) All rows must be in ascending order; (2) a card must be placed into that row where it creates the smallest gap to the previous card of that row. If a card played becomes the sixth card in that row, the player takes the other five as penalty, leaving their card as the new start. If a card is too small for all rows, the player must take one entire row instead, but can choose which one; again the card played starts the new row.\n\nCards carry 1-7 negative points (mostly 1; values ending in 5 = 2, ending in 0 = 3, doubles = 5, and 55 = 7, as it's ending in 5 and a double). After all cards are played, placed and resolved, scores are tallied. The game ends when someone reaches 66+ points and the lowest score wins. Otherwise, play another round with 10 cards per player.",
    "timestamp": 1759010400
  },
  {
    "username": "dakujem",
    "rating": 9.0,
    "comment": "Excellent easy party game. The fun part is how the game changes with varying number of players.\nThis might be the only game I keep taking to parties and actually end up playing for years.",
    "timestamp": 1758578400
  },
  {
    "username": "janou28",
    "rating": 9.0,
    "comment": "un classique !",
    "timestamp": 1758492000
  },
  {
    "username": "greamejohnston",
    "rating": 8.5,
    "comment": "Wolfgang Kramer , you little (big?) genius. 6 Nimmt! is currently dominating my gaming life. Why? ‘Cause this very unassuming, ugly duckling is fun; loud, sweary fun. There are squeaky bum moments aplenty as you skirt around the edge of disaster, praying that no-one else has the card that will put you ‘over the top’. It’s great to win, but a soul crushing catastrophe if you lose. Why not a 10 then? Well, it’s the gaming equivalent of riding a bucking bronco - you’ll find yourself holding on for dear life but as often as not this bad boy is going to toss you off (and not in a good way).",
    "timestamp": 1757973600
  },
  {
    "username": "Rubeus",
    "rating": 9.0,
    "comment": "",
    "timestamp": 1756332000
  },
  {
    "username": "AwMar",
    "rating": 8.5,
    "comment": "Addicting.",
    "timestamp": 1756072800
  },
  {
    "username": "Sitnam",
    "rating": 9.0,
    "comment": "Most card games feel dry and ho hum to me, but this one is an exception.",
    "timestamp": 1755813600
  },
  {
    "username": "c0sMyc",
    "rating": 9.0,
    "comment": "Sometimes you run into a small, older game that really sparks your interest. Give this a try if you get a chance. (Board game arena!)",
    "timestamp": 1754776800
  },
  {
    "username": "timeodanaos",
    "rating": 9.0,
    "comment": "Excellent filler game for 4-10 players. Playing cards at random seems to be almost as effective as attempting some sort of 'strategy'. Good fun and highly recommended.",
    "timestamp": 1753653600
  },
  {
    "username": "Pandante",
    "rating": 9.0,
    "comment": "6 Nimmt is a classic, and one of my favourite card games ever. It's easy to teach, quick, no downtime, and has a great balance of luck, strategy, and reading others.",
    "timestamp": 1753394400
  },
  {
    "username": "HughCross",
    "rating": 10.0,
    "comment": "Simoultaneous play, quick, engaging, and still competitive enough to be enjoyed by everyone. There is more tactics and nuances that may seems at first glance, as involves a clever use of hand management and risk assesment. If you git gud at it you can play the tactics variance to make it more strategic. Extremely portable, easy teach and easy set up. You can adjust the lenght of the game as you can set different goals. The only downside is that requires at least 4 to play.\nEscalate quickly from peaceful and friendly to enraging and hilarating, no wonder is a bull the symbol of the game. It's the perfect filler, specially to close the night or inbetween big games. Love it",
    "timestamp": 1759701600
  },
  {
    "username": "Mauricio_Oliva",
    "rating": 10.0,
    "comment": "great game",
    "timestamp": 1759269600
  },
  {
    "username": "invervegas",
    "rating": 10.0,
    "comment": "Complexity √",
    "timestamp": 1754863200
  },
  {
    "username": "ourmove123",
    "rating": 10.0,
    "comment": "# 2025-07-16\n\nThe digital implementation (BGA) is 10/10. The physical version is lacking because score keeping is tedious if you don't use chips. If you want to use chips, then the game becomes much more difficult to transport.\n\nAdditionally, the online version takes care of all the math and row upkeep. This is a huge bonus!\n\n# 2025-07-14\n\nCurrently learning heuristics for the game and I personally feel that I enjoy the game much more ever since.\n\nThe game feels cryptic at times, but once you get the hang of it, you really feel like you can perform well and learn from your mistakes.\n\nThere's definitely a random element to the game, but to me it's not much of an issue because I aim to place in the top 3 (not just 1st!) in 5p games.\n\nI definitely enjoy the game more online right now, and I've only played it once at 4p IRL. I look forward to seeing how it plays at 4-6p IRL.\n\nIRL, the main issue is score keeping. If you use chips or some equivalent, then it's easy. If you use a score tracker or pen-and-paper, then I find it tedious because the host typically has to do all the calculations and accounting.\n\n# 2025-07-10\n\nAfter playing and winning a few 6p games, I find that winning requires much more adaptive play compared to 5p.\n\nAt 5p, I found a reliable strategy that works more often than not, and each game can be played nearly the same way.\n\nAt 6p, I must adapt to the current board state at nearly all times. There are definitely more risky moments that feel like a coin flip when compared to 5p games.\n\nOverall I think I like 5p more than 6p, but 6p is still enjoyable.\n\nI prefer to play 6p IF I'm more interested in tense, unpredictable gameplay that requires me to adapt to nearly every situation.\n\n# 2025-07-09\n\nI feel like I prefer 5p much more than 6p. I feel 6p is much more chaotic and unpredictable! HOWEVER, I found that playing your high card liabilities EARLY and then playing safe from then on works well; the go-to strategy at 6p so far.\n\nExtra bonus for being simultaneous play, so games can be relatively short.\n\nPlanning to play IRL with a central bank of poker chips. The chips will have different point values, and the players will accumulate them over the course of a game as they gain negative points.\n\n# 2025-07-07\n\nThe game is very enjoyable online, and I've yet to play it in person at more than 2P. Currently I enjoy it primarily at 5p.\n\nThe score (currently 9) is highly influenced by online play, and it can change in the future depending on how it plays IRL at higher player counts. The main reason it's not easily a 10 is because I have not experienced a great IRL session, only online play.\n\nThe game is easy to learn and it's pretty challenging to win (or place high) reliably, especially if you are not \"card counting\".\n\nThe heuristics to win more often are easy to understand and enjoyable to implement.\n\nThe strategy noticeably changes depending on the player count.\n\nTake 5 is currently my favorite \"nearly-pure-numbers\" board game.\n\n# BEFORE 2025-07-07\n\nPlay cards and avoid taking bull cards that show bull-head symbols.\n\nThe winner of the game is the player with the highest score at the end of a round where at least one player gets to zero points.\n\nPlayers are dealt random hands and they play cards in ascending order, in one of several rows.\n\nIf they play the fifth card in a row, they take all of the cards in that row and their score gets reduces by the number of bull heads present in that acquired row.\n\nIf a player cannot play a card in ascending order, they have the choice to take any row they want.\n\nThe game is heavily luck based, however there appears to be \"some\" tactics/strategy that can help mitigate unlucky hands and events.\n\nI'm not quite sure what strategies are very successful at the moment, but I got the heavy impression that the game could be enjoyed casually.\n\nPlaying this game with a more serious tone seems possible, but at that point I believe the winner would heavily be determined by luck.",
    "timestamp": 1753048800
  },
  {
    "username": "JuddBanann",
    "rating": 10.0,
    "comment": "Great game for 6 people in professional variant",
    "timestamp": 1751320800
  },
  {
    "username": "jappie2005",
    "rating": 10.0,
    "comment": "104 card sleeves 56 x 87 (UltraPro Standard American)",
    "timestamp": 1750543200
  },
  {
    "username": "capt_neb",
    "rating": 10.0,
    "comment": "All-timer!",
    "timestamp": 1748988000
  },
  {
    "username": "oursino",
    "rating": 10.0,
    "comment": "Ambiance garantie.",
    "timestamp": 1744840800
  },
  {
    "username": "vladar95",
    "rating": 10.0,
    "comment": "mini",
    "timestamp": 1742943600
  },
  {
    "username": "EpicFrenzy",
    "rating": 9.6,
    "comment": "Simple yet highly dynamic depending on player count. Tactics and professional variant really add some skill to this game.",
    "timestamp": 1741302000
  },
  {
    "username": "Fingoldfin",
    "rating": 9.5,
    "comment": "(The boxes of the \"Fractal\" edition is too small and the cards with sleeves do not fit. The \"Buró\" edition is better)",
    "timestamp": 1741215600
  },
  {
    "username": "eVcLm",
    "rating": 10.0,
    "comment": "Quick to teach, quick to learn, fun immediately. Has been a hit with everyone I've played it with, even those with little board game experience. Candidate for moving up to a 10 with some more play.\n\nApril 24: continues to be a hit with every group, 3 people have gone on to buy their own copies after playing. Moved to 10\n\nMarch 2025 - no change to the rating here this is one of my all time favourites",
    "timestamp": 1741042800
  }
]