[
  {
    "username": "suekuku",
    "rating": 1.0,
    "comment": "I've only played this once and it was with two experienced players: a friend and boyfriend (now hubby). Hubby owns this and Iron Dragon.\n\nIt is so loooooong. I didn't know what I was doing. They did. It was tedious to the nth degree..\n\nThere are some games I don't like to play very much (plain Catan is one) but I will play them. Not this. I told my hubby \"no more of those damn crayon games!\" So he and his friend will plan a special night to play these crayon games together.\n\nUgh. I'm sure if I played it more, studied more, I would maybe enjoy it. But there are so many other games I don't play enough, so I'm not wasting any more time on these games.",
    "timestamp": 1497909600
  },
  {
    "username": "RobRose",
    "rating": 1.0,
    "comment": "Rated a 1 only because the programming won't let me give it a zero.",
    "timestamp": 1102719600
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not my theme",
    "timestamp": 1635199200
  },
  {
    "username": "Shampoo4you",
    "rating": 2.0,
    "comment": "Made terrible by the random event cards.\n\nOtherwise it would be a good game.",
    "timestamp": 1424041200
  },
  {
    "username": "Procyon_lotor",
    "rating": 3.0,
    "comment": "Thrifted $4",
    "timestamp": 1688508000
  },
  {
    "username": "rgtft",
    "rating": 3.0,
    "comment": "The crayon rails games haven't aged well.",
    "timestamp": 1586815200
  },
  {
    "username": "wizcreations",
    "rating": 4.0,
    "comment": "The pacing in this game is entirely off putting. It starts slow, stays slow, and by the time you have a train network fully established across Europe, you’re not even halfway to the end-game condition in money. Every time a player delivers a contract, the game stops so the player can identify the demands of his new card and see what can be done this turn to help accomplish it. This game needs some serious house rules to make it playable, at which point you may as well play any one of a number of different train games that have inherently solved these problems and are far better.",
    "timestamp": 1667689200
  },
  {
    "username": "John Rogers",
    "rating": 4.0,
    "comment": "An educational game for the whole family. Geographicly accurate and city names in their origanal language. Downside is that it typically takes much longer than Empire Builder.\n\nWIFE RATING - 4\n\nSold.",
    "timestamp": 1635544800
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "Never played it and probably never will.",
    "timestamp": 1750888800
  },
  {
    "username": "jgoyes",
    "rating": 5.0,
    "comment": "2023-06-05\n\nInitial Rating: 6.0 (May 2023)\n\nMy desire to play Eurorails was low, but only because it's a long game and you have to draw on the board (which I dislike). Around 10 years ago, I played Iron Dragon, and we didn't finish it. After finally playing Eurorails, I can say it's a fun game, but we played the short version and it still took several hours to end.\n\nEurorails' rules are easy to teach as they are very straightforward. You can explain them in under 6 minutes. Playtime is around 5 hours.\n\nThe theme of Eurorails, as the name suggests, revolves around building railways across Europe and then picking up and delivering goods. I'm not a fan of railroad games, but the theme works well in conjunction with the game's mechanisms.\n\nThe game's components aren't the best, but you have to keep in mind that this is a 1990 game. The game board is sturdy, but I dislike having to draw on it as I feel it will degrade the game eventually. The game comes with lots of small tokens that are hard to keep organized in the tray, so it's better to bag them. It has paper money. The game is now VERY expensive, and I have a new copy, but none of my friends is willing to pay what it cost me.\n\nWhen a friend was explaining the rules, I thought I was going to be very bored by the game, but I was pleasantly surprised. Even though the game's decisions aren't very deep, I was engaged all the time. I was even against ending the game early, as proposed by a friend. The goal is to be the richest player at the end, and the game ends when a player has accumulated 250 million dollars and connected all but one of the major cities in the network. On a turn, players can move their locomotive on the board a certain number of spaces. Locomotives can be upgraded to be faster and to handle more goods at the same time. Once a locomotive passes over a city or town, the player can load their train with the goods produced in that location. Players have 3 demand cards at all times, and the idea is to deliver the goods shown in the cards to the corresponding cities. After this, players can build infrastructure. The game is fun and engaging, but its complexity doesn't lie in deep decisions. Instead, there is a lot of information thrown at players, so initially, the turns were slow as players planned the best routes to build. I generally don't like pick-up-and-deliver games, but I had fun playing Eurorails. I enjoyed the puzzle-like nature of finding the most efficient routes and optimizing the deliveries. I cannot deny that. As I mentioned before, I don't feel the game's decisions are hard to process. The hardest thing is to create an effective network, but that depends on the contracts. Therefore, players familiar with the game will have a HUGE advantage. There are cities in the game that allow for an easier time when delivering, and there are cities that appear more often in the demand cards. Having this knowledge is important to create an effective network, but that knowledge comes with experience playing the game. Similarly, from my perusal of the deck (after we finished), it seems that some cities are not worth connecting as they have very few demand cards and are far away from anything. This doesn't seem balanced, and only hard-earned knowledge can mitigate this.\n\nThe luck factor is high in the game. While players have control over their route choices and the goods they pick up, they don't have much control over the cards they draw. In our game, the player who won often discarded demand cards until he found cards that had synergy between themselves. As the cards appear randomly, this can happen quickly or slowly. Besides this, there are some event cards that are unbalanced and (probably) affect only 1 player at random. For example, a player was about to deliver a certain type of goods, and just because of an event, that good's value increased for the next delivery. This wasn't planned; it just happened, and I dislike this. Other events are very harsh (you can get infrastructure destroyed just because), and it's pure luck whether you get hit by one of them or not. In summary, I heavily dislike the random nature of the events, even if they do mimic real-life events. They aren't fair or balanced at all.\n\nBest with 3 fast players, with more the downtime is too much AND the playtime is also too much. I cannot imagine playing a 5-player game.\n\nThe replay value of Eurorails is quite high. Each game will be different due to the cards and the way players build infrastructure.\n\nBottom line, Eurorails is a fun game that offers enjoyment and engagement. It surprised me that its rules were concise and easy to grasp. Sadly, it's too long for what it offers, and the luck factor is also very high. I also heavily dislike that I have to write on the board, as I feel it will eventually damage the game. I will sell my copy of the game as soon as possible, but I confess that Eurorails is better than expected, and I would like to play it again if only it wasn't so long.\n\nCurrent Rating: 5.0",
    "timestamp": 1686002400
  },
  {
    "username": "Fencejummper",
    "rating": 5.0,
    "comment": "Very dry pick up and deliver.",
    "timestamp": 1613602800
  },
  {
    "username": "mattgoal",
    "rating": 5.0,
    "comment": "I enjoy this game, but don't play it in person anymore. It is too long with too much down town.\n\nI do regularly enjoy an online or computer version of the game.",
    "timestamp": 1577314800
  },
  {
    "username": "enola7277",
    "rating": 6.0,
    "comment": "$50",
    "timestamp": 1759701600
  },
  {
    "username": "gmcnish",
    "rating": 6.0,
    "comment": "Pleasant enough. I enjoy pick up and deliver type games, there’s something satisfying about them. But it goes long, and not much happens.",
    "timestamp": 1749679200
  },
  {
    "username": "Unitoch",
    "rating": 6.0,
    "comment": "Another good entry in the crayon rails series. Comments from the original Empire Builder title apply here as well: this is a mathy train network building game that is a good deal more fine-grained that most modern game design. Nonetheless, it's a unique experience that isn't really outmoded by any modern title. The fine-grained economics and spartan emphasis on route-drawing work well with the game as it's designed, and there's just something nice about building a new rail system.\n\nI'm no series expert, but my one play of this map was just as good as any other in the series. Neat rules with the Chunnel and ferries. Map seems reasonably well-balanced.",
    "timestamp": 1748296800
  },
  {
    "username": "KatydidWonders",
    "rating": 6.0,
    "comment": "2-6",
    "timestamp": 1746136800
  },
  {
    "username": "Gwydion19",
    "rating": 7.0,
    "comment": "A regular in the Mayfair rail games rotation.",
    "timestamp": 1737068400
  },
  {
    "username": "jBullfrog",
    "rating": 7.0,
    "comment": "I really liked this game, though it takes a pretty big chunk of time. Has a good amount of depth and tension throughout. Wouldn't mind checking out some of the other crayon rail games as well",
    "timestamp": 1714082400
  },
  {
    "username": "NGDedrick",
    "rating": 8.0,
    "comment": "Almost exactly the same game as Empire Builder but on a Europe may. Probably a little harder for most people as the geography is less well known in the US.",
    "timestamp": 1738537200
  },
  {
    "username": "Migmeister",
    "rating": 8.0,
    "comment": "Excellent condition despite it's age.\n\nSome whitenings on corners. Everything accounted for in excellent condition. We did play it, but it feels unplayed!\n----------------------------------------\nFinally, a new map for the our Crayon rail game. We love those, it's quick to learn, not easy to master. But we reached a point were we are not playing with the event cards anymore. We are getting good, and when you play game with 4 players or more, there is too many coming out and it became who got it less by the cards... won.\n\nSo now, we just play the game with the 3 common delivery list. We love it.",
    "timestamp": 1733871600
  },
  {
    "username": "rlong007",
    "rating": 9.0,
    "comment": "Played 3 player with 3rd edition, and am convinced 3 players is the way to go. It gives you just enough time to figure out what you're doing. Was a lot of fun!\n\nPlayed 3 player last night with 4th edition. WAY more difficult to gain any sort of momentum than 3rd which I enjoyed but it did make it go longer, which isn't great. Overall it went over very very well!",
    "timestamp": 1696197600
  },
  {
    "username": "NvidiaJunkie",
    "rating": 8.5,
    "comment": "The low rewards for basically all contracts adds a level of difficulty that really kicks up the requirement of keeping your efficiency game together.",
    "timestamp": 1689976800
  },
  {
    "username": "torak",
    "rating": 10.0,
    "comment": "First version",
    "timestamp": 1701385200
  },
  {
    "username": "ketchup61925",
    "rating": 10.0,
    "comment": "MY COPY\n4th Edition, with colored cards and chips",
    "timestamp": 1655935200
  }
]