[
  {
    "username": "dtmoney75",
    "rating": 1.0,
    "comment": "1 Play\n\nPlayed at: 5",
    "timestamp": 1729548000
  },
  {
    "username": "darkfinale",
    "rating": 1.0,
    "comment": "Seems fun at first glance, however there are best moves in auctions which people can race to take, in turn order, and hence doesn't appeal to me again. The mechanics are quite broken for me and hence would not be interested to play again.",
    "timestamp": 1698706800
  },
  {
    "username": "vikings40",
    "rating": 1.0,
    "comment": "Pure garbage...?",
    "timestamp": 1545865200
  },
  {
    "username": "dannycafe",
    "rating": 1.0,
    "comment": "Please consider this and believe in me before you are willing to have one.\nThis is an auction game with various method. In fact, no matter the method is, the bidding price is majorly depending on the valuation. Then it is important to add make the valuation not so certain but however the game mechanism fails. Turns out the bidding prices will go to some range that I can get benefit and the player playing the card is earning an amount of money not so different from me. In conclusion, a money splitting game. And there is no way to prevent the leading player to earn money when you want to earn too. How about forming an alliance by playing new cards to change the valuation? It is much more risky and earning easy safety money. Someone who first must earn less.\nIf you enjoy a long time, monotonic money splitting game, try this! Enjoy an game that you know you are losing due to some random stuffs and snowball not later than the half of the time.",
    "timestamp": 1487718000
  },
  {
    "username": "rabid_schnauzer",
    "rating": 1.0,
    "comment": "This is the game that convinced me Knizia is vastly overrated.",
    "timestamp": 1413842400
  },
  {
    "username": "LosSchabossDragon",
    "rating": 1.0,
    "comment": "Awful theme, as if art was only art if it was being sold for much Coin at a Gallery or an Auction house. Distasteful if not maddening. If i ever get one i would burn it.",
    "timestamp": 1341093600
  },
  {
    "username": "Der Ubermolch",
    "rating": 1.0,
    "comment": "This game is an exercise in narcolepsy for me. Dreary deary dreary. I have more fun losing at Uno than I do winning at Modern Art.",
    "timestamp": 1149631200
  },
  {
    "username": "latschediwes",
    "rating": 2.0,
    "comment": "Rating the product, not the game:\n\nThe CMON edition has high quality components, it even comes with an easel and a gavel with a strike plate, and all parts look and feel premium. It's just that the CMON has not the satirical quality that comes with shitty art, i.e. it's totally missing the point.",
    "timestamp": 1760306400
  },
  {
    "username": "azeem",
    "rating": 2.0,
    "comment": "This game really did not work for me. I don't understand what the appeal is, except possibly as a party game.\n\nMy fear going into Modern Art is that it would be auctions for the sake of auctions, and it would have a big problem with \"incrementing by one\". Both of these fears were realized.\n\nHere are some of the reasons I dislike Modern Art:\n- What players are bidding on is uninteresting. Every turn, there is one painting, sometimes two.\n- The different auction styles don't seem relevant. I think the game would work fine if everything were an open auction, but it would be more boring.\n- There is nothing to do besides the auctions. The auctions aren't a part of a grander game (like in Power Grid), the auctions ARE the game. Neither the rewards nor the auction mechanisms are strong enough to sustain this. (Contrast this with Taj Mahal, which is 12 rounds of auctions, but with a fascinating mechanism that also ties in nicely with network building.)\n- The outcome of the auctions does not affect the market. As soon as a player puts a painting up for auction, it counts toward the artist for that round. It does not matter who wins the painting, and there is no option to \"trash\" a painting or otherwise influence its artist's rank.\n- Players give their money to other players, not to the bank. So bidding something up when you don't want it is not that much of a factor. I think this would work better if the goal of the game were not to have the most money, but instead if money could somehow be used to acquire victory points. (Contrast with The Estates for an auction game where players pay money only to one another, with terrific execution.)\n- Too long. Why four rounds? The numbers get higher, but the rounds don't become any more interesting. To make things interesting, where there are so many different artists that some of them will not score, means the rounds would have to go on much longer.\n\nI understand this is an early Knizia title, but it does not have any of the Knizia magic. The only thing that makes me feel like it is a Knizia design at all is the fact that an artist will not score for a season where they were not in the top 3, regardless of the earlier history. Otherwise, there is nothing that is special or even remotely noteworthy in Modern Art.\n\nI think this would be fine as a 2-round party game, where the point is for players to get into character and talk about the paintings and roleplay auctioneers. But as a 4-round strategy game, this gets old very fast, and it doesn't have the mechanical core to hold up that long.\n\nWere I to ever play again, I would try to end the game as fast as possible to minimize the suffering.\n\nTo my surprise, I preferred Modern Art the Card Game. The card game obviates the auctions, and puts an emphasis on hand management, which is what I think the real focus of Modern Art is anyway.\n\nSimilar to Terraforming Mars, I think Modern Art has a lot of objectively poor design choices. But for many people, the whole package works, and that's cool!\n\nI dislike Modern Art in real life, and I dislike the Knizia game too.",
    "timestamp": 1734303600
  },
  {
    "username": "BestBunza",
    "rating": 2.0,
    "comment": "Bad, boring, bye.",
    "timestamp": 1671490800
  },
  {
    "username": "dpbernath",
    "rating": 2.0,
    "comment": "Did not enjoy our one play of this game, but then I tend to HATE auction games in general, so bear that in mind when looking at my rating",
    "timestamp": 1558216800
  },
  {
    "username": "imoo",
    "rating": 2.0,
    "comment": "邦題：　モダンアート",
    "timestamp": 1441317600
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "* Played 2 times. Heavy strategy. It is an auction game, but an auction game with a lot of complex evaluation. Not for the faint of heart. I feel it's quite and I loathe the artwork. Pretty ironic for an art game. =)",
    "timestamp": 1416697200
  },
  {
    "username": "elmobarney",
    "rating": 2.0,
    "comment": "couldnt even finish the game was so boring and took so long. Modern art card game is soo much better",
    "timestamp": 1408831200
  },
  {
    "username": "ssuu_elen",
    "rating": 3.0,
    "comment": "It’s not a strategic game at all.",
    "timestamp": 1760220000
  },
  {
    "username": "BrambillaFumagalli24",
    "rating": 3.0,
    "comment": "I like cards only, the rest of the game absolutely boring, selled very fast",
    "timestamp": 1747692000
  },
  {
    "username": "parpari",
    "rating": 3.0,
    "comment": "After 10 plays, it is a very cleaver game for it's time because how it has multiple types of auctions and good thematic ties. However; I do not like because if there was experience gap between players, less experience players are going to hand a game to other player which there is no way to stop it. If all players have almost the same experience plays the game together, the luck of draw is going to be huge factor for winning.",
    "timestamp": 1729288800
  },
  {
    "username": "Quayde",
    "rating": 2.5,
    "comment": "I do like Knizia. I do not like auction games. The latter won out here as - though it is a clever design - I have found the game dull and painfully slow to play. Give me Medici any day.",
    "timestamp": 1681336800
  },
  {
    "username": "jmsmith2434",
    "rating": 3.0,
    "comment": "Random luck fest. But at least it is short, so you can play something better soon.",
    "timestamp": 1680991200
  },
  {
    "username": "noel344",
    "rating": 3.0,
    "comment": "Fairly dull and aged badly",
    "timestamp": 1673305200
  },
  {
    "username": "Lordstrategos777",
    "rating": 3.0,
    "comment": "Not really a commodities game (like Star Cartel) and not really a bidding war (like Stockpile) but an appreciating auction game. Since there’s no possibility of values crashing and values go up at the end of a round not with each auction there’s less tension, excitement, or fun here than other similar games.\n\nIf you want a game with rising (and falling) values stick with Star Cartel for trading commodities and Stockpile for bidding wars. If you want something in between try this I guess.\n\nI hope to give this more plays in another version. CMON version has tiny money tokens and UGLY artwork (modern art, figures). Maybe my opinion will change.",
    "timestamp": 1645657200
  },
  {
    "username": "boettler",
    "rating": 3.5,
    "comment": "I rarely like bidding games. This is no exception. Will only play if there is no other option.",
    "timestamp": 1749506400
  },
  {
    "username": "kniziagamer",
    "rating": 4.0,
    "comment": "Each round starts with totally unknown values of the paintings and shortly before round end the values are obvious most of the time.\n\nAs a consequence how much you bid early is just betting and how much you bid late is just math.\n\nThere‘s also only little agency with the card play, especially because the game only plays well at 4-5p.\n\nThe different auction types are really fun though.",
    "timestamp": 1724364000
  },
  {
    "username": "Daniel109",
    "rating": 4.0,
    "comment": "The art is beautiful and auction mechanics are generally super fun for me, but wow this design has some serious issues. First and foremost, you are completely at the mercy of whichever cards you draw round to round. The double auction cards are simply the most valuable, and in my experience, winners of this game are typically the ones who were able to draw the most of those. Maybe this game would feel more fair in a group where everyone was thinking about every auction mathematically, but that isn't realistic. Additionally, Modern Art can drag on way too long. High Society is a much better auction game and takes less than 15 minutes (also a Knizia design).",
    "timestamp": 1724191200
  },
  {
    "username": "Kodeir",
    "rating": 4.0,
    "comment": "Light bidding game. Balanced, but probably too much. Repeated plays have given me the impression the obsession for balance in its design has created mechanisms which constrict the players.\n\nRating: \nOptimal number of players:\n5\n3\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "MichaelaPat",
    "rating": 4.0,
    "comment": "2024",
    "timestamp": 1704668400
  },
  {
    "username": "Destrio",
    "rating": 4.0,
    "comment": "I prefer the push-your-luck auction in High Society as you just have to guesstimate at everyone's bidding cards rather than having to decide on how many victory points, or money, to auction. The rules also had a couple of players confused as to how exactly to resolve the auctions.\n\nThe art on the cards was the best part about the game for me.",
    "timestamp": 1698098400
  },
  {
    "username": "Luds",
    "rating": 4.0,
    "comment": "(Purchased from user Vuud, 2013-10-19)\n\nAuction game with art buyign theme. There is sime strategy in deciding when to sell a painting just for money, when to sell paintings that you want, and when to stop rounds. I found that the 4th round was too much, dragging too long. Not much of a fan of Medici, this one is longer, and more strategic, but not so much fun. Ra any day over these other ones.\n\n(Sold to user albon21 in Marketplace 2013-12-03)",
    "timestamp": 1695938400
  },
  {
    "username": "Mageknight12",
    "rating": 5.0,
    "comment": "Modern Art is clever in theory but dry and repetitive in practice. The constant auctions can feel tedious, and the theme doesn't do much to keep players engaged.",
    "timestamp": 1750456800
  },
  {
    "username": "Weirdsalmon",
    "rating": 5.0,
    "comment": "5/10: Modern art is a bidding/auction hand management game from Knizia that is just okay. In general, Knizia's games don't land with me. They are often cruel to beginners, have an eloquent design, and have a heavy emphasis on getting in your opponent's head.\n\nModern art feels a lot like a trick taking game in the way you have to keep track of what has been played when and by who. I just don't find that 'fun' feels a lot more like work to me.\n\nI don't hate this game; it just doesn't really excite me in any way and would be happy not to play it again.",
    "timestamp": 1746482400
  },
  {
    "username": "DragonC",
    "rating": 5.0,
    "comment": "It's somewhat of a \"meh\" game. Once you've played it a couple of times then each game is the same. And it's usually the one with the lucky draw who comes out on top.",
    "timestamp": 1746396000
  },
  {
    "username": "sireeshaaluri",
    "rating": 5.0,
    "comment": "Up to 5",
    "timestamp": 1742425200
  },
  {
    "username": "jyhuh35",
    "rating": 5.0,
    "comment": "경매의 정수, 경매의 모든것. dicetree ver.에서는 기존의 미흡했던 컴포넌트가 디럭스로 보강되었다. 예쁜 그림은 덤\n경매진행을 맡는것도, 시시각각 변하는 가치를 가늠하는것도 즐겁다",
    "timestamp": 1739660400
  },
  {
    "username": "oriad",
    "rating": 5.0,
    "comment": "i played today with playing group but nobody has enjoyed it.\n\nIt felt either too dry and abstract or without any rewards for the gamers involved.\n\nAs there was no reward of having painting as money . Even the gamer who won didn't enjoyed it .\n\nI don't have a big issue with this game but i think something did not triggered for me to make it one of my favorite or game i would play.\n\nLuck factor and style of player is way to much influencing any strategy so can be frustrating for people who plan anything also",
    "timestamp": 1737846000
  },
  {
    "username": "WingedLycan",
    "rating": 5.0,
    "comment": "Mayfair 2004 Edition",
    "timestamp": 1736550000
  },
  {
    "username": "PfrBraun",
    "rating": 5.0,
    "comment": "Modern Art – oder: Enger Rahmen. Wer Knizia spielt, erwartet und sucht den KniKni (Knizia-Kniff). Bei Modern Art sucht er sich offenkundig bei den Bietmodi – allein, die sind im Spiel eher der Knuff, der die Spielenden anstößt. Der Kniff liegt unter den ganzen Bietrunden wie der Ursprungstext im Palimpsest: Die Kombi aus Verkauf und Einkauf. Denn einerseits biete ich Karten an, um auf teuren Verkauf zu hoffen. Andererseits muss ich beim Einkauf genau kalkulieren, ob ich am Ende das Invest wieder reinhole. Nur passt der bietmodiknuffige Rahmen so gut wie eine barocke Bildumfassung um einen Mondrian. Denn der Kartensteuerungskniff wird von den Kartenverkaufsknuffs ziemlich weggeboxt. Wenn nämlich die ersten Bilder den Eindruck erwecken, dass ein:e Künstler:in diese Runde den Höchstpreis holen wird, gibt es wenig Grund, keine entsprechende Karte auszulegen. Dafür ist die Obergrenze mit fünf Karten einfach zu niedrig. Das Auslegen erinnert ein bisschen ans Piratenspiel aus der Spieltheorie: A spielt an, B bedient nicht, C bedient, D bedient nicht, E bedient. Dann kann A wieder anspielen und, zack, ist Platz 1 auf der Kunstrangliste vergeben. Legt man das zu Grunde, sind pro Runde nur 3 Künstler:innen in der Auslage. Danach braucht es Addition im Einkauf und Verkauf, um den Gewinn der Bilder zu kennen. Modern Art hat damit leider einen engen mathematischen Rahmen erhalten.",
    "timestamp": 1735426800
  },
  {
    "username": "tommayj",
    "rating": 5.0,
    "comment": "Played for the first time in 2024. Definitely feels a bit dated. Outstays its welcome on the table.",
    "timestamp": 1733871600
  },
  {
    "username": "bigfranco",
    "rating": 4.6,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "Redbeardin84",
    "rating": 5.0,
    "comment": "Auction mechanics.",
    "timestamp": 1726437600
  },
  {
    "username": "Nexoult",
    "rating": 5.0,
    "comment": "Si no piensas mucho es entretenido, si te gusta usar las mates y calcular hasta cuanto es rentable pagar o no, es un poco meh.",
    "timestamp": 1712268000
  },
  {
    "username": "johnclark",
    "rating": 5.0,
    "comment": "Played 20+ times. See my review.",
    "timestamp": 1707951600
  },
  {
    "username": "Dingus",
    "rating": 5.0,
    "comment": "I don't get the statistics of what a painting is (and might be) worth. Failed miserably at bidding.\n\n16 years later in 2024. But Betty, you only played twice!",
    "timestamp": 1705273200
  },
  {
    "username": "TheSlushySnake",
    "rating": 6.0,
    "comment": "Art-Themed, Auction Game. (4 Types Of Auctions).\n4-5 Players. (Best With 4-5 Players).",
    "timestamp": 1760047200
  },
  {
    "username": "farsidehobbes",
    "rating": 6.0,
    "comment": "A great pure auction game. It can go quickly if folks rush things through.\n\nKey thing to remember: if you pay more than half of what the art's potential price is, you lose ground against the auctioneer. Ex. you each have $100, if you pay $15 for something that will be worth $30, then the auctioneer has $115, and you have $85 which will then become $115, a net wash against that player.",
    "timestamp": 1759960800
  },
  {
    "username": "shoemoney",
    "rating": 6.0,
    "comment": "Elegant Knizia auction game. With the right group, a heap of fun. With the wrong group (it's an auction-palooza, so there's a ton of interaction, possibly LOUD), still worthwhile. I love how the game mimics the fickleness of the art market, as popularity dictates price, and the playing group controls popularity. It's not so much a matter of (potential!) valuation, which is calculable enough, as it is alternately cooperating with or competing against the other players to ultimately drive your assets' value up and your opponents' down. You get your art collection FOR FREE (donated by wealthy gallery patrons, I imagine), and it's up to you the art dealers collectively to make it worth something, or nothing. The more we've played, the more hidden layers of shenanigans and strategy we've uncovered. Survived the Great Purge of 2024 for its accessibility and versatility.",
    "timestamp": 1759096800
  },
  {
    "username": "jellyfishjoe",
    "rating": 6.3,
    "comment": "Hand management meets auctions. Some shared incentives, but most of the game is in marginal gains on the art and profitable auctions",
    "timestamp": 1757887200
  },
  {
    "username": "Jclancy15",
    "rating": 6.0,
    "comment": "There's definitely some good pricing and player interactivity going on here. It's also deceptively vulnerable to poor play kind of breaking the game, and I have yet to see a convincing explanation for why double auction cards aren't overpowered.",
    "timestamp": 1756332000
  },
  {
    "username": "Reciclerishu",
    "rating": 6.0,
    "comment": "Different types of auctions in one game - clever, interactive and amusing.\nWhile auction games are usually not my type of games, I think this does quite lot with little, but also is dependent on group you play with.",
    "timestamp": 1756245600
  },
  {
    "username": "GonkalBell",
    "rating": 6.0,
    "comment": "I love the idea of this game, but I think it's Knizia's weakest auction game. The different types of auctions are fun, and I love different artists can gain and lose popularity. However, it's still too easy to calculate how much each painting will be worth and bid the exact right amount.",
    "timestamp": 1756159200
  },
  {
    "username": "CannonFodderTed",
    "rating": 6.4,
    "comment": "There are 13,962 version of this game. Thanks Dr. Knizia. None on which, by the way, are the version I played, which was literally only a deck of cards and some number tokens. Not sure why other versions have all these other components like easels, boards, metal coins, gavels, and player screens. None of that stuff seems necessary. All you need is the cards and the number tokens and something to write down scores. Anyway, its a fun little quick filler that teaches fast and plays in about 20 minutes.",
    "timestamp": 1755554400
  },
  {
    "username": "Idiot_for_Life",
    "rating": 6.0,
    "comment": "Best at 4-5\nShort length\nAuction game where players bid on art in hopes it becomes more valuable later on.",
    "timestamp": 1752271200
  },
  {
    "username": "Hfufj748",
    "rating": 6.0,
    "comment": "04, 05, 03\nreco-bw, reco-byp, mixed-alol, reco-sb",
    "timestamp": 1751925600
  },
  {
    "username": "Tezen",
    "rating": 6.0,
    "comment": "Good bidding game, however too deterministic. The meta becomes clear after half a game, then it's just maths. I love the core mechanic.",
    "timestamp": 1751839200
  },
  {
    "username": "Vinceloke",
    "rating": 6.0,
    "comment": "New - bought RM100 (fan made pokemon edition)",
    "timestamp": 1751493600
  },
  {
    "username": "SpaceSheep4",
    "rating": 6.0,
    "comment": "Very fun auction game.\nIt has the right lenght, around 60 min, for a game of this type.\n\nThe rules are very streamlined and easy to teach.\n\nThematically it's also great. It does feel like it reflects the weird dynamics in art markets.\n\nAs a negative, it‘s very easy to „break“ the game. If a player massively overpays for something, the seller just benefits so much for it. Usually, in other games, a bad player doesn‘t really have the power to influence the winner that much. Therefore I think it‘s best to play it with a very casual and relaxed mindset and see it as an almost party game.\n\nI think Ra is the better Knizia auction game.",
    "timestamp": 1751320800
  },
  {
    "username": "CotB",
    "rating": 6.0,
    "comment": "Rankings\n66th Best Game 2021\n108th Best Game 2022\n169th Best Game 2023",
    "timestamp": 1750888800
  },
  {
    "username": "FSCB",
    "rating": 7.0,
    "comment": "Also own CMON 2024 edition for variety of cards.",
    "timestamp": 1760652000
  },
  {
    "username": "Trusty Sapper",
    "rating": 7.0,
    "comment": "Rarely, a Knizia auction game in which theme and mechanic are aligned, with the joke being on the modern art merry go round. Nothing soul expanding here but it's a perfect game in many respects",
    "timestamp": 1760047200
  },
  {
    "username": "piofernix",
    "rating": 7.0,
    "comment": "3-5 Players",
    "timestamp": 1759788000
  },
  {
    "username": "MorelliBuendia",
    "rating": 6.5,
    "comment": "Arrakis edition (European version of Dicetree's Korean edition).\n\nBeautiful components with metal coins, tiny easel and a wooden gavel. The fancy components actually help a lot in this one, it feels more immersive and thematic. Rattling the coins in your hand during a hidden auction or hitting the gavel is really cool. Playing with people who try to describe and sell you the painting really enhances the experience as well.\n\nI treat this as a filler, almost party game. It is thinky, and if someone plays poorly, they will probably lose. However, there is very little room for strategy, you can only react to what other players do, and sometimes there is just nothing you can do. Taking that into consideration, you can think of this as a game where winning is not a priority or a big deal, otherwise some games can get a bit frustrating.\n\nMogul Scale: 2/B",
    "timestamp": 1759528800
  },
  {
    "username": "kensiebensie",
    "rating": 7.0,
    "comment": "Gift from Brandon",
    "timestamp": 1759356000
  },
  {
    "username": "PickledPepperedPlum",
    "rating": 7.3,
    "comment": "Great starter game to the collection for the Auction/Market Manipulation type of activity, as values are only dictated by what people are playing at the time.\n\nHowever, if everyone embodies a similar strategy, then your max (reasonable) bid of a painting typically becomes very easy to figure out, which is my only drawback to this game. This is countered by how you choose to influence artist popularity with the cards you hold.\n\nOtherwise this game is well figured out and well executed. Be a good samaritan and sleeve these cards if you get a copy brand new. Preserve the beautiful artwork.",
    "timestamp": 1758837600
  },
  {
    "username": "Mind4u2c",
    "rating": 7.0,
    "comment": "ROATAN",
    "timestamp": 1758405600
  },
  {
    "username": "Orntt",
    "rating": 8.0,
    "comment": "Although the different types of auctions can be slightly confusing, and it takes a round for people to understand the valuations of the paintings, this is rightfully a classic game of \"playing the players\". No great mechanical complexity, just facing down your opponents and taking their money (and giving them paintings).",
    "timestamp": 1760911200
  },
  {
    "username": "ethanbg20",
    "rating": 8.4,
    "comment": "Really enjoyable - value deduction",
    "timestamp": 1760306400
  },
  {
    "username": "mrssallyintown",
    "rating": 8.0,
    "comment": "Fun, simple game. Love the gavel.",
    "timestamp": 1760220000
  },
  {
    "username": "MoMahili",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1759874400
  },
  {
    "username": "BeansForTrade",
    "rating": 8.0,
    "comment": "Better than Ra.",
    "timestamp": 1759701600
  },
  {
    "username": "turnover",
    "rating": 7.5,
    "comment": "Goodwill 3.99",
    "timestamp": 1759442400
  },
  {
    "username": "Jordan_Varbev",
    "rating": 8.0,
    "comment": "Knizia\n#3', #4**, #5**",
    "timestamp": 1759269600
  },
  {
    "username": "J_3MBG",
    "rating": 9.0,
    "comment": "Great game, pure auction game where players control the market without any real random factors involved.",
    "timestamp": 1760824800
  },
  {
    "username": "whitecatplays",
    "rating": 9.0,
    "comment": "It really is. Love how the different kinds of auctions shape the incentive space.",
    "timestamp": 1760738400
  },
  {
    "username": "strongbadia",
    "rating": 9.0,
    "comment": "X",
    "timestamp": 1760479200
  },
  {
    "username": "K_oroviev",
    "rating": 9.0,
    "comment": "Best auction game I know. Deep, engaging and fun. I’ve found that new players find the rules confusing at first, but with the right crew this game can be a blast.",
    "timestamp": 1759960800
  },
  {
    "username": "BlankPaper",
    "rating": 8.5,
    "comment": "10/3/25: A really interesting auction game. More enjoyable than Ra IMO as the decision space is more complex and social. Harder to learn though, and thus harder to get to the table. 8.5.",
    "timestamp": 1759442400
  },
  {
    "username": "viridon",
    "rating": 9.0,
    "comment": "+ Fantastic art and components\n+ Tight, various, and engaging auctions\n+/- Overall strategy can be difficult to parse\n+/- Dependent on group energy",
    "timestamp": 1759442400
  },
  {
    "username": "edsmorg",
    "rating": 9.0,
    "comment": "Dicetree edition",
    "timestamp": 1758319200
  },
  {
    "username": "antonkartashov",
    "rating": 10.0,
    "comment": "4p!, 5p!\n\nComplexity: ●●○ (medium)\nDuration: 45 mins\n\nThe best Eurogame ever: the simplest rules, maximum fun. Speculation on the prices of modern art paintings. Players buy and sell paintings from each other. You need to predict which artist will be the best-selling at the end of the round. You can win by buying up paintings from promising artists cheaply or by selling your own paintings at inflated prices.",
    "timestamp": 1761052800
  },
  {
    "username": "Drb89_",
    "rating": 9.5,
    "comment": "Auction\nHand management\n++ Simple rules\n++ Great components\n++ Favourite auction game",
    "timestamp": 1760911200
  },
  {
    "username": "darkk_",
    "rating": 10.0,
    "comment": "Auction off pieces of modern art in an effort to be the most profitable museum in the world.\n\nCaptivating ✅\nEngaging ✅\nReplayability ✅\nRules ✅\nQuality ✅\n\nMy BGG Perfect 10?\nAcquired 2+ ✅",
    "timestamp": 1760824800
  },
  {
    "username": "Tonybo",
    "rating": 10.0,
    "comment": "I love Auction games and i love this game.",
    "timestamp": 1760392800
  },
  {
    "username": "jcoopersd",
    "rating": 10.0,
    "comment": "Kinda genius? I feel like at first blush, it seems to be a game about different types of auctions. And that's part of it - but so much more of it is just this deeply opaque semi-closed economy bidding calculation. So many factors to take into account - how much am I willing to benefit the auctioneer in order to get some benefit of my own? that changes with how many players there are! If I win it, or if someone else wins it, how does it change my or their incentives for the rest of the round? How can I make my hand of paintings more valuable? Such a simple structure from which a gaggle of considerations arise.\n\nThe game does kinda suffer a bit of a randomness problem - it's very good to draw into popular artists, and getting dealt double cards is a huge advantage. It's not the worst thing though, having a little randomness.",
    "timestamp": 1760047200
  },
  {
    "username": "chessbestboardgame",
    "rating": 10.0,
    "comment": "Outstanding. A must have. Perfect game. Unlike others like Panic in Wall Street, the chaos here is perfectly organized, at any time an undercut is feasible, simple and insanly complex, multiple strategies available, no such thing as a \"bad hand\", and beautifully designed. No other words truly give credit to this masterpiece.",
    "timestamp": 1759615200
  },
  {
    "username": "theblobb",
    "rating": 10.0,
    "comment": "Also own Arte Moderno",
    "timestamp": 1759615200
  }
]