[
  {
    "username": "mutantheed",
    "rating": 1.0,
    "comment": "Rules are a bit vague but nice idea. Not as appealing to the family as it might appear.\n\nHad another look at it and it is actually just boring.",
    "timestamp": 1257980400
  },
  {
    "username": "kosterix",
    "rating": 2.0,
    "comment": "just feels too old and too flat, takes too long, and scoring is terrible.\nIf I had Concordia I would always prefer that.",
    "timestamp": 1525298400
  },
  {
    "username": "oursino",
    "rating": 3.0,
    "comment": "Je n'accroche pas au jeu. Pourtant il a de bonnes idées de mécanique.",
    "timestamp": 1744927200
  },
  {
    "username": "Kash000",
    "rating": 4.0,
    "comment": "Sold in December 2023 VFM",
    "timestamp": 1702854000
  },
  {
    "username": "Grobbs",
    "rating": 5.0,
    "comment": "I much prefer this to Small World. The auction is tighter which leads to more interesting decisions on when to decline. Open scoring makes for a better, but longer, endgame. Most importantly, having to keep a kingdom together to score changes the game dramatically.\n\nSell price: $25",
    "timestamp": 1735254000
  },
  {
    "username": "jtakagi",
    "rating": 5.0,
    "comment": "I played Small World first, but I think I just don't enjoy the core idea of so much change on the board. In games like 1960 I hated the way that you just spend a lot of turns undoing what your opponent has done. I know that it's different here, but it feels similar and I don't like it.",
    "timestamp": 1694728800
  },
  {
    "username": "enavico",
    "rating": 5.5,
    "comment": "= Like Small World, more or less",
    "timestamp": 1748815200
  },
  {
    "username": "Ryan Keane",
    "rating": 5.5,
    "comment": "I finally tried this predecessor to Small World, and I rate it half a point lower. I’ve grown a bit tired of Small World, it’s main advantage being it scratches my Britannia/History of the World itch in a fast play time, but the lack of real world setting reduces my interest. The real world map is just ok - it’s too abstracted to fit the game play needs (variety of different terrain) to interest me. Having played Vinci once, I like that it’s obvious which player you’re attacking based on pawn color, and the fact that you can get more varied combination of 2 techs vs race+ability. But SW has many improvements like clear iconography and chits with nice artwork that you can flip in decline, that help it fit in better as a solid area control family game. I generally like bash the leader games, but I totally see why they made scores HTI and fixed rounds to simplify end game decisions/negotiation - I’d say that would be the big difference in gameplay dynamics/narrative arc that will determine which you prefer.",
    "timestamp": 1748728800
  },
  {
    "username": "GeminiWeb",
    "rating": 7.0,
    "comment": "A personal favorite which I haven't played for a very long time ... deterministic combat and random civilisations, where you don't take the civilisation if you don't like it. Can lead to a bit of kingmaking and analysis paralysis at the endgame, but I don't care!",
    "timestamp": 1754863200
  },
  {
    "username": "booned",
    "rating": 8.0,
    "comment": "Very enjoyable! I think I like this more than Small world. Some notes on comparison:\n- I like the variable game length a bit more than Small World's fixed number of turns. Though Vinci ends up being a longer experience.\n- I think I like the open scoring in Vinci better than Small World's hidden but trackable scoring, or at least I don't mind it like some people. Yes, people can \"bash the leader\", but that's part of gaming. Besides, isn't it better to know you're bashing the leader, instead of guessing the person you're bashing is the leader, and being wrong?\n- I guess technically the game is slightly more complicated, because you have to remember that mountains don't score points and add +1 to defence and attack, and forests do score points and add +1 to defence but not attack. And you have to worry about your civilization splitting. But it's all pretty intuitive so it doesn't bother me.\n\nSmall World is fine, but I'd love to see (but will never see) a Vinci 2.0 (or I guess 3.0) with:\n- More maps than just Europe.\n- Larger civilization power tokens to make them easier to read across the table. We always tend to forget everyone's special abilities.",
    "timestamp": 1755468000
  },
  {
    "username": "guimel",
    "rating": 8.5,
    "comment": "Not for trade. Very good condition. French edition. English rules available on Yucata.de games site at this link:\nhttps://www.yucata.de/en/Rules/Vinci\n\n3 players minimum but 2 player variant in files on BGG. Medium light game. SdJ recommended. Very high ranking on BGG 7.1. For trade due to minimum player requirement.\n\nAwards nominee:\n2000 Spiel des Jahres Recommended\n2000 International Gamers Awards - General Strategy; Multi-player Nominee\n1999 Meeples Choice Award Nominee\n2000 Deutscher Spiele Preis 3rd Place.\n2000 International Gamers Award Best Strategy Game Nominee.\n2000 Golden Ace Nominee.\n1999 Concours International de Créateurs de Jeux de Société Winner,\n\n2 player variant rules in BGG files at this link:\nhttps://boardgamegeek.com/filepage/321/vinci2rulespdf\n\nMember @sa266 comments about 2 player game:\nThe game is very similar in feel to a 4 player game. For a 2 player game with 2 civilisations each, you have two different colours, and are effectively playing a 4 player game, with 2 each. You alternate turns with your opponent, so if you're playing red and green and your opponent white and yellow, the turn order would be something like red, white, green, yellow, and remain that order throughout the game. You are allowed to have your 2 civilisations next to each other, and even attack each other. As it's effectively a 4 player game, all rules for base tokens per civilisation and points to play to follow the four player rules.\n\nWhen the game ends the score per player is the SUM of the two scores of their civilisations. (This is to stop you using one civilisation to nuke your opponent, while just scoring with the other, as might happen if it was just the best civilisation that counted). Ties are broken by who has the highest score with their best civilisation.",
    "timestamp": 1754172000
  },
  {
    "username": "waterborg",
    "rating": 9.5,
    "comment": "Much, much, much, much better than Smallworld.",
    "timestamp": 1736982000
  }
]