[
  {
    "username": "Glutony",
    "rating": 1.0,
    "comment": "Very clearly a product of it's time. The movement is awful and random which leads to players just chasing each other in loops and the battle system is painfully slow. I get that players are supposed to make deals but most of the time the armies are fairly even due to the movement being random and troops only being tier 1 because of it. So there isn't really an incentive to forfeit. This leads to 20 minute battles where everyone else has to sit around and do nothing where the players involved duke it out on a separate battle board. I don't think I have ever finished a game of this and probably never will.",
    "timestamp": 1740351600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "It's basically Sorry with a more complicated board. Landing on someone is a huge advantage, so often that army surrenders without a fight, unless it's incredibly lopsided. Both tabletop RPGs and strategy computer games have done this better in the upcoming decades.",
    "timestamp": 1722031200
  },
  {
    "username": "Sortrose",
    "rating": 1.0,
    "comment": "Extremely long and complex roll and move game in which players are fighting each other. When a fight takes place, the involved players will have to set up another game (a dice roll competition) and play it out while the rest of the players wait until done (potentially for a looong time, so they better bring a book).",
    "timestamp": 1720994400
  },
  {
    "username": "TheWellbeingGamer",
    "rating": 1.0,
    "comment": "Not my sort of game. Quite tedious and can be far too long.",
    "timestamp": 1643756400
  },
  {
    "username": "vestrial",
    "rating": 1.0,
    "comment": "This was the first and I think only pure war game I ever played.\n\nThe genre just does not hold any appeal for me.",
    "timestamp": 1386370800
  },
  {
    "username": "wysczy",
    "rating": 1.0,
    "comment": "the most poor component I ever seen.\nas if you purchase a box of rubbish.",
    "timestamp": 1314655200
  },
  {
    "username": "Grumbling Grognard",
    "rating": 1.0,
    "comment": "Where to start... Random... Boring... Too Abstract... Tremendious length of game... Elimination rule... Little strategy... Waste of tree pulp. OMG, just noticed the 240 min listed on this game. I must have booked a dozen games of this back in the 80s NONE was ever under 4 hours and I honestly don't ever remember finishing one as someone would always give up after the marathon of random-ness.",
    "timestamp": 1292799600
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "Roll a die to move. Collect chits. When you randomly enter another's space (because you rolled it), roll dice and roll dice and roll dice and roll dice and roll dice and.... until somebody's chits are gone. Continue the above for 3 hours.",
    "timestamp": 1286661600
  },
  {
    "username": "gavingva",
    "rating": 1.0,
    "comment": "If you're in a three player game and are knocked out... time to grab a book or video while the other two have fun for the next couple of hours. The elimination rule makes it a 1 rather than a 5.",
    "timestamp": 1224280800
  },
  {
    "username": "nickjost",
    "rating": 1.0,
    "comment": "Game is:\n* Slow\n* Has an irritating board that provides less than optimal information\n* A dice fest with limit zero strategy.\n\nThat it is played at all is beyond my ken.",
    "timestamp": 1060380000
  },
  {
    "username": "Kodeir",
    "rating": 2.0,
    "comment": "On my first play I found it interesting and original, mainly thanks to its \"fog of war\" mechanism, though had the feeling it dragged a bit.\n\nA few games later and I'm forced to admit it: it drags. With two players its length is tolerable, if still on the long side, but with more players it's boring, plain and simple. If a four player game could somehow be finished in an hour, maybe two, it would be awesome. As it stands, it never gets played.\n\nTitan was cool and innovative when it was released. Nowadays, it's overly long and straight up boring. That said, the game speeds up a lot when playing a digital version against A.I. opponents, so you may want to give one of those a look.\n\nRating: \nNumber of players:\n2\n4~6",
    "timestamp": 1709334000
  },
  {
    "username": "Victoria_hermit",
    "rating": 2.0,
    "comment": "Monster fights after fight after fight after fight... You want to lose so you can go off and do something interesting like bathing your cat or scraping gum off the bottom of your shoe.",
    "timestamp": 1667689200
  },
  {
    "username": "James_Briggs",
    "rating": 2.0,
    "comment": "Lets all form a conga-line on the outer ring!",
    "timestamp": 1625263200
  },
  {
    "username": "Andrei Shlepov",
    "rating": 2.0,
    "comment": "Какой-то фэнтези-дарвинизм без малейшей литературной подоплеки. В школе был бы в восторге от подобной игры, но сейчас ни малейшего интереса.",
    "timestamp": 1545865200
  },
  {
    "username": "maggico",
    "rating": 2.0,
    "comment": "You wander here and there hoping to create your own army of monsters, hoping to confront someone. Not a good game to have a night with friends.",
    "timestamp": 1544223600
  },
  {
    "username": "ciggie",
    "rating": 2.0,
    "comment": "Fantasy, war/fighting, roll & move, nothing to do on someone else's turn, and impossible to keep track of your own pieces means this game is nothing but an unenjoyable slog. I'll find just about anything else to play.",
    "timestamp": 1473890400
  },
  {
    "username": "Salamon",
    "rating": 2.0,
    "comment": "Three plays and I still can't see what the fuss is about. I have not enjoyed it at all.",
    "timestamp": 1446850800
  },
  {
    "username": "iskerisky",
    "rating": 2.0,
    "comment": "All-but broken in my mind.",
    "timestamp": 1440799200
  },
  {
    "username": "Chris Barnard",
    "rating": 2.0,
    "comment": "Due to all the hype and price gougers on BGGM prior to it's reprinting, I was staggered on my first play by how poor this game really was. Heavily luck-based and endlessly repetitive. It's a long game with a lot of downtime and early player elimination.",
    "timestamp": 1431122400
  },
  {
    "username": "mgreen02",
    "rating": 2.0,
    "comment": "This is a memory test of stacks and patterns. Takes ages, too much down time. Never enjoyed it. Definitely one of the games that got a reprint for nostalgia reasons: it can't compete with modern designs.",
    "timestamp": 1424127600
  },
  {
    "username": "Galatolol",
    "rating": 3.0,
    "comment": "Similar to a PC game Heroes of Might and Magic (probably one of the inspirations): you roam around the map, recruit troops and fight battles on a separated map.\n\nThe game has some charm, but it also has a lot of problems. I don't even mean the roll to move mechanics, it is kinda exciting and it stops you from targeting the weakest player too easily. But you have huge downtime (at some point all 3 players after me were conducting battles and I was an observer for 40 minutes), player elimination, very snowbally (both in terms of troops on the main map and during battles).",
    "timestamp": 1739660400
  },
  {
    "username": "BackIssueBacklog",
    "rating": 3.0,
    "comment": "Overall a very intriguing concept that turns into a real slog. Reminiscent of one of my all time favorite PS1 games.\n\nI am a little harsh on Titan but only because I want it to be the greatness that it could... if it didn't take upteen hours.",
    "timestamp": 1730761200
  },
  {
    "username": "Pessoatukan",
    "rating": 3.0,
    "comment": "Great, old fashioned game, but it's best with two players - in bigger group the player elimination becomes a problem, because of the game lenght.",
    "timestamp": 1707346800
  },
  {
    "username": "Citery",
    "rating": 2.5,
    "comment": "I tried lying to myself, and it worked for a while, but after mulling over a dozen digital plays and a few in person plays I've had to accept the fact that Titan just isn't what I want it to be. The promise of epic, 80's-style fantasy warfare was just too intoxicating I guess.\n\nMost of Titan's runtime is consumed by a painful, laborious process of pushing your stacks of cardboard chits around to gather up more cardboard chits, a process that manages to be both unrelentingly calculational due to the complexity of the master board and muster chart, and overwhelmingly arbitrary because of the roll-to-move system. Sure, an expert player may be able to maneuver across the board and muster units with stunning, graceful odds-mitigation, but for any ordinary human being these turns will be arduous and protracted as you figure out what the hell the game will even allow you to do this turn. It doesn't help that so much of this is dependent on memory, as Titan gives you almost nothing to track what units are in what legion beyond a cutesy symbol; every one of your half dozen legions will have to be picked up and fiddled with every turn, and it's a pain in the ass.\n\nOccasionally, though, the monotony is broken by a tactical little dice-chucking mini game that only involves two players at a time. Everyone else just has to sit around and get their thumbs a-twiddling for the twenty or thirty minutes it may take for those two idiots to stop having all the fun. The whole concept of \"zooming-in\" on the board and resolving a battle as a sub-game is undeniably cool, but when put into practice with actual humans sitting at the table it becomes apparent how absurd the suggestion is, and how laughably dated.\n\nIn spite of the logistical concern of leaving half the table unable to play the game, the actual tactics on the battle boards are interesting. But it's disappointing that the personalities of all the pulpy fantasy creatures are abstracted away to just two number values in combat; aside from one specific unit there are no special abilities or thematic asymmetries anywhere in your legion, just more or less dice or a marginally higher or lower hit percentage. You work so hard to claw your way up the muster chart to recruit these colossal beasts; having that effort be rewarded with just a slightly larger integer is more than a little deflating.\n\nAnd all of this will take hours and hours. Maybe if I had grown up in the 80's and had all the time in the world to blow on playing Titan I would understand why this is so adored by so many, but I didn't, and I don't. Sorry Titan, I loved the idea of you.",
    "timestamp": 1696629600
  },
  {
    "username": "williewhale",
    "rating": 3.0,
    "comment": "Found the original AH version in a thrift store.",
    "timestamp": 1694037600
  },
  {
    "username": "lexen",
    "rating": 3.0,
    "comment": "Grand scale strategy and small scale tactics all in one game... somewhat because the dice lead the way on the main board a liilte to much.\nwanted very low, Valley edition.",
    "timestamp": 1675292400
  },
  {
    "username": "madziar",
    "rating": 3.0,
    "comment": "Where it is?",
    "timestamp": 1663711200
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not for me",
    "timestamp": 1628719200
  },
  {
    "username": "joebelanger",
    "rating": 3.0,
    "comment": "There is a lot of game here. I feel like my rating could go up with more plays.",
    "timestamp": 1610406000
  },
  {
    "username": "Weaks",
    "rating": 3.0,
    "comment": "Tedioso juego de monstruos. Una matriz, movimiento azaroso y combates sin lógica real, porque simulan criaturas fantásticas.",
    "timestamp": 1610319600
  },
  {
    "username": "emcglohon",
    "rating": 4.0,
    "comment": "",
    "timestamp": 1701558000
  },
  {
    "username": "SplinterBlade",
    "rating": 4.0,
    "comment": "Titan feels nostalgic even if it's your first time playing. It also feels a tad dated, though. The roll and move is still a little annoying even when you're just moving across different terrain types - some kind of resource to spend to modify rolls and pick up that last creature you need would be nice. But while I want to blame this game for random dice rolls, my friend who's played it more beats me all the time. So there's something in that.",
    "timestamp": 1680300000
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "intrinsic interaction\n\n abated agency via dumb dice\n dizzying downtime\n prolonged playtime\n\nI can be convinced to play this as a 2-player game, or if the multiplayer rules are altered to end the game at the end of the round a titan is killed, and the player with the most points wins.\n\nBetween the roll and move mechanism, trying to remember hidden-trackable-information about what creatures your opponents recruit to create favorable combat situations, and the Chutes and Ladders style movement where you frequently have uninteresting choices to make when moving, but also being forced to move if you want to increase your stack/win, this game is a crapshoot.\n\nThe tactical skirmish combat on the small boards is the best part about the game, so I'd rather play a game that's just that, or that with something innovative added.",
    "timestamp": 1648076400
  },
  {
    "username": "halbower",
    "rating": 4.0,
    "comment": "It's going to take a few more plays to figure out if I like this or not.",
    "timestamp": 1644793200
  },
  {
    "username": "LesPatatas",
    "rating": 4.0,
    "comment": "4 Players: 2v2 - 1 Game",
    "timestamp": 1587679200
  },
  {
    "username": "crimsondynamo",
    "rating": 4.0,
    "comment": "Played a few times, got my butt kicked. Not sure if I like the recruitment and movement.",
    "timestamp": 1511305200
  },
  {
    "username": "dancingdanslc",
    "rating": 4.0,
    "comment": "DIGITAL PLAY:\n\niPad Air\nAmeritrash fantasy war game. Does not hold up after time. Too long, over complicated dice fest boring!",
    "timestamp": 1500760800
  },
  {
    "username": "DeeCeptor",
    "rating": 4.0,
    "comment": "Fantastic theme! Building an army monsters and fighting is so cool!\nGood battles and theme unfortunately can't save it from some extremely poor attributes.\nBattles only occur between 2 players, meaning other players have to sit out for long periods of time.\nPlayers can be eliminated early, and the game can last 3+ hours. Elimination is a requirement for the game to end.\nOverall it takes far too long for what it is.",
    "timestamp": 1480201200
  },
  {
    "username": "mpalframan",
    "rating": 4.0,
    "comment": "Long with lots of down time, there are better games to play in this amount of time.",
    "timestamp": 1451862000
  },
  {
    "username": "gamezendo.com",
    "rating": 4.0,
    "comment": "Lots of combat to little effect",
    "timestamp": 1449788400
  },
  {
    "username": "MrNobody012",
    "rating": 5.0,
    "comment": "I played this once and had an absolute blast. In the last 30 minutes. The first 7 hours were a bit of a slog.",
    "timestamp": 1732143600
  },
  {
    "username": "wizardless",
    "rating": 5.0,
    "comment": "sigh.",
    "timestamp": 1713736800
  },
  {
    "username": "jormungandr",
    "rating": 5.0,
    "comment": "Didn't really care for the way movement worked or the length of play, though the tactical battles occasionally amused. I will admit that once the app came along, I played it considerably more often.",
    "timestamp": 1702335600
  },
  {
    "username": "TybaltGray",
    "rating": 5.0,
    "comment": "Asking $75",
    "timestamp": 1684792800
  },
  {
    "username": "jax900",
    "rating": 5.0,
    "comment": "Only part of the game played.\n\nThis is an oldschool type of a game, fun for a while, but very tiring in the long run.\nDowntime when playing with more than 2 players is GIGANTIC. Battles are resolved on separate boards and can take A WHILE to finish... Players not engaged in combat just watch and yaaawn.\n\nI really appreciate the general idea and several concepts from here, but dice-fest during battle resoution, long playing time, complexity (in a bad meaning) and general feel of 'oldness' put me off.\nStill, it might be a decent game for 2 players.",
    "timestamp": 1678489200
  },
  {
    "username": "Crashn_Cor",
    "rating": 5.0,
    "comment": "Very dry, old game. No thanks.",
    "timestamp": 1672614000
  },
  {
    "username": "ZharelAnger",
    "rating": 5.0,
    "comment": "A dice chucking monster fighting classic. It hasn't aged well since it can be exceedingly long to play and it has the dreaded PLAYER ELIMINATION element which can happen early.",
    "timestamp": 1613948400
  },
  {
    "username": "Kløve",
    "rating": 5.0,
    "comment": "My first real boardgame. I keep it around due to nostalgia, but it is a very good abstract fantasy wargame, if you're into that sort of thing.",
    "timestamp": 1584658800
  },
  {
    "username": "adamw",
    "rating": 4.5,
    "comment": "With a surprisingly simple rule system, Titan is not a complex game per se. However, movement plus mustering is ferociously time consuming for newbies. The game is designed (apparently) to take an enormous amount of time to play plus has player elimination - double strike. Turns take an incredible amount of time as well, so you could (and I have!) play a side game of any number of fillers while awaiting your turn. The on-line version (Colossus) takes *minutes* to play in comparison - demonstrating the obstuseness of this venerable monster. Yes, it is fun to stack up a frightening horde of monsters. But wow - what a slog to resolve it. Avoid it.",
    "timestamp": 1565733600
  },
  {
    "username": "scud",
    "rating": 5.0,
    "comment": "somehow it can't compare anymore with similar mordern games, but if you have a convention or smth similar gooing on, it's still worth some hours. just try to find smth to do with the players that get eliminated early",
    "timestamp": 1547593200
  },
  {
    "username": "ddollas",
    "rating": 5.0,
    "comment": "Too much. Just too much.",
    "timestamp": 1541372400
  },
  {
    "username": "copcopps",
    "rating": 5.0,
    "comment": "fun game, played it twice a LONG time ago. I remember it being very fun, but complicated, long and very \"runaway leader\" heavy for a slugfest. This game is kinda like Smash Up for hardcore gamers (and actually feels like a fighting game). I would love to play it again for a reevaluation",
    "timestamp": 1518217200
  },
  {
    "username": "batmatt72",
    "rating": 5.0,
    "comment": "its just too much...\ntoo heavy, too many rules\nbut such a cool idea\n\nI'd rather play Colossal Arena instead",
    "timestamp": 1490738400
  },
  {
    "username": "Daggerheart",
    "rating": 5.0,
    "comment": "Too long gametime, and would been much better with computer support too speed the battles up or I recommend using a chess watch to speed up the encounters.",
    "timestamp": 1485558000
  },
  {
    "username": "cdefrisco",
    "rating": 5.0,
    "comment": "I understand the lure of this game. There is quite a bit of nostalgia involved... The build-up of armies, where to move on the board... this all requires quite a bit of knowledge of the game. I play this with old college buddies who LOVE this game. If it weren't for them I would never pull this game out.",
    "timestamp": 1478473200
  },
  {
    "username": "zaphod b",
    "rating": 5.0,
    "comment": "Valley games version, excellent cond.",
    "timestamp": 1475791200
  },
  {
    "username": "blinks",
    "rating": 5.0,
    "comment": "-> Reddit Math Trade",
    "timestamp": 1475618400
  },
  {
    "username": "Fircoal",
    "rating": 5.0,
    "comment": "Cool ideas ruined by roll and move.",
    "timestamp": 1472508000
  },
  {
    "username": "bacusgod",
    "rating": 5.0,
    "comment": "A good game that clearly shows it's age. I've just learned to play it (and played a few games). Some rules feel a little bit excesive, while it's length is not a helpful issue. A good design, though, and most importantly: clearly fun.",
    "timestamp": 1463781600
  },
  {
    "username": "dotmrt",
    "rating": 5.0,
    "comment": "After playing with 6 players 8+ hours it was clear that this dicefest doesn't have enough meat on it's bones to be orbiting the game board for so long. So a bit no-no with 6 players.\nI hoped it would be better with 4 players, but the game is just too simplistic and random with this dumb roll-and-move mechanic. It lacks some diceroll modifying power cards or action card mechanics or what not. That can be blamed only on the ancient 1980-s game design which is not up to par with 21st century boardgame standards.\nBasically this game is won by the player who can hold off battling the longest. Or in other words the first players to attack each other are probably the first to be eliminated.\nSo don't get me wrong, it's not the micromanagement and the length of the game. I love some longer games, but this one just doesn't have any meat on it's bones to justify the play time.",
    "timestamp": 1457737200
  },
  {
    "username": "Steezish",
    "rating": 6.3,
    "comment": "3/16/25: This game is fun at first until you realize how long the game is going to last. I also do not like the lack of agency with movement.",
    "timestamp": 1755036000
  },
  {
    "username": "brutusbelton",
    "rating": 6.0,
    "comment": "Niegrywalna w obecnym kształcie, ale wierzę, że na jej bazie można zrobić naprawdę dobrą grę",
    "timestamp": 1725400800
  },
  {
    "username": "InjunJ03",
    "rating": 6.0,
    "comment": "CR",
    "timestamp": 1708902000
  },
  {
    "username": "Unitoch",
    "rating": 6.0,
    "comment": "Has a certain amount of old-school charm, but really doesn't show its strength until you play this repeatedly with the same group. The realities of the modern game market with constant new games make that highly unlikely. And worse, it's rough to have this much rules overhead and still see a player eliminated through no fault of her own in the first half hour. If the rules take longer than the game, that's a serious weakness. I don't usually mind player elimination, but there has to be at least SOME build up to the finale.\n\nThe game's rules are chromed out to a ridiculous degree, Terrain makes things vary. Units make things vary. Die rolls trigger special abilities. As a result, the battles are very rich, but unfortunately, only two players are involved in them. Everybody else at the table has to sit and wait for them to finish, which can lead to interminable downtime between turns. It's really the quintessential 80s Ameritrash game, with all of the benefits and problems associated with it. I wouldn't recommend buying it, but it's probably worth playing it once to see if it's your thing.",
    "timestamp": 1693000800
  },
  {
    "username": "Xerof",
    "rating": 6.0,
    "comment": "Pero sigo jugándolo online",
    "timestamp": 1691618400
  },
  {
    "username": "tppytel",
    "rating": 6.0,
    "comment": "Update 2023: Dropped to a 6 - it's just too long and hard to get to the table. And while there's nothing else exactly like Titan, there are so many more good games available now than there were 10+ years ago that are easier to get played. Titan is tight and interesting, but I don't ever see myself playing this again.\n\nA great game, though the updated components from VG can't entirely mask the age of the underlying design. The game definitely revolves around the strategic decisions on the Masterboard - the tactical considerations on the Battle Boards are significant, but not terrifically subtle. However, there are certainly some very interesting strategic decisions to be made, especially in the two player game where you have a bit more breathing room. But damn... this is a long game and the gameplay doesn't really change dramatically as you go. If I had this game in high school when I had whole nights to kill, I'd have played the heck out of it. But it's going to be awfully hard to fit it into my schedule these days.",
    "timestamp": 1682200800
  },
  {
    "username": "Gaius",
    "rating": 6.0,
    "comment": "Fantasy monster slug-a-thon of secret armies and player elimination. The game is divided into two realms, the strategic masterboard and tactical battleboards. Mechanics are relatively simple but expect to use the reference material often, especially if you are new to the game. So many nit pick rules. Seems to take a lifetime to really master. I first learned on the 1980 edition, and now trading away the 2007 revised edition. Ultimately, too long and drawn out of a game when there are so many other good battle game choices",
    "timestamp": 1670108400
  },
  {
    "username": "murph0499",
    "rating": 6.0,
    "comment": "Antiquated in its design. The mechanisms by themselves by nature lend themselves to larger player counts, but isn't really suitable for group plays because the downtime is enormous and by default, some peoples will be knocked out of the game really quickly.\n\nProbably a good game to play at a con and then bounce once you got knocked out. No doubt it's got depth and is very enjoyable in the right circumstances, but for most I'd wager, that fun probably isn't to be found in their own personal collection.",
    "timestamp": 1665612000
  },
  {
    "username": "superbowl4me",
    "rating": 6.0,
    "comment": "Digital (Apple)",
    "timestamp": 1664748000
  },
  {
    "username": "SeanC",
    "rating": 6.0,
    "comment": "Rating based on vague recollection. I don't remember the battle boards at all.",
    "timestamp": 1652911200
  },
  {
    "username": "Bolger",
    "rating": 6.0,
    "comment": "This is a truly excellent game. Really like the mechanics, something rather computer game like which I really enjoy. You have these big groups of monsters which you get to attack your opponents with when hey land on the same square, really fun battles! The only problem I have, and the reason why I never play it, is the play time involved. Several hours, I would say 4+ most often, and if I have that kind of time my friends usually want to play Warhammer or something else.",
    "timestamp": 1642892400
  },
  {
    "username": "gregandjan",
    "rating": 6.0,
    "comment": "Once a “must have,” and now a “what do with it now?” game. Did not live up to its hype.\n\nAt office January 2022",
    "timestamp": 1641164400
  },
  {
    "username": "breakmanynecks",
    "rating": 6.0,
    "comment": "Have A-H Version (1980?)",
    "timestamp": 1619906400
  },
  {
    "username": "bcnevan",
    "rating": 6.0,
    "comment": "Amerithrash through and through. While it's difficult to get to the table due to its down time and player elimination. Titan is still quite good as a solo game.",
    "timestamp": 1619215200
  },
  {
    "username": "doubt72",
    "rating": 6.0,
    "comment": "[This one has a placeholder date for play; I've played it, but not sure when, if I play it again I'll delete that.]",
    "timestamp": 1608937200
  },
  {
    "username": "jatang",
    "rating": 6.0,
    "comment": "Great classic game. Slow start-up time & lots of downtime in between battles but nothing comes close to it in a simple strategy/ tactical balance. Easy to remember movement paths & combat tables. Nice fantasy aspect. Terrain & native creatures make all battles different.",
    "timestamp": 1588111200
  },
  {
    "username": "mothertruckin",
    "rating": 6.0,
    "comment": "Sold.",
    "timestamp": 1584313200
  },
  {
    "username": "ShadowWolf69",
    "rating": 6.0,
    "comment": "Can be a very long game...scratch that..It is a very long game.\nThough I do like aspects of the monster mustering.",
    "timestamp": 1575932400
  },
  {
    "username": "Kharnik",
    "rating": 6.0,
    "comment": "An all-around fun game.",
    "timestamp": 1575154800
  },
  {
    "username": "MrBlissful",
    "rating": 6.0,
    "comment": "Speaking objectively, this is at best a 7, but its hard to be objective about this game. This slugfest was a huge favorite in my gaming adolesence and I would never turn down a game.\n\nGames take forever to complete but its the source of some of my fondest gaming memories from my youth.",
    "timestamp": 1571781600
  },
  {
    "username": "GeminiWeb",
    "rating": 7.0,
    "comment": "Only played once (before I started recording plays) but would like to play it more. AH version. Enjoy the iPad app though!",
    "timestamp": 1754863200
  },
  {
    "username": "DMarcus",
    "rating": 7.0,
    "comment": "2+ players\nStrategic\nComplexity: Simple\nDuration: 4+ hours\n\nAn old favorite. Can take forever and a day to play if players are not aggressive. Plus, if you get eliminated early, you'll need something else to do while you wait for the game to end.",
    "timestamp": 1747778400
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "Back in 1980 I attended my first ever game convention somewhere in downstate Illinois. I recall playing Titan at that convention. The game was not an Avalon Hill game, but came in a big coarse cardboard box. The guy teaching us the game was a bit appalled when I attacked relatively early, revealing my Titan, and I was eliminated fairly early.",
    "timestamp": 1743116400
  },
  {
    "username": "MJCamp",
    "rating": 7.0,
    "comment": "Fun, but never ending sometimes.",
    "timestamp": 1739055600
  },
  {
    "username": "martybjsg",
    "rating": 7.0,
    "comment": "Excellent map and muster system, can get very long. Having returned to playing this one... a classic. Absolutely one of my favorites from a few years back. Muster system, map and movement system, combat are all interesting and enjoyable. Player elimination is part of the game, shocking!\n\nMUST have the new edition - we do get to play this some - the kids will love it.",
    "timestamp": 1733612400
  },
  {
    "username": "SiddGames",
    "rating": 7.0,
    "comment": "Permanent.\n\nb2 g3 b4 g6\n30-240m\nrtp\n\nPlayed just a learning 2p game to 300 points so far. The game is actually not that complicated. I like a lot of features, especially the Archon-like movement to the Battle Boards to resolve engagements that occur on the Masterboard. There's a lot of dice-chucking here but I enjoyed it so far. Looking forward to a 3-4p game; I suspect the downtime would not be enjoyable in a 5-6p game.\n\nI like the theme/idea so much that I keep coming back to it over and over in game design. \"Titan Express\" in a hundred variations that never do quite what I want them to, heh.\n\n_store_GR_BS_1-1",
    "timestamp": 1732316400
  },
  {
    "username": "artikid",
    "rating": 7.0,
    "comment": "Needs an updated edition",
    "timestamp": 1730070000
  },
  {
    "username": "collezionista",
    "rating": 7.0,
    "comment": "110",
    "timestamp": 1728424800
  },
  {
    "username": "tanik",
    "rating": 7.0,
    "comment": "Excellent dice-rolling slugathon. Love the strategic/tactical board play. You move about the world mustering creatures and increasing your army's strength, then move to the small tactical boards for combat.\nThe only drawback is the mostly random movement system offered by a die roll. You have only a little bit of choice about where to move, based on the die roll and the board's restrictions. At the same time, though, you have some idea of which regions your opponents can reach on their turns because of the board's movement paths.\nI always play with a variant which gives more control over your movement and speeds up the game so you don't have to play for two days to get to the dragons, giants and collosi.",
    "timestamp": 1727301600
  },
  {
    "username": "NegativeZer0",
    "rating": 7.0,
    "comment": "6p\n3-4h",
    "timestamp": 1724796000
  },
  {
    "username": "whitecatplays",
    "rating": 8.0,
    "comment": "Some games are so weird and original.",
    "timestamp": 1760738400
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "War Game\n\nThe epic monster-army slug-fest. The depth of this game is impressive, especially considering the two very different but perfectly interlocking levels: the operational master board and the tactical battle boards. The master board movement system is simple enough, but offers a staggering number of decisions, probably more than any other roll-and-move game. The battle boards are a whole other game in themselves, providing an impressive lack of luck considering the fistfuls of dice being rolled. Indeed, the luck in this game extremely mitigated by some simple education of the game mechanics. This is one of the things that makes combat both simple and brilliant. If you have several hours to spend, Titan is the way to spend it.",
    "timestamp": 1759356000
  },
  {
    "username": "rutherford82",
    "rating": 8.0,
    "comment": "An incredible and unique design. It is a masterpiece and there is nothing quite like it. The monster evolution is my favorite part and the brief tactical battles actually have more to them than the small battle maps imply.",
    "timestamp": 1757023200
  },
  {
    "username": "OrcusMaximus",
    "rating": 8.0,
    "comment": "Love Titan. Used to play it regularly on a weekday evening. With experienced players. It's doable.",
    "timestamp": 1756764000
  },
  {
    "username": "wtcannonjr",
    "rating": 8.0,
    "comment": "Updated reprint version from Valley Games.\n\nContains masterboard playmat plus Outlands variant playmat.",
    "timestamp": 1753308000
  },
  {
    "username": "skrybble",
    "rating": 7.5,
    "comment": "Longish game with a slow start -- but a classic anyway. Totally innovative movement system, tense battles and you get to recruit lots of monsters to slaughter your opponent's critters. An extraordinary design.",
    "timestamp": 1735945200
  },
  {
    "username": "CinderDream",
    "rating": 8.0,
    "comment": "We love this classic game. Hard to find. People have not usually heard of this gem. Sometimes the games can run long, but we just pick them up the next day and play in bursts some times. Love it.",
    "timestamp": 1721080800
  },
  {
    "username": "mschemen",
    "rating": 8.0,
    "comment": "Enjoyed learning this at BGG con",
    "timestamp": 1709506800
  },
  {
    "username": "mattaebersold",
    "rating": 8.0,
    "comment": "Positives:\n- NOSTALGIA\n- Gameplay is mostly amazing\n- Player elimination. I think it's good because it adds tension, plus I never played with more than 3 people\n\nNegatives:\n- army group management can be fussy\n- Battle map rules can be hard to understand\n- Movement on the main board is confusing",
    "timestamp": 1708556400
  },
  {
    "username": "bdeink",
    "rating": 7.5,
    "comment": "If you recall depictions of DnD players and other nerds from popular media in the mid-nineties, that's the aesthetic which this game invokes in my mind.\n\nThat said, Titan is a lot of fun to play! I have not played with more than 2p and I would be hestitant to, since the game is already fairly slow at that player count.",
    "timestamp": 1690495200
  },
  {
    "username": "elqueaprende",
    "rating": 9.2,
    "comment": "-------------------------------\nThe true Heroes of Might & Magic!!",
    "timestamp": 1759356000
  },
  {
    "username": "kareds",
    "rating": 9.0,
    "comment": "First impression rating.",
    "timestamp": 1745359200
  },
  {
    "username": "HuckmanT",
    "rating": 9.0,
    "comment": "2025",
    "timestamp": 1738969200
  },
  {
    "username": "bobjohnson",
    "rating": 8.8,
    "comment": "+ Tactical dice chucker that encourages aggression rather than turtling. The battles are fast-paced and exciting. Rolling 18 dice at a time is fun! There is luck, but a lot of that is averaged out by the sheer number of dice you roll. I also enjoy coming up with mnemonics to help me remember where key lords/creatures of my opponents are.\n- Lots of downtime, since only two players can be involved in a battle at once, and the main game is basically on pause while the battle takes place. There is also player elimination, so have other games on hand to play for the eliminated players.",
    "timestamp": 1709852400
  },
  {
    "username": "DroppEcho",
    "rating": 9.0,
    "comment": "Apart from some quirks such as the movement rules (which you could argue gives the game personality), this is a tremendously fun dice combat game that always makes me think of the Heroes Of Might And Magic series. Gotta move to muster, baby! The zoomed-in battlelands are a blast. Rolling buckets of dice has never been this much fun since Warhammer. Valley Games edition has a nice version of the main board, although I'm not sure if the unit chits are better. This is a classic game, best with 2 or 3 players.",
    "timestamp": 1709506800
  },
  {
    "username": "drmabuse00",
    "rating": 9.0,
    "comment": "This is a game that I say has no peer and is a must have for all Ameritrash fans. This contains all the elements of gaming that I love in one package: theme, strategy, tactics, good ole dice chuckin and most importantly a high \"OOOO\" \" ARGGGGHH\" factor!\n\nI've played countless games through Colossus and online play(PBEM) and every game was electrifying and engaging. LOVE IT!!",
    "timestamp": 1704063600
  },
  {
    "username": "colorado_gamer",
    "rating": 9.0,
    "comment": "Do Gooder Library - Library, Rocky Mountain Games, Rare, Out of Print, High Demand, Prototype",
    "timestamp": 1691618400
  },
  {
    "username": "Samuel Vriezen",
    "rating": 9.0,
    "comment": "OK – as a friend put it, it's Fantasy Backgammon. A genre all to itself!\n__\n\nTitan. Game or meditation?\n\nI'm going to rate this game on how much I want to like it, more than maybe how much I'll actually be bringing it out. Because yeah, it's fiddly, has player elimination, goes on forever, etc... but what a universe to flow around in!",
    "timestamp": 1686261600
  },
  {
    "username": "Aharding",
    "rating": 9.0,
    "comment": "A classic and still one of my favourite games. Rare among multiplayer wargames in that it doesn't devolve into alliances yet still works well with two. Faster and better with experienced players as downtime in a large group of new players can be substantial but it does reward the effort needed to become experienced.",
    "timestamp": 1670281200
  },
  {
    "username": "AslanFrodo",
    "rating": 9.0,
    "comment": "+ General Magazine V 26/# 4 - 'The Badlands', 10 new Battlelands.",
    "timestamp": 1665093600
  },
  {
    "username": "Cragborn",
    "rating": 10.0,
    "comment": "the original AH version",
    "timestamp": 1761003660
  },
  {
    "username": "stevewitha_ph",
    "rating": 10.0,
    "comment": "An all-time favorite of mine. Always willing to play, but finding willing participants can be difficult as it is a bit more involved with a large rulebook. I understand that my rating is nostalgia based, and it probably deserves an 8 rating due to difficulty alone. Actually, you know what! I'm sticking to my guns, it's a 10/10 no notes!",
    "timestamp": 1756332000
  },
  {
    "username": "jBullfrog",
    "rating": 10.0,
    "comment": "I have the old Avalon Hill purple box version, though the box is now extremely tattered and torn from being thrown in a backpack to bring to friends' houses. The counters have always been bagged and appear to all be there. All the battlemats and the rules are accounted for and are in decent shape. Thinking I might need to get them laminated... Like a childhood teddy-bear, I hold a lot of nostalgia for this game.\n\nWhile I don't feel I can rate it accurately as I haven't played it since I was a kid, and I know we didn't follow the rules exactly, giving this a 10. This game and the old D&D redbox are what turned me into a gamer.\n\nreally, really want to play again...",
    "timestamp": 1755208800
  },
  {
    "username": "Dagrande",
    "rating": 10.0,
    "comment": "a monster slugathon fantasy wargame. Great 2-player-game, also great with 3-6 players.",
    "timestamp": 1740006000
  },
  {
    "username": "Aniceto",
    "rating": 10.0,
    "comment": "With 2 GMT chit trays.",
    "timestamp": 1735599600
  },
  {
    "username": "opinicus",
    "rating": 10.0,
    "comment": "A truly enjoyable game even if I have a lot of bad die rolling. Will always play but have to be in the mood and have the time to set aside.",
    "timestamp": 1722636000
  },
  {
    "username": "TVDinner",
    "rating": 10.0,
    "comment": "I think we'll play the AH version just for kicks occasionally. I'm still surprised that the entire set of counters fit in the AH box with only two of those overpriced plastic AH storage trays.\n\nGrant picked us up a new(er) board at some point, so we can feel good about our ratty original.",
    "timestamp": 1707606000
  },
  {
    "username": "Togego",
    "rating": 10.0,
    "comment": "This was far before miniature games started to show up.\nFor a game only played with Tokens it was amazing.\nMaybe someone should do a mini version...",
    "timestamp": 1697407200
  },
  {
    "username": "AndrewSFTSN",
    "rating": 10.0,
    "comment": "Greatest game ever. I'm terrible at it.",
    "timestamp": 1669849200
  },
  {
    "username": "bert_nerdsen",
    "rating": 9.5,
    "comment": "This game has a mystical aura for me. A door to a mindset of game design gone lost. Nowadays everything feels like an iteration of stories already told. This one doesn't and doesn't care.\n\nThe atmosphere is emphasized by the Mike Doyle edition. The board is hypnotic.",
    "timestamp": 1666994400
  }
]