[
  {
    "username": "njsauer",
    "rating": 1.0,
    "comment": "Tries to fix a broken old game. Doesn't do it.",
    "timestamp": 1059775200
  },
  {
    "username": "Bagherra",
    "rating": 2.0,
    "comment": "gorgeous game. very lackluster play.",
    "timestamp": 1742857200
  },
  {
    "username": "sherron",
    "rating": 3.0,
    "comment": "Wished there was BGG back when I got it, was so let down finding out it was an abstract and had cylinders instead of ships.",
    "timestamp": 1579820400
  },
  {
    "username": "aaj94",
    "rating": 4.0,
    "comment": "Breakthru is a reskin of the ancient Viking game Knefetafl. The game features two asymmetric sides: silver and gold. Gold has fewer pieces, and a 'flagship.' Gold's goal is to break out of the perimeter and move its flagship off the edge of the board. Silver, for its part, has more ships but much more to manage -- since they must guard all edges of the board from Gold's escape.\n\nI've played this twice, and the asymmetry is fascinating. It's hard to say which side has the easier job. The 3M bookshelf series is really strong, especially after my good experiences with Twixt and Acquire.",
    "timestamp": 1734562800
  },
  {
    "username": "Indy500sr",
    "rating": 5.0,
    "comment": ".compleet\nEAN nvt\nL6",
    "timestamp": 1757282400
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "A chess like variant where all the pieces have rook type movement and pawn type kills.\n\n\nGot in 2007",
    "timestamp": 1731279600
  },
  {
    "username": "opinicus",
    "rating": 6.0,
    "comment": "The heavy metal pieces and the light plastic board is an odd combo, but I've enjoyed the two plays.",
    "timestamp": 1722636000
  },
  {
    "username": "Bagheera kiplingi",
    "rating": 6.0,
    "comment": "Simplified version of the Old Norse game \"hneftafl,\" which employed more pieces and had a larger board. This condensed version uses basically the same rules: warriors find themselves surrounded and outnumbered and must escape. Alternative rules, a proper piece count, and the larger board design exist online. I have more fun playing full-size hneftafl, but this version is fun, too. Hneftafl possibly served as a teaching tool for young Icelandic warriors training to go a-viking. Even this trimmed-down version can help students learn important abstract lessons about battles.",
    "timestamp": 1696284000
  },
  {
    "username": "graybeard76",
    "rating": 7.0,
    "comment": "Another game I enjoyed playing in my childhood, but have not pulled out in years.",
    "timestamp": 1708988400
  },
  {
    "username": "BillNC",
    "rating": 8.0,
    "comment": "A fun and quick game!",
    "timestamp": 1643324400
  },
  {
    "username": "jackiesavon",
    "rating": 9.0,
    "comment": "I always found this game interesting to play-and fun too",
    "timestamp": 1327186800
  },
  {
    "username": "darksplinky",
    "rating": 10.0,
    "comment": "I love these bookshelf games! This one is lots of fun. Good strategy, heavy pieces, fun play through. This will go in our regular rotation.\n\nI love how these games look on my shelf. I’m always on the lookout for them when I am at a yard sale or antique market. I can’t wait to own them all!",
    "timestamp": 1579474800
  }
]