[
  {
    "username": "RodZ",
    "rating": 1.0,
    "comment": "Crappy and never owned it either",
    "timestamp": 1468274400
  },
  {
    "username": "Zarkan",
    "rating": 1.0,
    "comment": "HORRIBLE game, with horrible mechanics and absolutely no fun. Only luck counts, and half of the time spent on this horrible game is spent doing the calculations at the end. I'd trash this game in no time if it were not for the fact that my girlfriend actually likes it (as incredible as it might sound!). Surely the designers were smoking really bad stuff when then created this nonsense.",
    "timestamp": 1295218800
  },
  {
    "username": "mnv_iii",
    "rating": 1.0,
    "comment": "Not sure how I got my hands on this one... there isn't much game there, just theme (and quite a yucky theme at that). There are 20-25 different cards in the game, none of which has any kind of rules printed on them: you have to either memorize everything or always look them up in the rules (stoned people play this game?? HOW???). This is the only complication to what is otherwise a very simple take-that card game. Game would get a 2, but not printing any text at all on any card makes it deserving of a '1'.",
    "timestamp": 1146520800
  },
  {
    "username": "jtreat",
    "rating": 1.0,
    "comment": "Milles-borne on drugs.",
    "timestamp": 1063663200
  },
  {
    "username": "SmoovySmoov",
    "rating": 2.0,
    "comment": "Traded for Monopoly.",
    "timestamp": 1488841200
  },
  {
    "username": "Abiezer Coppe",
    "rating": 2.0,
    "comment": "I don't care if you smoke weed. I don't want to play a shit stoner humour game with you regardless.",
    "timestamp": 1457478000
  },
  {
    "username": "mgreen02",
    "rating": 2.0,
    "comment": "Fun for a very short space of time in your mid-teens. Beyond that you need to start asking yourself some searching questions",
    "timestamp": 1434924000
  },
  {
    "username": "xxxIcarusxxx",
    "rating": 2.0,
    "comment": "Broken because it's from the seventies and they were too fucked up on disco to make games correctly. You can't even play in the game until you HAPPEN to get a certain card out of the deck. Nope.",
    "timestamp": 1418252400
  },
  {
    "username": "Zanmor",
    "rating": 3.0,
    "comment": "Bill Moran's copy",
    "timestamp": 1650232800
  },
  {
    "username": "MarkyX",
    "rating": 3.0,
    "comment": "I've received this for free with a highly damaged box. It's Mille Borne with a few twists, but still random and luck-driven.",
    "timestamp": 1504821600
  },
  {
    "username": "deserter85",
    "rating": 3.0,
    "comment": "Painfully slow. Also I'm not drawn in by its theme/humour. So it's a definite no.",
    "timestamp": 1496872800
  },
  {
    "username": "puddingwrestler",
    "rating": 3.0,
    "comment": "Extremely frustrating. It is possible to be dealt a winning hand, but never get to play it as you never receive a 'market open' card.",
    "timestamp": 1396648800
  },
  {
    "username": "Nodens",
    "rating": 4.0,
    "comment": "+2 if smoking",
    "timestamp": 1758060000
  },
  {
    "username": "Jernau",
    "rating": 4.0,
    "comment": "To Sell",
    "timestamp": 1676761200
  },
  {
    "username": "RingelTree",
    "rating": 4.0,
    "comment": "Hah! This made me feel like a rebel when I was a teenager. Just as soon as play the more elegant Mille Bornes.",
    "timestamp": 1522533600
  },
  {
    "username": "mothertruckin",
    "rating": 4.0,
    "comment": "Better theme than Mille Bornes but essentially the same game with a few extra cards and some negotiation possibilities. Also you don't play with partners which is nice.",
    "timestamp": 1522360800
  },
  {
    "username": "ppsacco",
    "rating": 5.0,
    "comment": "Wanna buy some weed? Fun game...especially when smoked up!",
    "timestamp": 1757455200
  },
  {
    "username": "VibroChimp",
    "rating": 5.0,
    "comment": "Probably a better game if you’re stoned.",
    "timestamp": 1733439600
  },
  {
    "username": "mixmixmix",
    "rating": 5.0,
    "comment": "Drug dealing themed random card game. Can go far too long.",
    "timestamp": 1716933600
  },
  {
    "username": "Yashima",
    "rating": 5.0,
    "comment": "This was a present at some point and I don't remember playing this at all.",
    "timestamp": 1697580000
  },
  {
    "username": "greamejohnston",
    "rating": 5.0,
    "comment": "Was the king of cards in it's day but it has long since lost its lustre. I know my fond memories would be tarnished if I brought this one to the table.\n\nEdit- I was persuaded to play this recently and surprisingly- I found something to enjoy. Don't get me wrong-it went on too long, the luck to strategy balance is way out of whack and the rule set is crap, but what made it rise a degree above Uno was an element of negotiation- which turned out to be quite fun with those who were at the table- ex weed-heads, the lot of them!",
    "timestamp": 1683583200
  },
  {
    "username": "elflum",
    "rating": 5.0,
    "comment": "Dated",
    "timestamp": 1637362800
  },
  {
    "username": "melisgl",
    "rating": 5.0,
    "comment": "A fun, light card game about being drug dealers from 1980.",
    "timestamp": 1611183600
  },
  {
    "username": "Stroodle88",
    "rating": 5.0,
    "comment": "Got me through high school... it was entertaining back then.",
    "timestamp": 1608764400
  },
  {
    "username": "CharlieMnemonic",
    "rating": 6.0,
    "comment": "Pot themed Mille Bornes.",
    "timestamp": 1747087200
  },
  {
    "username": "bvongunten",
    "rating": 6.0,
    "comment": "Great game after midnight when people are tired or drunk or better both ;-)",
    "timestamp": 1733612400
  },
  {
    "username": "jannorek",
    "rating": 6.0,
    "comment": "Review under https://youtu.be/Kxkfi3wGt9s",
    "timestamp": 1678575600
  },
  {
    "username": "Matthew_Wallhead",
    "rating": 6.0,
    "comment": "Complexity 3",
    "timestamp": 1674774000
  },
  {
    "username": "ButtMunch",
    "rating": 6.0,
    "comment": "Good little card game. Mille Bourne with an added card trading mechanics that changes the game significantly.",
    "timestamp": 1672700400
  },
  {
    "username": "Scorpion0x17",
    "rating": 6.0,
    "comment": "Second set for large player count games",
    "timestamp": 1655503200
  },
  {
    "username": "emperormark",
    "rating": 6.0,
    "comment": "Played this a TON (along with Nuclear War) in high school-annoyed the HELL out of many of the teachers! Which I guess was the point! Lol!",
    "timestamp": 1594245600
  },
  {
    "username": "Kriamjo",
    "rating": 6.0,
    "comment": "Very fun to play. Scoring can be cumbersome. I ended up developing a spread sheet to automate scoring.",
    "timestamp": 1585090800
  },
  {
    "username": "AlexSpielrebell",
    "rating": 7.0,
    "comment": "It's old, it's clunky for modern standards. But it's still fun with the right players. Lots of luck, but still some room for strategy.",
    "timestamp": 1709074800
  },
  {
    "username": "bernstein82",
    "rating": 7.0,
    "comment": "party | card",
    "timestamp": 1704754800
  },
  {
    "username": "Attard",
    "rating": 7.0,
    "comment": "Its aight",
    "timestamp": 1700002800
  },
  {
    "username": "Omnipotatoe",
    "rating": 7.0,
    "comment": "German rules included. Funny card game. Easy to play. You are a drug dealer, doing everything to hinder the competition.",
    "timestamp": 1681855200
  },
  {
    "username": "BoxerDog",
    "rating": 8.0,
    "comment": "A very fun Take That card game. Wish my ex-roommate didnt steel the game from me.",
    "timestamp": 1746223200
  },
  {
    "username": "Blix",
    "rating": 8.0,
    "comment": "Social & Silly\nThis is a funny game, with the right friends. The same friends you play CAH with.",
    "timestamp": 1743890400
  },
  {
    "username": "tomppa",
    "rating": 8.0,
    "comment": "Nice party game",
    "timestamp": 1663624800
  },
  {
    "username": "dmiloc420",
    "rating": 8.0,
    "comment": "Excellent party game if you're playing with a group of good sports. If you're playing it with people that get their feelings hurt, it's not fun. I've had more good experiences than bad though, because I learned, quickly, not to play this game with strangers.",
    "timestamp": 1632348000
  },
  {
    "username": "schlappy",
    "rating": 8.5,
    "comment": "What Mille Bornes *should* have been from the beginning -- dynamic, lightning pace negotiations -- especially with four or more. Why this is rated so low is puzzling to me, unless it is because the subject matter may prevent sharing with some who would otherwise appreciate it??\nMy copy is 40 years old & a bit worn -- but, it actually adds some charm",
    "timestamp": 1707519600
  },
  {
    "username": "Quartzgamer",
    "rating": 8.9,
    "comment": "Loved playing this back in the eighties and now introducing it to the kids. Another favourite.\n02/03/19: 1st play for years - why so long? great game.",
    "timestamp": 1551567600
  },
  {
    "username": "rhubarb_j",
    "rating": 9.0,
    "comment": "A long-time favourite. Loads of fun.",
    "timestamp": 1508277600
  },
  {
    "username": "bowie47",
    "rating": 9.0,
    "comment": "Best card game i ever played and more people the better. Play when mashed its even better...",
    "timestamp": 1455577200
  },
  {
    "username": "KonstantinosD",
    "rating": 10.0,
    "comment": "An undying masterpiece.",
    "timestamp": 1753740000
  },
  {
    "username": "yukonzach",
    "rating": 10.0,
    "comment": "Been playing since 1982. Discovered in the Games Magazine Top 100 and bought my original deck at Spencer's Gifts. I am on my fourth deck. The 50th Anniversary rules are fairly different than the original rules (less ruthless perhaps?). Such a great game and always a blast to play.",
    "timestamp": 1590012000
  },
  {
    "username": "mklawonn",
    "rating": 10.0,
    "comment": "Played Gras since years in the same group and will always love the multible ways you can act. btw. we play without the Banker.",
    "timestamp": 1558994400
  },
  {
    "username": "HarvardElessar",
    "rating": 9.5,
    "comment": "Ignore the Geek Rating for this game, it's awesome! Why? Quick to explain, and really fun to play - the strategy is straightforward but compelling, things can turn around fast, and the theme and card art are smokin'. Needs 4 or more playes to shine. Drugs optional.",
    "timestamp": 1443823200
  }
]