[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "The goal is very amusing, hard to find that kind of theme in board games. The problem is the means to get there, the trick taking is so loose with rules that it feels perfunctory, and could’ve been swapped with any other mechanism. It’s also the least exciting part of the teach.",
    "timestamp": 1722463200
  },
  {
    "username": "Klausi300",
    "rating": 2.0,
    "comment": "2",
    "timestamp": 1483657200
  },
  {
    "username": "Mister_Green",
    "rating": 3.0,
    "comment": "Yikes. This game really shows its age. And I’m not sure who it’s for. I mean, it’s not for the uninitiated, as it’s too quirky for a TT muggle. It’s also not for the veteran, as any semblance of control is an absolute J-O-K-E. This one is mean, but not in the silly American Bookshop way. The box is too big. The card quality isn’t great. It takes too long. I mean, I could go on for a while. Ouch. Expected more from Uwe.",
    "timestamp": 1744668000
  },
  {
    "username": "Procyon_lotor",
    "rating": 4.0,
    "comment": "3+ players\n$2.40",
    "timestamp": 1703977200
  },
  {
    "username": "povertidonki",
    "rating": 5.0,
    "comment": "I don't love the idea of being able to call trump in the middle of the suit. It's pretty meh because of that.",
    "timestamp": 1654639200
  },
  {
    "username": "OGNOG",
    "rating": 4.9,
    "comment": "OGness undecided. (Rating non-indicative of game quality.)",
    "timestamp": 1649109600
  },
  {
    "username": "peacmyer",
    "rating": 6.0,
    "comment": "Gift to Sierra; Engineers; MRJ. Traded. 2 sold.",
    "timestamp": 1757887200
  },
  {
    "username": "theaaron",
    "rating": 6.0,
    "comment": "After one play, not bad.\n\nIt does seem odd to me that the big gimmick of the game is that you can change trump during a trick when you play off suit, but this is largely a trick-avoidance game. So it's very rare that you would choose to trump. Maybe this will be more common with more plays.",
    "timestamp": 1729720800
  },
  {
    "username": "liketheboys",
    "rating": 7.0,
    "comment": "A trick-taker with more control than average.\n\nWe love the trumping in rule. We love spring cleaning.\n\nWe don't love it when people start digging through their junk pile mid-round. Don't be one of these people.",
    "timestamp": 1761099420
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "Very interesting take on trick taking, love the junk pile management\n\nNeeds more plays and family play",
    "timestamp": 1759442400
  },
  {
    "username": "RaTheGod",
    "rating": 9.0,
    "comment": "Underrated gem! My favorite trick taking game. Only problem was the production but I don't think that should be factored into this review.",
    "timestamp": 1709074800
  },
  {
    "username": "Tolkana",
    "rating": 10.0,
    "comment": "11\n\nKul litet spel",
    "timestamp": 1661378400
  }
]