[
  {
    "username": "pdowen3",
    "rating": 1.0,
    "comment": "Not sure we played it right",
    "timestamp": 1738623600
  },
  {
    "username": "dragonster",
    "rating": 1.0,
    "comment": "A purchase driven by the spy theme ... a so-so game with an obvious strategy",
    "timestamp": 1526162400
  },
  {
    "username": "Boltana",
    "rating": 1.0,
    "comment": "Some of the worst game rules ever written.",
    "timestamp": 1430258400
  },
  {
    "username": "luckyjim",
    "rating": 1.0,
    "comment": "2 plays - appears to be broken.",
    "timestamp": 1349647200
  },
  {
    "username": "epilgrim",
    "rating": 2.0,
    "comment": "a truely stupid one-note joke of a game heralded by cheap gamers that would rather play crap games.\n\nI hated playing this...and I refuse.",
    "timestamp": 1429394400
  },
  {
    "username": "Zadok13",
    "rating": 2.0,
    "comment": "This game has an amusing premise and decent art, but that is not enough to redeem this dull, borderline broken game.",
    "timestamp": 1348437600
  },
  {
    "username": "Roger_Jay",
    "rating": 2.0,
    "comment": "Rules needs to be fixed. Simply allow for putting down more than one lair card at a time and no more spy cards than the number of lair card(s) and it should work better.",
    "timestamp": 1348178400
  },
  {
    "username": "martybjsg",
    "rating": 2.0,
    "comment": "After another play, I am like, huh? Funny stuff sure, but I think I missed the game part. I won't play this again if I can help it.",
    "timestamp": 1321311600
  },
  {
    "username": "grasa_total",
    "rating": 3.0,
    "comment": "It's been a while, but I don't remember there being any actual game. Just luck of the draw.\n\nRedeeming factor: The \"Totally\" in its revised title (James Ernest's Totally Renamed Spy Game) was a perfect comedic touch.",
    "timestamp": 1714514400
  },
  {
    "username": "Nostradunwhich",
    "rating": 3.0,
    "comment": "This version has a serious flaw that makes it unplayable. Too easy to just destroy opponent's bases before they get strong enough to stop most of the spies in the deck.",
    "timestamp": 1630965600
  },
  {
    "username": "psymann",
    "rating": 2.8,
    "comment": "Thought this would work well as a game that plays 7 people, and is light and fun, so tried it with a group who are newish to gaming but wanted to play enough to set up a night specifically for playing games. I've had success bringing various other games to the group, but this one - not. They all hated it, and whether we were just playing it badly or something I don't know, but it didn't really ever seem to get going.\n\nNow, every time I bring a new game around to them, they always check \"It's not got spies, has it?!\" - so it's become a group in-joke as a Rubbish Game. Which I guess means it doesn't deserve a high rating ;-)",
    "timestamp": 1495231200
  },
  {
    "username": "J_3MBG",
    "rating": 3.0,
    "comment": "Simple one trick game. Unimpressed and will not play again",
    "timestamp": 1488063600
  },
  {
    "username": "bggmatje",
    "rating": 4.0,
    "comment": "[December 2022]\nSilly beer and pretzel card game that is okay as a closing game at the end of the night, but there are better alternatives in that category.\n\nGeekMarket: https://boardgamegeek.com/market/product/3130963",
    "timestamp": 1736290800
  },
  {
    "username": "hilaryj",
    "rating": 4.0,
    "comment": "30 minutes\n2-6 Needs 4 players\nDrinking",
    "timestamp": 1684360800
  },
  {
    "username": "DreamingBudgie",
    "rating": 4.0,
    "comment": "Funny little game with good art and easy uncomplicated play. It doesn't have a strong strategic backbone and it lacks any sudden turn around luck elements that might have made it exciting.\nIt doesn't have a high replay value.",
    "timestamp": 1542668400
  },
  {
    "username": "skrutsch",
    "rating": 4.0,
    "comment": "Great concept. Have three versions - ranking for original version.",
    "timestamp": 1531519200
  },
  {
    "username": "roo414",
    "rating": 5.0,
    "comment": "Aug\n\nFun light game no real deep strategy",
    "timestamp": 1720648800
  },
  {
    "username": "littlechandler",
    "rating": 5.0,
    "comment": "The doubling and attacking opposing laira in the game creates some tense moments, but the doubling especially feels too lucky, even if you can somewhat gauge some likelihood based on number of cards remaining in opposing players' hands.",
    "timestamp": 1701644400
  },
  {
    "username": "Janasik",
    "rating": 5.0,
    "comment": "This feels a bit more complicated than it actually is. At its core, you play spy cards, flip secret layer cards, and then see which number is higher. So it's not really what I would call a great game, but it can be enjoyable if you get into the spy theme.",
    "timestamp": 1584226800
  },
  {
    "username": "shibby",
    "rating": 5.0,
    "comment": "Mwahahaha, Deforest Washington I will tell you how you're going to die, slowly, before I press this button and walk away thinking that you'll eventually die.... Never happens.",
    "timestamp": 1574290800
  },
  {
    "username": "breakmanynecks",
    "rating": 5.0,
    "comment": "I Have PnP:\nBefore I Kill You, Mister Bond",
    "timestamp": 1572908400
  },
  {
    "username": "unrealnighthawk",
    "rating": 5.0,
    "comment": "I don't think this game works well with 2 people. I need to play it some more with more people to really give it a fair rating.",
    "timestamp": 1548802800
  },
  {
    "username": "myopia",
    "rating": 5.0,
    "comment": "I assume Mr Bond had IP issues",
    "timestamp": 1545260400
  },
  {
    "username": "PlaneGuy",
    "rating": 5.0,
    "comment": "Bought the new one. Lairs blow up so easily now \n\nGame design fodder now",
    "timestamp": 1543791600
  },
  {
    "username": "ponchera69",
    "rating": 6.0,
    "comment": "4-5",
    "timestamp": 1748469600
  },
  {
    "username": "Fysst",
    "rating": 6.0,
    "comment": "Joint",
    "timestamp": 1710630000
  },
  {
    "username": "The Great Sun Jester",
    "rating": 6.0,
    "comment": "2001 purchase",
    "timestamp": 1703113200
  },
  {
    "username": "mi_de",
    "rating": 6.3,
    "comment": "10/23: This was rather fun! A take that on steroids…almost nobody managed a score as we knocked each other about quite a lot. Requires using evil genius voices and lots of flair.",
    "timestamp": 1696716000
  },
  {
    "username": "ptm_junk",
    "rating": 6.0,
    "comment": "Not a bad press your luck game. Also a little bit funny",
    "timestamp": 1687384800
  },
  {
    "username": "flash_baz",
    "rating": 6.3,
    "comment": "Nice little game this. I wasn't that excited by the theme - thought it a bit silly and cheesy - but the mechanics of the game are quite sound. Once you get the hang of it the game becomes a clean, fast push-your luck contest that has just enough strategic depth to make it interesting as well as fun. The cards are nice, and good quality. And a big shout out for the manufacturer for putting the game in such a nice compact package (I really hate games that come in big, stupid boxes that just take up all your shelf space).",
    "timestamp": 1675983600
  },
  {
    "username": "netzer",
    "rating": 6.0,
    "comment": "It's cute. And funny.\nI'm less sold on the fact your hand size decreases when you use Taunt cards. Especially in higher player counts - it makes the game less fun then it's supposed to be IMO.",
    "timestamp": 1670454000
  },
  {
    "username": "hakuus",
    "rating": 6.0,
    "comment": "Is there such a thing as too much taunting?",
    "timestamp": 1662156000
  },
  {
    "username": "TuesdayFortnite",
    "rating": 7.0,
    "comment": "sealed in box",
    "timestamp": 1748901600
  },
  {
    "username": "Madviking12",
    "rating": 7.0,
    "comment": "#Cheapass",
    "timestamp": 1737068400
  },
  {
    "username": "sroel908",
    "rating": 7.0,
    "comment": "\"I'm sorry. That last hand...nearly killed me.\"\n- James Bond, \"Casino Royale\" (2006)\n\nNice filler \"take that\" card game. I appreciate that it's very portable and comes in a simple standard tuck box that fits into your purse or pocket. I am a sucker for the spy theme, so it probably scores higher for me than most. Easy to teach, easy to learn, and doesn't outstay its welcome. Probably best with 3-5 players.",
    "timestamp": 1701212400
  },
  {
    "username": "tikitack",
    "rating": 6.5,
    "comment": "$5",
    "timestamp": 1691532000
  },
  {
    "username": "MadWelshWizard",
    "rating": 8.0,
    "comment": "Miss Rhodes says: This is a card game in which each player is an evil mastermind. The aim is to build your lair into which you entice spies and then dispatch the, you then earn points according to how big the scalp of the unlucky spy is. The game gets more interesting when you send in spies to your opponents' lairs to destroy them! I really enjoyed this game...especially as i kicked Craig's ass!",
    "timestamp": 1528063200
  },
  {
    "username": "jimmyjot",
    "rating": 8.0,
    "comment": "Rules changed from previous incarnation, \"Before I Kill You, Mr. Bond.\" Changes are a tremendous improvement.",
    "timestamp": 1522879200
  },
  {
    "username": "ThatBoardGameGuyOG",
    "rating": 8.0,
    "comment": "(Own Before I Kill You, Mr. Bond edition)",
    "timestamp": 1513465200
  },
  {
    "username": "joebelanger",
    "rating": 8.0,
    "comment": "Fun filler game that is a must play for Bond fans.",
    "timestamp": 1481670000
  },
  {
    "username": "SunshineKitty91",
    "rating": 9.0,
    "comment": "Loved the game when we had the rules. Kids have since lost them. If anyone has a way to find a free print-off of just the rules, I'd really appreciate it.",
    "timestamp": 1677193200
  },
  {
    "username": "Greg 50",
    "rating": 9.0,
    "comment": "Great little card game! Fun illustrations and easy to earn. Another game my wife also enjoys!",
    "timestamp": 1503439200
  },
  {
    "username": "Sky Captain",
    "rating": 9.0,
    "comment": "Best cardgame ever",
    "timestamp": 1281996000
  },
  {
    "username": "mikehulsebus",
    "rating": 9.0,
    "comment": "Great game. Simple but there's plenty of strategy if you want to get hardcore with this. Not sure why it's ranked so low.",
    "timestamp": 1257548400
  },
  {
    "username": "mxslade2000",
    "rating": 10.0,
    "comment": "The first edition was the best, why didn't they get the rights for Austin Powers instead?",
    "timestamp": 1195340400
  },
  {
    "username": "azereal",
    "rating": 10.0,
    "comment": "Very fun game. I have had lots of success introducing this to new people. It is nice and simple, dripping with theme, great art and plays very quick.",
    "timestamp": 1193612400
  },
  {
    "username": "kodokunobaajin",
    "rating": 10.0,
    "comment": "This game is too fun! Whenever I have to reveal portions of my base, I always add the phrase \"...of Evil\" when annoucing the card (as in \"the Coffee Machine... of Evil!\"). Being the villain is cool. This game predates the PC game with the same concept (a bit more developed, but the same theme). Also, there's the guest appearance of Dr. Lucky. I go to all the trouble of saving him on that stupid ship and he shows up to destroy my lair... of Evil! I'm going to kill him one of these days... (I'll get you next time, Gadget. Next time.)",
    "timestamp": 1125180000
  },
  {
    "username": "Degenerate",
    "rating": 10.0,
    "comment": "Lord have mercy, I love this game. It's not a good game, not at all. It's stupid, and luck driven. It's ugly, and cheaply produced. And yet, I've played it with everybody I can so much now no one will talk to me. Why, oh why, oh why???",
    "timestamp": 1124488800
  }
]