[
  {
    "username": "lordalatar",
    "rating": 1.0,
    "comment": "This game is unplayable.",
    "timestamp": 1674255600
  },
  {
    "username": "Thargorx",
    "rating": 2.0,
    "comment": "Boring, repetetive and luck based.",
    "timestamp": 1369087200
  },
  {
    "username": "bykkarn",
    "rating": 3.0,
    "comment": "Friends copy, cards is really powerful and it feels like some strategies are stronger then other.",
    "timestamp": 1539986400
  },
  {
    "username": "Mattias Persson",
    "rating": 4.0,
    "comment": "Played 5-10 times. This was a unique effort in the Swedish game industry in terms of theme, flavour and components. If published in German or English it could probably have become an international hit at the time. Revisiting it in 2023, it´s too random and has too much take-that, at least for me. Some people may still enjoy it.",
    "timestamp": 1693087200
  },
  {
    "username": "Buximu5",
    "rating": 5.0,
    "comment": "Hos päron",
    "timestamp": 1741906800
  },
  {
    "username": "Brastias",
    "rating": 4.5,
    "comment": "Easy to learn and play. Provides a good history lesson but as a game it's seriously lacking in many areas.",
    "timestamp": 1686348000
  },
  {
    "username": "Mutiemoe",
    "rating": 6.0,
    "comment": "Sort of basic but good game.",
    "timestamp": 1709074800
  },
  {
    "username": "igel_son",
    "rating": 6.0,
    "comment": "In Storage",
    "timestamp": 1649023200
  },
  {
    "username": "ManUnderBord",
    "rating": 7.0,
    "comment": "Thematic, beautiful game with some poorly balanced mechanics (trade-centric strategies are usually terrible and land-owning usually the strongest) but nostalgia, the pace of the game and at least 4 players help to overcome the issues. I am up for playing it any time, which speaks to its strengths (or its nostalgic allure).",
    "timestamp": 1739487600
  },
  {
    "username": "utl94",
    "rating": 8.0,
    "comment": "This gem seems fun and is generally spoken well about in my circles. After a first try out, I was happy to explore this further. Note the stunning artwork incorporated. Just don't mind the ineptly placed Casper logo on the attractive board and the average gold tokens.",
    "timestamp": 1595714400
  },
  {
    "username": "Zimeon",
    "rating": 9.0,
    "comment": "Interesting game about the history of Sweden. Extremely weird Eurogame mechanics mixed with complete chaos card drawing random factors. Fascinating style of play.\nAs a game it's just an 8, but as I really like the theme and because it feels immersive for me as a Swede, it gets a 9.",
    "timestamp": 1328655600
  },
  {
    "username": "OracleThesis",
    "rating": 10.0,
    "comment": "This is a classic Swedish strategy game, very complex, lot of strategy to master. An all time favorite in my family",
    "timestamp": 1734476400
  }
]