[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Kind of a dumb train game in space, which I secretly kinda like. The goofy humor helps a ton, to be honest, very few boardgames take space this non-seriously. It shares a lot of elements with Empire Builder and its spinoffs, including the solitaire gameplay. The major difference is it's more random, relying on dice rolls and silly movement restrictions, instead of event cards.\n\nSo why do I like this less than Empire Builder? The beginning is more exciting (random movement! unknown planets!), but the ending is far more boring. Eventually you have to identify the most profitable path, and just repeat that forever, until someone wins. I hate that arc, all the wacky mysteries coalesce into a dull accounting game. This wouldn't be a problem if it was 1 hour, but it drags on for 3 hours. Plus there's even MORE calculator-work in this one, adding fractions for a factory payout, it's honestly tiring.",
    "timestamp": 1729980000
  },
  {
    "username": "BajaBlaster",
    "rating": 1.0,
    "comment": "What an awful game. 3 hours I'll never get back.",
    "timestamp": 1546729200
  },
  {
    "username": "Der Ubermolch",
    "rating": 1.0,
    "comment": "Dreadful dreadful game, horribly imbalanced against the last player, far far too random for a game of such a length, mostly pointless. I'd be very happy if I never play this again",
    "timestamp": 1216245600
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not my type",
    "timestamp": 1629756000
  },
  {
    "username": "PlatypusNinja",
    "rating": 2.0,
    "comment": "This game is too solitaire-ish for me. Take your turn, wait patiently while everyone else takes their turn...",
    "timestamp": 1339452000
  },
  {
    "username": "Gryfon",
    "rating": 2.0,
    "comment": "wow, this is one vastly overrated game\n\ndice and chit randomness easily provides more game-winning inputs than player decisions.\n\nif it was fast, I could see the draw. at over 4 hours, dozens of games come to mind that are far more involving.\n\nMoV Strategy:\n\n#1 move first (random)\n#2 move faster (random)\n#3 pick-up the IOUs and relics ahead of everyone else (see #1 and #2). Ideally, find the IOU for your race (random).\n#4 when you arrive at a location that sells shields or clippers (random), buy them.\n#5 when you are at a location, buy a single good. sell it at a location that is revealed by your (random) travels. buying (and selling) two similar goods just slows you down.\n#6 when you sell goods, make sure there are (random) demand chits there.\n#7 while travelling, pick up the (random) fares that appear.\n#8 don't buy anything other than a clipper (transport, freighter). see #2 if you are confused.\n#9 don't buy a factory or factory goods.\n#10 don't worry about relative profits on goods or efficiency of certain paths over others (see #1, #2, #5, #6, #7 for why this is true).\n#11 follow #1-#10, wait for 4-6 hours. Victory!\n\n...and a final point - a 5 player game of MoV with 2 or more people having AP; just insert the sharp stick right now. Since we are talking MoV, pick one of several chits representing how sharp the stick might be, then roll a die to determine which eye it goes in.",
    "timestamp": 1335045600
  },
  {
    "username": "Tsaar",
    "rating": 3.0,
    "comment": "After one (short) play I think that if you have fond memories from epic adventures as Merchants of Venus from times long past, this game might still have some appeal. To me it was a new game and the amount of luck, slow grind, passive downtime and runaway leader are obvious signs of outdated board games.\nThe graphic design is a disaster. Piles of chits with unreadable texts are spread all over the board. The goods to trade have funny names but all look the same and there are no clear markers to show which planet belongs to what people.\nEverything about this game looks and feels like an amateurish hobby project and I’d rather play Talisman from the same era. But hey, I have some fond memories about playing that game…\nMerchant of Venus shares one feature with modern euros though: it plays mostly solitaire. That’s not a plus.",
    "timestamp": 1643929200
  },
  {
    "username": "ianne",
    "rating": 3.0,
    "comment": "A sort of roll-and-move, pick-up and deliver, train game set in space with the ability to develop technology.",
    "timestamp": 1573340400
  },
  {
    "username": "darthboywonder",
    "rating": 3.0,
    "comment": "Roll-to-move, pick up and deliver that rarely changes, random effects that cost you money or time... outside of its quirky theme, I don't see much here to like.",
    "timestamp": 1531087200
  },
  {
    "username": "Terry Egan",
    "rating": 4.0,
    "comment": "The crowd I play with insists the old Avalon Hill version of this game is far and away the best. However, I did not enjoy my first play of Merchant of Venus enough that I want to try the new edition and make the comparison for myself. This felt sort of old-school clunky and fiddly, and random chance just seems to play far too great a role for me to invest a couple of hours in this ever again.",
    "timestamp": 1706482800
  },
  {
    "username": "joseph777",
    "rating": 4.0,
    "comment": "I found this games excellent for two reasons - 1. Initial exploration of planets and finding of relics (relics are upgrades for your ship). 2. The demand system for goods is second to none. If you have 5 Space spice counters in your hold then you look for the planet that has the most demand counters for Space spice and race your fellow gamers to that location. Demand counters give bonus $ but disappear as that commodity is received so the bonuses get smaller as the demand goes down.\n\nHowever, there are a couple of problems with the game. It's hard to peg back the leader. We've found that the leader by mid-game is usually the winner at the end. Perhaps, some random events such as are found in The London Game or Starfarers of Catan?\nAlso, the solitaire rules totally suck and are broken. If anyone has fixed them please email me.\n\nStrategy - Explore early but not for too long, make a quick couple of trades for bucks, upgrade your engines so that when your rolling mvmnt dice you're skipping every 1st or 2nd travel dot, make sure your hold's always full and look for those demand counters.\n\nSometimes we ignore the random movement in the cloud section of the board to speed up game play. (This makes one of the relics obsolete but so what.)\n\nApart from that it's a real blast and for what it is I haven't seen it's equal yet.\n\n2023 - sold ages ago. Had a runaway leader problem.\nWould love to see an updated version. I did enjoy upgrading the ships and buying and selling.",
    "timestamp": 1687298400
  },
  {
    "username": "Joe Miner",
    "rating": 4.0,
    "comment": "A game that cries out to be avoided by the AP players who are attracted to it.",
    "timestamp": 1678662000
  },
  {
    "username": "tiagoVIP",
    "rating": 4.5,
    "comment": "About Merchant of Venus:\n\n1) What is it?\nIs the essence of pick and delivery game, with a racing aspect (the first to X money). This mechanic counts for around 85% of the game, with the remaining 15% being exploration, ships upgrades, finding planets and revealing obscure points of the cosmos, building spaceports and factories, etc. And you will be bound to take goods and passengers from point A to point B for a long time, as the playing time clocks around 3 hours.\n\nTherefore, the game is all about finding the best routes, trying to take the best deals, and make every stop counts towards the final goal.\n\n2) How do you play?\nAt first the board starts with all the planets in need to be explored - no one knows, beforehand, which place sell what and where to sell stuff - not even the home planets for the races of the players. In the turn the player can: move (by rolling 2 to 4 dice, depending on the type of ship) and if she manage, stop in a planet or trading post. In the planet - or trading post - the player can sell 1 good and buy 1 good. Buing for ship upgrades and building spaceports and factories count as a buy, therefore you can't build a spaceport and buy an upgrade or a good of the planet in the same turn.\n\nIf the player builds or uses the spaceport of someone else, there is not limit to the amount of goods sold and bought - the player owning the post gets 10% of the amount of money spent and gained (this applies even if the spaceport is yours!).\n\nSome races have science that allow the player to not only buy goods, but also purchase upgrades for the spaceship - these are shields, drives, and in some the possibility of changing your ship type for another - there are 4 types:\n- Scout: the starting ship. Hold: 2 goods. Movement: 3 dice;\n- Clipper: faster ship. Hold: 2 goods. Movement: 4 dice;\n- Transport: balanced. Hold: 3 goods. Movement: 3 dice;\n- Freighter: lots of space. Hold: 4 goods. Movement: 2 dice.\n\nDuring the game, players will keep buying and selling goods, trying to attend to the demands of the planets, which make produts sell for a higher price. This requires a good amount of route planning, not only the starting and final destination, but everything in between, as, except with a Clipper with a combo drive, travel will usually demand a few stops along the way. So, even if you are in planet 4, which sells something that planet 11 wants, oh so badly, is probable that you might need to stop at planet 14 along the way. Maybe is best to take only one good from planet 4, and another in planet 14, this one not to sell in 11, but next to 11 is planet 3, and you can then sell that there, while taking its good to sell in... and so on.\n\nThe game will proceed until one player reaches a certain amount of money. When this happens, the game is over and the player wins.\n\n3) Which are the decisions made during play?\nWhat to buy and where to go. This isn't a difficult game to grasp at all. It do requires some vision not only to see what you will buy/sell next, but also your next step from there, and even the next after the next. This, of course, is if you want to play well. Otherwise, you can just live in the moment - hoping for some luck in the demands of the planets and/or in the appearance of passengers.\n\nWhen and where to build spaceports (more than factories) can also serve the players well.\n\nThere are some tatical decisions during play, but most serve in a long term aspect, specially when considering the ship upgrades, as, from my experience, games are less decided by which type of goods you buy/sell, and more because of the fine tunning of the spaceship doing the job. You might want a fast Clipper, with a drive, in order to sail across the board in a blur of movement, trying to take all the highest demands before the others. Or you might want a slow and steady approach with a Freighter, carrying loads of goods to make fewer travels, but gaining time building (or using) spaceports to make several transactions at once. Or you might prefer the more balance Transport. Either way, though opportunity still plays its part, the ships is that most likely will make the players game.\n\n4) What are the good things in the game?\n- Straightforward mechanic, without several mini-games built in;\n- Both strategic and tatical, with long-term decisions and the ability to see and use the best opportunities that appears along the way;\n- The gameplay is smooth, almost relaxing, as once the board is fully opened, there is little surprises and no agression between players;\n- Random set up makes the replay higher.\n\n5) Which are the bad news?\n- Long playing time: this isn't always a bad thing, but in a game in which players do the same thing over and over, I prefer a shorter playing time, as it can get dull fast;\n- Luck of the dice: movement is made by rolling dice, and you might not be able to reach your intended destination, as fast as you wanted, because of them;\n- Luck of the draw: the demand of the planets (which make goods more valuable) and passengers are drawn, randomly, from a bag. This can make a passenger just appear in the planet you are, or a demand appear in the planet you are going, making you gain more money just by pure luck;\n- Low player interaction: though there is the possibility of trading between players, this will seldom happen, as if you have a good, you already have a destination for it (and you are probably in the way to there), so usually there is little reason to make trades. Other than this, the interaction is all indirect: someone delivers a good, fulfilling a demand, before you, or you use the spaceport built by someone else;\n- Runaway leader: with little interaction, and no risk in sells, is possible that a player, with some luck, can pull away and open a big lead. There is little to be done, except hope for Lady Luck prefer you, or that mistakes are made.\n\n6) How do you feel while playing?\nLike being in the easiest job done by Serenity. In Merchant of Venus there are no risks, except for a few unkown spots in the route, but even the nastier one (a cost 40 to pass) will only stop you, if you can't pay.\n\nThere is a lack of excitement in the gameplay. There are no high risk with high reward deliveries. No devious passenger that pays a lot, but might put you in trouble. No unstable good that can blow you ship, that cost cheap and sell for a lot in the right places. Though there is an asteroid field on the board, deliveries to or from there pay nothing more than other places.\n\nPlayers do the same thing over and over and over again, with the full knowledge that they will deliverthe goods and be paid. This makes for a lackluster experience and helps in the runaway leader problem - if someone is leading, you might want to go all in and accept a highly dangerous delivery in a killer route - you might fail, but, if you don't, you could turn the game around. No. The highest paying good might be right beside the consuming planet, connected by the smoothest of the routes.\n\nMerchant of Venus is simply left in the finest dust by Firefly: The Game , as, for me, is a much better game, with more options, more to do, more excitement and in about the same amount of time or less.\n\nStill, Merchant of Venus offers a pure pick and delivery experience, is easy to teach and play to the point of being relaxing, just listen to the space radio while the spaceship, in autopilot, sails the in between the systems. Overall, the low confrontation and low complexity of Merchant of Venus can (and, for quite a while already, do) appeal to some players, but not me.",
    "timestamp": 1664056800
  },
  {
    "username": "Taxshop",
    "rating": 5.0,
    "comment": "Fun theme and game, but takes too long for what it is, high luck quotient, and a runaway leader issue.",
    "timestamp": 1595800800
  },
  {
    "username": "John Rogers",
    "rating": 5.0,
    "comment": "Andrew Tullsen PnP version.\n\nA classic pick-up and deliver game with exploration and supply/demand market elements. The game is somewhere in between Age of Steam and the crayon rails series in depth/length and somehow more a more pleasant experience than either.\n\nWIFE RATING - 7\nI think pick-up and deliver is my favorite mechanic.\n\nTraded along with Cannes in the Post-Valentines Quickie Math Trade.",
    "timestamp": 1588370400
  },
  {
    "username": "jens_hoppe",
    "rating": 5.0,
    "comment": "Best \"space trading game\" I know. Handles the concept of supply and demand at various locations in a very elegant way. I sold my copy many years ago.",
    "timestamp": 1551049200
  },
  {
    "username": "AKHawkster",
    "rating": 5.0,
    "comment": "I liked this a lot more when I was younger, but the long setup, the snowball effect, and the lack of counterplay make it hard to enjoy nowadays",
    "timestamp": 1511910000
  },
  {
    "username": "ciggie",
    "rating": 5.0,
    "comment": "A long pick up and deliver roll and move game. Yes it's a classic and the variability this game provides is amazing given when it was made. I can see how so many games that have come since then have built off of the ideas of this. However, the length is just too much especially with 6. Other than the demand tiles, this badly needs more ways to combo or engine build as otherwise you do the same thing 2 hours in as you do on your first turn. I'd always rather play something like Istanbul which has the same race approach to pick up and deliver, but is much more streamlined.",
    "timestamp": 1454799600
  },
  {
    "username": "jatang",
    "rating": 6.0,
    "comment": "I like pick up and deliver as well as exploration. The drawback here is that the leader's engine builds faster and faster. In a long, slow game, you have to enjoy maximizing your solitaire deliveries for several hours.\n\nI've never played with the attack variant.",
    "timestamp": 1749938400
  },
  {
    "username": "ParalyzedAnalyst",
    "rating": 6.0,
    "comment": "Some decent concepts, but my main gripe is that the movement is unnecessarily random. And unfortunately, a lot of other mechanics tie into the movement dice roll, so it's hard to house rule away. The game goes on for a long time, and there's practically nothing to do outside of your turn.",
    "timestamp": 1728338400
  },
  {
    "username": "galfridus",
    "rating": 6.0,
    "comment": "Fine game, marred by die roll randomness.",
    "timestamp": 1705878000
  },
  {
    "username": "RandaPrince",
    "rating": 6.0,
    "comment": "Could get pretty tedious.",
    "timestamp": 1687125600
  },
  {
    "username": "clint_",
    "rating": 6.0,
    "comment": "Played with 4. Lots of downtime, made especially worse given that all of the movement restrictions can equate to not getting to do much of anything on your turn. The chit-churning from trading is neat, I just wish the roll-and-move generated options to choose from instead of removing them.",
    "timestamp": 1666562400
  },
  {
    "username": "NormandyWept",
    "rating": 6.0,
    "comment": "Elite: the Board Game (which means I'm probably predisposed to like it thanks to some 80s/90s home computer game nostalgia), as you travel from place to place looking to buy goods from suppliers and sell them to consumers elsewhere in the galaxy.\n\nThe game has that great 80s sci-fi board game feel with a fun, quirky space setting and a compelling core economic system. There's roll and move but it's well-done, combined with some rules on inertia to create an interesting dynamic as you explore the galaxy and later try to exploit it economically.",
    "timestamp": 1642546800
  },
  {
    "username": "paulastoria",
    "rating": 6.5,
    "comment": "Ok",
    "timestamp": 1755122400
  },
  {
    "username": "jacojre",
    "rating": 7.0,
    "comment": "Surprisingly I like this game better as a solitaire game than face-to-face, as the solitaire variant provides a wonderful, tense challenge. Still a very strong effort which warrants re-playing now and again.\n\n2025 Update: Recent solo playings have produced less satisfactory experiences. Without spoiling the game for others, it appears there is a strategy leading to a clear route to victory. And that strategy involves an uninteresting, mechanical process: though one that does faithfully represent how good supply chain management works.",
    "timestamp": 1755036000
  },
  {
    "username": "MarkusNeedham",
    "rating": 7.0,
    "comment": "14/07/25 - On loan to Mark\n\nHave had this a long time and have played it many times with my sons as they were growing up. It's definitely a game of its time with the components not as slick as modern games.\n\nMore than happy to play this again.",
    "timestamp": 1752444000
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "A pick-up-and-deliver game and a roll-and-move game, but the first undersells it and the second under-explains it. There's a lot of threat assessment and determination of what might be worth pushing your luck over. My favorite mechanic was probably the cup of chits that spat a new chit every time something else went into the cup. Old school design that still manages to relate its theme better than several of its follow-ups.",
    "timestamp": 1759356000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 8.0,
    "comment": "Merchant of Venus is an excellent pick up, deliver, and exploration game. It does take some effort to set up & tear down. And you'd best have a counter tray. Further there are lots of transactions that require some math.\n\nFortunately the game is worth it. I've played this many times over a long span of years.\n\nSpare copies in storage.\n\nOLD SCHOOL COLLECTION",
    "timestamp": 1749852000
  },
  {
    "username": "Sorp222",
    "rating": 8.0,
    "comment": "Pick up and deliver at it's finest, that also holds a story line and a game of discovery. The map, exploration, goods distribition and movement choices feel ultra modern (2012) in a game with an old school arc.",
    "timestamp": 1746741600
  },
  {
    "username": "Ryan Keane",
    "rating": 9.4,
    "comment": "I’ve technically only played this edition once, and it was Eric Summerer’s homecrafted version he was playing with me and Tom Vasel, who had never played before. I didn’t actually have a great first impression, getting a bit annoyed from downtime from bad die rolls. But then my wife got the reprint. We played the FFG standard rules for a while, based on my so-so experience of that first play of classic. But then we finally decided to try the classic rules again, and i don’t know what I was thinking. The classic rules were a blast and we have now played it a ton and MoV classic rules is now in my top 10. I rate this edition a 9.5 just because you can’t get it anymore, so I prefer to highlight the newer edition in my top 10, but it’s the basically unchanged classic rules that I am rating, not the pretty crap FFG standard rules.",
    "timestamp": 1759356000
  },
  {
    "username": "doktor avalanche",
    "rating": 9.0,
    "comment": "PP",
    "timestamp": 1759010400
  },
  {
    "username": "Nodens",
    "rating": 9.0,
    "comment": "Every game different, everyone finishes with more than they started with. One of the best.",
    "timestamp": 1757541600
  },
  {
    "username": "islander",
    "rating": 9.5,
    "comment": "S0 | • 35in by 35in board washable roll-out inkedgaming board - Check\n• Market boards printed, assembled, and laminated - Check\n• Player aid placards printed, assembled, and laminated - Check\n• Events placards printed, assembled, and laminated - Check\n• Money decks - Check\n• Counters, 51 quarter-sized, printed and assembled - Check\n• Counters, 15 halfdollar-sized, printed, trimmed, and assembled - Check\n• Counters, 369 nickel-sized, printed, trimmed, and assembled - Check\n• Lost World A + B variants, printed, assembled, and laminated - Check\n• Ship boards (including variants) printed, double-side assembled, and laminated - Check\n• Three chip cases to store everything but the main board and rulebook - Check\n• Dice for events, tele-gates, and each of the six player-colors - Check\n• Rulebook from Artscow - Check\n• Satin draw bag for counter cup - Check\n• Spaceship pawns, painted and flight-standed - Check",
    "timestamp": 1731884400
  },
  {
    "username": "bdeink",
    "rating": 9.5,
    "comment": "One of my all time favourites, and an absolute blast every time we play.\n\nIncl. The General variant counters.\n\nThe game scales really well both in terms of player count and the agreed-upon amount of money needed to win, and the path to victory may look very different depending on these factors.\n\nThe agent, base, and second ship counters from the expansion are always included in our games (though we ignore every other module or optional rule).\n\nThe combat rules (incl. mercenaries and forts) should always be ignored. I find that they detract from the experience. We still allow the purchase of weapons for the violently inclined, but only the purpose of blowing asteroids out of the sky (or rather, space).",
    "timestamp": 1717884000
  },
  {
    "username": "Stephan Valkyser",
    "rating": 10.0,
    "comment": "2nd copy (mint)",
    "timestamp": 1689804000
  }
]