[
  {
    "username": "RandaPrince",
    "rating": 1.0,
    "comment": "I'm just going to say it: I hate Fluxx. It's definitely easy to teach, but that's because there's no game. It's just draw some cards, play them, hope you meet the win condition. There's no strategy. A lot of people like it, but I won't play it.",
    "timestamp": 1751148000
  },
  {
    "username": "purplecow55",
    "rating": 1.0,
    "comment": "In this card game, players are mostly going to draw cards and play cards until a player achieves a goal on the table. All goals and rules can change as the game continues.",
    "timestamp": 1748124000
  },
  {
    "username": "ncc1701jv",
    "rating": 1.0,
    "comment": "No. Just...no",
    "timestamp": 1738537200
  },
  {
    "username": "SterlingBlake",
    "rating": 1.0,
    "comment": "It passes time, but lacks all of the characteristics of games which make them enjoyable.",
    "timestamp": 1727560800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I thought it was silly random fun. Then someone sat there silently for minutes trying to optimize their turn in their head.",
    "timestamp": 1726524000
  },
  {
    "username": "NachosGrande",
    "rating": 1.0,
    "comment": "I think I have the correct version listed.",
    "timestamp": 1722549600
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "It's random by definition, changing goals, changing cards etc. Total gonzo. At least it doesn't pretend to be serious and is over quickly.",
    "timestamp": 1722376800
  },
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "There's nothing quite like rules that constantly change during game play, unless it's a game that can also end after 5 minutes.",
    "timestamp": 1709506800
  },
  {
    "username": "Euroman",
    "rating": 1.0,
    "comment": "In league with Munchkin and Killer Bunnies.\nDraw the right card and win! Yippee!\nHorrible, horrible, horrible!",
    "timestamp": 1707692400
  },
  {
    "username": "Parat0xic",
    "rating": 1.0,
    "comment": "This is one of the worst games I have ever played. It was super random, dragged on way too long, and provided no enjoyment.",
    "timestamp": 1685656800
  },
  {
    "username": "EpicFrenzy",
    "rating": 1.0,
    "comment": "no thx",
    "timestamp": 1680386400
  },
  {
    "username": "SD1138",
    "rating": 1.0,
    "comment": "Hey, let's play a light take-that card game where the rules constantly change so it only rewards people who know all the cards and takes hours to play since once someone is about to win and end the game, someone else will changes the rules so they don't and the game resets.",
    "timestamp": 1673478000
  },
  {
    "username": "drunkcrunkfranken",
    "rating": 1.0,
    "comment": "Way back when, I found a new board gaming group and played King of Tokyo for the first time. Everyone seemed to be enjoying it and having fun, so we played it a couple more times. Then, one of the other players pulled this out, and we stopped having fun.",
    "timestamp": 1672441200
  },
  {
    "username": "Fried Egg",
    "rating": 1.0,
    "comment": "I've only played one game of this but the first chance I had to end the game (even though it gave the game to another player) I took it. What does that tell you about it?\n\nNow I've played it a second time, I realised that a rating of 2 was too generous for this game. Rating lowered to a 1.",
    "timestamp": 1664143200
  },
  {
    "username": "tandahunter",
    "rating": 1.0,
    "comment": "An absolute mess of a game. No further comment.",
    "timestamp": 1664143200
  },
  {
    "username": "xvatat",
    "rating": 1.0,
    "comment": "Too much waiting time even for a light-hearted casual game",
    "timestamp": 1642374000
  },
  {
    "username": "lynx1998",
    "rating": 1.0,
    "comment": "Too chaotic and luck based. Urgh!!",
    "timestamp": 1640214000
  },
  {
    "username": "ObiJuankenob",
    "rating": 1.0,
    "comment": "Played on BGA and hate it. The game is absolutely random and luck dependent.",
    "timestamp": 1627682400
  },
  {
    "username": "pmanpman",
    "rating": 1.0,
    "comment": "It's just an overcomplicated way of rolling a dice. If you could at least choose to stop playing cards whenever you wanted, it would have some value, but it just forces you to be a robot. Honestly, there are two ways to \"play\" Fluxx. Option 1: Make people draw and play as many cards as possible to get yourself out of your misery as fast as possible. Option 2: Make people not be able to draw or play cards to take pleasure in prolonging everyone else's misery.",
    "timestamp": 1626732000
  },
  {
    "username": "garry_rice",
    "rating": 1.0,
    "comment": "As long as you don't mind a game that has constantly changing goals, constantly changing rules, and lots of luck thrown in for good measure, you'll absolutely love this game(G)...On the other hand, if you have a hard time with any of the above, stay FAR away from this game...it'll drive you mad!",
    "timestamp": 1625868000
  },
  {
    "username": "FutureSpec",
    "rating": 1.0,
    "comment": "One of the worst games I've ever played. Might not actually be a game. The changing victory conditions is what spoils the fun. There's no real strategy or goal to work toward.",
    "timestamp": 1619560800
  },
  {
    "username": "jrsquee",
    "rating": 1.0,
    "comment": "Great fun years ago in school, but alas, I find it tedious now.",
    "timestamp": 1610924400
  },
  {
    "username": "Bort",
    "rating": 1.0,
    "comment": "I've played a few different thematic variations of Fluxx, so I don't know where exactly to leave this rating. Really it doesn't matter because it all winds up at the same chaotic disaster of an experience. I don't get it. I just do not get this game. I love simple games. I can have fun and laugh at a game that doesn't take itself seriously, where it's more like a social activity. Telestrations. Boom. Takes 5 seconds to explain. Everyone gets it. You laugh and all walks of life can participate. And if you don't like it, you can clearly see when the game will end (which also doesn't take long). But Fluxx is the only game on this planet that I might refuse to play from this day forward. It's billed as a silly game for non-gamers, but how can such a convoluted, confusing, random, potentially endless game make for an enjoyable experience for those new to the hobby? I hate that this game is being recommended to friends of mine that have a casual interest in games and stumble wide-eyed into a store for the first time. I never intended to rate this game as it clearly isn't meant for me and I don't want to be super negative. But after having to teach this game to friends who couldn't figure out how to play from reading the rules, I needed to air my grievances with Fluxx. THERE ARE SO MANY OTHER GREAT GAMES. Don't make someone suffer through this one.",
    "timestamp": 1607554800
  },
  {
    "username": "CascadeHush",
    "rating": 1.0,
    "comment": "fails to do what it sets out to do",
    "timestamp": 1607036400
  },
  {
    "username": "Tambu_1",
    "rating": 1.0,
    "comment": "dont like this game. try play 2",
    "timestamp": 1603926000
  },
  {
    "username": "Wolfie6407",
    "rating": 1.0,
    "comment": "Like: Nothing\n\nDislike: Everything. The most luck based BS game I've ever had the misfortune of playing.",
    "timestamp": 1603231200
  },
  {
    "username": "The Nue",
    "rating": 1.0,
    "comment": "I've actually never lost a game of Fluxx, and still have never enjoyed myself playing it. That's some real testament to how un-engaging a game is when even victory doesn't offer the most remote of satisfaction",
    "timestamp": 1588456800
  },
  {
    "username": "ljhms",
    "rating": 1.0,
    "comment": "Inevitably ends up with draw 10/hand limit 10 and everyone taking ten minutes deciding which cards to play and keep. Turns a ten minute game into one and a half hours.",
    "timestamp": 1577574000
  },
  {
    "username": "Pierce",
    "rating": 1.0,
    "comment": "Complete chaos, utterly random, extremely boring.",
    "timestamp": 1577055600
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "I don't know where to start",
    "timestamp": 1576537200
  },
  {
    "username": "fsnam",
    "rating": 1.0,
    "comment": "To the last, I grapple with thee; From Hell's heart, I stab at thee; For hate's sake, I spit my last breath at thee. -Herman Melville (He must have played Fluxx to be so inspired)",
    "timestamp": 1565215200
  },
  {
    "username": "Magesmiley",
    "rating": 1.0,
    "comment": "Played a few times. Way too random for my tastes. Might as well draw straws to see who wins.",
    "timestamp": 1554933600
  },
  {
    "username": "MachineEpsilon",
    "rating": 1.0,
    "comment": "Meta changing, completely random, card game",
    "timestamp": 1553727600
  },
  {
    "username": "rfrank",
    "rating": 1.0,
    "comment": "A game that changes so fast it is hard to say there is any strategy except for constant change and hoping you come out in a good place. My least favorite game of all time.\n\nEdit 2019: add Phase 10 to least favorite as well.",
    "timestamp": 1550962800
  },
  {
    "username": "benshever",
    "rating": 1.0,
    "comment": "More stupid random luck. At least everyone agrees Fluxx sucks. Next.",
    "timestamp": 1550012400
  },
  {
    "username": "crappyjacks",
    "rating": 1.0,
    "comment": "I liked this \"game\" when I was a teenager. You change the rules as you play, and that is a neat idea. However, in practice, the game is a chaotic mess that goes on for an indeterminate amount of time. It's pure chance that someone can establish a winning condition and meet that condition.",
    "timestamp": 1542754800
  },
  {
    "username": "MontyPylon",
    "rating": 1.0,
    "comment": "unfun and luck based. 1001 Blank White Cards is way better than this",
    "timestamp": 1540332000
  },
  {
    "username": "DeadFrog",
    "rating": 1.0,
    "comment": "Randomly forces you to do things, really just not fun at all",
    "timestamp": 1533852000
  },
  {
    "username": "Santiago",
    "rating": 1.0,
    "comment": "Fluxx isn't so much a game as something do with your friends when you're all stoned. Not being one to partake of such chemical enhancement, I haven't found much use for it.",
    "timestamp": 1515106800
  },
  {
    "username": "Harblnger",
    "rating": 1.0,
    "comment": "If I'll never have to play this \"game\" again, it'll be too soon.",
    "timestamp": 1512946800
  },
  {
    "username": "hvogel",
    "rating": 1.0,
    "comment": "I imagine that Hell is actually one huge, never ending game of Fluxx.",
    "timestamp": 1509404400
  },
  {
    "username": "giltleaf",
    "rating": 1.0,
    "comment": "I do not get the point of these \"games.\" Not even funny despite how hard they try.",
    "timestamp": 1507932000
  },
  {
    "username": "Coweggs",
    "rating": 1.0,
    "comment": "Terrible game, pointless",
    "timestamp": 1503612000
  },
  {
    "username": "Numskull",
    "rating": 1.0,
    "comment": "How to be unpopular: Be the person who always wants to play Fluxx.\n\nHow to be even more unpopular: Be the person who always plays that abominable \"X+1\" card.",
    "timestamp": 1500760800
  },
  {
    "username": "eadred",
    "rating": 1.0,
    "comment": "This game plays you, I despise it.",
    "timestamp": 1499810400
  },
  {
    "username": "zam_SE",
    "rating": 1.0,
    "comment": "Boring random card game in which the rules and win conditions constantly change. Don't play this.",
    "timestamp": 1499119200
  },
  {
    "username": "tycowart",
    "rating": 1.0,
    "comment": "This is not a game. It's not fun, It's not funny. It's not clever. It's an obnoxious bout of luck that takes way to long to play without involving any thought or strategy. You'd be better off sitting at a table and rolling dice to see who rolls higher... same level of strategy but much faster.",
    "timestamp": 1497218400
  },
  {
    "username": "MComer",
    "rating": 1.0,
    "comment": "I didn't enjoy anything about my one play of this.",
    "timestamp": 1489791600
  },
  {
    "username": "MaxTurbo4600",
    "rating": 1.0,
    "comment": "Ugh.",
    "timestamp": 1486940400
  },
  {
    "username": "Slaverzguild",
    "rating": 1.0,
    "comment": "\"Flux\" and all of its variants are not games. They're time wasters.",
    "timestamp": 1483484400
  },
  {
    "username": "guardianz",
    "rating": 1.0,
    "comment": "This is not a game, it is expensive and ineffective toilet paper. For yahoos only.",
    "timestamp": 1483052400
  },
  {
    "username": "ni_se",
    "rating": 1.0,
    "comment": "Crazy, rather crappy game. I just play it for the laughs, when someone unfamiliar to the game comes by.",
    "timestamp": 1474236000
  },
  {
    "username": "Meel",
    "rating": 1.0,
    "comment": "A waste of time",
    "timestamp": 1465336800
  },
  {
    "username": "Garet_Jax975",
    "rating": 1.0,
    "comment": "Broken AF",
    "timestamp": 1464040800
  },
  {
    "username": "klinsy73",
    "rating": 1.0,
    "comment": "For sale",
    "timestamp": 1459720800
  },
  {
    "username": "adebisi",
    "rating": 1.0,
    "comment": "2008-06-13\nSimply the worst game I've ever played. A real torment.\n\n2016-02-02\nWhy I find Fluxx so horrible? Well I've played three games, the first one lasted for 30 minutes without me even getting to play a single card. In the second one, I got to play but was out of luck and couldn't win on my turn. So before I had a chance to play again, someone took a 10 minute turn and won. Again we played for 30 minutes, during which I contributed for a single massive minute. The third game was the same as the second one.\n\nSo, I've lost 90 minutes of my life to Fluxx, and of that time I was active only for a couple of minutes. There were almost no decisions to be made. Once you figured out in which order to play your cards, you only played what you could and hoped for the best.\n\nFluxx brings you one of the worst fun-to-time ratios, hands down. After 2008 I have simply refused to play on all occasions, which are scarce (thank god for this) and limited to the biggest of conventions that seem to attract the weirdest of weirdos who enjoy playing all the bad games just for the sake of it. I find the whole concept similar to watching movies that are so bad that, in some perverse way beyond my comprehension, are \"good\".",
    "timestamp": 1454367600
  },
  {
    "username": "TheJoelVeencamp",
    "rating": 1.0,
    "comment": "I thought Munchkin would be my most disliked game, because of its randomness and longevity, but I am sorely mistaken. Fluxx (and any version, as the concept is the same) is by far the worst game I have ever played. Do you want a game that you can win on the first turn? Do you like party games that can last for over two hours? Do you like complete randomness in your games? If you answered yes to all three of those questions, Fluxx is still not the game for you because you can go play Munchkin, which I hate to say, is 10 times better than Fluxx. The basics of Fluxx is to complete the current goal (which constantly changes), by having a pair of cards in front of you that matches the goal. That's it. Now add cards that changes the goal constantly, changes drawing and discarding rules, the fact that you can only play one card per turn, you only draw one card (initially) per turn, and every type of card is in a SINGLE draw deck, and you've go yourself the most random game know to man. Awful game, I cannot be bribed any amount of money to play this again.",
    "timestamp": 1450393200
  },
  {
    "username": "gingyanna",
    "rating": 1.0,
    "comment": "I didn't understand the point of this \"game\", and didn't enjoy it at all. To be fair,the drunken group next to me had a blast playing the same game. Maybe I am broken..",
    "timestamp": 1438984800
  },
  {
    "username": "jnharr",
    "rating": 1.0,
    "comment": "Never. Again.",
    "timestamp": 1438207200
  },
  {
    "username": "Keatus",
    "rating": 1.0,
    "comment": "This is not a game but an exercise in drawing and playing cards. It is far to random and has little to no strategic decisions. - Math Trade",
    "timestamp": 1428530400
  },
  {
    "username": "Jerryvonkramer",
    "rating": 1.0,
    "comment": "One of the worst games ever made.",
    "timestamp": 1418684400
  },
  {
    "username": "rilo",
    "rating": 1.0,
    "comment": "Why are there so many Fluxx expansions and varieties? I thought it was dull, aggravating and long. I'd rather pay Candyland.",
    "timestamp": 1416524400
  },
  {
    "username": "Revelade",
    "rating": 1.0,
    "comment": "I just zone out when I play this game because there is just no space for skill. Losses are just because someone happened to draw the right card. Wins feel empty. It's more of thing to play to see what happens. I'd rather play the easier to learn and more intense, Liar's Dice.",
    "timestamp": 1411596000
  },
  {
    "username": "Solid",
    "rating": 1.0,
    "comment": "Originality (0.25/1.0)\nTheme (0.0/0.5)\nPure Fun (0.0/1.0)\nReplayability (0.0/1.0)\nStrategy/Luck Ratio (0.0/0.5)\nScalability (0.25/0.5)\nParity (0.0/0.5)\n\nOverall 0.5/5.0",
    "timestamp": 1407016800
  },
  {
    "username": "Vydar",
    "rating": 1.0,
    "comment": "This is not a game. It is an exercise in randomness.\n\nDefinitive 1.",
    "timestamp": 1401919200
  },
  {
    "username": "Tokhuah",
    "rating": 1.0,
    "comment": "This is not really a game so much as random poo slinging. If you are looking for something that uses strategy you are better off buying squirt guns than anything from this franchise. The fact that there have been so many expansions is a testament to the low standards necessary to distract the human mind.",
    "timestamp": 1391900400
  },
  {
    "username": "colinmarsh",
    "rating": 1.0,
    "comment": "I wish there were an option on game play weight of \"mindless\".\n\na worthless filler game that has the added bonus of potentially dragging on for over an hour.",
    "timestamp": 1389394800
  },
  {
    "username": "SirHandsome",
    "rating": 1.0,
    "comment": "Worst Game I've Ever Played Award\n\nFluxx is a nightmare. A slow boring ride at a theme park that may never let you off.\n\nThe fact that it can last anywhere from 1 minute to infinity, but offer not one interesting decision the entire time, is a problem, to say the least.\n\nThat's not a 1, it's a zero.\n\n(0 Design + 0 Enjoyment",
    "timestamp": 1387839600
  },
  {
    "username": "SybotCB",
    "rating": 1.0,
    "comment": "Grueling game. I don't want to play this anymore, It would have to be very special circumstances.",
    "timestamp": 1386198000
  },
  {
    "username": "ts0ng",
    "rating": 2.0,
    "comment": "This is an activity alright.",
    "timestamp": 1740178800
  },
  {
    "username": "udance4ever",
    "rating": 2.0,
    "comment": "while I totally get the theme of the game captures how quickly the \"goal\" changes in this game - it drove me a bit batty - enough to question if I would enjoy playing again!",
    "timestamp": 1736118000
  },
  {
    "username": "BackIssueBacklog",
    "rating": 2.0,
    "comment": "I don't despise the games but since buying them and playing them quite a bit in 2011/2012 I have yet to return to any Fluxx games.",
    "timestamp": 1730761200
  },
  {
    "username": "Cubesonamap",
    "rating": 2.0,
    "comment": "This game is just utter chaos.",
    "timestamp": 1729980000
  },
  {
    "username": "TheHandsomeDan",
    "rating": 2.0,
    "comment": "....this game never ends. Blegh.",
    "timestamp": 1728684000
  },
  {
    "username": "ParalyzedAnalyst",
    "rating": 2.0,
    "comment": "Too chaotic without actually being funny.",
    "timestamp": 1728597600
  },
  {
    "username": "Talyl",
    "rating": 2.0,
    "comment": "I know this game is fairly popular but my partner and I both find it too chaotic. I'm not a fan of how swiftly things change.",
    "timestamp": 1725314400
  },
  {
    "username": "trodat123",
    "rating": 2.0,
    "comment": "just not my game",
    "timestamp": 1712700000
  },
  {
    "username": "GrimThunderbrew",
    "rating": 2.0,
    "comment": "good idea, poor implementation",
    "timestamp": 1705878000
  },
  {
    "username": "bernstein82",
    "rating": 2.0,
    "comment": "duplicate! english!",
    "timestamp": 1705273200
  },
  {
    "username": "JoeXJoe",
    "rating": 2.0,
    "comment": "Did not like",
    "timestamp": 1702508400
  },
  {
    "username": "bellyrub",
    "rating": 2.0,
    "comment": "I don't understand why anyone would want to play this instead of just having a discussion to hang out. Or just roll dice to see who wins.",
    "timestamp": 1694556000
  },
  {
    "username": "aronske417",
    "rating": 2.0,
    "comment": "This is a very not fun experience for me. One of the worst games I have ever played.",
    "timestamp": 1687730400
  },
  {
    "username": "Jmarkmoss",
    "rating": 2.0,
    "comment": "Bad memory. Would never play 01/10/23",
    "timestamp": 1673305200
  },
  {
    "username": "charliebevis",
    "rating": 2.0,
    "comment": "No agency, complete arbitrariness, and random noise dominate what I’d call more of an experience than a game.",
    "timestamp": 1672441200
  },
  {
    "username": "Butterbob",
    "rating": 2.0,
    "comment": "Completely random garbage",
    "timestamp": 1670194800
  },
  {
    "username": "Bohdominator",
    "rating": 2.0,
    "comment": "Maybe this is the point of the game but the rules just got confusing and hard to keep track of. I can see why this would appeal to some people but not for me.",
    "timestamp": 1670108400
  },
  {
    "username": "unprinted",
    "rating": 2.0,
    "comment": "Almost pure luckfest that can last seconds or hours, depending on how unlucky you are. There are better quick games, and MUCH better long ones. Despite this, the simplicity of the basic idea means it's horribly popular in some groups.",
    "timestamp": 1668466800
  },
  {
    "username": "Jack Squat",
    "rating": 2.0,
    "comment": "At times, there's not even the illusion of meaningful choices to make. So random, it barely qualifies as a game. Not to put too fine of a point on it, but in my opinion, it's just a stupid way to spend time.",
    "timestamp": 1667516400
  },
  {
    "username": "icortezi",
    "rating": 2.0,
    "comment": "This game can be drawn out so long to the point it is no longer fun anymore.",
    "timestamp": 1663192800
  },
  {
    "username": "authentic",
    "rating": 2.0,
    "comment": "It's just disappointingly random and not as funny as Munchkin. The vanilla version has the least to make the experience fun.",
    "timestamp": 1661292000
  },
  {
    "username": "NormandyWept",
    "rating": 2.0,
    "comment": "Whilst there's something interesting about an open system where the rules of the game change regularly, this theoretically thought-provoking game design is very tiresome in practice as the wild shifts in what you're trying to do can result in many unsatisfying endings and even more overly-long games where nobody is able to win for long periods of time.\n\nThe core 'collect a set of items or modify the shared state so you win' has been done better by Looney in Chrononauts, where attaching some of the elements here to a more concrete and more entertaining setting which ties more satisfyingly to what you're actually doing in the game (rather than being merely artwork, as it is in the various Fluxx variants).",
    "timestamp": 1650837600
  },
  {
    "username": "gramsdad",
    "rating": 2.0,
    "comment": "Fluxx Suxx!",
    "timestamp": 1650492000
  },
  {
    "username": "AesopDoom",
    "rating": 2.0,
    "comment": "I can play this, but I don't think I'd ever ask for it...",
    "timestamp": 1649023200
  },
  {
    "username": "MDJD",
    "rating": 2.0,
    "comment": "I only wish I could get back the time I wasted playing this lousy \"game\".",
    "timestamp": 1645225200
  },
  {
    "username": "Fragasnap",
    "rating": 2.0,
    "comment": "Random by definition. Simple strategy can be developed through familiarity with the deck, but that requires too much dedication for too little payoff. Always ends suddenly and unsatisfyingly, either immediately or after dragging on too long.",
    "timestamp": 1633730400
  },
  {
    "username": "Epochend",
    "rating": 2.0,
    "comment": "It mystifies me how they decided to make a party game (which almost always thrive on simplicity) entirely out of fiddly, changeable rulesets (one of the most irritating facets of board gaming), with literally nothing else included. One of the few games I genuinely can't understand what people see in it.",
    "timestamp": 1619215200
  },
  {
    "username": "angia93",
    "rating": 2.0,
    "comment": "just nope",
    "timestamp": 1610924400
  },
  {
    "username": "Wccody",
    "rating": 2.0,
    "comment": "boring ol fluxx but I can play it",
    "timestamp": 1604617200
  },
  {
    "username": "NanometricRed",
    "rating": 2.0,
    "comment": "Fluxx es un juego que en la teoría es interesante, porque las reglas y las condiciones de victoria van cambiando durante el transcurso de la partida, pero cuando en reiteradas ocasiones te topas con que tienes 12 cartas en la mano y solo puedes jugar una y tienes que estar atento tanto a tus cartas como a la de los rivales, pues te genera mucho AP y un juego que pareciera ser rápido y dinámico termina siendo lento y somnífero, lo peor es que hay muchas temáticas para elegir y con todas pasa lo mismo",
    "timestamp": 1600984800
  },
  {
    "username": "enavico",
    "rating": 2.0,
    "comment": "- Awful game",
    "timestamp": 1596924000
  },
  {
    "username": "ludocrat",
    "rating": 2.0,
    "comment": "Complete madness... This is not a game.",
    "timestamp": 1595023200
  },
  {
    "username": "Born-of-Ashes",
    "rating": 2.0,
    "comment": "A novelty once, then you realize it is merely a vehicle to keep people at the table all night chasing a futile goal that will change as soon as you get near it.",
    "timestamp": 1593554400
  },
  {
    "username": "hockeysemlan",
    "rating": 2.0,
    "comment": "Horrible. Horrible game . I wanted a game with changing rules, got a game that is just locking you out in the worst way possible.",
    "timestamp": 1587592800
  },
  {
    "username": "SirPork",
    "rating": 2.0,
    "comment": "NEVER BUY THIS FOR ME EVER AGAIN!!!",
    "timestamp": 1586901600
  },
  {
    "username": "juuzzom",
    "rating": 2.0,
    "comment": "The good thing is that games might not last that long. You simply do what you must, not what you'd like to do.",
    "timestamp": 1578610800
  },
  {
    "username": "evlkeith",
    "rating": 2.0,
    "comment": "20`19",
    "timestamp": 1575759600
  },
  {
    "username": "guzmo",
    "rating": 2.0,
    "comment": "Good game to warm the sauna.",
    "timestamp": 1574463600
  },
  {
    "username": "ilkkachu",
    "rating": 2.0,
    "comment": "This is just drawing cards and seeing what happens. I don't know where the game is in it. Never again.",
    "timestamp": 1570399200
  },
  {
    "username": "Shadoglare",
    "rating": 2.0,
    "comment": "Yeah, this is a single-play rating. Because I'm never playing this again. You can't make me. Ugh. Just awful.",
    "timestamp": 1567720800
  },
  {
    "username": "mmazala",
    "rating": 2.0,
    "comment": "\"I've seen stuffed animals win flux.\" - BGG user Boronx",
    "timestamp": 1561327200
  },
  {
    "username": "DayvanCowboy",
    "rating": 2.0,
    "comment": "I'd rather roll dice to determine a winner.",
    "timestamp": 1550790000
  },
  {
    "username": "Clellybobus",
    "rating": 2.0,
    "comment": "I can see how people might love this. I hoped I would love it. But ugh. No. Just no.",
    "timestamp": 1550617200
  },
  {
    "username": "ChronoBasher",
    "rating": 2.0,
    "comment": "Used - some scuffs on the box.",
    "timestamp": 1545951600
  },
  {
    "username": "Qwampa",
    "rating": 2.0,
    "comment": "Completely random. awful experience to play this.",
    "timestamp": 1541718000
  },
  {
    "username": "DisasterAiR",
    "rating": 2.0,
    "comment": "It is supposed to be a 10 minutes game not an half and hour pass and no one even close to winning when the rules keep changing game.",
    "timestamp": 1535061600
  },
  {
    "username": "fastattaq",
    "rating": 2.0,
    "comment": "Sold on Consignment",
    "timestamp": 1534197600
  },
  {
    "username": "copcopps",
    "rating": 2.0,
    "comment": "Too chaotic for newcomers, too light for gamers and you can literally have no turn. They are A LOT better filler games than this one. In the words of Zee Garcia, this game is random and it is garbage. Bumped up from a 1 to a 2 because at least this game can be called a game and I can see some theme pasted on making some people smile.",
    "timestamp": 1531778400
  },
  {
    "username": "csb249",
    "rating": 2.0,
    "comment": "I'm not even sure what to say about this one. Just hot garbage.",
    "timestamp": 1528322400
  },
  {
    "username": "ekloff",
    "rating": 2.0,
    "comment": "This game is all over the place. It feels like a filler, with its quick and simple decisions, but with such a volatile game system, this game can drastically vary in length from one game to the next. This is all by design, but I don't care for it and will not be revisiting.",
    "timestamp": 1527631200
  },
  {
    "username": "mitcharf",
    "rating": 2.0,
    "comment": "Free game that I received -- not one I set out to acquire.",
    "timestamp": 1523484000
  },
  {
    "username": "Dynastico",
    "rating": 2.0,
    "comment": "It's random. You might randomly have some fun if you purposefully change the rules a lot to screw with everyone else.",
    "timestamp": 1522879200
  },
  {
    "username": "prnpenguin",
    "rating": 2.0,
    "comment": "Vanilla Fluxx takes the awesomeness of Star Fluxx, removes the theme, removes the Creeper cards, and sucks all the fun out of the game. While I love Star Fluxx, I'd rather watch feminine hygiene commercials than play the standard base game, Fluxx.",
    "timestamp": 1521327600
  },
  {
    "username": "smith4jp",
    "rating": 2.0,
    "comment": "I hate this game. you sit there and when its your turn you look to see if you won. if not, you just wait until next round. zero strategy. I only played it once and I won the game I played.",
    "timestamp": 1517958000
  },
  {
    "username": "MegaMushroom",
    "rating": 2.0,
    "comment": "A truly terrible card game that tries far to hard to be amusing but just ends up being too random to ever be fun. It might not be so bad if a round wrapped up quickly, but in my experience it sticks around far longer than it needs to.",
    "timestamp": 1516662000
  },
  {
    "username": "sublimestars",
    "rating": 2.0,
    "comment": "I can't deal with the randomness and changing rules. Playing this was torture for me.",
    "timestamp": 1512860400
  },
  {
    "username": "LetsOlympics",
    "rating": 2.0,
    "comment": "Enjoyable game that can't be taken too seriously. Started out super fun but became boring after a few plays.",
    "timestamp": 1512428400
  },
  {
    "username": "Chris Barnard",
    "rating": 2.0,
    "comment": "Awful.",
    "timestamp": 1507413600
  },
  {
    "username": "cogthecat",
    "rating": 2.0,
    "comment": "This game sounds great on paper, but in practice is not at all fun. If I win, there's no sense of accomplishment since victory conditions change arbitrarily and far too fast to make decisions around. If I lose, I'm still frustrated because my opponents didn't earn a victory either. Some of the themes expansions like Star Fluxx improve upon that problem mildly by adding more persisting effects, but even then the fundamental premise is still that you have no real control over the game and everything is constantly changing, which really just turns it into an exercise in boredom and frustration without a payoff.",
    "timestamp": 1507240800
  },
  {
    "username": "Bellaatje",
    "rating": 2.0,
    "comment": "Geen enkele impact op dit spelletje, de naam \"filler\" niet eens waard.",
    "timestamp": 1505080800
  },
  {
    "username": "shouting man",
    "rating": 2.0,
    "comment": "IOS IPAD only\n\nAlso tried a couple of times at Playopolis Rochester. Not a good experience.",
    "timestamp": 1503784800
  },
  {
    "username": "Havox",
    "rating": 2.0,
    "comment": "This is one of those games that be over in 5 minutes or go on for 5 hours. I play this with my kids and they enjoy it. Not one of my favorites, but good family game.",
    "timestamp": 1497391200
  },
  {
    "username": "Fubuju",
    "rating": 2.0,
    "comment": "This was fun when I didn't know better (early twenties and drunk).",
    "timestamp": 1496700000
  },
  {
    "username": "rasslor",
    "rating": 2.0,
    "comment": "I hate this game and all variations of it.",
    "timestamp": 1489186800
  },
  {
    "username": "alexs34",
    "rating": 2.0,
    "comment": "Horrible.",
    "timestamp": 1488063600
  },
  {
    "username": "Catbug",
    "rating": 2.0,
    "comment": "Waste of time",
    "timestamp": 1486681200
  },
  {
    "username": "nhjelmberg",
    "rating": 2.0,
    "comment": "A chaotic and luck-driven card games where you play cards, change conditions and eventually see a player lucky enough to win. Not strategic enough for a game, nor fun enough for a filler.",
    "timestamp": 1483916400
  },
  {
    "username": "Mycupcakegirl",
    "rating": 2.0,
    "comment": "Why do people like this? I only play it because it is hilarious how bad it actual is.",
    "timestamp": 1480806000
  },
  {
    "username": "Svengaard",
    "rating": 2.0,
    "comment": "I'm hard pressed to call this a game. I'll still play it if some one else is really keen on it, but I won't go out of my way to do so.",
    "timestamp": 1479769200
  },
  {
    "username": "JasonMerosa",
    "rating": 3.0,
    "comment": "The only time someone wins is if they have the goal cards when it's played.",
    "timestamp": 1760652000
  },
  {
    "username": "ahkat",
    "rating": 3.0,
    "comment": "Sold 10/2025 Zulu Bazaar for $4",
    "timestamp": 1760306400
  },
  {
    "username": "rcoil",
    "rating": 3.0,
    "comment": "I can see it being interesting in subverting expectations of how a game is supposed to work, but once the novelty has worn off you are left with a bad game that's equivalent to a dice roll.",
    "timestamp": 1755554400
  },
  {
    "username": "AgentStone",
    "rating": 3.0,
    "comment": "So so so random, I didn't enjoy it. Would play only with alcohol.",
    "timestamp": 1754690400
  },
  {
    "username": "Smokalotapotamus",
    "rating": 3.0,
    "comment": "Review: A simple game to teach new players how to deal with changing rules. Excellent as one of many gateway games to teach players on their way to more complicated games. That said, I loathe playing this game. I only bring it out for people who are very new to modern table top games.\n\nTags: Best Four, Party Game, Small",
    "timestamp": 1753135200
  },
  {
    "username": "mawilson4",
    "rating": 3.0,
    "comment": "I was told it was supposed to be funny. It was not.",
    "timestamp": 1749679200
  },
  {
    "username": "Deltonbrack",
    "rating": 3.0,
    "comment": "I like Fluxx. I prefer the themed ones better for my own personal taste for flavor.",
    "timestamp": 1748901600
  },
  {
    "username": "hf774",
    "rating": 3.0,
    "comment": "bad game but I played 30 times.",
    "timestamp": 1748124000
  },
  {
    "username": "Plargyplop",
    "rating": 3.0,
    "comment": "No. No, no, no. No.",
    "timestamp": 1744236000
  },
  {
    "username": "cubntin",
    "rating": 3.0,
    "comment": "2-6 players",
    "timestamp": 1743289200
  },
  {
    "username": "Beastly_Venturer",
    "rating": 3.0,
    "comment": "2 plays. Not my style and a complete crap shoot. But given the title you know what you are in for.",
    "timestamp": 1740265200
  },
  {
    "username": "ShiannLin",
    "rating": 3.0,
    "comment": "1999 Mensa Select Winner\n2005 Japan Boardgame Prize Best Japanese Game Nominee",
    "timestamp": 1733785200
  },
  {
    "username": "pluviometer",
    "rating": 3.0,
    "comment": "A silly game I had some fun with back in the first year of college. One time, someone's Keepers spelled out \"Taxes the Toaster love milk time\", which was probably the pinnacle of enjoyment one can get out of this game.",
    "timestamp": 1733353200
  },
  {
    "username": "deductionfun",
    "rating": 3.0,
    "comment": "Complete luckfest.",
    "timestamp": 1732143600
  },
  {
    "username": "LovecraftCountry",
    "rating": 3.0,
    "comment": "Random and ridiculous, Fluxx never fails to be strange. It's not really my style.",
    "timestamp": 1730242800
  },
  {
    "username": "Legodude57",
    "rating": 3.0,
    "comment": "Fun silly game where there is no way to really plan a winning strategy. Some players love to \"troll\" other players by reducing the amount of cards you can have in your hand, etc. It is so simple that you can bring to a party and not worry about people struggling to play or getting creamed. New players win all the time.\n\nSold 9/2024",
    "timestamp": 1727474400
  },
  {
    "username": "GuidoVanHorn",
    "rating": 3.0,
    "comment": "I succesfully avoided this game for decades...however my niece loves it and I got roped into a game. The key to games in this genre is to embrace the chaos and enjoy it like a rollercoaster. If your goal is to win at all costs you will be frustrated.",
    "timestamp": 1727215200
  },
  {
    "username": "Zpacequark",
    "rating": 3.0,
    "comment": "+It's fun to change the rules of the game as it is in progress.\n\n-Random and chaotic.\n-\"I just drew a winning card. Can anyone else respond? Nope. Okay, I guess I won?\"",
    "timestamp": 1727128800
  },
  {
    "username": "LuisGomez",
    "rating": 3.0,
    "comment": "Can be a bit long. It's too chaotic for me.",
    "timestamp": 1711922400
  },
  {
    "username": "Kaffedrake",
    "rating": 3.0,
    "comment": "Played once and was not amused.\n\nThrifted on 22/3 2024.",
    "timestamp": 1711148400
  },
  {
    "username": "Jittery Jester",
    "rating": 3.0,
    "comment": "easy to teach but the game can either run too short or too long.",
    "timestamp": 1710716400
  },
  {
    "username": "realityfoible",
    "rating": 2.6,
    "comment": "Fluxx can tell you a lot about someone's gaming tastes.\nPersonally I dislike games where winning and loosing is pure unfair chaos.\n\nHowever I appreciate that it is this exact chaos that makes Fluxx novel and accessible for everyone, even the non-competitive and game shy. There is absolutely no barrier to entry, and no performance anxiety to a game where progress is a silly crapshoot.\nLike with Catan, I respect the work Fluxx does to bring people into our hobby even if I never want to play it.",
    "timestamp": 1706396400
  },
  {
    "username": "Mounthail",
    "rating": 3.0,
    "comment": "People play cards.\nAfter a long time someone says \"I won\".\nPlay then ends in silence.\n\nDrunk play highly recommended.",
    "timestamp": 1704582000
  },
  {
    "username": "Instinct8",
    "rating": 3.0,
    "comment": "Haven't played but probably won't play shrug",
    "timestamp": 1704150000
  },
  {
    "username": "muzrobertson",
    "rating": 3.0,
    "comment": "When I was a child, I spoke as a child, I understood as a child, I thought as a child; but when I became a man, I put away childish things.",
    "timestamp": 1701990000
  },
  {
    "username": "Teslavstwain",
    "rating": 3.0,
    "comment": "It really annoys me to be working toward something and have it just randomly change. I REALLY REALLY don't like this game.",
    "timestamp": 1699484400
  },
  {
    "username": "FrozenScoundrel",
    "rating": 3.0,
    "comment": "[ 6 ]",
    "timestamp": 1696456800
  },
  {
    "username": "sosopoptart",
    "rating": 2.9,
    "comment": "The only time winning a game by random should be permissible is if the game is aimed at an age group too young for strategy. For that reason, Candyland is an acceptable game, and Fluxx is unforgiveably bad. The game gives you enough card text to waste your time trying to strategize, just for you to have to play all of it pointlessly. And worst of all, this could go on for 45 minutes.",
    "timestamp": 1693864800
  },
  {
    "username": "Khumbanigash",
    "rating": 3.0,
    "comment": "I remember that I found the idea of shifting rules intriguing when I got this game. But after a few games it just bored the hell out of me...",
    "timestamp": 1693692000
  },
  {
    "username": "jcoopersd",
    "rating": 3.0,
    "comment": "Not a good game by any means, but kind of a funny activity. I'd honestly rather play this than some other well-praised light games like TTR or Splendor.",
    "timestamp": 1690063200
  },
  {
    "username": "NvidiaJunkie",
    "rating": 3.0,
    "comment": "Good game to kill some time with, but I won't offer to pull it out myself.",
    "timestamp": 1689976800
  },
  {
    "username": "FlamezOfGamez",
    "rating": 3.0,
    "comment": "Version 5.0\n\nFluxx is a series very near and dear to my heart, but adding some sort of more cohesive theme to the game does wonders for it. Any other version of Fluxx is better than this, but I hold no negative feeling toward the original.",
    "timestamp": 1688767200
  },
  {
    "username": "Spalaczky",
    "rating": 3.0,
    "comment": "Pray that someone can end the game early or you might be stuck on this game for a while.",
    "timestamp": 1687557600
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "I suspect Fluxx was born out of a desire to see MTG's promise (\"card text can change any rule\") realised to a greater potential. And the base framework is here, but the card design is overall just silly and swingy with no sense or reason. There are simply too many potential victory conditions and too many crazy wild swings for anything but purely opportunistic play to prevail; once the \"ah, I see\" of how cards interact has been explored, nothing's really here to hold interest. The solution from the publisher's perspective is, of course, a bazillion additional and equally silly versions/expansions to maintain that exploratory phase alive (and profits rolling).\n\nSessions can end in 30 seconds or really overstay their welcome within the 30 min territory, including excruciating (for your opponents) turns of optimising the draw/play of over a dozen cards. Still shorter than Munchkin.",
    "timestamp": 1685052000
  },
  {
    "username": "samcrane2011",
    "rating": 3.0,
    "comment": "I feel like I'm caught between a rock and a hard place of not wanting to be the guy on a high horse who can't enjoy a silly card game like Fluxx, but who also just really does not enjoy Fluxx...",
    "timestamp": 1682460000
  },
  {
    "username": "Joakley815",
    "rating": 2.5,
    "comment": "- Terrible. Will not play again.\n\nIt's Fluxx. The idea is a neat one (constantly changing rules), but the execution unfortunately is just not very good.",
    "timestamp": 1679439600
  },
  {
    "username": "Stylemys",
    "rating": 2.5,
    "comment": "I really enjoyed this game once upon a time. It's utterly random, but it was amusing nonetheless. That lost its luster pretty quick though. Then it just started getting painful to sit through. Nowadays, I hope to never have to play again. Ever.",
    "timestamp": 1676934000
  },
  {
    "username": "HunDundee",
    "rating": 3.0,
    "comment": "BGA",
    "timestamp": 1674601200
  },
  {
    "username": "eskravitz",
    "rating": 3.0,
    "comment": "Sold (along with Family Fluxx) at WGGCon auction for $5.",
    "timestamp": 1674342000
  },
  {
    "username": "sekipl",
    "rating": 3.0,
    "comment": "stupid random game",
    "timestamp": 1673910000
  },
  {
    "username": "hi1hi1hi1hi1",
    "rating": 3.0,
    "comment": "A wild ride where anything (the cards say) can happen.\nPlayed in: 2022",
    "timestamp": 1672700400
  },
  {
    "username": "FlamezOfGamez",
    "rating": 3.0,
    "comment": "Version 4.0\n\nFluxx is a series very near and dear to my heart, but adding some sort of more cohesive theme to the game does wonders for it. Any other version of Fluxx is better than this, but I hold no negative feeling toward the original.",
    "timestamp": 1663797600
  },
  {
    "username": "millsyboy",
    "rating": 3.0,
    "comment": "It's pretty random, but at least not completely. Some of the rule combinations can be pretty fun while they last, but the game's best feature is probably its (usually) short playing time.",
    "timestamp": 1657663200
  },
  {
    "username": "queenzentar",
    "rating": 3.0,
    "comment": "I have a bunch of fluxx games.",
    "timestamp": 1654898400
  },
  {
    "username": "JohnWaffles",
    "rating": 3.0,
    "comment": "I introduced this game to a few other gamers who have mostly just played more modern designs and we made it maybe two rounds around the table before someone asked, \"What is the point of playing this game?\"\n\nI know you could make that argument about any hobby activity ever, but there is so much randomness here with so little reward that it just seems like a waste of time. The game does not respect your time, is what I'm trying to say.",
    "timestamp": 1649541600
  },
  {
    "username": "shivianfalcon",
    "rating": 3.0,
    "comment": "Played it a few times, outstays its welcome and just wanted it to end every time. The sheer randomness and lack of decision space makes me dislike it. Hate being stuck with situations like hand size 0 and must draw and play 1 card every turn yay...",
    "timestamp": 1648936800
  },
  {
    "username": "ChrisMukherjee",
    "rating": 3.0,
    "comment": "Depending on the cards you have in your hand, your turn can either be very short or way too long. Turns often end up being long because players need to spend time reading and understanding their cards and considering what order to play cards in for best results.",
    "timestamp": 1648936800
  },
  {
    "username": "GinoPino39",
    "rating": 3.0,
    "comment": "too random and luck dependent",
    "timestamp": 1648677600
  },
  {
    "username": "rainyl",
    "rating": 3.0,
    "comment": "宣传里说是游戏规则和游戏目标会在游戏过程中不停改变，其实变的只是每回合的摸牌数、打牌数、手牌上限等几个变量，游戏目标也只是在几个不同的固定搭子之间切换而已。所以宣传上有意在夸大「规则改变」这个点子。\n\n但想出一个好的点子，和设计一个好的游戏，差距还是有点远的。游戏实际玩起来的感觉一是无聊，二是不可控。几个规则变量的频繁改变对于游戏乐趣毫无帮助。至于策略，基本就只有背下游戏目标牌的固定搭配，然后留在手上等着偷鸡撞大运。\n\n真的想体验这种规则失效的感觉，我可能宁愿选择《试个好游戏》这种完全放弃了规则的。",
    "timestamp": 1647385200
  },
  {
    "username": "finke67",
    "rating": 3.0,
    "comment": "My wife saw this game in the store and wanted to get it... It is entertaining for a couple of minutes.",
    "timestamp": 1646866800
  },
  {
    "username": "formulagames",
    "rating": 3.0,
    "comment": "although the concept is funny, you basically have no real influence on the game. the rules change all the time. we played 4 rounds. in 2 of the rounds, the game was finished so quickly that 1 person did not even get to play...",
    "timestamp": 1645052400
  },
  {
    "username": "Abdul",
    "rating": 3.0,
    "comment": "If you want a card game with rule breakers, I would suggest Red 7 (or any other Carl Chudyk game) over this. Fluxx is just a pointless random mess, and I have no idea how it managed to spawn so many spinoffs.",
    "timestamp": 1642287600
  },
  {
    "username": "PaperDesigner",
    "rating": 3.0,
    "comment": "These are light and random and bad. All of them. I might be more willing to play a theme I like more, but they're still not that interesting.",
    "timestamp": 1642028400
  },
  {
    "username": "mbower3",
    "rating": 3.0,
    "comment": "Too random and did not like the goals constantly changing.",
    "timestamp": 1641510000
  },
  {
    "username": "cwaq",
    "rating": 3.0,
    "comment": "2015 - købt med Charlotte",
    "timestamp": 1641337200
  },
  {
    "username": "techstocklava",
    "rating": 3.0,
    "comment": "Played again recently and reminded me of everything that frustrated me about it. My biggest gripe is unlike practically every other game I’ve ever played, there’s no guarantee of progress toward an ending. You could win on your first turn, or be playing for the rest of your life, there’s really no way to be sure. OK, typically it ends rather quickly. But when it doesn’t, the knowledge that it doesn’t need to end, ever, seeps into your gut like a creeping horror.\n\nBasically this game is what happens when the power of a single turn is turned up to 11. There are amazing plays to be made, but if you can’t win, the state of the game when it returns to you will be unrecognizable. You have to hold onto your best cards in the hope you can use them on your next turn, but you also need to make sure no one else is holding anything useful, so your opponents will be doing their best to destroy everything you have before your next turn, and it’s not hard to do.\n\nWinning can either happen by pure luck or by eventually letting your opponents’ greed or impatience get the better of them, as they pass up an opportunity to destroy you in order to preserve themselves. Although there’s a certain grim satisfaction in the latter it doesn’t make up for the general feeling of bashing your head on a wall, in my book.",
    "timestamp": 1640646000
  },
  {
    "username": "johnnyboystnl",
    "rating": 3.0,
    "comment": "I won't argue that some people could enjoy this game, but it's really not for me. It's meant to be a wacky, swingy game full of hilarious crazy rules that continually change. In many ways it feels like a parody of a traditional card game, but the constantly changing goals of the game and abundance of targeted and ruthless cards make it impossible to do any sort of engine building or even get closer to winning as the game progresses.\n-The game makes you feel like you can influence the direction of the game in your favor, but %90-95 of the time you wind up frustrated that the game doesn't even look the same by the time it got back to you. The entire goals of the game may have changed, rendering that plan you had useless, so you have to start from scratch (as if you had just started the game).\n-I'm actually a fan of wacky, luck-driven games (quacks of quedlinburg,6 nimmt, King of Tokyo). This just goes too far.\n\nI think any game can be fun with the right group and the right mindset. That being said, some games facilitate a quality shared experience better than others. This game continually does a very poor job of this compared to many other games.",
    "timestamp": 1637362800
  },
  {
    "username": "Destov",
    "rating": 3.0,
    "comment": "BGA",
    "timestamp": 1637103600
  },
  {
    "username": "SweKenZo",
    "rating": 3.0,
    "comment": "Card game with alot of luck. Varying rules sounds cooler in theory, than it actually plays out.",
    "timestamp": 1635372000
  },
  {
    "username": "Elm0__",
    "rating": 3.0,
    "comment": "Too chaotic and random for my liking.",
    "timestamp": 1633903200
  },
  {
    "username": "LazyRobot11",
    "rating": 3.0,
    "comment": "Why did I play this game more than once?!",
    "timestamp": 1632607200
  },
  {
    "username": "PablodeLaVista",
    "rating": 3.0,
    "comment": "Random and chaotic game - and not in a fun way. Wins come out of nowhere and it is very possible to lock the game down. This game shows its age.",
    "timestamp": 1631397600
  },
  {
    "username": "Patman1",
    "rating": 3.0,
    "comment": "It's a decent activity but unfortunately can have a tendency to overstay it's welcome. There are very few meaningful decisions. You don't play the game so much as the game just sort of happens to you. It's fine for playing something with non-gamers.",
    "timestamp": 1631397600
  },
  {
    "username": "DixieSkullz",
    "rating": 3.0,
    "comment": "Lots of people love Fluxxx. It just doesn't work for me. There's not much game to it, really -- with the rule changes, it can easily become \"draw some cards, play all of them.\" There's no strategy at all. By the end, I usually just want someone to win so we can play something else. This is one of the few games that if someone suggests it, I'll say no.",
    "timestamp": 1628373600
  },
  {
    "username": "iadena",
    "rating": 3.0,
    "comment": "Too chaotic. Too random.",
    "timestamp": 1626127200
  },
  {
    "username": "Qhorin",
    "rating": 3.0,
    "comment": "German-language version. Trimmed from collection.\n\nPlayed on BGA. Randomness overwhelms the little bit of tactics for me.",
    "timestamp": 1625695200
  },
  {
    "username": "polyjay",
    "rating": 3.0,
    "comment": "Very little incentive to pull this out. I don't even think the Uno crowd would like this one, as it feels out of control.\nCould work as a drinking game?",
    "timestamp": 1625608800
  },
  {
    "username": "t_ovatum",
    "rating": 3.0,
    "comment": "not great but was one of my first introductions to games that didn't totally suck. oddly enough, it seems pretty bad now. it's sort of fun as a diversion but it's so random.",
    "timestamp": 1624917600
  },
  {
    "username": "WatsonChao",
    "rating": 3.0,
    "comment": "完全靠運無法掌控的卡牌遊戲，規則勝利條件一直變最後贏得人也莫名其妙，建議規則可大改都比原規則好。",
    "timestamp": 1623535200
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "I see why people hate it. But it's ultimately just fascinating to see the chaotic nature of the game pan out. I love changing the rules.",
    "timestamp": 1759356000
  },
  {
    "username": "tdhsmith",
    "rating": 3.9,
    "comment": "This was a really excellent stepping stone to have available on my journey into the hobby, but I just can't tolerate playing it much more. At anything but 2P, planning beyond your current hand is basically useless. It can somehow slog (you drew 5 played 5 and nothing really came of it? / we made it to a full deck reshuffle?). I can actually tolerate the randomness -- if anything it's sort of the joy of the experience -- but most of the cards are more \"atomic\" effects than lending themselves to more *emergent* experiences, so the sense of discovery wanes after a handful of plays in the Fluxx system.\n\nAll that said and this would rank fine alongside the Exploding Kittenses of the world. But for some reason this game seems to make the people who win feel clever and that evokes a strong annoyance in me. I don't have an emotional attachment to winning Fluxx, nor, despite the theatrics I often take up while acting as a game avatar, do I really have personal attachment to my win-loss ratio in ANY games. But for some reason having this chaotic experience and then seeing satisfaction in the winner's eyes triggers an unusual grumpiness in me, like watching a silver-spooned triply-safety-netted individual talking about the American dream and how they just \"put their nose down\" and \"made their own success\".\n\nSo yes, it's a me problem. I can't fully engage the \"I'm playing Uno with my family\" mode in my brain. But I'm not going to rate this on some platonic ideal of other people's experiences. So there. That is my... 3 paragraph analysis of a silly family card game.\n\nRereading this, maybe it isn't quite fair to call that grumpiness \"unusual\"...",
    "timestamp": 1755986400
  },
  {
    "username": "Arnar146",
    "rating": 4.0,
    "comment": "gísli",
    "timestamp": 1754431200
  },
  {
    "username": "Mezmorki",
    "rating": 4.0,
    "comment": "I enjoy Fluxx, but it's pretty 50/50 with the rest of my gaming group, so it doesn't hit the table often.",
    "timestamp": 1751839200
  },
  {
    "username": "EvilCheesypoof",
    "rating": 4.0,
    "comment": "Why I got rid of it: Cool idea 20 years ago, just played out at this point",
    "timestamp": 1749333600
  },
  {
    "username": "mr_ben_jen",
    "rating": 4.0,
    "comment": "kinda lame",
    "timestamp": 1748469600
  },
  {
    "username": "Oninohugo",
    "rating": 4.0,
    "comment": "Exactly whatever.",
    "timestamp": 1746568800
  },
  {
    "username": "sandwichboy7",
    "rating": 4.0,
    "comment": "Baker",
    "timestamp": 1743804000
  },
  {
    "username": "nmetken",
    "rating": 4.0,
    "comment": "This game is just ok to me, its fun to BS and sit around and see what kind of crazy rules you can throw into play but at the end of the game at no point have I ever felt like what I did contributed to me winning or losing, literally the dictionary definition of right place right time in order to win.",
    "timestamp": 1743631200
  },
  {
    "username": "Bagherra",
    "rating": 4.0,
    "comment": "wonderful game of chaos but can become tiresome rather quickly.",
    "timestamp": 1742857200
  },
  {
    "username": "silenceisgolder",
    "rating": 4.0,
    "comment": "Good for a few laughs, but I can't imagine playing too much of this.",
    "timestamp": 1742770800
  },
  {
    "username": "dennislaumen",
    "rating": 4.0,
    "comment": "Fluxx is a funny gimmick, but I do not enjoy it's random chaos in any way. I'm not sure why that is, because I often enjoy randomness and chaos.",
    "timestamp": 1742598000
  },
  {
    "username": "sorentheborn",
    "rating": 4.0,
    "comment": "it's unique and fun, but very chaotic. there is a time and a place for it and i'm glad to have it in my collection, but if the box was just the slightest larger i would not own it. my first game was digitally, which was a disaster. much better on the table IMO.",
    "timestamp": 1742166000
  },
  {
    "username": "queerchameleon",
    "rating": 4.0,
    "comment": "green 100",
    "timestamp": 1742166000
  },
  {
    "username": "tomvdvel",
    "rating": 4.0,
    "comment": "Chaos: the card game. I actually enjoyed some plays of this where I got to draw a large amount of cards, change the rules and win out of nowhere in one big turn. Even then, this is much, much too random to receive a passing score.",
    "timestamp": 1737932400
  },
  {
    "username": "lil_canuck",
    "rating": 4.0,
    "comment": "Way too high of randomness and too low in skill/agency. I don't like it at all. Husband enjoys it.",
    "timestamp": 1736463600
  },
  {
    "username": "Rygel",
    "rating": 4.0,
    "comment": "OK game. Stupid, silly fun. Better to be played as a drinking game.\n\nGot in 2007",
    "timestamp": 1731279600
  },
  {
    "username": "Frugus",
    "rating": 4.0,
    "comment": "Sold on Marketplace - November 7th 2024",
    "timestamp": 1730934000
  },
  {
    "username": "ERPriest",
    "rating": 4.0,
    "comment": "Meh. To random with no real game in there. Would play again if others wanted, but otherwise................",
    "timestamp": 1726956000
  },
  {
    "username": "plyons",
    "rating": 4.0,
    "comment": "Chaotic and without much substance, but fun/funny with the right group.",
    "timestamp": 1725832800
  },
  {
    "username": "oldgoat3769967",
    "rating": 4.0,
    "comment": "I have no love for Fluxx. there is little player control in the game design and does the game ever really \"end\"?",
    "timestamp": 1723240800
  },
  {
    "username": "CannonFodderTed",
    "rating": 4.2,
    "comment": "Who knew such a simple and random game could cause me to have so much fun with my kids! Yeah, it's silly, yeah its kind of random, but the game is so smooth and so easy that it just works. You can teach it in a matter of seconds (draw a card, play a card, abide by any new rules, try and achieve whatever the current goal is, keeper cards get played in front of you...that's the entire rules basically). The new rules that the cards add are well thought out and work well with each other. This is a neat filler to have around to pull out with kids, family, or non gamers that requires next to no effort to explain and teach. Not a lot of meat here but fun to be had and their is a plethora of themed versions that can be tossed right in with the base game.",
    "timestamp": 1722549600
  },
  {
    "username": "rainbowrose",
    "rating": 4.0,
    "comment": "USED",
    "timestamp": 1722204000
  },
  {
    "username": "PizzaChip",
    "rating": 4.2,
    "comment": "W tę gra trzeba grać tylko dla funu jaki daje, nie liczcie, że staniecie się w niej niepokonani, bo rozgrywka jest niesamowicie nieprzewidywalna. Tu wszystko się może zdarzyć, a losy rozgrywki mogą się zmienić diametralnie po zagraniu jednej karty.\n\nOcena po 6 partiach w 3 i 4 osoby. Średni czas gry = 24 min.\n\nbga\nOlek",
    "timestamp": 1716156000
  },
  {
    "username": "HumbleS",
    "rating": 4.0,
    "comment": "The core concept of Fluxx appeals to me - an extremely minimal card game whose rules are made more elaborate and complex by the very cards that are played - but the execution feels lackluster. It's extremely chaotic & the rules changes are difficult to plan around, not to mention the highly variable game-length... but the chaos is sort of the point. What I take more issue with is the fact that many of the cards are just not very interesting. A huge portion of them are the so-called \"keepers\", cards which you put in front of you and have no effect of their own. Almost all of the objectives are just a pair of keepers you need to acquire. Many of the rules cards just change how many cards you can draw or play. The few cards that actually do something interesting usually involve some random element, or affect all players the same way, which makes it hard to judge how useful they are. At times dull and at others confusing, but never all that interesting. Still, Fluxx is wild enough to keep my interest for a short time.",
    "timestamp": 1713477600
  },
  {
    "username": "DarthRyon",
    "rating": 4.0,
    "comment": "Simply not fun. Nowadays dumb games have atleast a decent theme and are easy to read. Fluxx has no theme and is unpredictable, especially in terms of game lenght.",
    "timestamp": 1712786400
  },
  {
    "username": "Dessyreqt",
    "rating": 4.0,
    "comment": "Best at: 4 - Plays: 2-6",
    "timestamp": 1712613600
  },
  {
    "username": "tootstorm",
    "rating": 4.0,
    "comment": "Game straight up tries its dangedest to annoy the heck outta youse.",
    "timestamp": 1709766000
  },
  {
    "username": "peter haslehurst",
    "rating": 4.0,
    "comment": "Enjoyable light game if you accept the chaos as part of the experience. Not for control-freaks!",
    "timestamp": 1707519600
  },
  {
    "username": "noahcoad",
    "rating": 4.0,
    "comment": "Just too crazy. Fun, but can't keep a plan or strategy. Dominion is this style card engine game done right.",
    "timestamp": 1703631600
  },
  {
    "username": "Frank_Ly",
    "rating": 4.0,
    "comment": "Barely a game. Put down a card, maybe you get closer to wining, maybe you wont. I wouldnt waste energy thinking. But oh boy, if youre REALLY lucky you might accidently make a joke.\n\nIts like being on the outside of an inside joke, and i truly dont see the appeal. Just play something thats actually funny. Even Cards Against Humanity is preferable\n\n10 - Perfect\n9 - Perfect, but I wish it was a little more exciting\n8 - Pretty darn good, get it if you can afford it, maybe tiny gripes\n7 - Pretty good, would recommend getting if it is on sale\n6 - It's fine, maybe get if there's a heavy sale\n5 - Little boring, the game is functional though\n4 - Is technically a game\n3 - The bad movie of board games\n2 - Somehow even worse\n1 - Purely hypothetical, unimaginably bad",
    "timestamp": 1700434800
  },
  {
    "username": "Ellogeyen",
    "rating": 4.0,
    "comment": "2-4 plays (2013)",
    "timestamp": 1696802400
  },
  {
    "username": "adi_venturer",
    "rating": 4.0,
    "comment": "Why? Just why?\n\n(Plays: 2)",
    "timestamp": 1695765600
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "Magic: The Gathering if you removed the depth, strategy, and sophistication.\n\nI used to play this with mixed casual company back in High School. Back then It had it's moments where DRAW 5 and PLAY ALL would be in play, then one player would proceed to play TAKE ANOTHER TURN, LET'S DO IT AGAIN, and TAKE ANOTHER TURN leading towards an inevitable victory, but those moments were more frequently offset by one player having two corresponding Keepers in play, and another player being forced to play the matching Goal card, giving a win to another player.",
    "timestamp": 1694556000
  },
  {
    "username": "papyrus2",
    "rating": 4.0,
    "comment": "Too chaotic, but I would play it again in a party setting. Some expansions are more fun than the OG.",
    "timestamp": 1690754400
  },
  {
    "username": "Reciclerishu",
    "rating": 4.0,
    "comment": "Random, lucky party-ish card game, where rules changes while you play. Definitely game not for me.",
    "timestamp": 1690668000
  },
  {
    "username": "jimmyorr",
    "rating": 4.0,
    "comment": "Best: 4",
    "timestamp": 1688767200
  },
  {
    "username": "Pr1meTim3",
    "rating": 4.0,
    "comment": "just played it 3 times and it was okay.",
    "timestamp": 1683410400
  },
  {
    "username": "rynelf",
    "rating": 3.5,
    "comment": "--Mar2005-- Interesting experience, and not one I desire oft to repeat. I find myself looking for ways to simply end the game - without any regard for who it is that wins! Sadly, my children find it amusing.\n--Mar2009-- I do see one considerable virtue of the game, though. My youngest is developing his reading skills: to be more precise, he can read words, but putting them together to understand what exactly is intended by the author is the skill under development. Reading a set of rule cards in Fluxx seems like really good practice for him. And, what's more, he enjoys it.",
    "timestamp": 1680559200
  },
  {
    "username": "krit1789",
    "rating": 3.5,
    "comment": "Chaotic. There must be some (American) cultural references that I do not understand and do not find interesting.",
    "timestamp": 1679353200
  },
  {
    "username": "cdefrisco",
    "rating": 4.0,
    "comment": "I use this game only to bring young people into the hobby. I really don't enjoy the game because of the 99% luck/chaos involved. But the kids seem to love it. Probably because its a game about breaking/changing the rules. I have adult friends who enjoy this as well.",
    "timestamp": 1677020400
  },
  {
    "username": "Zalasta",
    "rating": 4.0,
    "comment": "It’s fluxx and it is super random. Can end very quickly or take forever. You’ll either hate it or find the joy in the chaos. Count me in the former so once is enough for me!",
    "timestamp": 1675033200
  },
  {
    "username": "Transmuter",
    "rating": 4.0,
    "comment": "I do not like Fluxx. It's so random as to make any strategy meaningless.",
    "timestamp": 1674169200
  },
  {
    "username": "tangentline",
    "rating": 4.0,
    "comment": "Completely random and depends on what cards you get. Some strategy in saving the winning cards until the right time but that's it. Oftentimes you're forced to play the only card in your hand and that's the only action you can take.",
    "timestamp": 1672873200
  },
  {
    "username": "killerjoe1962",
    "rating": 4.0,
    "comment": "Eh, I don't hate it.",
    "timestamp": 1672527600
  },
  {
    "username": "panglossian",
    "rating": 4.0,
    "comment": "5+",
    "timestamp": 1672182000
  },
  {
    "username": "Marthinoth",
    "rating": 4.0,
    "comment": "BGA",
    "timestamp": 1668639600
  },
  {
    "username": "Caro13",
    "rating": 4.0,
    "comment": "Too random.",
    "timestamp": 1666821600
  },
  {
    "username": "gusjustgus1",
    "rating": 4.0,
    "comment": "2-6 Players, 5-30 Min",
    "timestamp": 1665439200
  },
  {
    "username": "Nathardicus",
    "rating": 4.0,
    "comment": "Not a fan of these games that change the rules on every card.",
    "timestamp": 1658872800
  },
  {
    "username": "BrendenV",
    "rating": 4.0,
    "comment": "Gave away",
    "timestamp": 1658872800
  },
  {
    "username": "Lisa_a_random_nerd",
    "rating": 4.0,
    "comment": "Stefan's parents. sell.",
    "timestamp": 1658786400
  },
  {
    "username": "vladdswrath",
    "rating": 4.0,
    "comment": "I get that this is a silly, low investment game which is fine. But like Munchkin, how on earth are there a hundred versions of this. People are strange.",
    "timestamp": 1658786400
  },
  {
    "username": "ahyangyi",
    "rating": 4.0,
    "comment": "Makes one of the most exciting game introduction. (\"We begin with two simple rules, and then every rule can change during the game!\") But it's actually quite lacking in actual gameplay.\n\nThankfully, the good idea (changing available rules/goals during a game) is now an integral part of many better games...",
    "timestamp": 1654552800
  },
  {
    "username": "ErikLevin",
    "rating": 4.0,
    "comment": "It's a good idea, and I get that it's supposed to be chaotic, but I would still like it more if skill had just a tad more influence over who wins.",
    "timestamp": 1652997600
  },
  {
    "username": "Olafslomp",
    "rating": 4.0,
    "comment": "Played on BGA",
    "timestamp": 1652392800
  },
  {
    "username": "Guacacole",
    "rating": 4.0,
    "comment": "BGA",
    "timestamp": 1652220000
  },
  {
    "username": "skrebs",
    "rating": 4.0,
    "comment": "Depends on the situation. With non-gaming friends and beer, good fun. Without beer, can be long and drawn out till you pray that somebody just wins the damn thing.",
    "timestamp": 1651442400
  },
  {
    "username": "culturejam",
    "rating": 4.0,
    "comment": "too frustrating to be strategic, too many rules to keep track of for a party game",
    "timestamp": 1650578400
  },
  {
    "username": "tiagoVIP",
    "rating": 4.0,
    "comment": "Simple rules (at the beginning at least) and with a great deal of chaotic fun.\n\nThe downtime can be a pain though, as you can see the others play \"Draw 4, Play 3\" or \"Play All\" and so forth, and in your turn the rules changed so that all you can do is, well, play 1 and pass. For this reason, I found that the 3 players game works a lot better than the 4+.\n\nThe box could be a little bigger (so that the cards could be sleeved and still fit in it).",
    "timestamp": 1648591200
  },
  {
    "username": "BillNC",
    "rating": 4.0,
    "comment": "Interesting concept, but pretty random.",
    "timestamp": 1648504800
  },
  {
    "username": "chaddyboy_2000",
    "rating": 4.0,
    "comment": "A good way to waste some time! Good fpr play with non-gamers, and for some reason, fairly addictive!",
    "timestamp": 1645570800
  },
  {
    "username": "luija",
    "rating": 4.0,
    "comment": "1",
    "timestamp": 1645484400
  },
  {
    "username": "bronwenwatts",
    "rating": 4.0,
    "comment": "Fun for a short game every now and then. Can get pretty crazy with all the rules that can be going at the same time.",
    "timestamp": 1644706800
  },
  {
    "username": "Ychor",
    "rating": 4.0,
    "comment": "2007: 13 plays\n2008: 6 plays",
    "timestamp": 1644447600
  },
  {
    "username": "butsam",
    "rating": 4.0,
    "comment": "Great light game, but need a lot of people for maximum fun.",
    "timestamp": 1644361200
  },
  {
    "username": "Wentu",
    "rating": 4.0,
    "comment": "I am sorry but I hate this kind of messy chaotic activity... it's not even a game, just .... no... don't let me add more...",
    "timestamp": 1643756400
  },
  {
    "username": "CraftyFlutterby",
    "rating": 4.0,
    "comment": "Board Game Arena\nIt's a little wild and unpredictable. I'd enjoy it more themed with IP.",
    "timestamp": 1643151600
  },
  {
    "username": "velochy",
    "rating": 4.0,
    "comment": "Slightly too random for my tastes as a game. Good time killer tho.",
    "timestamp": 1640732400
  },
  {
    "username": "Koennen",
    "rating": 5.0,
    "comment": "Better as a concept.",
    "timestamp": 1761007860
  },
  {
    "username": "Weltmacht",
    "rating": 5.0,
    "comment": "Russisch",
    "timestamp": 1759528800
  },
  {
    "username": "Iocaine",
    "rating": 5.0,
    "comment": "2-6 players\nWell used, not bent, edges just no longer white",
    "timestamp": 1757541600
  },
  {
    "username": "Muppetus Galacticus",
    "rating": 5.0,
    "comment": "Archived",
    "timestamp": 1755900000
  },
  {
    "username": "botticus",
    "rating": 5.0,
    "comment": "Apparently I never recorded a play of regular Fluxx before, but it's the same as other Fluxx. Play cards until someone wins. The last two plays of Fluxx games have involved long stretches where the rules were basically draw cards and play all your cards. Appreciated the lack of needing to attempt a strategy.",
    "timestamp": 1751752800
  },
  {
    "username": "tento4pm",
    "rating": 5.0,
    "comment": "Alright. The win conditions keep changing. The game is really a race to see who can complete the win condition before it gets thrown out. Its just alright as a game.",
    "timestamp": 1746568800
  },
  {
    "username": "JediMaster0310",
    "rating": 5.0,
    "comment": "Very swingy with minimal strategy, but still fun as a very light group game.",
    "timestamp": 1745272800
  },
  {
    "username": "danielmleitao",
    "rating": 5.0,
    "comment": "Rated: 02/2023\nEdited: -",
    "timestamp": 1744840800
  },
  {
    "username": "jkgrence",
    "rating": 5.0,
    "comment": "A lot of people malign Fluxx for the players not having any control over what is going on. From a veteran Fluxx player- trust me, once you know the cards you can manipulate the game as you see fit. While the strategies aren't very deep, they run a good bit deeper than most people know. The hard part is figuring out what those strategies are to begin with.",
    "timestamp": 1743890400
  },
  {
    "username": "Iftut",
    "rating": 4.5,
    "comment": "This is a game for people that don't play board games. It feels like it was designed by people that don't really play them either.\n\nThere is a little bit of basic strategy in the game, but otherwise it's all over the place.\n\nMight be a bit of light and fun chaos for the right group of non-gamers.",
    "timestamp": 1742684400
  },
  {
    "username": "DazBro",
    "rating": 5.0,
    "comment": "BGA",
    "timestamp": 1742684400
  },
  {
    "username": "LordAlfredo",
    "rating": 5.0,
    "comment": "It's an alright casual game but the novelty wears off really fast",
    "timestamp": 1741820400
  },
  {
    "username": "TheKilljoy",
    "rating": 5.0,
    "comment": "It's a casual game that's easy to include non-gamers into. It can run a bit long and sometimes feels endless.\n\nUpdate: It's 2025 and really Fluxx has no place in anyone's collection. It's barely a game.",
    "timestamp": 1739142000
  },
  {
    "username": "KovertKazoo",
    "rating": 5.0,
    "comment": "A game to fill the time between better games. Often feels like a chore, but the moments in which you combo-off or win can sometimes feel awesome. Starts to feel old after many plays.",
    "timestamp": 1737586800
  },
  {
    "username": "rkimerer",
    "rating": 5.0,
    "comment": "This game is fun to play but the main function of the game can be confusing. There have been many times when our group is just hoping to pull the clear card to get rid of all the rules. They become hard to remember after a while.",
    "timestamp": 1736031600
  },
  {
    "username": "theslymouse1",
    "rating": 5.0,
    "comment": "*\n1C",
    "timestamp": 1735945200
  },
  {
    "username": "tscox87",
    "rating": 5.0,
    "comment": "Interesting idea. Drags on too long for my tastes.",
    "timestamp": 1735254000
  },
  {
    "username": "Innsbruck",
    "rating": 5.0,
    "comment": "Player Count: 2 to 6\n Competitive Game: One player wins alone\n\nYes, it's supposed to be that chaotic.\n\nThere are a million versions of Fluxx with different themes, but this was the original.\n\nDesigned by Andrew Looney and Kristin Looney.",
    "timestamp": 1734908400
  },
  {
    "username": "chanyuekong",
    "rating": 5.0,
    "comment": "2-6",
    "timestamp": 1734908400
  },
  {
    "username": "symbioid",
    "rating": 5.0,
    "comment": "Meh. I love the idea of a game like this. It seems very creative. It is creative. The theme is great, but it's waaaaaaaaay too luck driven. Too easy to lose at the very last minute... One simple card draw can easily stop the game instantly, even though it feels like you're going to keep playing.",
    "timestamp": 1726956000
  },
  {
    "username": "almogshemesh",
    "rating": 5.0,
    "comment": "I like the concept of different rules changes across the game but it might become very chaotic, I wish you could limit the rules to max 2-4 cards. We ended up with 8 rules it was very confusing.",
    "timestamp": 1724364000
  },
  {
    "username": "capnwaffer",
    "rating": 5.0,
    "comment": "Very random game that fluctuates.",
    "timestamp": 1724277600
  },
  {
    "username": "Erik_G",
    "rating": 5.0,
    "comment": "A fairly mindless party game.",
    "timestamp": 1721685600
  },
  {
    "username": "G_Riffy",
    "rating": 5.0,
    "comment": "Due to the core mechanic of the game, which causes the rules to be ever changing as well as the win conditions, it can be quite a funny game, but it takes a long time and the enjoyment wears off quickly.",
    "timestamp": 1720216800
  },
  {
    "username": "cchlanger",
    "rating": 5.0,
    "comment": "On the one hand, it reminds me of Carl Chudyk's Innovation which should be praised, on the other hand, this is probably also why I am so disappointed. The chaos and unpredictability just go too far.",
    "timestamp": 1719957600
  },
  {
    "username": "killerwar_hog2",
    "rating": 5.0,
    "comment": "Cool.... Filler... Rather play something with more meat.",
    "timestamp": 1718488800
  },
  {
    "username": "EmeraldYam",
    "rating": 5.0,
    "comment": "The PLAYMOBIL® Legion reviews \"Fluxx\"\n\n10 years on... I respect this game for what it is: a fun, if shallow, chaotic filler. Doesn't have a role in my gaming life at the moment, though.",
    "timestamp": 1717624800
  },
  {
    "username": "AmassGames",
    "rating": 5.0,
    "comment": "Took a while to understand this but clever idea and can be annoying to know when it will end and can drag but if people know what they are doing...which can drag it as well, it can be swift and thus is decent, prefer some themed versions\n\nGoogle AmassGames for 2,599+ more\nhttps://youtu.be/zNT3kypseLY",
    "timestamp": 1717279200
  },
  {
    "username": "mixmixmix",
    "rating": 5.0,
    "comment": "Random! Very generic theme (collect Cookies and Milk, etc), but fun if the game can manage to end within 10 minutes. Otherwise, walk away!",
    "timestamp": 1716933600
  },
  {
    "username": "Addboilingwater",
    "rating": 5.0,
    "comment": "Family, Party Light & Fast (6)\nCards Determine The Rules, Actions & How To Win. Constant Adaptation & Flexability\nMany Themed ALternatives\n[@Hide][C&CBrum][@SnD]",
    "timestamp": 1715810400
  },
  {
    "username": "BogusKoszalka",
    "rating": 4.9,
    "comment": "w pudełku 9x12",
    "timestamp": 1714946400
  },
  {
    "username": "Zengoeroe",
    "rating": 5.0,
    "comment": "This card game seemed interesting, but the mechanics just ain't fun.",
    "timestamp": 1713996000
  },
  {
    "username": "Bromden62",
    "rating": 4.5,
    "comment": "Card",
    "timestamp": 1712181600
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "A lot of people hate Fluxx and not without reason: this is a totally absurd and senseless luckfest where even tactical planning is almost impossible. Yet, I find it funny.\n\nThe rules are simple: each turn you draw a card and you play a card. Possible cards can be either rules, which alter the draw/play ratio along with some other things, actions, which have an immediate effect, keepers, which are objects that you keep in front of you, and goals, which are put into play and the first player that has the keepers displayed on the goal wins.\n\nThe game for the most part plays itself, but leads to funny situations and only last ten minutes... But sometimes drags. And drags. And drags. And that's what can make a game of Fluxx really stink, because a quick and light filler turns into a senseless activity that doesn't seem to end. Indeed, it can drag over an hour or even more, though that's unlikely.\n\nMy suggestion is that you pull it out in \"beer & pretzels\" situations, but play with the house rule that if the game isn't over after 10-15 minutes, everyone looses.\n\nRating: \nOptimal number of players:\n4~5\n2~3\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "Michael Ward",
    "rating": 5.0,
    "comment": "02/24/24 Played Fluxx. Our two two-player games took 41 minutes. I think I may have played many it years ago, but I have virtually no recollection of it. Nor do I know what version I played today. There's nothing wrong with it; its just not my cup of tea. So I rated it a '5' (Mediocre - take it or leave it). The game has no scores; someone just wins.",
    "timestamp": 1708815600
  },
  {
    "username": "rickwhatever",
    "rating": 5.0,
    "comment": "2-6",
    "timestamp": 1708038000
  },
  {
    "username": "joeyvigil",
    "rating": 5.0,
    "comment": "Not a bad game, I just would rather play others",
    "timestamp": 1706050800
  },
  {
    "username": "dkfozz",
    "rating": 5.0,
    "comment": "Hit or miss, luck-based card engine",
    "timestamp": 1705446000
  },
  {
    "username": "MikeJonez",
    "rating": 5.0,
    "comment": "2023: 6/10\n2024: 5/10",
    "timestamp": 1705186800
  },
  {
    "username": "mathgoblin",
    "rating": 5.0,
    "comment": "the worst part of a board game is learning the rules. in this game you have to learn the rules multiple times over",
    "timestamp": 1704150000
  },
  {
    "username": "mollymega",
    "rating": 5.0,
    "comment": "Sold",
    "timestamp": 1699916400
  },
  {
    "username": "kijoe",
    "rating": 5.0,
    "comment": "Very chaotic set collection game with ever changing rules - a bit too much, but can be fun with the right group",
    "timestamp": 1699225200
  },
  {
    "username": "Educatedguess",
    "rating": 5.0,
    "comment": "I like the concept, not the game itself.",
    "timestamp": 1696370400
  },
  {
    "username": "Vinnyvinvinvinvin",
    "rating": 5.0,
    "comment": "Eh. Bleh theme, but it's Fluxx. I see no point playing this version if you have the others.",
    "timestamp": 1694210400
  },
  {
    "username": "tttokki",
    "rating": 5.4,
    "comment": "The idea of building a game as you go is a really interesting concept. Somewhat random, but fun to play.",
    "timestamp": 1693864800
  },
  {
    "username": "meshnaster",
    "rating": 5.0,
    "comment": "Mindless card playing. Fun once or twice.",
    "timestamp": 1693692000
  },
  {
    "username": "kilrah",
    "rating": 5.0,
    "comment": "Everything about this game was said already. An experiment in controlled chaos. Less of a game as it is just a randomizer - however there are tactics that will have a better player win more on average. What is bad is that the gametime is hugely random and can last from seconds to hours. It TENDS to last a bit too long for a pretty much mindless game.",
    "timestamp": 1691964000
  },
  {
    "username": "peacmyer",
    "rating": 5.0,
    "comment": "Looney randomness, but funnish. Traded. Version 4.0 gift to MRJ. Gift to Mike's middle school club.",
    "timestamp": 1691359200
  },
  {
    "username": "Cdohm1",
    "rating": 5.0,
    "comment": "Good travel game, this and many versions I own have been on many deployments together.",
    "timestamp": 1691013600
  },
  {
    "username": "RedwoodCroft",
    "rating": 5.0,
    "comment": "It may be an old classic , but I never really got into Fluxx.",
    "timestamp": 1685916000
  },
  {
    "username": "data00",
    "rating": 5.0,
    "comment": "────────────────────────────────────────────────────\n놀랍게도 긱에서 투표 수 많기로 200위 이내이 게임이고, 시리즈로 30개가 넘는 게임이 출시된 게임입니다.\n'게임 중에 진행 규칙이 계속 바뀐다?' 그래서 플레이가 경쾌하고 흥미진진할 것이 기대됐으나\n그냥 따분하게 존버하다가 운 좋게 셋콜렉션 완성 됐을 때 '나 이겼어' 하고 끝나는 느낌이었습니다.",
    "timestamp": 1683151200
  },
  {
    "username": "DrekOverlord",
    "rating": 5.0,
    "comment": "At first it was interesting with the changing rules, but adding and changing them frequently lengthens the duration of the game considerably.",
    "timestamp": 1682632800
  },
  {
    "username": "Chilltron",
    "rating": 5.0,
    "comment": "Много читать иногда карты противоречат друг другу!",
    "timestamp": 1679180400
  },
  {
    "username": "Nyom7",
    "rating": 5.0,
    "comment": "Has a lot of random chance in terms of winning but is portable, quick, and can create some really amusing events. I would though say that it's better to get one of the maaaaany IP/stylised iterations rather than the original.",
    "timestamp": 1678143600
  },
  {
    "username": "Yefreitor",
    "rating": 5.0,
    "comment": "Decent party game. Easy to teach and requires zero thought while playing. Unfortunately, the cards require enough reading and interaction to make conversation during the game difficult, so there are better options.",
    "timestamp": 1676242800
  },
  {
    "username": "n0rseMN",
    "rating": 5.0,
    "comment": "Just a little odd...",
    "timestamp": 1674169200
  },
  {
    "username": "raycross",
    "rating": 5.0,
    "comment": "完全不知道在玩什麼的遊戲，沒什麼樂趣可言。",
    "timestamp": 1670108400
  },
  {
    "username": "dhable",
    "rating": 5.0,
    "comment": "Average - take it or leave it.\n\nThis is one of those games that might just require a larger group of loud people willing to shout and tease each other. With 2 players, the game is an interesting experience if parsing the rules and following them.\n\n\nRating History:\n23 Jan 2020 - 5 (25 plays)\n31 May 2019 - 5 (25 plays)\n09 May 2017 - 5 (21 plays)",
    "timestamp": 1669676400
  },
  {
    "username": "Diarmud",
    "rating": 5.0,
    "comment": "Never understood the hate. Fun as a wacky filler, unless you have people so analytical that they can't relax and take the game for what it is.",
    "timestamp": 1669503600
  },
  {
    "username": "paulkessels",
    "rating": 5.0,
    "comment": "Silly fun filler. Rule benders constantly, which makes it random and non controllable/plan able.",
    "timestamp": 1668898800
  },
  {
    "username": "whodo",
    "rating": 5.0,
    "comment": "We never liked this, but that was a very long time ago.",
    "timestamp": 1666994400
  },
  {
    "username": "mikesanerd",
    "rating": 4.6,
    "comment": "It's ok as filler, but the game is so random that it is hard to get into. For a simple family card game, it gets the job done, but not something I would recommend at all as a gamer's game.",
    "timestamp": 1659996000
  },
  {
    "username": "Ajax",
    "rating": 5.0,
    "comment": "Random nonsense.",
    "timestamp": 1659564000
  },
  {
    "username": "reversed",
    "rating": 5.0,
    "comment": "Random chaos. More of an activity than a game.",
    "timestamp": 1659304800
  },
  {
    "username": "RandyGr",
    "rating": 5.0,
    "comment": "For Sale: $__ plus shipping.\n2–6 Players. Playing Time: 5–30 Min. Age: 8+. Weight: 1.39 / 5.\nBought new, played once.",
    "timestamp": 1658008800
  },
  {
    "username": "AceXT",
    "rating": 5.0,
    "comment": "More proof of concept than entertaining game on its own, the rules iterations tend to get stuck in unfun loops.",
    "timestamp": 1656540000
  },
  {
    "username": "daewezzy",
    "rating": 5.0,
    "comment": "I think I lost it",
    "timestamp": 1656453600
  },
  {
    "username": "KittyHawkMarch",
    "rating": 5.0,
    "comment": "This is one of the few games in my collection my dad actually likes. I could give it to him if things in my collection get too tight. Especially since I got a Voyager copy of this.",
    "timestamp": 1654552800
  },
  {
    "username": "Endaro",
    "rating": 4.5,
    "comment": "Given away/sold.",
    "timestamp": 1654034400
  },
  {
    "username": "donteatpoop",
    "rating": 5.3,
    "comment": "I hate that this game hits the table as often as it does. lol. It's not a terrible game but it is completely chaotic. I'm not a big fan, but I mean... if that's what people want to play... I guess I'm roped into playing it too. lol. Go team.",
    "timestamp": 1651528800
  },
  {
    "username": "I_am_a_sandwich",
    "rating": 5.0,
    "comment": "I can enjoy this game, but almost everyone else who has played it has come away either a little confused or bored. It’s a niche game for a niche type of person, but if you like it you’ll love it.",
    "timestamp": 1650492000
  },
  {
    "username": "aPilgrim",
    "rating": 5.2,
    "comment": "At first this is pretty intriguing but it ends up being way too chaotic for my liking.\n[4]2-6",
    "timestamp": 1649023200
  },
  {
    "username": "ChaosEngine7",
    "rating": 5.0,
    "comment": "6",
    "timestamp": 1646866800
  },
  {
    "username": "Griffted",
    "rating": 5.0,
    "comment": "A chaotic card game that is not entirely random, like some reviews would lead you to believe.",
    "timestamp": 1645657200
  },
  {
    "username": "DeanTheBaguette",
    "rating": 5.0,
    "comment": "It is fun that the rules are ever-changing. And the objectives are quite cute. But overall, I'd say that's the main appeal of this game. And it's easy to learn and keep track of the rules since it's all right in front of you. Best rule of the game is the one where any number gets +1.",
    "timestamp": 1645657200
  },
  {
    "username": "Ender4747",
    "rating": 5.0,
    "comment": "Excellent condition",
    "timestamp": 1645311600
  },
  {
    "username": "Andersioh",
    "rating": 5.0,
    "comment": "NL",
    "timestamp": 1644447600
  },
  {
    "username": "ajie426",
    "rating": 5.0,
    "comment": "规则随时变化这个设定有点意思，包括胜利条件和摸牌打牌的方式等都是随时变化的，但是最终胜利的条件还是看物品收集和胜利条件的匹配，这一点倒是平平无奇\n\n非常混乱，赢得莫名其妙，输得也莫名其妙",
    "timestamp": 1644447600
  },
  {
    "username": "Ketteringkid",
    "rating": 5.0,
    "comment": "I thought this was fun until I played it again. It just is long, boring and terrible. I wanted it to end.",
    "timestamp": 1643929200
  },
  {
    "username": "Matts15",
    "rating": 4.5,
    "comment": "I used to love this game (It was one of my very early gateway games) but the rapid chaos and inconsistent game lengths aren't my favorite.",
    "timestamp": 1643151600
  },
  {
    "username": "Hoatherm",
    "rating": 5.0,
    "comment": "An interesting game of changing rules and mechanics. I would say it is a game I would play once and happily say ‘ok great, now what’s next’, which for a small game isn’t ideal. There is too much luck having the right win condition and card combo that you are just grateful that there is ‘a’ winner at the end of it.",
    "timestamp": 1641769200
  },
  {
    "username": "Greenflash21",
    "rating": 5.0,
    "comment": "Was fun when I started playing. not so much anymore",
    "timestamp": 1640559600
  },
  {
    "username": "taahaag",
    "rating": 5.0,
    "comment": "Who needs rules? Too chaotic to be fun.",
    "timestamp": 1639782000
  },
  {
    "username": "JeromeAndHisHair",
    "rating": 5.0,
    "comment": "I hope everyone interested in board games plays Fluxx at least once. Not because it's the best game ever, but the idea of playing rule cards is genius. It creates a comedic engine of chaos. There's so much at work in this game, and although it's 90% luck based, it's still fun. Although, from a chaos machine, of course every game isn't consistently exciting. I've had my share of games that never really got anywhere and took too long. But I've also had my share of ridiculous games. I'd love it, and play it more if it was more consistently engaging.",
    "timestamp": 1637622000
  },
  {
    "username": "kaepone",
    "rating": 4.5,
    "comment": "Full of randomness, but that's the game. Really no strategy because of rule changes and action cards that others can play that could negatively impact your plans. Adjust your tactics each turn and hope for good luck.",
    "timestamp": 1636326000
  },
  {
    "username": "ranld",
    "rating": 5.0,
    "comment": "Bobby loves this game. Did he bring regular, or a different version? Maybe Stoner Fluxx because of Peace, Love, Cookies, Dreams, etc...? Nope, I just looked at that one -- Bong Hits, Weed, Got a Light...",
    "timestamp": 1635721200
  },
  {
    "username": "MrBlocker",
    "rating": 5.0,
    "comment": "The game of chaos! You need the right group to play this. Go in expecting utter randomness and you'll have a good time. However, it can really drag out if you let it.",
    "timestamp": 1634767200
  },
  {
    "username": "Shnikes",
    "rating": 5.0,
    "comment": "2-6 players. 3.1 Edition. Openned, slight wear. Included are the promo cards: Start the Clock, Larry the Zombie, Zombies Eat Brains and One, Two, Five!.",
    "timestamp": 1632607200
  },
  {
    "username": "rexchow2015",
    "rating": 4.5,
    "comment": "party game full of chaotic cards altering the rules constantly\nlaughs for non gamers and not recommend for family gamers or above",
    "timestamp": 1626213600
  },
  {
    "username": "juriel1",
    "rating": 5.3,
    "comment": "Game is fun in general, but bit chaotic for me ,especially new rules (and tons of them)",
    "timestamp": 1625695200
  },
  {
    "username": "allan647",
    "rating": 5.0,
    "comment": "Given to niece",
    "timestamp": 1624658400
  },
  {
    "username": "Sinyi",
    "rating": 5.0,
    "comment": "不曉得是翻譯問題還是自己中文理解能力不好，\n導致對此遊戲的說明不太能理解。\n因此跟朋友在遊戲過程邊玩邊納悶，\n玩到懷疑人生？？？",
    "timestamp": 1622844000
  },
  {
    "username": "mjhake",
    "rating": 5.0,
    "comment": "Rules changing card game",
    "timestamp": 1622066400
  },
  {
    "username": "deedw",
    "rating": 5.0,
    "comment": "Ich kannte zuvor schon Zombie Fluxx, insofern war es leicht erlernt. Es gibt vier Grundregeln im Spiel. Wenn man dran ist, zieht man X Karten (je nach Regel) und spiel Y Karten (je nach Regel). So kann man zum Beispiel neu Regelkarten spielen. Alternativ kann man Gegenstände auslegen und sammeln oder ein neues Ziel vorgeben. Wenn ein ausgelegtes Ziel erreicht ist, ist das Spiel sofort vorbei. Fluxx spielt sich sehr chaotisch. Vor allem am Ende ist es eher ein \"Wir ziehen nur Karten, bis einer gewinnt.\" Strategisch kann - und soll - man das Spiel nicht spielen. Es war nett, aber ich es reißt mich wie damals Zombie Fluxx nicht vom Hocker.",
    "timestamp": 1622066400
  },
  {
    "username": "Mighty Jim",
    "rating": 5.0,
    "comment": "Very silly, devoid of strategy, super-chaotic, but mildly engaging as an activity.",
    "timestamp": 1621807200
  },
  {
    "username": "esok",
    "rating": 5.0,
    "comment": "A decent filler. This game has the advantage that anyone can jump in or jump out at any time without affecting game play.",
    "timestamp": 1619992800
  },
  {
    "username": "ogoctopus",
    "rating": 5.0,
    "comment": "Lost\nAnd rebought.\nAnd marked for gift",
    "timestamp": 1616886000
  },
  {
    "username": "pouringraine",
    "rating": 5.0,
    "comment": "I used to have fun with this game, but this printing has too many complicated rules for my liking. I guess the nice thing is that you could remove those cards before the game to make a less complicated version.",
    "timestamp": 1616367600
  },
  {
    "username": "cazaron",
    "rating": 5.0,
    "comment": "Rules change, and that stops the better player from always winning. That alone makes this game a hit for my family because they always know they're in with a chance no matter what time it is.",
    "timestamp": 1616194800
  },
  {
    "username": "FranklinTV",
    "rating": 5.3,
    "comment": "Light and slightly fluffy card game. Unusual mechanic (Rules / Goals change as cards are played). (9/1/10 - Rating 6). Update: Actually, as an end of evening filler, It's quite a reasonable game - rating increased to 7 (35/10/10). UPDATE: Recent revisit to the game, and it has lost some appeal (rating drop to 6 - 2/4/13). UPDATE Its portablility is its main appeal (Rating 5.735 Jan 17). UPDATE: One for the Board Game Collection Event Horizon, donated to work colleague (Dec 19). UPDATE: Pub Meeple Ranking Engine Dec 2020 (Rating: 5.295).",
    "timestamp": 1615330800
  },
  {
    "username": "Colouring_kiwi",
    "rating": 5.0,
    "comment": "Kids",
    "timestamp": 1614812400
  },
  {
    "username": "chrtad",
    "rating": 4.5,
    "comment": "Great filler. Easy to teach.",
    "timestamp": 1611961200
  },
  {
    "username": "enr_1991",
    "rating": 5.0,
    "comment": "With Fluxx Dice expansion",
    "timestamp": 1610319600
  },
  {
    "username": "joebelanger",
    "rating": 5.0,
    "comment": "Can be fun. Can be irritating. Do not take this game seriously. Just watch the time burn away and try not to regret it.",
    "timestamp": 1610060400
  },
  {
    "username": "xilconic",
    "rating": 5.0,
    "comment": "Basically a filler and time-killer. Easy to teach as the game develops as you play. But in the end it's a pretty random game with some fun to be had.",
    "timestamp": 1608418800
  },
  {
    "username": "UnicornVariant",
    "rating": 5.0,
    "comment": "Best when combined with other Fluxes.",
    "timestamp": 1606172400
  },
  {
    "username": "Jungleboy24",
    "rating": 5.0,
    "comment": "If you want Pure Fun that comes from immense randomness, Fluxx is the perfect game for you. It is a game that always makes us smile",
    "timestamp": 1605049200
  },
  {
    "username": "TheLimestoneCowboy",
    "rating": 5.0,
    "comment": "*D",
    "timestamp": 1602108000
  },
  {
    "username": "disclamer",
    "rating": 5.0,
    "comment": "An inoffensive way to pass the time.",
    "timestamp": 1599343200
  },
  {
    "username": "cannibal048",
    "rating": 5.0,
    "comment": "2-6 players, 5-30min",
    "timestamp": 1597528800
  },
  {
    "username": "JamesTS",
    "rating": 5.0,
    "comment": "This game is wacky, zany, and hilarious, it’s not my go to, but I’ll play it.",
    "timestamp": 1596751200
  },
  {
    "username": "SilentMix",
    "rating": 5.0,
    "comment": "own Japanese version",
    "timestamp": 1595973600
  },
  {
    "username": "JamesArkham",
    "rating": 5.0,
    "comment": "Includes International Tabletop Day Expansion.",
    "timestamp": 1595628000
  },
  {
    "username": "Cheelara1",
    "rating": 5.0,
    "comment": "Gave to women's shelter",
    "timestamp": 1584918000
  },
  {
    "username": "VeraFelkina",
    "rating": 5.0,
    "comment": "The game just doesn't work. One party took about 2+ hours and we literally couldn't end it because nobody was winning.",
    "timestamp": 1584918000
  },
  {
    "username": "justusjonas",
    "rating": 5.0,
    "comment": "Sold, funny for 2 or 3 plays but thats it",
    "timestamp": 1583190000
  },
  {
    "username": "airydisk",
    "rating": 5.3,
    "comment": "Older version, but in great shape.\nMy kid's rating: 7.5",
    "timestamp": 1578783600
  },
  {
    "username": "multimelissa",
    "rating": 5.0,
    "comment": "I would consider Fluxx an improvement to Uno. I suggest it to people who like Uno to broaden there repertoire. The original Fluxx doesn’t have enough theme for me, and there are so many other themes of Fluxx to choose from instead. I think I’ll give this to my niece so it can find a new home and be played.",
    "timestamp": 1578265200
  },
  {
    "username": "tyroll",
    "rating": 5.2,
    "comment": "Es un juego saca cartas muy corto, que depende absolutamente del azar, en el cual no puedes generar estrategias de ningún tipo. En lo personal no es mi tipo de juego, aunque a algunos les gusta mucho ya que hace reir.",
    "timestamp": 1577660400
  },
  {
    "username": "JanushPoha",
    "rating": 5.0,
    "comment": "Not for those who cant keep up with constant rule changes. Enjoyable but could pass away.",
    "timestamp": 1577487600
  },
  {
    "username": "akimbonautilus",
    "rating": 5.2,
    "comment": "(Kevin used to own, now none of us own)",
    "timestamp": 1577314800
  },
  {
    "username": "mnickerson30",
    "rating": 5.0,
    "comment": "Can be fun, can be frustrating - when you identify a winning play, more often than not the rules will change before you can execute it. This was kind of amusing on first play; on subsequent plays, less so.",
    "timestamp": 1576364400
  },
  {
    "username": "ajoseph86",
    "rating": 5.0,
    "comment": "Cabin essentials",
    "timestamp": 1574722800
  },
  {
    "username": "Pendraggin",
    "rating": 5.0,
    "comment": "Played a number of times w/o logging",
    "timestamp": 1572476400
  },
  {
    "username": "redadmiral",
    "rating": 4.5,
    "comment": "My kids had fun with it, I definitely didn't.",
    "timestamp": 1569967200
  },
  {
    "username": "van146",
    "rating": 5.0,
    "comment": "Perhaps god to play in appropriate group",
    "timestamp": 1569189600
  },
  {
    "username": "HouseOfPanda",
    "rating": 5.0,
    "comment": "(L)",
    "timestamp": 1569103200
  },
  {
    "username": "Shadow89",
    "rating": 5.0,
    "comment": "I don't mind playing this game, but it isn't really my favorite party game any more. There is a lot to be desired from this game, but I'll play it most of the time if someone wants to. But no one usually wants to.",
    "timestamp": 1568325600
  },
  {
    "username": "Necroblaster3000",
    "rating": 5.0,
    "comment": "This was acceptable for the time I was playing it but if I were in a position to choose this to play I'd most likely pass.",
    "timestamp": 1568152800
  },
  {
    "username": "HapaxLeg",
    "rating": 5.0,
    "comment": "The best part of this game is when someone announces: \"I win!\"",
    "timestamp": 1564437600
  },
  {
    "username": "CharlieMote",
    "rating": 4.9,
    "comment": "Not much of a game but good for Spanish language students.",
    "timestamp": 1564092000
  },
  {
    "username": "LucaCiglione",
    "rating": 4.5,
    "comment": "Duration can be 1 minure, or hours. No control available.",
    "timestamp": 1563228000
  },
  {
    "username": "ArtB",
    "rating": 5.0,
    "comment": "played many times before I began recording plays\ndown from 6",
    "timestamp": 1563228000
  },
  {
    "username": "Celtic",
    "rating": 4.5,
    "comment": "Great concept and offers perhaps the most enjoyable first game of any game you're likely to play, as the imaginative jokes inherent in the card combinations fly by. Sadly that's the best it gets as this is the gaming equivalent of Pandora's box - opening it unleashes utter chaos and all you can do is hang on till it's spent and pray it's over quickly.",
    "timestamp": 1562277600
  },
  {
    "username": "semicharm",
    "rating": 5.0,
    "comment": "Good condition (purchased new)",
    "timestamp": 1561068000
  },
  {
    "username": "Czech",
    "rating": 5.0,
    "comment": "Gave to Scott Suehle",
    "timestamp": 1560290400
  },
  {
    "username": "absolvi",
    "rating": 5.0,
    "comment": "Very Good",
    "timestamp": 1558908000
  },
  {
    "username": "Secondguess",
    "rating": 5.0,
    "comment": "2-6 Player\nCompetitive\n20 mins",
    "timestamp": 1558130400
  },
  {
    "username": "rigacu",
    "rating": 6.0,
    "comment": "Vienna",
    "timestamp": 1760220000
  },
  {
    "username": "kwalzl",
    "rating": 6.0,
    "comment": "7B",
    "timestamp": 1758664800
  },
  {
    "username": "Brother Abe",
    "rating": 6.3,
    "comment": "Maria pre 2015",
    "timestamp": 1758578400
  },
  {
    "username": "korossyl",
    "rating": 6.0,
    "comment": "Random, short, and enjoyably chaotic.",
    "timestamp": 1757455200
  },
  {
    "username": "Onthewayover",
    "rating": 6.0,
    "comment": "My non-hobbyist in-laws introduced us to this dynamic little game, and we had to get it!",
    "timestamp": 1753394400
  },
  {
    "username": "Galion",
    "rating": 6.0,
    "comment": "Rating based on play with version 3.0--otherwise the rating drops sharply. Found copy in free pile 7/19/25.",
    "timestamp": 1752962400
  },
  {
    "username": "EllenCaroline",
    "rating": 6.0,
    "comment": "used to own",
    "timestamp": 1750802400
  },
  {
    "username": "Ostropol",
    "rating": 6.0,
    "comment": "Southold/Fam",
    "timestamp": 1750629600
  },
  {
    "username": "DexGeek",
    "rating": 5.5,
    "comment": "Owner: Dex & Katie",
    "timestamp": 1744754400
  },
  {
    "username": "Medic Jesus",
    "rating": 6.0,
    "comment": "Played once or twice. Meh. Gave it to my cousin.",
    "timestamp": 1744581600
  },
  {
    "username": "Altaz",
    "rating": 6.0,
    "comment": "s",
    "timestamp": 1744581600
  },
  {
    "username": "TheDeckie",
    "rating": 6.2,
    "comment": "Played digital version only",
    "timestamp": 1743717600
  },
  {
    "username": "TheKloewers",
    "rating": 6.0,
    "comment": "Very luck based, but funny.",
    "timestamp": 1740265200
  },
  {
    "username": "cajun_catfish",
    "rating": 6.0,
    "comment": "[2-6] CARD: Family version, crazy rules to win",
    "timestamp": 1739660400
  },
  {
    "username": "TrentonTron",
    "rating": 6.0,
    "comment": "I must have played this 50+ times in the six months I have owned it, with a vast assortment of people. Maybe not a \"gamer's game, but extremely popular, especially with older children and teenagers.",
    "timestamp": 1739142000
  },
  {
    "username": "xerossilence",
    "rating": 6.2,
    "comment": "Fluxx is a lot of fun. Pretty mindless to be fair but fun mindlessness. Simplest rules of any game, to start, and it can get pretty silly how the rules change over the game.\n[other]",
    "timestamp": 1738969200
  },
  {
    "username": "digitalbeachbum",
    "rating": 6.0,
    "comment": "The never ending game.",
    "timestamp": 1735426800
  },
  {
    "username": "Mountaingardner",
    "rating": 6.0,
    "comment": "2-6 Player",
    "timestamp": 1735254000
  },
  {
    "username": "ccjnwl",
    "rating": 6.0,
    "comment": "#NWG\n\nCan be fun as a non-serious filler, very random, can be over in a few minutes if a player draws a right card, or go on for hours. Very little strategy is possible, as rules and victory conditions change from one turn to the next...",
    "timestamp": 1732316400
  },
  {
    "username": "bggmatje",
    "rating": 6.0,
    "comment": "[December 2017]\nA beer and pretzel filler card game with ever changing rules and win conditions. Okay if you need to kill some time.",
    "timestamp": 1728252000
  },
  {
    "username": "LordGarySugar",
    "rating": 6.0,
    "comment": "It's best played when you try to cause chaos - otherwise victories either take ages or are anticlimactically sudden",
    "timestamp": 1728165600
  },
  {
    "username": "Acholt22",
    "rating": 6.0,
    "comment": "One of the first \"modern\" games that I played with John.\n\nThis is a game in which the game is constantly \"in flux\" with the rules and goals of how to win are always changing. Such a neat concept.",
    "timestamp": 1720303200
  },
  {
    "username": "Zomerdromen",
    "rating": 6.0,
    "comment": "Okay filler card game. Quite luck dependent but it doesn't last long.",
    "timestamp": 1720216800
  },
  {
    "username": "Pillowwolf",
    "rating": 6.0,
    "comment": "mom has second copy.",
    "timestamp": 1719439200
  },
  {
    "username": "jefross",
    "rating": 5.6,
    "comment": "no solo",
    "timestamp": 1712872800
  },
  {
    "username": "Norrmeister",
    "rating": 6.0,
    "comment": "Dutch version.",
    "timestamp": 1708642800
  },
  {
    "username": "Kinskey",
    "rating": 6.0,
    "comment": "2-4 players",
    "timestamp": 1707951600
  },
  {
    "username": "ColonelDecker",
    "rating": 6.0,
    "comment": "Too chaotic",
    "timestamp": 1705964400
  },
  {
    "username": "purvisa",
    "rating": 6.0,
    "comment": "Chaos abounds, and that's a good thing. You've probably seen, and likely played, this in at least one of its flavors. And there are many. It is light and simple.\n\nFluxx is simple: Everyone gets 3 cards, and one player starts by drawing a card and playing a card. There are no limits and no other rules, until there are. And therein lies the beauty in the game's simplicity. Goals, Keepers (the means of achieving the goals), Actions, and New Rules are in the cards.\n\nIn minutes you may find yourself drawing 4 cards, being able to play 2, and having a hand size of only 1, with the first card you play being randomly selected from your hand, all as you hope to win the lottery (Dreams+Money).\n\nSetup and re-boxing times are essentially immaterial. You pull a basic rules card, shuffle up, deal, and start. Don't expect depth of strategy here, though, as luck and some silliness will likely determine the winner.",
    "timestamp": 1703718000
  },
  {
    "username": "Firearchitect",
    "rating": 5.5,
    "comment": "Lost in Divorce",
    "timestamp": 1701385200
  },
  {
    "username": "Spydurman",
    "rating": 6.0,
    "comment": "Definitely need to be in the right mood to play this. It's a fun quick game that is easy to learn. Sometimes the chaos is fun, sometimes it's frustrating. I'm a big downer on games not letting you do anything and there are scenarios where you might do nothing or barely have a turn or two before the game is over. But the saving grace is that it's often quick to play.",
    "timestamp": 1701385200
  },
  {
    "username": "artegoneia",
    "rating": 6.0,
    "comment": "Objectively not a very good game but I greatly enjoy it as a filler game. I especially enjoy playing this with first-timers and watching them slowly realize that this game is chaos and the only thing you can do is roll with it.",
    "timestamp": 1700953200
  },
  {
    "username": "Nerdvik",
    "rating": 6.2,
    "comment": "Not too bad; good party game.",
    "timestamp": 1700866800
  },
  {
    "username": "flash_baz",
    "rating": 5.5,
    "comment": "Some love it; some hate it: I'm in-between. I'll join in if others are playing it, but not for very long. I find the quick victory or long-slog stalemate outcomes annoying. But if the other players are having fun with the game I tend to pick up on their enjoyment. I'll keep it in my collection, but mainly for others who like it more than me.",
    "timestamp": 1697839200
  },
  {
    "username": "minitova",
    "rating": 6.0,
    "comment": "A fast-paced card game where you have a lot to win to know the cards and combinations. The rules for winning change over time. Could be as fun as it could be annoying.",
    "timestamp": 1696888800
  },
  {
    "username": "chillcats",
    "rating": 6.0,
    "comment": "Very random, but non gamers seem to like it in my experience",
    "timestamp": 1695938400
  },
  {
    "username": "Insane Foxx",
    "rating": 6.0,
    "comment": "Hard to game plan, since it could last anywhere from a minute or two all the way to half an hour or more.",
    "timestamp": 1695765600
  },
  {
    "username": "Magatone",
    "rating": 6.0,
    "comment": "Very quick game, easy to learn, and fast paced. This is great to break out on trips and the like where you'll have a few minutes of downtime.",
    "timestamp": 1694469600
  },
  {
    "username": "HowitzerBug",
    "rating": 5.5,
    "comment": "Pretty clever, light and silly filler game. Manipulate the rules to your advantage and try to get a goal out that lets you win. Can be a headache for some if you struggle to keep up with changing situations, but it's not one to be taken too seriously so play with tongue firmly in cheek!",
    "timestamp": 1692223200
  },
  {
    "username": "Tycho",
    "rating": 6.0,
    "comment": "Playing this game I feel I'm not just fighting my opponent(s), but also I'm fighting Chaos. I must play cards to further my plans, but also to keep in force a ruleset that allows for planning.",
    "timestamp": 1691100000
  },
  {
    "username": "galabouttown",
    "rating": 5.5,
    "comment": "66",
    "timestamp": 1686434400
  },
  {
    "username": "Alexandra_Pharmic",
    "rating": 6.0,
    "comment": "The novelty is nice for a couple of plays, but it gets old fast.",
    "timestamp": 1685311200
  },
  {
    "username": "toomanyminis",
    "rating": 6.0,
    "comment": "Purge 05/2023",
    "timestamp": 1684274400
  },
  {
    "username": "Darklaw90",
    "rating": 5.5,
    "comment": "ottimo come filler! non prende di più solo perchè appunto non è un capolavoro... ma diverte e tanto!",
    "timestamp": 1683496800
  },
  {
    "username": "Carbonium",
    "rating": 6.0,
    "comment": "Мне понравилось, но никому больше. Время партии может сильно скакать от кол-ва правил",
    "timestamp": 1682028000
  },
  {
    "username": "LisArtist",
    "rating": 5.5,
    "comment": "Owned. Previously Owned. Owned. Previously Owned. And so it goes. Always in flux is Fluxx. Should we have milk and cookies or have we tapped out? Currently: Previously Owned.",
    "timestamp": 1678834800
  },
  {
    "username": "Futean",
    "rating": 5.5,
    "comment": "Sell (or op shop)",
    "timestamp": 1677884400
  },
  {
    "username": "unoq",
    "rating": 6.0,
    "comment": "i found the fluidity of the rules and the derived chaos fun, even if sometimes you spend more time reading cards than playing. this chaos means that you can have basically no strategy or w/e, but as a super-light way to kill time there's surely worse things - because you play to play, not to win. only tried it online, so maybe handling all the chaos it generates irl would be so messy that a bit of fun goes away.",
    "timestamp": 1677452400
  },
  {
    "username": "Alwin",
    "rating": 6.0,
    "comment": "The perfect filler.",
    "timestamp": 1677366000
  },
  {
    "username": "JBrown98023",
    "rating": 5.5,
    "comment": "Bought this in the 90's maybe? I think we got it at Wizards of the Coast in Auburn. Great fast game that is easy to teach.",
    "timestamp": 1676847600
  },
  {
    "username": "smapple30",
    "rating": 6.0,
    "comment": "Played",
    "timestamp": 1676070000
  },
  {
    "username": "stevenwarburton",
    "rating": 6.0,
    "comment": "Ok it's Fluxx. Nothing quite like it and sure, not everyone's cup of tea. Depends on just how much control you want over your strategy - this is always wild.",
    "timestamp": 1675206000
  },
  {
    "username": "NurseJosh",
    "rating": 6.0,
    "comment": "\"Very Good\" condition; Age-related wear on corners of box",
    "timestamp": 1674514800
  },
  {
    "username": "pocketpool399",
    "rating": 6.0,
    "comment": "numerous themes out there, pick one you like and stick with it.\n\ngood starter game for any game group",
    "timestamp": 1673564400
  },
  {
    "username": "tarur",
    "rating": 6.0,
    "comment": "12.01\njest (wspólna puszka z innymi fluxxami)",
    "timestamp": 1673478000
  },
  {
    "username": "SP34K345Y",
    "rating": 6.0,
    "comment": "I love this game. I love the chaos of going from so many to so few rules, but it can be difficult to find others who are willing to play more than twice.",
    "timestamp": 1672786800
  },
  {
    "username": "Vavavenya",
    "rating": 6.0,
    "comment": "Хаос",
    "timestamp": 1671922800
  },
  {
    "username": "rboswel3",
    "rating": 6.0,
    "comment": "Very chaotic with more people, but hey, its a decent pallet cleanser. I can see why people wouldn't like it, but to get people to the table, it might be a nice way to get them there.",
    "timestamp": 1670626800
  },
  {
    "username": "joeincolorado",
    "rating": 6.1,
    "comment": "It's just chaos, but it can be funny sometimes.",
    "timestamp": 1668207600
  },
  {
    "username": "billr257",
    "rating": 6.0,
    "comment": "nk",
    "timestamp": 1666821600
  },
  {
    "username": "TeamAbsolute",
    "rating": 5.5,
    "comment": "Harmless enough card game. Wouldn’t mind playing if other people want to - but there’s a lot of card games I’d choose to play ahead of this one.",
    "timestamp": 1666821600
  },
  {
    "username": "Jannie__",
    "rating": 6.0,
    "comment": "alleen online gespeeld",
    "timestamp": 1666735200
  },
  {
    "username": "GrimacePCH",
    "rating": 6.0,
    "comment": "Not bad for a light \"filler\" game, to pass the time while players are showing up or to plug a gap between games or at the end of the night as a \"palate cleanser\". You can't really make a strategy, as it is so very random, but if you realize that and don't take the game too seriously, you can have fun with it. The only game where you can win when it's not your turn, and you're not really paying too close of attention to the game. I call it \"backing into the win with your eyes closed\".",
    "timestamp": 1664316000
  },
  {
    "username": "Rex_Lui",
    "rating": 6.0,
    "comment": "Card",
    "timestamp": 1663970400
  },
  {
    "username": "jammitch",
    "rating": 6.0,
    "comment": "Decent filler when I'm in the mood.",
    "timestamp": 1660600800
  },
  {
    "username": "lrsjohnson",
    "rating": 6.0,
    "comment": "Up to 6",
    "timestamp": 1660514400
  },
  {
    "username": "Tornroot",
    "rating": 6.0,
    "comment": "With me.",
    "timestamp": 1660341600
  },
  {
    "username": "CharlieMnemonic",
    "rating": 6.0,
    "comment": "Silly fun. I love all the spin-off themes.",
    "timestamp": 1659218400
  },
  {
    "username": "the_snek",
    "rating": 6.0,
    "comment": "Too lovey-dovey for my taste.",
    "timestamp": 1658440800
  },
  {
    "username": "DocLuke",
    "rating": 6.0,
    "comment": "A very chaotic card game. Fun with the right group.",
    "timestamp": 1658268000
  },
  {
    "username": "Not_People",
    "rating": 6.0,
    "comment": "An alright luck-based game to pass the time. Easy to learn and play.",
    "timestamp": 1657144800
  },
  {
    "username": "eliendriel",
    "rating": 6.0,
    "comment": "It's a quick and relatively easy game to play",
    "timestamp": 1656021600
  },
  {
    "username": "Ze0n_qg",
    "rating": 6.0,
    "comment": "fun game that lets you \"break the rules\" but its straightforward and easy to teach and normally a good time",
    "timestamp": 1654898400
  },
  {
    "username": "hatj2",
    "rating": 6.0,
    "comment": "CD 1",
    "timestamp": 1654552800
  },
  {
    "username": "TheBadDoctor",
    "rating": 5.5,
    "comment": "Another filler game that people will either love or hate. Very casual.",
    "timestamp": 1652133600
  },
  {
    "username": "viranga",
    "rating": 6.0,
    "comment": "Version 4.0\nMy sister was enticed into playing this - quite amazing!\nI also have:\nMonty Python Fluxx (For trade: it's not funny for ppl who haven't seen the films)\nStar Fluxx",
    "timestamp": 1651960800
  },
  {
    "username": "MsDinosaur",
    "rating": 5.5,
    "comment": "Small box. In the over the door organizer.",
    "timestamp": 1651096800
  },
  {
    "username": "springem",
    "rating": 6.0,
    "comment": "Fluxx is a highly accessible small box game. I find that two sets generally pair well together, but I can recommend mixing more than two sets at a time. This is a go-to game to play between heavier games.\n\nThis is my least favorite of the themes.\n\nGave away 04/2022",
    "timestamp": 1650837600
  },
  {
    "username": "Gavlizard",
    "rating": 5.5,
    "comment": "Fun when there's nothing else to do.",
    "timestamp": 1650405600
  },
  {
    "username": "dlminsac",
    "rating": 6.0,
    "comment": "One rule: pick up a card then play a card. How do you win? Don't know yet. How you win is on the cards played and it changes quickly. The rules also are constantly changing. Draw 2, play 5, limit hand size, force blind play, steal cards, make chocolate milk. This game is pure chaos at its finest. Games can last 60 seconds or 10 minutes and repeated playings are mandatory. It is fast and furious and sometimes frustrating but always fun. Just don't play too often.",
    "timestamp": 1648936800
  },
  {
    "username": "arthurcucumber",
    "rating": 6.0,
    "comment": "A game of changing rules and end game conditions, a game which is completely random and a game that can be won by the first player on the first turn of the game (something I have actually done).\n\nDespite that it's actually quite fun with the right people at the right time and unlike games such as Munchkin, Fluxx doesn't hang around too long.\n\nThere's also a bit more control to the game than first appears.",
    "timestamp": 1648764000
  },
  {
    "username": "netzer",
    "rating": 6.0,
    "comment": "It's ok. The idea is nice, but it does feel a bit random for the most part.",
    "timestamp": 1648764000
  },
  {
    "username": "DrexlSpivey",
    "rating": 6.0,
    "comment": "Deck Box",
    "timestamp": 1648504800
  },
  {
    "username": "robyaw",
    "rating": 6.0,
    "comment": "Gifted to Bluesmith Information Systems.",
    "timestamp": 1647471600
  },
  {
    "username": "dragonchilde21",
    "rating": 6.0,
    "comment": "I like the changing rules but this game can really drag on. I find the Pirate version the most interesting since you have to talk like a pirate throughout.",
    "timestamp": 1646953200
  },
  {
    "username": "DSAdixits",
    "rating": 6.0,
    "comment": "Fun, but I like themed versions better.",
    "timestamp": 1645830000
  },
  {
    "username": "Bakcyl",
    "rating": 5.5,
    "comment": "Kasia\nJózef",
    "timestamp": 1644793200
  },
  {
    "username": "ong_elvin",
    "rating": 6.0,
    "comment": "Silly but reasonably fun little game about collecting random cards to win. Everything proceeds reasonably until someone plays the right combination of cards to do ALL THE THINGS. Then it just gets random for a bit until someone shuts off the shenanigans.",
    "timestamp": 1644793200
  },
  {
    "username": "scod101",
    "rating": 6.0,
    "comment": "A game that is very based on chance especially around the end game conditions. This can lead to a game lasting a few rounds or multiple rounds.",
    "timestamp": 1643410800
  },
  {
    "username": "seepieceeggshell",
    "rating": 6.0,
    "comment": "Winning doesn't matter - the value here is in musing about new combinations and weird tactics. Everyone can enjoy this for a few rounds and it's a great palate cleanser, plus it encourages non-gamers to conceptualize rules in a new way.\n\nSold January 2022",
    "timestamp": 1641682800
  },
  {
    "username": "zooney",
    "rating": 6.0,
    "comment": "A neat innocent game to play with the kids.",
    "timestamp": 1641596400
  },
  {
    "username": "starbucksmocha",
    "rating": 6.0,
    "comment": "❓",
    "timestamp": 1639263600
  },
  {
    "username": "DaSpottishKing",
    "rating": 6.0,
    "comment": "This is a great party game with more rules and changes than most games. It beats playing Uno, so it is a win in my book!",
    "timestamp": 1639090800
  },
  {
    "username": "kikaytete",
    "rating": 6.0,
    "comment": "10-11\n48%",
    "timestamp": 1638140400
  },
  {
    "username": "MxRex",
    "rating": 6.0,
    "comment": "Technically Teresa's copy.",
    "timestamp": 1637276400
  },
  {
    "username": "clips",
    "rating": 6.0,
    "comment": "version 1 owned\nversion 4 own",
    "timestamp": 1636239600
  },
  {
    "username": "Teppolainen",
    "rating": 6.0,
    "comment": "A game which makes its own rules as it's played. Because of this has no apparent end in sight - our records are a 2 hour game and one where the last player didn't get to play in the first turn! A great filler.",
    "timestamp": 1636066800
  },
  {
    "username": "byfed",
    "rating": 6.0,
    "comment": "Juego de caras, en el que las reglas van cambiando a medida que juegas. Está curioso, aunque es caótico a más no poder.",
    "timestamp": 1634680800
  },
  {
    "username": "Mone83",
    "rating": 6.0,
    "comment": "left in Italy",
    "timestamp": 1631656800
  },
  {
    "username": "niblet22",
    "rating": 6.0,
    "comment": "An interesting card game where the win goal changes throughout the game until someone meets a win condition. Only played one game so far, looking forward to trying it again to get a better feel for the game.",
    "timestamp": 1631138400
  },
  {
    "username": "andyl",
    "rating": 5.5,
    "comment": "Silly little game.",
    "timestamp": 1630965600
  },
  {
    "username": "BobbyReichle",
    "rating": 6.0,
    "comment": "Fluxx is such a pleasant diversion, so quick to set up and get going. Easy to converse during… a pleasant distraction.",
    "timestamp": 1630360800
  },
  {
    "username": "amchallam",
    "rating": 6.0,
    "comment": "2-6 players/1.39/30 mins/8+",
    "timestamp": 1630274400
  },
  {
    "username": "Zavaglio",
    "rating": 5.5,
    "comment": "Placeholder - \"I have played it with a friend who owns it\"",
    "timestamp": 1630015200
  },
  {
    "username": "drepplay",
    "rating": 6.0,
    "comment": "Completely random and unpredictable. This makes it fun if you're in the mood, but it can easily get too complex and drag on too long. A game could take minutes or hours",
    "timestamp": 1627077600
  },
  {
    "username": "Jimcohen",
    "rating": 6.0,
    "comment": "Good fun if in the mood",
    "timestamp": 1625263200
  },
  {
    "username": "Tsathoggua1980",
    "rating": 6.0,
    "comment": "played this in college quite a bit.",
    "timestamp": 1625263200
  },
  {
    "username": "Tj66stang",
    "rating": 6.0,
    "comment": "Fun card game. love the way it constantly changes. Very luck dependent game though.",
    "timestamp": 1625004000
  },
  {
    "username": "herbius",
    "rating": 6.3,
    "comment": "Family owned -S6-A6.5- Familiar party game. Take that. Interesting concept of the game, whereas it may flow into very interesting or neverending game.",
    "timestamp": 1620511200
  },
  {
    "username": "Astroking112",
    "rating": 6.0,
    "comment": "Pretty solid party game, although it can be prone to never-ending games if players start to understand how to abuse the rules and have a bit of luck. This is still a fairly solid opening game that is relatively low-investment (so you can drop it at pretty much anytime), and I like to use it to introduce people to a pretty simple game that quickly starts to teach them the intricacies of rules and lets players either feel clever or revel in the ensuing chaos. Not for everyone.",
    "timestamp": 1619560800
  },
  {
    "username": "atmpoison",
    "rating": 6.0,
    "comment": "Chaotic, you can have 3-turn matches, they still don't take too long.",
    "timestamp": 1618696800
  },
  {
    "username": "Briesi",
    "rating": 5.5,
    "comment": "Für ein total glückslastiges Spiel ist es wenigstens ganz lustig",
    "timestamp": 1618610400
  },
  {
    "username": "MrCoCheese",
    "rating": 6.0,
    "comment": "BGA",
    "timestamp": 1618351200
  },
  {
    "username": "DeathbyVCR",
    "rating": 6.0,
    "comment": "4 (2-6)",
    "timestamp": 1616626800
  },
  {
    "username": "bomberah",
    "rating": 6.0,
    "comment": "Donated to TGP on 2/2/21\n\nS-5",
    "timestamp": 1612306800
  },
  {
    "username": "BoredPyro",
    "rating": 6.0,
    "comment": "Fun pandemonium.",
    "timestamp": 1611529200
  },
  {
    "username": "StillAdamClark",
    "rating": 6.0,
    "comment": "A classic game that I use for openers, easy to learn, great expandability.",
    "timestamp": 1608937200
  },
  {
    "username": "SteveMaddening",
    "rating": 6.0,
    "comment": "Played",
    "timestamp": 1608073200
  },
  {
    "username": "Buzibee508",
    "rating": 6.0,
    "comment": "IOS only",
    "timestamp": 1608073200
  },
  {
    "username": "lenrob49",
    "rating": 6.0,
    "comment": "D3\n2-6, 4",
    "timestamp": 1607036400
  },
  {
    "username": "linjgames",
    "rating": 6.0,
    "comment": "Fluxx is a quasi-chaotic game where the rules are always changing... in other words, it’s not a very serious game. In fact, the best part of playing Fluxx is seeing all the funny combinations of keepers listed on the goal cards.\n\nThis is the plain vanilla version of Fluxx, so the “jokes” formed by the keepers and goal cards are more basic and easy to understand (e.g., the goal “melted chocolate” requires the keepers “chocolate” and “the Sun”). This game is ok, and a good way to introduce the game to a broad audience, but it lacks the zing of the more tightly themed versions, like Star Trek Fluxx or Firefly Fluxx, etc.",
    "timestamp": 1606690800
  },
  {
    "username": "JohnWThomas",
    "rating": 6.0,
    "comment": "I don't want to diss on this game too much as it's one of the 1st games that brought me into the hobby, but now as we try playing it I find it very random and chaotic. Still good now and then, but it's seen its day (and Pirate Fluxx is a bit better anyway).",
    "timestamp": 1605740400
  },
  {
    "username": "Inherent",
    "rating": 6.0,
    "comment": "Original Fluxx lacks the fun themes that keep me pulled into these sort of games.",
    "timestamp": 1605567600
  },
  {
    "username": "AdmiralAckbar31",
    "rating": 6.0,
    "comment": "Solid party game and filler, but it can definitely run much longer than it needs to.",
    "timestamp": 1605222000
  },
  {
    "username": "waddie",
    "rating": 6.0,
    "comment": "2-6 players",
    "timestamp": 1602972000
  },
  {
    "username": "monacelli",
    "rating": 6.0,
    "comment": "I like all the Fluxx varieties, especially if they have Creeper cards in them.",
    "timestamp": 1599256800
  },
  {
    "username": "Mkyrmse",
    "rating": 6.0,
    "comment": "Not as good as the themed versions but still good for a quick play.",
    "timestamp": 1597356000
  },
  {
    "username": "shadowjump",
    "rating": 6.0,
    "comment": "Card",
    "timestamp": 1596060000
  },
  {
    "username": "ralfchr",
    "rating": 6.0,
    "comment": "Card",
    "timestamp": 1594936800
  },
  {
    "username": "psyllogism",
    "rating": 6.0,
    "comment": "I love how playing this game can feel like a \"combo deck\" from Magic: the Gathering. Unfortunately, I can't usually convince other players to play it with me. They usually find it \"too annoying\".",
    "timestamp": 1592517600
  },
  {
    "username": "CriticalMass",
    "rating": 6.0,
    "comment": "Quick easy game. Too many versions that are all too much the same. If you want the best one, Zombie Fluxx is way up there in my opinion.",
    "timestamp": 1591740000
  },
  {
    "username": "Bigfifty",
    "rating": 6.0,
    "comment": "Innovative, but there really isn't so much a gameplay as there is just a randomly shuffled deck of cards that happened to the players.",
    "timestamp": 1589061600
  },
  {
    "username": "jonnyutah",
    "rating": 6.0,
    "comment": "de 2 a 6, cartas\nme ha gustado. Las partidas pueden durar o 1 min o media hora. Quizas eso le haga perder algo pero es la gracia del juego. Las reglas van cambiando con cada carta",
    "timestamp": 1587765600
  },
  {
    "username": "Blaze79797",
    "rating": 6.0,
    "comment": "Fluxx is little more than its core gimmick of changing rules and victory conditions, but it's simple enough that this is really all you need to be enjoyable. Will this be the first card game I grab? No. But it's simple, easy to learn, quick, and entertaining, which broadens the base of people you can play with. You're not going to have a Fluxx session that lasts for hours, but that's kind of the point.",
    "timestamp": 1586469600
  },
  {
    "username": "Oneliness",
    "rating": 6.0,
    "comment": "I like a lot of the ideas in this game, but I just wish it didn't play so much like a lot of \"change the rules\" games (like UNO). You're often playing cards and changing rules not because you're working with what you've got (like Viticulture), but because you've simply got nothing else to do. As much as I find the concept to be trashy good fun, I just end up getting bored way too quickly.",
    "timestamp": 1584918000
  },
  {
    "username": "monkeyhandz",
    "rating": 6.0,
    "comment": "Perfectly enjoyable time waster game. Fun the first few times, if you haven't played it in a while or when playing with new people or children.\n\nI'd rather play this than Uno, War, Top Trumps, etc.",
    "timestamp": 1584054000
  },
  {
    "username": "deactivision",
    "rating": 5.5,
    "comment": "More of an experience than a game as the decisions are light. But it is easy an accessible and good for a few laughs.",
    "timestamp": 1583449200
  },
  {
    "username": "Alex the Pretty Good",
    "rating": 6.0,
    "comment": "Chaos and fun.\nCan take a while to keep track of all rules ... And sometimes the game ends quicker than expected.",
    "timestamp": 1582844400
  },
  {
    "username": "TVTom",
    "rating": 7.0,
    "comment": "Must have for young kids -- some versions are harder than others, so get the simpler ones for kids just learning to read. My favorite versions are Astronomy Fluxx (great pics of the planets) and Fairy Tale Fluxx (great illustrations, and young kids love this one).\n\nThe problem with Fluxx is that it's about 99% luck, so it's fantastic for young kids learning to both read and follow directions while being able to fully compete with adults; but I don't play this with adults, except to check out a new version once just to read the fun cards.",
    "timestamp": 1760738400
  },
  {
    "username": "mickwood",
    "rating": 7.0,
    "comment": "2-6 players. Lots of expansions & variants.",
    "timestamp": 1759960800
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 8717371240417\ncd rek 9",
    "timestamp": 1756504800
  },
  {
    "username": "Oryn",
    "rating": 7.0,
    "comment": "Fluxx is a game that I frequently pack with me if there's a possibility someone will want to play a light game. It's easy to teach and usually plays in under 20 min. I've found it's a great game to introduce newer or non-players and usually everyone has a good time and wants to play multiple times a session.\n\nIs it the most thrilling game? No, but I do think it's a great entry game and even some more of my experienced gaming friends still want to play it from time to time.",
    "timestamp": 1756245600
  },
  {
    "username": "winchesterkaveman",
    "rating": 7.0,
    "comment": "The original, undiluted Fluxx.\nA great gap filler, and probably the start of a collection of Fluxx games that will regularly illicit the question of 'But are they different enough to need 20 different versions on your shelf?' to which the answer can only, honestly be 'no', and yet you'll still pick up 2 more versions next time you visit you FLGS.",
    "timestamp": 1753653600
  },
  {
    "username": "JohnGrimes",
    "rating": 7.0,
    "comment": "Viel zu lange nicht gespielt! Wackelkandidat",
    "timestamp": 1750716000
  },
  {
    "username": "Dennis64W",
    "rating": 7.0,
    "comment": "Lots of laughs!",
    "timestamp": 1745445600
  },
  {
    "username": "viphead",
    "rating": 7.0,
    "comment": "Fun and quirky party game.",
    "timestamp": 1737586800
  },
  {
    "username": "LunaFate",
    "rating": 6.6,
    "comment": "This is the best-known game of Andrew Looney.\nAnd despite its had a better days in the beginning of 2000 then now,I truly love an central idea of the Fluxx and everytime I have so much fun during the constantly changing rules and flow of the game.\nIt's fantastic!",
    "timestamp": 1736809200
  },
  {
    "username": "missdragonara",
    "rating": 7.0,
    "comment": "Fun, quick, good warm up. Too random for games night.",
    "timestamp": 1736204400
  },
  {
    "username": "wyatter",
    "rating": 7.0,
    "comment": "not important",
    "timestamp": 1735945200
  },
  {
    "username": "stevepwalker",
    "rating": 7.0,
    "comment": "Keep",
    "timestamp": 1735945200
  },
  {
    "username": "Knitsudge",
    "rating": 7.0,
    "comment": "I have an early edition of this game, which did not have the creepers game mechanic. I prefer it to the newer editions.",
    "timestamp": 1735599600
  },
  {
    "username": "fromeea",
    "rating": 7.0,
    "comment": "In Box #0012\n\nAmy Peschong: 7\nBrady Jensen: 5\nDawn Raymond: 5",
    "timestamp": 1734044400
  },
  {
    "username": "RMitrea",
    "rating": 7.0,
    "comment": "1/1/2020 as placeholder for previously played game.",
    "timestamp": 1733439600
  },
  {
    "username": "jrowley",
    "rating": 7.0,
    "comment": "Always willing to play Fluxx!!",
    "timestamp": 1730415600
  },
  {
    "username": "reyzor",
    "rating": 7.0,
    "comment": "+",
    "timestamp": 1729720800
  },
  {
    "username": "Jwat18",
    "rating": 7.0,
    "comment": "Andrew owns\n\nJonny & Sophie own",
    "timestamp": 1729461600
  },
  {
    "username": "MrEpicdog",
    "rating": 7.0,
    "comment": "Very fun, good concept, but needs more cards that make the game something entirely different. Ex: cards that switch the game into like Uno or Go Fish. My main problem with the game though is that you have an option to make it crazy (aka: fun). Like half the players will try to make the game hard on purpose and others try to make it too easy. Could benefit from forcing players to make harder decisions.",
    "timestamp": 1728252000
  },
  {
    "username": "flutegirl",
    "rating": 7.0,
    "comment": "Fun, chaotic game. You can't take it seriously, though.",
    "timestamp": 1727042400
  },
  {
    "username": "MD87",
    "rating": 7.0,
    "comment": "With the Creeper Pack this is good fun, but without it it's a bit flat.\n\nSome of the goals are a bit too generous - like having a certain hand size or number of keepers. They're just instant win conditions in a lot of cases.\n\nIt has some fun rules that don't appear in (m)any of the other variants I've played: inflation (increases any printed numeral by 1), hand limit 0, and one that forces your first play to be random (if you have more than 1 play). The latter two combined make for some pretty crazy games.",
    "timestamp": 1724536800
  },
  {
    "username": "Kasiopea",
    "rating": 7.0,
    "comment": "I like this one, requires discussion, focus and distance  complete randomness is quite funny",
    "timestamp": 1723759200
  },
  {
    "username": "W1LDH0R53",
    "rating": 7.0,
    "comment": "1 Card Sleeves",
    "timestamp": 1722290400
  },
  {
    "username": "Nyghtskyz",
    "rating": 7.0,
    "comment": "BGG expansion",
    "timestamp": 1719612000
  },
  {
    "username": "hansolo2007",
    "rating": 6.7,
    "comment": "Demo deck from store i think",
    "timestamp": 1715810400
  },
  {
    "username": "shavemykiwis",
    "rating": 7.1,
    "comment": "Crazy and wild",
    "timestamp": 1715637600
  },
  {
    "username": "Zwidar",
    "rating": 7.0,
    "comment": "v3.0. Before they added in creepers.",
    "timestamp": 1710284400
  },
  {
    "username": "camax",
    "rating": 6.5,
    "comment": "Gifted to Alex McAra",
    "timestamp": 1708297200
  },
  {
    "username": "Rivka",
    "rating": 7.0,
    "comment": "I have brought this to game night, and some people really like it.\nPros: Works as a party game, can be silly fun\nCons: best for people who don't get discouraged or confused easily by quick changes in the rules, really a love-it-or-hate-it game.",
    "timestamp": 1708210800
  },
  {
    "username": "funnyfisher7",
    "rating": 7.2,
    "comment": "I like how random and chaotic this game is lol. I can relax and not worry about being competitive for realsies because there are so many things that can occur between my turn that can entirely change any plan I currently have. Some may not like that, but I think it can be nice to play a funny crazy game like Fluxx sometimes",
    "timestamp": 1705791600
  },
  {
    "username": "TJ86",
    "rating": 6.5,
    "comment": "Original (un-themed) version of this very chaotic set collection game with ever changing rules. Very little skill involved but usually easy going fun. This version has the least extra mechanisms although it struggles to shine as a party game as some people can't cope with the ever changing rules.",
    "timestamp": 1702767600
  },
  {
    "username": "SukiGold",
    "rating": 7.0,
    "comment": "",
    "timestamp": 1701298800
  },
  {
    "username": "StoppedFerret",
    "rating": 7.0,
    "comment": "Yeah, I like it. I think it's fun and good.\n\nI played the card that says I'm right.\n\nSo I am.",
    "timestamp": 1700262000
  },
  {
    "username": "Caterp1llar1",
    "rating": 7.0,
    "comment": "I've played this so many times the box is falling apart",
    "timestamp": 1699398000
  },
  {
    "username": "Jemaima",
    "rating": 7.0,
    "comment": "Хорошая игра, много разных механик, но играть большими компаниями интереснее. Просто игра. Без энтузиазма.\n\n\nИзменяю рейтинг после нескольких игр: вы должны играть в него в правильном настроении. Очень весело и много динамики. Хорошо подходит для отдыха)",
    "timestamp": 1698620400
  },
  {
    "username": "PurpleKangaroo",
    "rating": 7.0,
    "comment": "The latest edition of Fluxx is good, but not as well-balanced or as creatively themed as its many variations. As an introduction to the world of Fluxx, I actually far prefer Holiday Fluxx. This version is best for experienced Fluxx players when combined with the \"Rules Mill\" and \"Creepers\" expansions.",
    "timestamp": 1697666400
  },
  {
    "username": "UndutifulCarrot",
    "rating": 7.0,
    "comment": "Man, I love this game. It's good, simple, dumb fun and playable with anyone if you're not looking for something weighty or serious",
    "timestamp": 1695420000
  },
  {
    "username": "Mathman1224444",
    "rating": 7.0,
    "comment": "This game can take 2 minutes and be a nothing burger, 20 minutes and be a back-and-forth game, or 45 minutes because players start with no cards, draw a useless card, and play it. It's difficult to know whether the game you're about to play is going to be fun, but it's simple enough to teach and random enough that new players always have a decent chance of winning.\n\nThe game seems popular enough for several expansion, but they all kind of do the same thing. I would only recommend having the original, or only having one expansion without the original.",
    "timestamp": 1689717600
  },
  {
    "username": "JBeezey",
    "rating": 7.0,
    "comment": "2-4 Players",
    "timestamp": 1688594400
  },
  {
    "username": "mikee385",
    "rating": 7.0,
    "comment": "Hilariously fun casual filler game for any number of people. We've had as much fun with just two players as we have with eight. If you're looking for strategy, look somewhere else. If you're looking for fun, mindless, play-anywhere, play-anytime entertainment, this game is fantastic. Our main problem is getting people to stop playing this game...",
    "timestamp": 1686348000
  },
  {
    "username": "lausdower",
    "rating": 6.5,
    "comment": "One of the first games I ever owned. Gave it to my sister when I moved out of state.",
    "timestamp": 1686002400
  },
  {
    "username": "VeilOfOblivion",
    "rating": 7.0,
    "comment": "EN",
    "timestamp": 1684101600
  },
  {
    "username": "GothPunkGeek",
    "rating": 7.0,
    "comment": "Added cards from 4.0 and SE, along with several promo cards",
    "timestamp": 1683324000
  },
  {
    "username": "Meiere01",
    "rating": 7.0,
    "comment": "Holiday Fluxx\nMarvel Fluxx\nMath Fluxx\nOz Fluxx\nZombie Fluxx",
    "timestamp": 1682028000
  },
  {
    "username": "Dissaua84",
    "rating": 7.0,
    "comment": "$ta$",
    "timestamp": 1679868000
  },
  {
    "username": "Bochikawa",
    "rating": 7.0,
    "comment": "+tabletop expansion",
    "timestamp": 1679439600
  },
  {
    "username": "walkerjenn5",
    "rating": 7.0,
    "comment": "2-6p free solo variant available",
    "timestamp": 1679266800
  },
  {
    "username": "Plixxi",
    "rating": 7.0,
    "comment": "Definitely a workout for the brain; don't play this with people whose minds aren't flexible enough to match the twists and turns the game provides. So random. So hilarious.",
    "timestamp": 1677884400
  },
  {
    "username": "wdwPlayNext",
    "rating": 7.0,
    "comment": "Small Games",
    "timestamp": 1676761200
  },
  {
    "username": "pdrseuss",
    "rating": 7.0,
    "comment": "Quick! Unique! Fun and funny! Easy to learn and teach! Colorful! Fluxx is a light tactical game that helps new gamers develop a thicker skin because nobody should get too attached to their cards. You shouldn't play this for a serious game, but rather for a fun social silly time. This is even fine for a light quick 2-player game.\n\nThe only downside is that everybody's hands of cards can get ridiculously large, which can be difficult for small hands and high alcohol contents.\n\nThis is in the same \"guilty pleasure\" category as Munchkin and Killer Bunnies, but plays quicker. Every gamer should have a closet nonsense game. I have a satisfactory and fun time when I play Fluxx, which is much more I can say about any department store game. Fluxx has replaced Uno for me.\n\nFamily Game! Beer-N-Pretzels Game! Church Group Game Kids Game!",
    "timestamp": 1674946800
  },
  {
    "username": "Buddyroo22",
    "rating": 7.0,
    "comment": "We have a lot of Fluxx. We like the game but we don't play it as much anymore. It's a good filler. Fun for people who don't like to learn rules",
    "timestamp": 1674428400
  },
  {
    "username": "HungrySaint17",
    "rating": 7.0,
    "comment": "Good, fun game but not much strategy",
    "timestamp": 1673996400
  },
  {
    "username": "Omodin",
    "rating": 7.0,
    "comment": "Fun, light, and fairly quick. A good end of night game or in between longer games.",
    "timestamp": 1673823600
  },
  {
    "username": "Scotty_Bomb",
    "rating": 7.0,
    "comment": "Still a classic card game, and always fun to crack out as a warm up.",
    "timestamp": 1672700400
  },
  {
    "username": "Zygmoont",
    "rating": 6.8,
    "comment": "Good party game with rules changing all the time, quite entertaining",
    "timestamp": 1672354800
  },
  {
    "username": "Katastrophy9",
    "rating": 6.9,
    "comment": "2015 *Traded* (G4GG)\n\n Play on BoardGameArena\n\n~ Could not find anyone in the household that liked this game enough to play it regularly with me. More partial to the Zombie theme anyway.",
    "timestamp": 1671231600
  },
  {
    "username": "Becker99",
    "rating": 7.0,
    "comment": "BETTER WITH MORE",
    "timestamp": 1669935600
  },
  {
    "username": "mpatoka",
    "rating": 7.0,
    "comment": "If you like random, somewhat chaotic gameplay and win conditions you usually have to get lucky to win, then this game is for you. Fun to play.",
    "timestamp": 1666648800
  },
  {
    "username": "shortreststudios",
    "rating": 7.0,
    "comment": "The constant threat of shifting rules is what makes this one for me.",
    "timestamp": 1665612000
  },
  {
    "username": "kizmitt",
    "rating": 7.0,
    "comment": "My deck is well-loved as this game is a popular one. This version of Fluxx is nice and simple. However if I'm introducing somebody to Fluxx, I usually turn to my favorite edition: EcoFluxx/Nature Fluxx.\nMy one gripe with this version is the plethora of religious cards. I don't so much mind the references like having a bible or cross keeper, but I don't like the cross-bonus new rule card (allows people wearing crosses to have an extra draw) or the bible verses action card (allows people who can recite a bible verse to play two extra cards with the action).",
    "timestamp": 1663106400
  },
  {
    "username": "dsrtrosy",
    "rating": 7.0,
    "comment": "Mobile only",
    "timestamp": 1662674400
  },
  {
    "username": "OasisFlyer",
    "rating": 6.5,
    "comment": "Nice filler, easy to play two player but also easy to add more players. Interesting mechanic of the rules changing, fun game, can be a quick play or a bit longer depending on what happens.",
    "timestamp": 1661637600
  },
  {
    "username": "Herald Selenay",
    "rating": 7.0,
    "comment": "App version for iPad.",
    "timestamp": 1660773600
  },
  {
    "username": "Irsaan",
    "rating": 7.0,
    "comment": "Usually quick and always chaotic. Good mindless fun, no strategy needed. Just slam cards until someone wins.",
    "timestamp": 1660168800
  },
  {
    "username": "Woelf",
    "rating": 7.0,
    "comment": "Haven't played this specific copy, but my rating is set the same as standard (English) Fluxx.",
    "timestamp": 1658786400
  },
  {
    "username": "ElectricCoffee",
    "rating": 7.0,
    "comment": "I always describe this game as \"The game without rules\". The rules at first are simple: draw 1 card, play 1 card. From that moment onward everything quickly spirals into chaos!",
    "timestamp": 1654725600
  },
  {
    "username": "sbilbey",
    "rating": 7.0,
    "comment": "Our daughter loves Fluxx, but some of our gaming friends find it a little random.",
    "timestamp": 1650492000
  },
  {
    "username": "battlespoons",
    "rating": 7.0,
    "comment": "A simple game that gets crazy. Fun for family.",
    "timestamp": 1650405600
  },
  {
    "username": "BrianMcD",
    "rating": 7.0,
    "comment": "The original, but not my favorite -- I think Fluxx is best with a strong theme.",
    "timestamp": 1647471600
  },
  {
    "username": "brianbloom",
    "rating": 8.0,
    "comment": "I like Fluxx a lot. We keep a copy on the table for playing while eating! Not perfect but very fun.",
    "timestamp": 1757541600
  },
  {
    "username": "LordHaas",
    "rating": 8.0,
    "comment": "Fun, EZ teach, Quick play.",
    "timestamp": 1756677600
  },
  {
    "username": "clawp1995",
    "rating": 8.0,
    "comment": "3D Printed Box\nSleeve Kings Standard USA 56 x 87 (110) SKS-8807",
    "timestamp": 1754258400
  },
  {
    "username": "TomTraubert",
    "rating": 7.5,
    "comment": "Our family loves this crazy, silly, frustrating little game.",
    "timestamp": 1753912800
  },
  {
    "username": "Jack Rosier",
    "rating": 8.0,
    "comment": "mayra",
    "timestamp": 1752444000
  },
  {
    "username": "lswan",
    "rating": 8.0,
    "comment": "Biased because I didn't understand this game. Let say that I'm rating my gaming experience for this game.",
    "timestamp": 1752271200
  },
  {
    "username": "zelmf",
    "rating": 8.0,
    "comment": "very good for groups and casuals",
    "timestamp": 1745618400
  },
  {
    "username": "Blix",
    "rating": 8.0,
    "comment": "Social & Silly\nFluxx is a fantastic game! A great game that is fast and always different. Lots of laughs and lots of thinking.",
    "timestamp": 1743890400
  },
  {
    "username": "Holaatit",
    "rating": 8.0,
    "comment": "The randomness can lead to a confusing experience for first time players but once you get accustomed to the base gameplay rules this is a fun game night card break out that serves well as a pallet cleanser between larger games. One of the more player interaction card games in terms of altering rules and what people want in their hand",
    "timestamp": 1743372000
  },
  {
    "username": "jaluth",
    "rating": 8.0,
    "comment": "Absolutely loved this with my old gaming group back in the early naughts. Simple to get into, but the ever changing rules can be a turn-off for modern (writing this in 2025) gamers. Think of it as a card-driven version of the \"Calvinball\" game (from the Calvin & Hobbes comic strips)",
    "timestamp": 1739401200
  },
  {
    "username": "played",
    "rating": 8.0,
    "comment": "The game with no rules- well not exactly.... You draw cards and play cards as per rules on the table, hoping to collect a set. These rules and collections are forever changing- fluxuating if you will. The fun of this game is the chaos and the ever changing \"tactics\". You hold your breath for hope so you can play that killer card, or the opposite, where you hope to get rid of that awful card that you have in hand. There's no definitives in this game, including the length. So you could spend up to an hour where the game out stays it's welcome, or 5 minutes where you want more! In a world with limited time, if I was to gamble I would gamble for something I cannot obtain. So in this case I will play something which will guarantee more of a chance of a fun quick game. Hey, I didn't make the rules!\n\nDidn't make the cut because a friend got me the nicer fourth edition as a present. The stinker cards, or whatever they are called, actually detract from the game as it's not as much fun. Fourth edition has nice colours though.",
    "timestamp": 1737586800
  },
  {
    "username": "bertle",
    "rating": 8.0,
    "comment": "Lots of fun, and so simple. Anyone can play, though new players (if not gamers) can be overwhelmed with all of the changing rules. Varies considerably in the length of play.\n\n(2024) (2025)",
    "timestamp": 1734130800
  },
  {
    "username": "thejrrogers",
    "rating": 8.0,
    "comment": "Bonkers",
    "timestamp": 1716847200
  },
  {
    "username": "MeowMeowMeeple",
    "rating": 8.0,
    "comment": "Quick to pick up and play--we started with 2 players, and it would be even more fun with more people! The first three rounds went very fast.",
    "timestamp": 1716760800
  },
  {
    "username": "Madstone",
    "rating": 8.0,
    "comment": "it is an entertaining game where the goal to win is constantly changing depending on the cards played. It is a fun game to play with 4-6 people. So many genre versions of the game. Find your genre and try it!",
    "timestamp": 1714946400
  },
  {
    "username": "sawall",
    "rating": 7.5,
    "comment": "The randomness makes this not a great game for everyone but with the right group it's incredibly entertaining.",
    "timestamp": 1710802800
  },
  {
    "username": "TuesdayFortnite",
    "rating": 8.0,
    "comment": "Fluxx. The rules are on the cards! Great gateway game for open minded players, but can be very confusing for those expecting something more like monopoly!",
    "timestamp": 1706914800
  },
  {
    "username": "tommaas616",
    "rating": 8.0,
    "comment": "Not for everyone. Very, very random and chaotic. Fun with the right mix of players!",
    "timestamp": 1705446000
  },
  {
    "username": "Mbaro",
    "rating": 8.0,
    "comment": "This is such a fun and chaotic game for almost any occasion. I feel like the more people at the table, the more fun it becomes. I'm also biased to this game because it was the first game my fiance and I played together and later I proposed to her with a custom hand made from a booster pack.",
    "timestamp": 1704582000
  },
  {
    "username": "noobster",
    "rating": 8.0,
    "comment": "80 nis",
    "timestamp": 1701385200
  },
  {
    "username": "gthanatos",
    "rating": 8.0,
    "comment": "small",
    "timestamp": 1699916400
  },
  {
    "username": "amilu",
    "rating": 7.5,
    "comment": "Expansions:\n+ Fluxx: BoardGameGeek Expansion\n+ Fluxx: 10th Anniversary Party Promos – Expansion Card Pack\n+ Fluxx: Party Favors",
    "timestamp": 1699743600
  },
  {
    "username": "MarthaFuller73",
    "rating": 8.0,
    "comment": "Fun game!!",
    "timestamp": 1698012000
  },
  {
    "username": "Picpig",
    "rating": 8.0,
    "comment": "I love it, but the player mix is important — either you laugh yourself to death upon rule-change, or people get annoyed when their hand-cards are turned useless in a flash.",
    "timestamp": 1696716000
  },
  {
    "username": "MrWoodrow",
    "rating": 8.0,
    "comment": "I like Fluxx.\n\n\nI recently watched an interview with the designer Andy Looney which explained a lot! He possesses a special kind of genius.\n\nFluxx gets a lot of stick for being random. It isn't just random, it is chaotic, stressful and frequently utterly mental.\n\nBasically the game rules can (and very often will) significantly change from turn to turn based on the cards played. One turn you could be drawing a card and playing a card in the pursuit of launching a rocket to the moon, the next turn you could be drawing 5 cards and playing 10, playing rock, paper scissors with an opponent, drawing MORE cards if it's your birthday and playing random cards from the deck to try and combine milk and cookies.....\n\nI don't really understand the criticism because Fluxx, in my opinion, does exactly what it sets out to do, and that is provide an unusual, chaotic game experience where nobody really knows what is going to happen which doesn't feel like any other game. And surely there's a place for a game like that in most peoples lives? No? Do you need a special kind of mind to appreciate it? Do I only like Fluxx because secretly I just want to watch the world burn? Maybe. But it has achieved mainstream popularity, which is surprising.\n\n\nSome people have said that the game is so chaotic that it's hardly a game at all and that you just play cards until somebody lucks into a victory condition. I suppose it could be played that way but I have definitely won more games than I have lost and the top players on BGA would definitely disagree. There is always a chance that a beginner could beat a master, that's part of the chaos which is part of the charm but equally a good player knows how to create opportunities for themselves whilst limiting the choices of their opponents.\n\nI think Fluxx is a beautiful, complex and misunderstood game which could be enjoyed by all, so long as everyone agrees to enjoy it for what it is, rather than complaining about what it isn't,",
    "timestamp": 1696456800
  },
  {
    "username": "anivic",
    "rating": 8.0,
    "comment": "The craziness has been given a physical form! While the idea is quite simple, the fact that you can change how the game is played on the get go is quite entertaining. No two games are the same.\nThe only detail is that it requires a lot of attention.",
    "timestamp": 1690668000
  },
  {
    "username": "JimABassPlayer",
    "rating": 7.9,
    "comment": "February 28, 2003, Ubercon III, Secaucus, NJ: Fluxx (3.0) reintroduced me to the hobby. With multiple versions, the game with the ever-changing rules is always enjoyed in my gaming circles.",
    "timestamp": 1683237600
  },
  {
    "username": "kaelorian",
    "rating": 8.0,
    "comment": "1.39",
    "timestamp": 1681423200
  },
  {
    "username": "JadedAria",
    "rating": 8.0,
    "comment": "Please check this comment to see what is for trade.\n\nThis game is awesome. The mechanics are deceptively simple... They can often confuse casual gamers without someone experienced helping them through the first round.\n\nExpansions:\nBGG Promo Pack (for trade)\nCthulhu Fluxx: The Unspeakable Promo Card (for trade)\nMammoth Fun Pack (for trade)\nMeta Rule\nRock Paper Scissors Pack (for trade)\nSkullduggery Promo Card (for trade)\nStar Fluxx: Robo-Doc Promo Card (for trade)\nSwap Plays for Draws Promo Card x2 (1 for trade)\nTabletop Day Expansion (for trade)\n\nDECKS:\nBatman\nDoctor Who (with all promo cards)\nFirefly (with Alliance and Alliance Treasure promos)\nHoliday (with promos)\nJumanji (deluxe with coin)\nMarvel\nMonty Python (with promos)\nSolo Fluxx (printed rules for single player option)\nStar Trek (with Bridge expansion)\nStar Trek DS9 Fluxx\nStar Trek TNG\nStar Trek Voyager\nTiny Fluxx (2 player max)",
    "timestamp": 1672527600
  },
  {
    "username": "BadBoyJoe06",
    "rating": 8.0,
    "comment": "Chaos incarnate.",
    "timestamp": 1665525600
  },
  {
    "username": "other_nebogipfel",
    "rating": 8.0,
    "comment": "Many people dislike Fluxx because it is so random. I like to watch the crazy surrealistic journey it takes me on.",
    "timestamp": 1659736800
  },
  {
    "username": "laytox",
    "rating": 8.0,
    "comment": "One of my favorite entry/filler games. Been playing since high school. Yes it's random, also it's fun.",
    "timestamp": 1658786400
  },
  {
    "username": "jblue22",
    "rating": 8.0,
    "comment": "Small",
    "timestamp": 1658613600
  },
  {
    "username": "PerpetualFX",
    "rating": 8.0,
    "comment": "I can see why people hate on this game, but with the right people and the right mindset this game is wonderful. Completely random, can't really plan or make any super smart moves, but sometimes it's nice to just go along for the ride and have some laughs with your friends and family without having to think too much (or at all). Plus the many different versions means there's always a theme someone will be interested in.",
    "timestamp": 1658354400
  },
  {
    "username": "mikehulsebus",
    "rating": 7.5,
    "comment": "Great way to pass time.",
    "timestamp": 1656972000
  },
  {
    "username": "sergood",
    "rating": 8.0,
    "comment": "**#GeekSort-Exclude**",
    "timestamp": 1655676000
  },
  {
    "username": "JJ_JeffO",
    "rating": 8.0,
    "comment": "Had it, lost it, bought another one couple years later cuz I missed it so much.",
    "timestamp": 1653343200
  },
  {
    "username": "siobahnv",
    "rating": 8.0,
    "comment": "I win ?",
    "timestamp": 1648249200
  },
  {
    "username": "brendanobrien",
    "rating": 7.5,
    "comment": "N 2020",
    "timestamp": 1648249200
  },
  {
    "username": "cotj73",
    "rating": 8.0,
    "comment": "Crazy, quick and lawless.",
    "timestamp": 1645657200
  },
  {
    "username": "jaime_lex",
    "rating": 8.0,
    "comment": "With this one I started in the hobby",
    "timestamp": 1645484400
  },
  {
    "username": "UAJZ",
    "rating": 8.0,
    "comment": "2-6, B:4, 5-30m",
    "timestamp": 1644534000
  },
  {
    "username": "jonpaget",
    "rating": 8.0,
    "comment": "A constantly changing card game that’s simple in design but complex and chaotic in play. Good quick fun.",
    "timestamp": 1643151600
  },
  {
    "username": "Grimoire_",
    "rating": 8.0,
    "comment": "BGA - the rule is broken ... and so does the laughter. I often find myself in giggles where the game goes in wrong-endless way. Yes, its 5 mins play is quick, but is interesting play if it lasts more.\n\nDigital Implementation: Works well on mobile, but the text is kinda small. A classic card-only game, once you familiar with the cards, the text completely doesn't matter.",
    "timestamp": 1636585200
  },
  {
    "username": "evingerm@epix.net",
    "rating": 8.0,
    "comment": "traded to Ed",
    "timestamp": 1630188000
  },
  {
    "username": "SnowyAshton",
    "rating": 8.0,
    "comment": "The card game that started my journey into being a Board Game Geek. Though many do not like it, Fluxx will hold a special place in my heart.",
    "timestamp": 1627164000
  },
  {
    "username": "tjbronz",
    "rating": 8.0,
    "comment": "Good quick game.",
    "timestamp": 1619992800
  },
  {
    "username": "darkgaze",
    "rating": 8.0,
    "comment": "A classic. Fun game for two and for more people gets longer. It's so random that sometimes a game can take 1 minute but it's fun anyway.",
    "timestamp": 1613343600
  },
  {
    "username": "JamIT42",
    "rating": 8.0,
    "comment": "Awesome game; easy to learn; lots of replay value. Haven't tried any expansions yet.",
    "timestamp": 1608505200
  },
  {
    "username": "RangerNK",
    "rating": 8.0,
    "comment": "Fluxx is a simple game full of random things happening. While playing you constantly change the rules. How many cards are drawn? How many are played? What is the limit of cards in your hand? What is the winning condition? This is what makes Fluxx fun. If you want a game where you carefully plan your strategy or a game without any luck factoring in, Fluxx is not for you. But if you want to have a fun time with a short, random game that doesnt take itself to serious, give it a try.",
    "timestamp": 1607468400
  },
  {
    "username": "PumpkinGirl",
    "rating": 8.0,
    "comment": "One of my daughter's favorites. Can be hard to teach to grandparents and non-english speakers.",
    "timestamp": 1604358000
  },
  {
    "username": "swillsswil",
    "rating": 8.0,
    "comment": "A crazy game where the rules change as part of playing the game. One of my favorites from college, and pretty easy to get anyone into, because the rules start out so simple.",
    "timestamp": 1603317600
  },
  {
    "username": "Stephenkeable",
    "rating": 8.0,
    "comment": "Love when it gets out of hand with the number of rules, really have to pay attention to what's going on.",
    "timestamp": 1596319200
  },
  {
    "username": "abetherigg",
    "rating": 8.0,
    "comment": "Its fun if you do not approach it with a competitive mindset. If you approach it with a light heartened view and a devious intent, then it is beyond fun. I understand why a lack of a clear goal can turn some away.",
    "timestamp": 1595282400
  },
  {
    "username": "sxvuq4o3w4xy7xi8nw67",
    "rating": 8.0,
    "comment": "surprised by the low ratings...this is quick, fun, and easy to teach game. always so many laughs around the table. the instant win mechanic keeps the tension high. love it!",
    "timestamp": 1594677600
  },
  {
    "username": "GregMartCol",
    "rating": 8.0,
    "comment": "Tengo la versión que la caja parece un medicamento...",
    "timestamp": 1593295200
  },
  {
    "username": "almayland222",
    "rating": 8.0,
    "comment": "Another great game!",
    "timestamp": 1592258400
  },
  {
    "username": "slybaby",
    "rating": 8.0,
    "comment": "Sleeves - Swan Panasia Sleeves 57 X 90 - Thick",
    "timestamp": 1588284000
  },
  {
    "username": "mattpeppo",
    "rating": 8.0,
    "comment": "Changing rules are fun to keep up with, and interesting for all ages. Great concept.",
    "timestamp": 1587852000
  },
  {
    "username": "steviewii",
    "rating": 8.0,
    "comment": "Storage\nHard Shell Card Case",
    "timestamp": 1585778400
  },
  {
    "username": "huibschoots",
    "rating": 8.0,
    "comment": "Fun: bit of chaos and the unpredictability makes it a good game!",
    "timestamp": 1582930800
  },
  {
    "username": "zaincmt",
    "rating": 7.5,
    "comment": "Version owned:\nPlays:\nScore:\nBest Player Counts:\nGame Length:\nType of Game:\nTheme / Artwork:\nComponents:\nReplayability:\nGame Difficulty:\nTactics / Strategy required?:\nDescription:",
    "timestamp": 1581807600
  },
  {
    "username": "pokes_",
    "rating": 8.0,
    "comment": "I don't even care that there's almost no strategy. I'm here to have fun.",
    "timestamp": 1581375600
  },
  {
    "username": "Acciaccatura",
    "rating": 8.0,
    "comment": "Original Edition\nStar Flux Edition\nDoctor Who Flux Edition",
    "timestamp": 1580338800
  },
  {
    "username": "mjmwi",
    "rating": 8.0,
    "comment": "Keep",
    "timestamp": 1577919600
  },
  {
    "username": "nuis",
    "rating": 7.5,
    "comment": "L",
    "timestamp": 1577228400
  },
  {
    "username": "shibby",
    "rating": 8.0,
    "comment": "I love random. This is random. I love it.",
    "timestamp": 1573772400
  },
  {
    "username": "luzer1495",
    "rating": 8.0,
    "comment": "First time playing was with Lisa and friends at Rook & Pawn in Athens. Birthday gift from Salve - 2017.\n\nPretty fun game for a while. It's gotten a bit stale after too many plays though.",
    "timestamp": 1567548000
  },
  {
    "username": "Loripdosiam",
    "rating": 8.0,
    "comment": "I enjoy playing it but many people I try it with don't seem to like it, I think they find it too abstract.\nI might have the advantage that I played Zombie Fluxx before this one which I feel is less abstract in goals.",
    "timestamp": 1565992800
  },
  {
    "username": "DiceLord",
    "rating": 9.0,
    "comment": "Card game",
    "timestamp": 1759701600
  },
  {
    "username": "Zavia",
    "rating": 9.0,
    "comment": "An essential for introduction for new bg players. No other game is before a game of Fluxx.\nIt teaches the jargon we use, how to understand its implications and, later, to exploit the rules to your advantage.",
    "timestamp": 1745186400
  },
  {
    "username": "mortaine",
    "rating": 9.0,
    "comment": "Easily one of the best silly/random games ever made.\nKeep",
    "timestamp": 1737673200
  },
  {
    "username": "killerqueendopamine",
    "rating": 9.0,
    "comment": "Math and Chem versions",
    "timestamp": 1730674800
  },
  {
    "username": "ak3hx993bu",
    "rating": 9.0,
    "comment": "2-8 players",
    "timestamp": 1720821600
  },
  {
    "username": "drakythe",
    "rating": 9.0,
    "comment": "Easy game to break out anywhere with almost no rules explanation",
    "timestamp": 1707260400
  },
  {
    "username": "Cygwulf",
    "rating": 9.0,
    "comment": "Very fun, randomly chaotic card game. Usually plays fast. Can depend on who you're playing with, people who are especially competitive might not like how quickly fortunes can change in this game.",
    "timestamp": 1705964400
  },
  {
    "username": "neuhausr",
    "rating": 9.0,
    "comment": "really helps if you have a good grounding in procedural logic, due to how certain card combos create stacked effects and recursive loops",
    "timestamp": 1686520800
  },
  {
    "username": "fredbud",
    "rating": 8.5,
    "comment": "excellent game",
    "timestamp": 1685224800
  },
  {
    "username": "taxy",
    "rating": 9.0,
    "comment": "in Metallbox",
    "timestamp": 1682287200
  },
  {
    "username": "B_Franklin",
    "rating": 9.0,
    "comment": "Such a fun and quirky game",
    "timestamp": 1668294000
  },
  {
    "username": "Nicolabs",
    "rating": 9.0,
    "comment": "Bought from BGTCUK August 2022",
    "timestamp": 1662415200
  },
  {
    "username": "fuzzy77",
    "rating": 8.5,
    "comment": "2 (ver5.0)\n\n\n\n6-2-22",
    "timestamp": 1654552800
  },
  {
    "username": "Odd24_7",
    "rating": 9.0,
    "comment": "Fluxx series. The OG edition. Quick and light game for fast play. Everyone can play it. Loads of fun!",
    "timestamp": 1632434400
  },
  {
    "username": "ArtfulDodger",
    "rating": 9.0,
    "comment": "The one that started it all. Love all Fluxx games!\nI have two versions.",
    "timestamp": 1624658400
  },
  {
    "username": "Gecko97",
    "rating": 8.5,
    "comment": "Good quick-start game, for those who don't want to learn a heap of rules at the start.",
    "timestamp": 1621634400
  },
  {
    "username": "BAT754",
    "rating": 8.5,
    "comment": "Wonderful card game. Got it on a whim one day, and have played it constantly since. While it’s mostly based on luck, there is a good amount of strategy needed as well to feel like a solid brain workout, especially when the rounds start going long. Highly recommend.",
    "timestamp": 1620511200
  },
  {
    "username": "reptile_wizard",
    "rating": 9.0,
    "comment": "Easy to lean/teach new players.\nCan be a quick game or played many times.\nNever the same play through!",
    "timestamp": 1603753200
  },
  {
    "username": "jonre723",
    "rating": 9.0,
    "comment": "Purple edition. 10 points with The Traitor.",
    "timestamp": 1595455200
  },
  {
    "username": "IrrationalDM",
    "rating": 9.0,
    "comment": "Lost box (at least top)",
    "timestamp": 1558303200
  },
  {
    "username": "Angry_Technobadger",
    "rating": 9.0,
    "comment": "The only rules are Draw 1, Play 1. Everything else is in the deck. Have fun!",
    "timestamp": 1558303200
  },
  {
    "username": "ZacharyTheNerd",
    "rating": 8.5,
    "comment": "Expansions:\nCreeper Pack",
    "timestamp": 1547766000
  },
  {
    "username": "Rawkinrex",
    "rating": 9.0,
    "comment": "Always a good time!",
    "timestamp": 1525816800
  },
  {
    "username": "zeder",
    "rating": 9.0,
    "comment": "in the early days of Fluxx the cards were printed black and white on heavy matte card stock that was initially impossible to shuffle and equally hard to fan out in the hand. as these things go the cards would become \"looser\" through repeated plays and Me and My Friends in College played the hell out of those cards. indeed, My pack was so dinged and scratched that in reality you could easily tell half the cards in the other players hands just based on the unique patterns of scratches and dents on the cards. we didn't care. the game was fun and incited good-natured ribbing and we could play a dozen hands in an evening when in reality we should have been studying a little more. I eventually played the later versions that were made of much better card-stock and maintained most of what we loved in the original and added other cards of interest. along that vector, My group of Friends also heavily modified some of our cards to add our own effects long before we ever heard of blanxx. the game just begs to be modified and made your own! don't get me wrong, i love complex and strategic games but i also love fillers like Fluxx. the world is big enough for both, and the world is better for Fluxx.\n\nembrace the chaos.",
    "timestamp": 1523224800
  },
  {
    "username": "TPineapples",
    "rating": 9.0,
    "comment": "Crazy fun game. Simple rules (at first), quickly turns into a chaotic match of policing rules and gaming the system. Really enjoy this one, looking forward to trying expansions and other sets.",
    "timestamp": 1520118000
  },
  {
    "username": "diamondz123",
    "rating": 9.0,
    "comment": "2–6 Players\nCommunity: 2–6 — Best: 4",
    "timestamp": 1518908400
  },
  {
    "username": "AanTafel",
    "rating": 9.0,
    "comment": "Bought this game on a small convention in Utrecht not really knowing what it was, but it sounded great. Best buy ever!",
    "timestamp": 1510182000
  },
  {
    "username": "ftl_ftw",
    "rating": 9.0,
    "comment": "A classic. Fast to play especially once you get the hang of it, and pretty fun. Good filler game.",
    "timestamp": 1508104800
  },
  {
    "username": "Cbear1332",
    "rating": 8.5,
    "comment": "Very fun game. If you are wanting just a fun, relaxing card game where rules change and you will never know who is going to win, you will like this game",
    "timestamp": 1504044000
  },
  {
    "username": "storyhound17",
    "rating": 9.0,
    "comment": "I have been playing the original Fluxx almost since it originally came out. It was a staple through college. It's fabulous wacky fun and it well worth the price of admission.",
    "timestamp": 1500069600
  },
  {
    "username": "Arianka",
    "rating": 9.0,
    "comment": "Fast and furious",
    "timestamp": 1499205600
  },
  {
    "username": "Nardi84",
    "rating": 9.0,
    "comment": "I think I like this one more than most people...",
    "timestamp": 1497564000
  },
  {
    "username": "Htrinh0000",
    "rating": 9.3,
    "comment": "3/1/17: In storage",
    "timestamp": 1488754800
  },
  {
    "username": "TESisler",
    "rating": 9.0,
    "comment": "I'm new to this game but I love the chaotic aspect to the game.",
    "timestamp": 1483398000
  },
  {
    "username": "sikestopherdan",
    "rating": 9.0,
    "comment": "Awesome concept where rules are changed and modified as play continues. Can get very hectic the longer you play, but it was a fun hectic. Even when I lost I was laughing at how crazy and close it was, with just 2 players. Each play will be different and unique, can't wait to play with more players",
    "timestamp": 1483398000
  },
  {
    "username": "Athion",
    "rating": 9.0,
    "comment": "3.0 is a personal favourite with the radiocative potato!",
    "timestamp": 1448060400
  },
  {
    "username": "MrBeast30",
    "rating": 8.5,
    "comment": "Played and played, still love it",
    "timestamp": 1426633200
  },
  {
    "username": "feenix1363",
    "rating": 9.0,
    "comment": "Fluxx classic is always a great tool for introducing non-games to our hobby.",
    "timestamp": 1424214000
  },
  {
    "username": "MillicanDarque",
    "rating": 9.0,
    "comment": "Check out my review of Fluxx version 5.0 below.\nhttp://jlnelson73.wordpress.com/2014/10/16/fluxx-review/",
    "timestamp": 1413928800
  },
  {
    "username": "fangor",
    "rating": 9.0,
    "comment": "2-6 spelare",
    "timestamp": 1404597600
  },
  {
    "username": "acellama88",
    "rating": 9.0,
    "comment": "Very easy game to pick up. Great to play with family members.",
    "timestamp": 1391727600
  },
  {
    "username": "famouspatrick",
    "rating": 9.0,
    "comment": "Good party game; need people who aren't invested in being the winner. This is a game for people who just want to have fun and interact. My family loved this; needs a minimum of 3, better with more.",
    "timestamp": 1388617200
  },
  {
    "username": "lordclyde1",
    "rating": 9.0,
    "comment": "The ultimate pick up and play card game. May actually be the easiest to learn game there is.",
    "timestamp": 1382652000
  },
  {
    "username": "tmcke712",
    "rating": 9.0,
    "comment": "Family Favorite",
    "timestamp": 1382479200
  },
  {
    "username": "Belmakori",
    "rating": 9.0,
    "comment": "Fun, fast filled game. Plays well enough. Was introduced to it at Gen Con 2000. Played that game soooo many times, I can't recall who won them all.",
    "timestamp": 1371333600
  },
  {
    "username": "cmatzkanin",
    "rating": 9.0,
    "comment": "I have Fluxx 4.0\n\nI really don't understand all the Fluxx hate. I love this game, especially when things get complicated.",
    "timestamp": 1361142000
  },
  {
    "username": "forero",
    "rating": 9.0,
    "comment": "No-Color",
    "timestamp": 1345672800
  },
  {
    "username": "Florelline",
    "rating": 9.0,
    "comment": "I really enjoy this game. I preferred it before v4.0, but meh. I find it interesting how many people say it requires no thought. Sure, it's random who wins each time, but knowing when to place cards, or remembering if a certain goal was already played is important!\n\nDisregard the naysayers! It's a fun game, and even if you end up not liking it, at least you can say you were educated in your dislike!",
    "timestamp": 1344981600
  },
  {
    "username": "lordmethos",
    "rating": 8.6,
    "comment": "sleeved",
    "timestamp": 1334008800
  },
  {
    "username": "ghatbass",
    "rating": 8.5,
    "comment": "Greatest casual card game I have ever played; a go to for any party - BG or not.",
    "timestamp": 1329260400
  },
  {
    "username": "dtgunning",
    "rating": 9.0,
    "comment": "First card game I ever owned and for the longest time the only game. Was introduced to it in 10th grade Algebra class by classmate and friend Michael Lohr. I immediately bought a copy at the Hobby store I frequented and I own many versions of the same game. Gotta keep Looney Labs in business!",
    "timestamp": 1325026800
  },
  {
    "username": "DacholaEtecoon",
    "rating": 9.0,
    "comment": "Usually quick and simple. Easy to teach. Good filler game.",
    "timestamp": 1321052400
  },
  {
    "username": "Lontra",
    "rating": 9.0,
    "comment": "A great quick game that you can play with almost anyone. Super easy to teach: \"What are the rules?\" Draw one play one, \"How do you Win?\" There is no goal yet. All the card have exactly what they do explained and nearly everyone I play this with has a good time. Ultra portable and quick.",
    "timestamp": 1311372000
  },
  {
    "username": "girtablilu",
    "rating": 9.0,
    "comment": "One of the best, and most unique, games I've ever played. Constantly changing rules keep you on your toes and holds your interest. A bit of skill, a bit of luck, and always fun.",
    "timestamp": 1298934000
  },
  {
    "username": "pijll",
    "rating": 8.5,
    "comment": "Fun, as long as it is played quickly. It gets to the table easy because of its short playing time (mostly) and the flexible number of players, but leaves the table just as quickly.",
    "timestamp": 1291676400
  },
  {
    "username": "joxta",
    "rating": 9.0,
    "comment": "Excellent little game that keeps you on your toes. Great as a filler between other things, and very portable (especially the older deck boxes).\nAlways comes on holiday with us, and has been played in cars, planes, pubs, restaurants, hotels.",
    "timestamp": 1289775600
  },
  {
    "username": "mmastertheone",
    "rating": 9.0,
    "comment": "<3",
    "timestamp": 1284588000
  },
  {
    "username": "viragkiss",
    "rating": 9.0,
    "comment": "2009.11.19.\n3350 Ft",
    "timestamp": 1273528800
  },
  {
    "username": "MaddMatt",
    "rating": 9.0,
    "comment": "One of my favourite fillers. Random and crazy. Recommended with beer.\n\nNo Zombies.",
    "timestamp": 1271023200
  },
  {
    "username": "juggler42",
    "rating": 9.0,
    "comment": "Love the Fluxx. A little erratic for some people, but it matches my mindset well.",
    "timestamp": 1271023200
  },
  {
    "username": "SeanJJordan",
    "rating": 9.0,
    "comment": "I love the simplicity of Fluxx. It's easy to pick up and play, and it's very casual-gamer friendly. As the game has been revised, it's gotten incrementally better. The alternate versions (particularly Zombie Fluxx) are really good.",
    "timestamp": 1269730800
  },
  {
    "username": "rougemacabre",
    "rating": 9.0,
    "comment": "Great for a pickup game and to play with both people unfamiliar and familiar to the game. Since the rules constantly change, new players don't feel like those more knowledgeable have too much of an advantage over them.",
    "timestamp": 1262646000
  },
  {
    "username": "Wind Lane",
    "rating": 9.0,
    "comment": "Really, really fun card game. You'll have the most fun if you try more to mess with the other players rather than just trying to win.",
    "timestamp": 1252792800
  },
  {
    "username": "Cringing Dragon",
    "rating": 9.0,
    "comment": "Fluxx, Zombie Fluxx, Family Fluxx, Christian Fluxx, Jewish Fluxx and numerous promo cards. Added as a separate game to try to keep game plays separate, but it looks like that won't work.",
    "timestamp": 1241128800
  },
  {
    "username": "eldrwyrm",
    "rating": 9.0,
    "comment": "I love this game. The chaotic nature of it appeals to me greatly. I think my favorite card is either \"1st play random\" or \"Inflation\".",
    "timestamp": 1235516400
  },
  {
    "username": "Skotte",
    "rating": 9.0,
    "comment": "what an awesome game",
    "timestamp": 1231801200
  },
  {
    "username": "Veralysona",
    "rating": 9.0,
    "comment": "Succeeds in and by its simplicity. Recognises the fact that love and chocolate are the most valuable things in life.",
    "timestamp": 1218405600
  },
  {
    "username": "walk_softly",
    "rating": 9.0,
    "comment": "I have enjoyed this each and every time I played. Love having to rethink the strategy almost every hand. I mostly lose but still enjoy. I now own all the versions.",
    "timestamp": 1211925600
  },
  {
    "username": "KellumSowers",
    "rating": 9.0,
    "comment": "Dude, rules always change. Played this one for 7 or 8 hours while waiting in line for Star Wars Ep II!",
    "timestamp": 1203894000
  },
  {
    "username": "awsmshelley",
    "rating": 10.0,
    "comment": "I love Fluxx, own several versions of it, and plan to add to my collection! I enjoy adding chaos to the game whenever I can find someone to play with me.",
    "timestamp": 1760652000
  },
  {
    "username": "ginger_mints",
    "rating": 9.7,
    "comment": "My favorite card game. It is never the same game twice, and has a great variety of rules that you can play strategically. Yes, it is very luck-based but also very fun, especially if you have 2 players.",
    "timestamp": 1749506400
  },
  {
    "username": "tokyoite",
    "rating": 10.0,
    "comment": "Delights the whole family. Not many games combine laughs and strategy, but this one manages. Makes you think, but not too hard. Just the right length for repeat hands if the mood is right.",
    "timestamp": 1744840800
  },
  {
    "username": "kimbelov",
    "rating": 10.0,
    "comment": "Отдаёшься потоку событий, он тебя несёт, и ты просто стараешься не утонуть. Глупая и хаотичная игра, которая заканчивается мгновенно, возможностей повлиять на происходящее минимум, но процесс прекрасен.",
    "timestamp": 1733698800
  },
  {
    "username": "Fudgemuffin",
    "rating": 10.0,
    "comment": "Great party game!",
    "timestamp": 1729548000
  },
  {
    "username": "Togego",
    "rating": 10.0,
    "comment": "My favorite card game. The idea with constantly changing rules is simply great. The new version by Amigo didn't catch the original feeling, though.",
    "timestamp": 1697407200
  },
  {
    "username": "emtproject",
    "rating": 10.0,
    "comment": "Keeps you and your friends busy, chaotic fun thats great between classes or as a study break. If you take it for what it is, you will love it! If you are want a game thats complex and you can master - this is not it! Simple, fun and a great way of facilitating a conversation!",
    "timestamp": 1697407200
  },
  {
    "username": "sfaDusty93",
    "rating": 10.0,
    "comment": "Also:\nGerman ver 4, 2 ed",
    "timestamp": 1685311200
  },
  {
    "username": "amlyow",
    "rating": 10.0,
    "comment": "With so many iterations, there's a version for everyone.\nYou never know how it's going to end as the 'rules' are always in flux.",
    "timestamp": 1680645600
  },
  {
    "username": "ccowgill",
    "rating": 10.0,
    "comment": "Extreme Chaos Edition",
    "timestamp": 1672873200
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "used",
    "timestamp": 1668726000
  },
  {
    "username": "RJ523",
    "rating": 10.0,
    "comment": "It is always an incredibly fun time playing this one with a group of friends.",
    "timestamp": 1656367200
  },
  {
    "username": "Frankjc3rd",
    "rating": 10.0,
    "comment": "I do not play this game as often as I would prefer.",
    "timestamp": 1654293600
  },
  {
    "username": "BoredGameGeek1982",
    "rating": 10.0,
    "comment": "Better then Uno",
    "timestamp": 1636671600
  },
  {
    "username": "squallnickey",
    "rating": 10.0,
    "comment": "This game is one of my favorite. Even though game play may get stuck sometimes, I may enjoy a lot of excitement when there are chances changing the game rules.",
    "timestamp": 1635980400
  },
  {
    "username": "justinlillich",
    "rating": 10.0,
    "comment": "My favorite card game, hands down (lol). Recommend for all ages and experience. Just a good time all around.",
    "timestamp": 1628632800
  },
  {
    "username": "madpoet13",
    "rating": 10.0,
    "comment": "Super fun game that you can put in your pocket and play anywhere and teach anyone very easily!",
    "timestamp": 1625954400
  },
  {
    "username": "LordJanithor",
    "rating": 10.0,
    "comment": "Fluxx is Fluxx",
    "timestamp": 1624744800
  },
  {
    "username": "Aradetic",
    "rating": 10.0,
    "comment": "Great for 2-6 people.",
    "timestamp": 1618869600
  },
  {
    "username": "MograhmDeadbraid",
    "rating": 10.0,
    "comment": "As an employee of a game store, and a total game geek to boot, Fluxx is definitely a big suggestion for customers. It have become the go-to game for my wife and I when we need a little fun in our lives. Fast, furious, and ultimately intriguing.",
    "timestamp": 1616281200
  },
  {
    "username": "Lukafio",
    "rating": 10.0,
    "comment": "Own 10 different versions/themes and some expansions.",
    "timestamp": 1611961200
  },
  {
    "username": "RoShin",
    "rating": 10.0,
    "comment": "Fantastic game that can last 2 minutes or 2 hours depending in rule changes. This is one of my go-to games.",
    "timestamp": 1579042800
  },
  {
    "username": "theinfamousj",
    "rating": 10.0,
    "comment": "Always a great party/filler game that plays quicklyish. While the themed decks are cute, the original deck is less cheesy and always a great way to introduce people to the Fluxx universe.",
    "timestamp": 1565560800
  },
  {
    "username": "Furore",
    "rating": 10.0,
    "comment": "Relly dynamic game!!",
    "timestamp": 1518822000
  },
  {
    "username": "Septembre",
    "rating": 10.0,
    "comment": "Weird, chaotic, funny. Perfect game.",
    "timestamp": 1513033200
  },
  {
    "username": "CarrieSue41",
    "rating": 10.0,
    "comment": "I've had way, way more plays on this one. I got it long before I knew BGG existed.",
    "timestamp": 1504389600
  },
  {
    "username": "stoneleaf",
    "rating": 10.0,
    "comment": "v4.0",
    "timestamp": 1501365600
  },
  {
    "username": "toober",
    "rating": 10.0,
    "comment": "Card game where rules constantly change. Game could be one round or one hour. i have many of the different themed versions.",
    "timestamp": 1496959200
  },
  {
    "username": "teristen",
    "rating": 10.0,
    "comment": "I give this 10 stars and recommend it 9 times out of 10 when someone asks for a game recommendation. I always suggest learning with this core deck.",
    "timestamp": 1487199600
  },
  {
    "username": "Dr Vendo",
    "rating": 10.0,
    "comment": "One of the first games I ever played that got me into gaming beyond Monopoly and LIFE.",
    "timestamp": 1485212400
  },
  {
    "username": "UncleGizmo",
    "rating": 10.0,
    "comment": "Fluxx is one of those games that should be in everyone's collection. It's easy to play and there tons of variations. A great game to introduce others into the world of games outside of Monopoly.",
    "timestamp": 1480201200
  },
  {
    "username": "allenjess11",
    "rating": 10.0,
    "comment": "Great for two players.",
    "timestamp": 1478991600
  },
  {
    "username": "Jariw",
    "rating": 10.0,
    "comment": "Our family has been playing Fluxx for many years. We have the original version, zombie, Nature, and many others. Fluxx is easy to learn: Draw a card and play a card! What is the goal to win by? Well, it's constantly changing, according to what Goal is played. This fun game can be played by people of all ages, as long as they can read or understand pictures. It's well worth the price!",
    "timestamp": 1476741600
  },
  {
    "username": "ArmyManNB",
    "rating": 10.0,
    "comment": "My wife loves this.",
    "timestamp": 1467151200
  },
  {
    "username": "straythought",
    "rating": 10.0,
    "comment": "Heavily played and in bad condition.",
    "timestamp": 1465336800
  },
  {
    "username": "Alan Saunders",
    "rating": 10.0,
    "comment": "The perfect play anywhere with anyone game.",
    "timestamp": 1435010400
  },
  {
    "username": "qbie",
    "rating": 10.0,
    "comment": "TTS",
    "timestamp": 1434924000
  },
  {
    "username": "Imandra",
    "rating": 10.0,
    "comment": "I carry this game with me in my purse. It's great to bust out and play in restaurants, waiting in line at conventions, really anywhere!",
    "timestamp": 1424127600
  },
  {
    "username": "TMcNeill89",
    "rating": 10.0,
    "comment": "4th Edition",
    "timestamp": 1419894000
  },
  {
    "username": "antimagical",
    "rating": 10.0,
    "comment": "I never get tired of playing Fluxx.",
    "timestamp": 1419289200
  },
  {
    "username": "ZucriyAmsuna",
    "rating": 10.0,
    "comment": "The most fun family card game I've ever played. ^_^",
    "timestamp": 1402956000
  },
  {
    "username": "bungeeboy",
    "rating": 10.0,
    "comment": "Lost in the flood 2013. \n\nRestored to me! Thank you!",
    "timestamp": 1388185200
  },
  {
    "username": "lanejustin",
    "rating": 10.0,
    "comment": "Alternate Box",
    "timestamp": 1383865200
  },
  {
    "username": "fabricioca",
    "rating": 10.0,
    "comment": "Muito random, muito random!",
    "timestamp": 1352588400
  },
  {
    "username": "sweetooth84",
    "rating": 10.0,
    "comment": "We play this game every night I host a game night. its a great way to start off the night when you having people showing up at all different times because anyone can jump in at anytime & they havent missed anything because the rules are ever changing. the game can go as log or as short as you want it to go, depending on the cards you have in your hands. We've played for over an hour, & other times 3 minutes. Most commonly about a half hour though. Awesome game, you have to play.",
    "timestamp": 1334268000
  },
  {
    "username": "Lu Tze",
    "rating": 9.5,
    "comment": "A really light pick up and deliver fun game. Easy to follow and lots of laughs. Thanks looneys.",
    "timestamp": 1326754800
  },
  {
    "username": "turkinaa",
    "rating": 10.0,
    "comment": "Easy to understand game play and the constant rule changes allow the game to feel fast and fun.",
    "timestamp": 1296687600
  },
  {
    "username": "punga",
    "rating": 10.0,
    "comment": "Simply brilliant. It's amazing how they took the concept of extreme randomness, which is usually despised by gamers, and made it not only fun, but incredibly addictive.",
    "timestamp": 1278280800
  },
  {
    "username": "Nekura",
    "rating": 10.0,
    "comment": "Current deck is \"Greatest Hits\" collection with cards from 2.0, 2.1, 3.0, 3.1, and Eco Fluxx as well as a bunch of promo cards (Borders Rule, Flowers, Tarts, Star, etc.) and custom goals.",
    "timestamp": 1251064800
  },
  {
    "username": "hermeticmage",
    "rating": 10.0,
    "comment": "I can get almost anybody to play this game. It's quick, it's fun, and it's challenging. A home run for Looney Labs...",
    "timestamp": 1246572000
  },
  {
    "username": "Kacey3",
    "rating": 10.0,
    "comment": "I also have additional cards collected through Looney Labs promos and other cards for sale though the website.",
    "timestamp": 1240783200
  },
  {
    "username": "JoviAllTogetha",
    "rating": 10.0,
    "comment": "This is just about my favorite time passer ever. I love going to diners and spending hours and hours playing this game. Its gotten people to come introduce themselves to see what the fun is about and its gotten my family off video games and internet for time together! Highly entertaining game.",
    "timestamp": 1238623200
  },
  {
    "username": "Thawhidol",
    "rating": 10.0,
    "comment": "One of my gateway games, and still an old favorite.",
    "timestamp": 1237762800
  },
  {
    "username": "Rooster01410",
    "rating": 10.0,
    "comment": "This is my favorite game of all time. The randomness is what makes it one of the greatest games of all time",
    "timestamp": 1231455600
  },
  {
    "username": "LordDarkSith",
    "rating": 10.0,
    "comment": "Seen this and thought that it would suck. Seen some vids from the designer and thought that it sounded cool. I love this game.",
    "timestamp": 1213826400
  },
  {
    "username": "XAce90",
    "rating": 10.0,
    "comment": "Simple, fun, quick, humorous, and vastly entertaining are just a few words that describe Fluxx. You can play for hours on end without becoming bored but I think my rating speaks for itself.",
    "timestamp": 1189634400
  },
  {
    "username": "bonnyaclyde",
    "rating": 9.5,
    "comment": "CRAZY. Deffinately a love it or hate it game. It is a game of shifting strategy. Many people say there's no strategy after I win the game. You have to enjoy the challenge of a constantly changing game to like it.",
    "timestamp": 1185573600
  },
  {
    "username": "Krisjohn",
    "rating": 10.0,
    "comment": "My favourite game. I've mixed Fluxx, EcoFluxx, Family Fluxx and a dozen promo cards together into an UberFluxx deck.",
    "timestamp": 1174604400
  },
  {
    "username": "magstheaxe",
    "rating": 10.0,
    "comment": "My favorite card game in years.",
    "timestamp": 1167433200
  },
  {
    "username": "game girl geek",
    "rating": 10.0,
    "comment": "No. 1 on my top 10. I love the unpredictability of this game. It can last 2 mins or 30 mins and the rules and goals are constantly changing. I love games like this that are simple to explain because you get more time to play!",
    "timestamp": 1154901600
  },
  {
    "username": "The DoLittle",
    "rating": 10.0,
    "comment": "One of the best card games I've ever played. Never *EVER* the same game twice and the more the merrier. I've introduced this game to people who have never played anything outside of \"Go Fish\", young children just learning to read, and even those with \"special needs\" who even wound beating the pants off of me. A highly recommended game for young and old and an family game night \"MUST HAVE\"!",
    "timestamp": 1128722400
  },
  {
    "username": "Laelia",
    "rating": 10.0,
    "comment": "Always a fun game. It's constantly changing. I love it!",
    "timestamp": 1115416800
  },
  {
    "username": "Gardener",
    "rating": 10.0,
    "comment": "This is one of my all time favorite games. It's fun, fast and ever-changing. I own every version released of this games, some in several copies and even an early beta version used by the designer during play tests.",
    "timestamp": 1104274800
  },
  {
    "username": "eman_p",
    "rating": 10.0,
    "comment": "I've got version 2...",
    "timestamp": 1102114800
  },
  {
    "username": "Rorik36",
    "rating": 10.0,
    "comment": "Love this game. Every time I teach it to someone we play it over and over again until someone cries \"Uncle!\" Mostly just dumb luck, but a great game to fill some dead time.",
    "timestamp": 1098914400
  },
  {
    "username": "offie",
    "rating": 10.0,
    "comment": "I have the first version as well as 3.0",
    "timestamp": 1097186400
  },
  {
    "username": "DesmonaFS",
    "rating": 10.0,
    "comment": "Simple, fun, and rounds are usually quick. I'm pretty much always in the mood for a game of Fluxx. :-)",
    "timestamp": 1082757600
  },
  {
    "username": "doliver",
    "rating": 10.0,
    "comment": "Fun and different every time. This game never fails to hook newcomers instantly.",
    "timestamp": 1060120800
  },
  {
    "username": "Korath",
    "rating": 10.0,
    "comment": "An awesome card game..simple to learn..even simpler to play..and man o man is it addictive.",
    "timestamp": 1055800800
  }
]