[
  {
    "username": "masimp1",
    "rating": 1.0,
    "comment": "Just bad. Really bad. Roll dice and the winner is the highest result is more fun.",
    "timestamp": 1608418800
  },
  {
    "username": "AlexSpielrebell",
    "rating": 2.0,
    "comment": "Terrible game, broken, no fun, sold it",
    "timestamp": 1636326000
  },
  {
    "username": "jcarvin",
    "rating": 3.0,
    "comment": "Doesn't feel like you have a lot of decisions to make or much control, especially if you don't have teams and are running the race as individuals.",
    "timestamp": 1692136800
  },
  {
    "username": "tphon",
    "rating": 4.0,
    "comment": "Sold by SCG",
    "timestamp": 1709852400
  },
  {
    "username": "katzbacher",
    "rating": 5.0,
    "comment": "Does anyone have an English version of the game overview sheet (double-sided, colour) they could scan and send me? I only have the German version in the used game I just acquired.",
    "timestamp": 1543100400
  },
  {
    "username": "smic",
    "rating": 5.0,
    "comment": "I created a Solitaire Variant that makes the game more sensible, quick (10 min), and fun IMO.",
    "timestamp": 1514761200
  },
  {
    "username": "Druivenclub",
    "rating": 5.5,
    "comment": "Hans",
    "timestamp": 1693864800
  },
  {
    "username": "SeanC",
    "rating": 6.0,
    "comment": "Rating based on vague recollection...it was somewhat disappointing.",
    "timestamp": 1652911200
  },
  {
    "username": "JamesT",
    "rating": 7.0,
    "comment": "What a funky game. We played the 4-player team version, without the advanced rules. This game definitely confused a lot of people because it shipped with two rule sets.",
    "timestamp": 1732921200
  },
  {
    "username": "bwonson",
    "rating": 8.0,
    "comment": "I was expecting a bad game due to comments on BGG and from friends, but all 3 of us who played really enjoyed it. We played 2 games...the base standard version and the Advanced game (which is quite challenging). This one will get repeated plays.\n\nAnother play under the belt and again a great game. The decisions are difficult ones due to being unable to plan...but that is what makes it different and exciting to the end.",
    "timestamp": 1357426800
  },
  {
    "username": "GBookman",
    "rating": 9.0,
    "comment": "The bad opinioned reviews have indications that the reviewer did not read the correct set of the rules. I'm not slighting the reviewers because the publisher has not made it easy to enjoy this game. Read the rules booklet with the white border and read the advanced rules, which are NOT in the rule book but rather on the back of the card stock diagram of the basic game set-up. Two rules booklets and advanced rules on the back of the basic game diagram, this reminds me of programs managed by the US Federal Govt. But trust me, reading the rules a couple of times is worth it cause the game is allot of fun.",
    "timestamp": 1361401200
  },
  {
    "username": "mrraow",
    "rating": 10.0,
    "comment": "Thing about this one, you have to realise that it's a partnership game. Two other players have one of your top ships, you just have to work out who they are and play accordingly! I really can't believe this game has such a low rating; it's very tense to the end, trying to work out who is acting in your interests, and who is acting against you.",
    "timestamp": 1274306400
  }
]