[
  {
    "username": "Ponton",
    "rating": 1.0,
    "comment": "This game can be solved. That's bad.",
    "timestamp": 1243202400
  },
  {
    "username": "Clockpunk",
    "rating": 2.0,
    "comment": "Surprisingly deep farming/market simulation title.",
    "timestamp": 1455058800
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Interesting economic game. Although it was rather solitaire-ish. The main point of interaction was the market, which isn't the focus of the game though",
    "timestamp": 1734649200
  },
  {
    "username": "Sack",
    "rating": 4.0,
    "comment": "high complexity, low fun.",
    "timestamp": 1564437600
  },
  {
    "username": "nerdymove",
    "rating": 5.0,
    "comment": "2",
    "timestamp": 1350424800
  },
  {
    "username": "Aingeru",
    "rating": 4.5,
    "comment": "10/02/07->Start playing On-line...",
    "timestamp": 1290726000
  },
  {
    "username": "PfrBraun",
    "rating": 6.0,
    "comment": "Dicke Kartoffeln (Doris Matthäus / Frank Matthäus) – oder: Wo Reiner Knizia die Würmer fürs Bratwurmeck fand. Trotz seines geruhsamen Äußeren enthält die Schachtel ein straff designtes Wirtschaftsspiel. Kartoffelwachstum und Komposthaufenwürmerzucht sind dabei thematisch nicht nur Beiwerk, sondern Dreh- und Angelpunkt der ökonomischen Planungen. Wesentlich besser als in Schoko & Co. gelingt es dabei hier, den Kartoffelabsatzmarkt zu manipulieren. Und wer schon mal mit einem Riesenverkauf den Preis in den Keller getrieben hat, wo andere nur ein paar Sack auf dem Marktkarren hatten und das Invest nur knapp wieder reinholen, der weiß wie süß es ist, die Gegner am Boden zu halten. Nun macht Dicke Kartoffeln auch mindestens die Hälfte der Spielzeit großen Spaß. Wo das Geld knapp ist und die Kalkulation noch stimmen muss, da wird mal schnell der Boden gedüngt und damit ruiniert. Da werden die Biokartoffeln Typ „Biola“ in nur homöopathischen Dosen geernet, um nur ja ein Feld ökologisch werthaltig zu lassen. Da wird die Würmeraufzucht auf das gerade noch erträgliche Maximum gefahren. Und da nun liegt der Hase im Pfeffer! Die Würmer sind finanziell so wirkmächtig, dass schon in Runde zwei oder drei durch Wurmverkauf die Barschaft soweit gesichert ist, dass anschließend auf Masse produzierte konventionelle Ware auch bei billigstem Preisniveau lohnt. Wer dann über die volle Rundenzahl von sechs Runden spielt, sollte auch die ruinierten Böden am Ende wieder auf Ökoniveau haben. Damit ist „Dicke Kartoffeln“ eines der frühesten Spiele, die zu entdecken sich lohnen, die aber dann in dem durch das Spiel selbst simulierten Kapitalismus dem Gesetz neuer Ware zum Opfer fallen. Und wer Würmer mag, möge ans Bratwurmeck gehen.",
    "timestamp": 1624312800
  },
  {
    "username": "hiyou",
    "rating": 6.0,
    "comment": "作物を作って売る。どのくらい作るかで相場が変動。儲けを出そう。ゲームエンジンは社長の決断その類なんだけど、個人ボードや勝利点の概念等ドイツゲームの萌芽と言える。楽しさもあり考えどころも多すぎず少なすぎず。89年かぁ。凄い。",
    "timestamp": 1584658800
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "Dicke Kartoffeln is a spreadsheet game about potato farming. Yes, the theme is rather dry. But, I like it. A few rough edges, but I still want to play more. Boy, are the events rough!\n\nOLD SCHOOL COLLECTION",
    "timestamp": 1730761200
  },
  {
    "username": "HerbertML",
    "rating": 7.8,
    "comment": "/*#W6*//*stay*/",
    "timestamp": 1677970800
  },
  {
    "username": "amwiles",
    "rating": 10.0,
    "comment": "Can it get any better than organic potato farming? I don't think so. Why is the BGG rating only 5.71? Clearly, the right people haven't played this game yet.",
    "timestamp": 1195686000
  }
]