[
  {
    "username": "ETHANVAN",
    "rating": 1.0,
    "comment": "Another game that whoever is the best at arguing their word is real ends up being the winner. I was never a good English student.",
    "timestamp": 1730588400
  },
  {
    "username": "slkg",
    "rating": 1.0,
    "comment": "Wow did we hate this game! Boring, few decisions, kept having no options and waiting for other folks to win. Was the favourite game of one of the other people. I don't know why!",
    "timestamp": 1730588400
  },
  {
    "username": "RodimusPrime",
    "rating": 1.0,
    "comment": "I bounced off of this game because the rules and the scoring are boring.",
    "timestamp": 1674428400
  },
  {
    "username": "HeavyAdge",
    "rating": 1.0,
    "comment": "Worst game iv'e ever played rewards 2 letter words and seemingly goes on forever.",
    "timestamp": 1543964400
  },
  {
    "username": "LindseyJ",
    "rating": 1.0,
    "comment": "Not as enjoyable as I thought it would be.",
    "timestamp": 1388530800
  },
  {
    "username": "Tom Wright",
    "rating": 1.0,
    "comment": "This game was pretty miserable.",
    "timestamp": 1337464800
  },
  {
    "username": "TheLarynx",
    "rating": 1.0,
    "comment": "I can't say that this game 'spells fun' for me; we never played long enough to get to that word. Boredom set in too quickly.",
    "timestamp": 1326322800
  },
  {
    "username": "jenpatankar",
    "rating": 1.0,
    "comment": "The design of this game is awful. Game play is irritating.",
    "timestamp": 1303336800
  },
  {
    "username": "Boarass",
    "rating": 1.0,
    "comment": "Extremely monotonous and stupid. The outcome of the game depends 90% on card draw and 10% on actual word hunting skill. Want a word game? Play Scrabble. Play Boggle. Avoid this.",
    "timestamp": 1275256800
  },
  {
    "username": "curtc",
    "rating": 2.0,
    "comment": "I’m not a fan of word games in general, and this is one of the worst. No player interaction.",
    "timestamp": 1758578400
  },
  {
    "username": "weasel",
    "rating": 2.0,
    "comment": "A little too basic for me",
    "timestamp": 1739660400
  },
  {
    "username": "disposable.superhero",
    "rating": 2.0,
    "comment": "Just bad. It was boring and painful to finish.",
    "timestamp": 1667080800
  },
  {
    "username": "paxxlaws",
    "rating": 2.0,
    "comment": "Components in new condition. Played only once.",
    "timestamp": 1580857200
  },
  {
    "username": "Legomancer",
    "rating": 2.0,
    "comment": "Dull.",
    "timestamp": 1520290800
  },
  {
    "username": "dpbernath",
    "rating": 2.0,
    "comment": "I typically like word games, but this didn't work for me",
    "timestamp": 1482534000
  },
  {
    "username": "ChooChoooo",
    "rating": 2.0,
    "comment": "I'm not even sure why I still own this.",
    "timestamp": 1470607200
  },
  {
    "username": "n2NZnXG",
    "rating": 2.0,
    "comment": "Played this at CABS, but won't play it again. If I want to play a word game combining letters to make words, I'll play Letter Roll. My favorite word game is Word Blur. Other word games I like are AmuseAmaze, Word Winder, and Bananagrams. Montage is a unique and interesting word game for 4 players on 2 teams. And although I'd rather play the aforementioned games than BuyWord, Word on the Street, or What's My Word?, all the latter games are better games than Quiddler. I'd rather play plain old Boggle than Quiddler.",
    "timestamp": 1465509600
  },
  {
    "username": "riverc0il",
    "rating": 2.0,
    "comment": "Deluxe (tin) version including short word dictionary, like new, only played twice. English language from a smoke free home.",
    "timestamp": 1462140000
  },
  {
    "username": "Mister_Zombie",
    "rating": 3.0,
    "comment": "I only play Quiddler because it is something my parents can play. We've adapted the rules to encourage somewhat longer words. But still yet another word game where you win by using silly short words nobody ever would use in the real world. There are better word games out there.",
    "timestamp": 1754690400
  },
  {
    "username": "elijah234",
    "rating": 3.0,
    "comment": "Either you get vowels in the draw or eat lots of negative points.",
    "timestamp": 1742425200
  },
  {
    "username": "Pandorzecza",
    "rating": 2.5,
    "comment": "Word creation",
    "timestamp": 1629237600
  },
  {
    "username": "Scottyglc",
    "rating": 2.5,
    "comment": "Bought new from GW. Not the biggest fan of word games. Took too long to play with my family as everyone takes forever to figure out what to play. Donating back to Goodwill.",
    "timestamp": 1606777200
  },
  {
    "username": "nooblysauce",
    "rating": 3.0,
    "comment": "Word game that kind of ends up playing like phase 10, where each round you get more cards and have to make more words. Is usually fun to start, but gets slower at the end. Make sure you're playing with word lovers first.",
    "timestamp": 1546470000
  },
  {
    "username": "Gershwin27",
    "rating": 2.9,
    "comment": "I've played many times, but I've learned that I do not like spelling games. I don't think I'll play it ever again.",
    "timestamp": 1510182000
  },
  {
    "username": "elbrycko",
    "rating": 3.0,
    "comment": "Seems far too random. Someone will inevitably draw well enough to go out immediately and then someone gets screwed because they have no/all vowels.",
    "timestamp": 1496181600
  },
  {
    "username": "ZeeGarcia",
    "rating": 3.0,
    "comment": "As far as word games go (which are not my faves), I like this one well enough. It's a little long, but that's easily fixed by not playing all the suggested rounds.",
    "timestamp": 1473631200
  },
  {
    "username": "theledger",
    "rating": 3.0,
    "comment": "This game will crash and burn so hard and so loudly, that you may be legally liable for causing every player in your group to contract tinnitus.\n\nAlways wary of any game that requires a dictionary on stand by - all of your darkest fears will be fully realized by game's end - but it has little to do with your Merriam-Webster. Quiddler quickly devolves into a 2-3 letter word slog fest and mercifully ends just before your blood pressure reaches it's boiling point.\n\nIf you insist on having fun with words - read a book of dirty limericks instead.",
    "timestamp": 1441576800
  },
  {
    "username": "OthelloKeys",
    "rating": 4.0,
    "comment": "Scrabble meets gin rummy.",
    "timestamp": 1728424800
  },
  {
    "username": "KuddlyKisses",
    "rating": 4.0,
    "comment": "My senior mother likes it. I'll play it to spend some time with her.",
    "timestamp": 1703890800
  },
  {
    "username": "rynelf",
    "rating": 4.0,
    "comment": "--Mar2007-- Not terribly compelling little word-building game. I'd much rather play My Word! or Boggle (which are mercifully fast) or even sit down to a serious slog at Scrabble. It's pretty, though.",
    "timestamp": 1680559200
  },
  {
    "username": "hammerfest451",
    "rating": 4.0,
    "comment": "Replaced by Hardback. Donated.",
    "timestamp": 1668985200
  },
  {
    "username": "antiussentiment",
    "rating": 4.0,
    "comment": "I feel being able to play many short words make the final hands a bit swingy? If someone gets a pile of vowels and another gets only consonants, going out on your first turn will leave the consonant player high and dry.",
    "timestamp": 1660341600
  },
  {
    "username": "halohogg",
    "rating": 4.0,
    "comment": "Tedious.",
    "timestamp": 1659650400
  },
  {
    "username": "qwertymartin",
    "rating": 4.0,
    "comment": "Poor word game. Converted it into a Bali set, as it has almost the same letter distribution.",
    "timestamp": 1658700000
  },
  {
    "username": "jeffeff",
    "rating": 4.0,
    "comment": "Small",
    "timestamp": 1646089200
  },
  {
    "username": "Sir Pent",
    "rating": 4.0,
    "comment": "I'm not typically a fan of \"word games\", but this one is actually pretty fun. It's also easily transportable. But the person with a better vocabulary will always have a huge advantage in these types of games.",
    "timestamp": 1639609200
  },
  {
    "username": "visard",
    "rating": 5.0,
    "comment": "Form words from letter cards. If you can go out other players have one more turn.",
    "timestamp": 1757973600
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "Across 8 rounds (3-10 cards each round), players are going to take a card and play cards or pass. Players can go out if they play a card and discard a card resulting in no cards in their hand. The other player has one final turn and points are calculated, with +10 for longest word and +10 for the most words to end the round. The player that scores the most points wins.",
    "timestamp": 1740265200
  },
  {
    "username": "Epochend",
    "rating": 5.0,
    "comment": "Not bad; but as with most games of this type, there's not much you can do if you draw a bunch of useless letters, especially since you normally only get to draw 1 or 2 new cards before the rounds end.",
    "timestamp": 1739401200
  },
  {
    "username": "magicfreak39178",
    "rating": 5.0,
    "comment": "Played it a while ago, it was fine.",
    "timestamp": 1727992800
  },
  {
    "username": "phunlvr",
    "rating": 5.0,
    "comment": "Good idea; Mix of Rummy & Scrabble. Lazy implementation ruins it; Just pure luck",
    "timestamp": 1724277600
  },
  {
    "username": "bdcroom",
    "rating": 5.0,
    "comment": "Word Games.. meh overall as a category for me.",
    "timestamp": 1717020000
  },
  {
    "username": "Dessyreqt",
    "rating": 5.0,
    "comment": "Best at: 4 - Plays: 2-6",
    "timestamp": 1712613600
  },
  {
    "username": "Justin_Oke",
    "rating": 5.0,
    "comment": "We only played it a few times a long time ago and then forgot about it. I need to get it out again and try it with the kids",
    "timestamp": 1708988400
  },
  {
    "username": "Peterping",
    "rating": 5.0,
    "comment": "You need to modify the rules yourself to enjoy it - start with 5 or 6 cards each as lower numbers are a boring lottery. Also, the rules are badly explained but once you work them out it is quite good.",
    "timestamp": 1703113200
  },
  {
    "username": "BoomDooger",
    "rating": 4.5,
    "comment": "Chels: 5\nAnt: 4\n\nSold at Garage Sale 11/5/23",
    "timestamp": 1699138800
  },
  {
    "username": "RaffertyA",
    "rating": 5.0,
    "comment": "One 3-player game. Five Crowns with the alphabet (same designer). Some interesting play but:\n1) Likely to get, at most, 2 card draws.\n2) A game of small words, 6 cards were unusual.\n3) Cannot be played across generations or 'education' disparities.\n4) Can really drag as a lot of mental effort (i.e. time) can be spent to avoid negative points (which can mostly be avoided or significantly minimized).\n\nFinal 3-player scores were 251, 231, 217. 4-player 242, 236, 214, 209.\n\nNote: Person teaching the game overlooked the 'Bonus' points.",
    "timestamp": 1697839200
  },
  {
    "username": "ACForward",
    "rating": 5.0,
    "comment": "Fun little word-building game. The main issue with it is how slow turns can get in the later rounds as options increase. Also, multiple players vying for the same dictionary can be problematic, leading to imbalances in the number of (known) available words.",
    "timestamp": 1692828000
  },
  {
    "username": "laytox",
    "rating": 5.0,
    "comment": "Not super fond of word games but got as a Christmas present so I kept it. Fun enough filler I guess",
    "timestamp": 1690927200
  },
  {
    "username": "Herokid",
    "rating": 5.0,
    "comment": "Worse scrabble",
    "timestamp": 1690581600
  },
  {
    "username": "Mangosteen",
    "rating": 5.0,
    "comment": "I generally like word games. One innovation about this one is that some cards have a two-letter combination. But it's just too easy to make a combination of words from any hand of cards within one or two turns. Basically the only time I can't do it is if I don't have any vowels or any consonants. That is frustration rather than challenge. Verdict: too easy to be much fun.",
    "timestamp": 1686002400
  },
  {
    "username": "GaryP",
    "rating": 5.0,
    "comment": "The idea of the game is great, and I like the letter art. However, most phases end in the first round. I need a variant that makes it last just a bit longer.",
    "timestamp": 1684879200
  },
  {
    "username": "TMacfarlane26",
    "rating": 5.0,
    "comment": "Not a huge fan of word games. This one is just okay. People who love Scrabble type games will enjoy this one.",
    "timestamp": 1684706400
  },
  {
    "username": "Greenosaur",
    "rating": 5.0,
    "comment": "Decent game. Good for party's.",
    "timestamp": 1682373600
  },
  {
    "username": "Beefy79",
    "rating": 6.0,
    "comment": "Sister Owns",
    "timestamp": 1758146400
  },
  {
    "username": "Teppolainen",
    "rating": 6.0,
    "comment": "A word game in the vein of Scrabble cards and similar - but it has 2-letter syllables as well as single letters, making it a bit more interesting than usual. The end-of-round mechanic is sudden death, triggered by the first player wanting to go out, which makes this enjoyably fast to play too.",
    "timestamp": 1757973600
  },
  {
    "username": "PhantomGamer",
    "rating": 6.0,
    "comment": "Solid game combining word-building and a rummy mechanic. Getting deal the right combination of cards can definitely swing the odds in your favor, and it’s easy to take negative points for the hand.",
    "timestamp": 1751061600
  },
  {
    "username": "Hoodie_Wearing_Idiot",
    "rating": 6.0,
    "comment": "A simple but solid word game. Much better than Scrabble, at least.",
    "timestamp": 1748901600
  },
  {
    "username": "Zaytor",
    "rating": 6.0,
    "comment": "A nice, light game used as a filler between other games. I really enjoy word games and this one is quite unique.\n\nWith the right people, this one is very fun.\n\n[Updated review from 2015]",
    "timestamp": 1748469600
  },
  {
    "username": "Stacey219",
    "rating": 6.0,
    "comment": "I enjoyed it while I played it, but haven't gotten it back out again.",
    "timestamp": 1745791200
  },
  {
    "username": "I_made_a_username",
    "rating": 6.0,
    "comment": "Pros: simple gameplay, easy to teach, games do not go on too long.\n\nCons: not the most deeply riveting game because it chose to focus on a key gameplay mechanism that is not distracted or added onto with other mechanisms or theme.",
    "timestamp": 1739660400
  },
  {
    "username": "RandomStrategy",
    "rating": 6.0,
    "comment": "This game is okay, and I know some friends who really enjoy it; but I have played other word games that I like much better. So, for me, it's just meh.",
    "timestamp": 1736895600
  },
  {
    "username": "xerossilence",
    "rating": 6.2,
    "comment": "This is a great family/social style game, and a new favorite of my wife's. Mechanically it's mostly just Gin Rummy, but with letters or letter strings forming words instead of playing cards forming hands. Words start small in the first round (three cards), and increase each round up to ten cards at the end of the game. There are some fun bonuses (most words in a round, longest word in a round) that might convince you to hold out for just the right letter to get you to longest word, which can be fun. You also can't end the round unless you are using all of your cards, which forces people to figure out how to use them all as fast as possible. These different factors pull you in multiple directions, making for an entertaining game.\n\nThe cards look great as well. The letters have a fun style to them.\n[card game - rummy]",
    "timestamp": 1730502000
  },
  {
    "username": "K_Town",
    "rating": 5.9,
    "comment": "Unlike Phase 10, I DO have fond memories playing this... even if the game itself is mediocre at best. It's essentially Rummy with letters",
    "timestamp": 1726783200
  },
  {
    "username": "Rervin1001",
    "rating": 6.0,
    "comment": "I originally played this in an FLGS with a friend and enjoyed it quite a bit. Its a faster word game that I can play when i dont have time for some of the longer ones.",
    "timestamp": 1724536800
  },
  {
    "username": "semicharm",
    "rating": 6.2,
    "comment": "Good condition",
    "timestamp": 1723327200
  },
  {
    "username": "tycham85",
    "rating": 6.0,
    "comment": "super easy game to learn and play, and decently fun. the mechanic is scrabble meets rummy, where you form words with cards from your hand, and lay down all at once, totaling the point value of each letter.\n\n*photokeeper",
    "timestamp": 1723154400
  },
  {
    "username": "AJSGeek",
    "rating": 6.0,
    "comment": "A fun word game that plays very similar to Five Crowns. All kinds of hilarity can be had depend on how dirty your mind is LOL",
    "timestamp": 1718834400
  },
  {
    "username": "Brother Abe",
    "rating": 6.0,
    "comment": "Maria’s pre 2015",
    "timestamp": 1712440800
  },
  {
    "username": "tedacuen",
    "rating": 6.0,
    "comment": "Quiddler es un juego de cartas cuyo objetivo es formar palabras. Cada carta tiene una letra y valor de puntos. Las cartas usadas para formar palabras te dan puntos positivos, y la que te queden en la mano te restan puntos.",
    "timestamp": 1704495600
  },
  {
    "username": "TheLordWinter",
    "rating": 6.0,
    "comment": "Create words from an ever-increasing number of letter cards in their hand.",
    "timestamp": 1704063600
  },
  {
    "username": "elrhays84",
    "rating": 6.0,
    "comment": "A fun word game I'd like to play more.",
    "timestamp": 1700434800
  },
  {
    "username": "KoolerAidMan",
    "rating": 7.0,
    "comment": "1 - 8 players.\nBest: 2 - 6 players.\n\nCard game. Tiny game.\n\nDo not sleeve. Sleeves will not fit in tray.",
    "timestamp": 1756504800
  },
  {
    "username": "StewartTame",
    "rating": 7.0,
    "comment": "Excellent word game! Less frustrating than Scrabble.",
    "timestamp": 1755295200
  },
  {
    "username": "hertsjoatmon",
    "rating": 6.8,
    "comment": "My partner loves word games and we think this one may be our main go to. It’s simple enough to teach to anyone and it mainly about the words rather than secondary scoring objectives. Most of the time we only do bonuses for longest word rather than most words.",
    "timestamp": 1749852000
  },
  {
    "username": "ryanjohnpeterson",
    "rating": 7.0,
    "comment": "Simple, fun, fast game. Easy to teach and takes little time.",
    "timestamp": 1748988000
  },
  {
    "username": "PerpetualRevision",
    "rating": 7.0,
    "comment": "1-8 players.",
    "timestamp": 1748124000
  },
  {
    "username": "ScottHuddleston",
    "rating": 7.0,
    "comment": "6",
    "timestamp": 1747432800
  },
  {
    "username": "Zappa68",
    "rating": 7.0,
    "comment": "fun word building game. feels like the letter mix is a little off",
    "timestamp": 1739055600
  },
  {
    "username": "Tolkienfan3324",
    "rating": 7.0,
    "comment": "Card Game",
    "timestamp": 1737673200
  },
  {
    "username": "JayJayGee",
    "rating": 7.0,
    "comment": "Picked this one up for $2 and that was a good investment! Fast, easy, and good for the \"little gray cells.\" Thumbs definitely up.",
    "timestamp": 1737327600
  },
  {
    "username": "alexanderbanning",
    "rating": 7.5,
    "comment": "FAMILY\n\nA card-based Scrabble-like word game that plays quickly. A good lunch time selection.\n\nRecommended with 2-6 players (best 4). 30 mins.",
    "timestamp": 1755122400
  },
  {
    "username": "big_booboo",
    "rating": 8.0,
    "comment": "Was fun at first, until it became a game of pass-the-dictionary. Rating is for the game with the house rule that dictionaries are only allowed when a word is challenged.",
    "timestamp": 1752789600
  },
  {
    "username": "Lbrereton",
    "rating": 7.5,
    "comment": "simple fast and fun.",
    "timestamp": 1750716000
  },
  {
    "username": "cubntin",
    "rating": 8.0,
    "comment": "1-8 players",
    "timestamp": 1743372000
  },
  {
    "username": "invervegas",
    "rating": 7.5,
    "comment": "Complexity √",
    "timestamp": 1733698800
  },
  {
    "username": "WolfSoul121",
    "rating": 8.0,
    "comment": "1-8 players",
    "timestamp": 1721858400
  },
  {
    "username": "Onthewayover",
    "rating": 7.5,
    "comment": "A good, cheap, portable word game that has a solo mode. My grandma first introduced me to it, It's most fun when you're not too competitive about it.",
    "timestamp": 1719180000
  },
  {
    "username": "montsegur",
    "rating": 7.5,
    "comment": "RUMMY with letter cards . Draw a card, build word(s) , discard one card. That s it but in first round you start with 3 cards up to 10 cards in the last (8th) round. That makes it easy to get in",
    "timestamp": 1718575200
  },
  {
    "username": "rabesandratana",
    "rating": 8.0,
    "comment": "i like it more than Paperback. Simpler rules and quicker",
    "timestamp": 1712959200
  },
  {
    "username": "Hunter_P",
    "rating": 8.5,
    "comment": "A family favorite of mine; the game is easy to understand but the quality of your games increase the more expansive your vocabulary is. Still, the game is accessible to even the youngest of players able to read and parse letters into words; making it an all-ages kitchen table game for you and your friends.\n\nAn excellent alternative way to play a word spelling game; and my favorite one of its kind.",
    "timestamp": 1757282400
  },
  {
    "username": "Lordjames01",
    "rating": 9.0,
    "comment": "Our version is Quiddler - English edition 2014",
    "timestamp": 1750543200
  },
  {
    "username": "Knucklebone",
    "rating": 9.0,
    "comment": "A fun word game. Could only play it once in a night because of the amount of rounds, despite its small size.",
    "timestamp": 1739919600
  },
  {
    "username": "James_Dond",
    "rating": 9.0,
    "comment": "This is the best card like game to compare to scrabble. Your deal starts with 3 cards. Then goes up by 1 card each deal and you also need the dictionary that goes with this game separately. That is how you get the most fun and learning new words or meanings at the same time.",
    "timestamp": 1715292000
  },
  {
    "username": "Niara7",
    "rating": 9.0,
    "comment": "If someone could tell me how to turn this into an educational game (for myself), I'd rate it even higher. I'd like to learn new words, rather than just be tested on ones I already know.\n\nHere's my idea for a variant: At the beginning of the game, each player chooses a set number of unfamiliar words from the dictionary (suggest between 3-5). If that player successfully plays one of their words during a round, they receive 10 bonus points.",
    "timestamp": 1707087600
  },
  {
    "username": "hkproc",
    "rating": 9.0,
    "comment": "2023- #27 Top 50\n2022- #34 Top 50\n2021- #23 Top 50\n\n6/2022- Update: Quiddler is not strategic AT ALL; rather, the joy of the game comes from simply reacting to the cards you have and trying to make the best of the hand you were dealt. It's breezy fun for word nerds! The solo mode is also fantastic-- like patience solitaire but with letters.\n\n6/2021- Even though my mom usually beats me, I enjoy a good game of Quiddler. The tension ratchets up the larger your hand of cards gets, and it's always nail-biting to see who will go out first!",
    "timestamp": 1703458800
  },
  {
    "username": "goethean",
    "rating": 8.8,
    "comment": "Learn the name of Vietnamese currency! (Xu.)\nLearn the term for a South American three-toed sloth! (Ai.)\nLearn the 14th letter of the Greek alphabet! (Xi.)",
    "timestamp": 1675638000
  },
  {
    "username": "SnakesEvan",
    "rating": 9.0,
    "comment": "Great game, one of my families go to games. Their is a level of enjoyment of trying to make all the letters work for you, and that level of problem solving. Sometimes you just don't get the cards though and that is fine. My only downside is my family fights a lot on what words are \"legal\" playing words",
    "timestamp": 1663711200
  },
  {
    "username": "ChrisLaning",
    "rating": 9.0,
    "comment": "Has the highest ratio of \"boxes to houses\" of my extended family with a little over 1/1",
    "timestamp": 1640905200
  },
  {
    "username": "theCartoonMrOats",
    "rating": 10.0,
    "comment": "a terrific card game. it's saving our marriage, haha.",
    "timestamp": 1755381600
  },
  {
    "username": "TessalinaMessalina",
    "rating": 10.0,
    "comment": "My favorite board or card game, which I describe to potential players as Scrabble-adjacent, but more fun.",
    "timestamp": 1727215200
  },
  {
    "username": "RonCarlson01",
    "rating": 10.0,
    "comment": "S019\n\nNIS",
    "timestamp": 1705791600
  },
  {
    "username": "boneroller",
    "rating": 10.0,
    "comment": "I found the right group for this game; might not be so high with a different mixture of people.\nPicked up a second copy. Picked up a third set.",
    "timestamp": 1701644400
  },
  {
    "username": "KittenKindness",
    "rating": 10.0,
    "comment": "It's a great game and very easy to introduce non-board game playing people to!",
    "timestamp": 1700089200
  },
  {
    "username": "IAmSuperGrover",
    "rating": 10.0,
    "comment": "One of my top all time favorites. Is always a safe and fun choice when introducing non-gamers.",
    "timestamp": 1657317600
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "used",
    "timestamp": 1645311600
  },
  {
    "username": "TheLoveBunnies",
    "rating": 9.5,
    "comment": "Introduced to this by some friends in China. We'll be forever thankful to them. The playability different numbers and ages of people is excellent.",
    "timestamp": 1644793200
  },
  {
    "username": "grahamcourt",
    "rating": 10.0,
    "comment": "Great family game, been playing for years Now on sixth pack. Others got worn out!",
    "timestamp": 1624140000
  }
]