[
  {
    "username": "TheNewblar",
    "rating": 1.0,
    "comment": "The new AllPlay version is garbage. Game doesn't fit in it's own box. Cheap plastic trash. Never buy AllPlay games.",
    "timestamp": 1719180000
  },
  {
    "username": "l111",
    "rating": 1.0,
    "comment": "CLOSET",
    "timestamp": 1613602800
  },
  {
    "username": "weasel",
    "rating": 1.0,
    "comment": "This one's unplayable for me -- I'm red/green color-blind and it's almost impossible to tell many of the colors apart. Ugh. Otherwise looks like a great game...",
    "timestamp": 1261522800
  },
  {
    "username": "Uriens",
    "rating": 1.0,
    "comment": "a math exam...",
    "timestamp": 1099436400
  },
  {
    "username": "Nye27",
    "rating": 2.0,
    "comment": "a rubbish version of go, will not play again.",
    "timestamp": 1710025200
  },
  {
    "username": "GoodGameGeek",
    "rating": 2.0,
    "comment": "mathsoc",
    "timestamp": 1514588400
  },
  {
    "username": "amish_rabbi",
    "rating": 2.0,
    "comment": "colours are terrible for me, can't tell them apart at all",
    "timestamp": 1501624800
  },
  {
    "username": "aquillo",
    "rating": 2.0,
    "comment": "Camels that looked like candy, but eating would have been more fun than playing",
    "timestamp": 1446678000
  },
  {
    "username": "Freshcactus",
    "rating": 3.0,
    "comment": "2-4",
    "timestamp": 1747951200
  },
  {
    "username": "snth",
    "rating": 3.0,
    "comment": "A game that I think is bad.\n\nPrefer: Blue Lagoon, Blooms, Hey That's My Fish, Meridians, Babylonia, Havalandi, *Star, Hacienda, Rebirth.\n\nReplaces: Samurai",
    "timestamp": 1725314400
  },
  {
    "username": "Jmarkmoss",
    "rating": 3.0,
    "comment": "Not too sure about this one. Didnt enjoy play at 2. Felt very predictable. Maybe we missed something but the rules seemed light enough to have not glossed anything over.\n\nSold in 2023 12/18/23\n\nStill haven't figured out the hype on this one 02/05/2024",
    "timestamp": 1707087600
  },
  {
    "username": "Kester",
    "rating": 3.0,
    "comment": "This just bored me to tears. I can't see wanting to play it again.",
    "timestamp": 1695852000
  },
  {
    "username": "ab4523",
    "rating": 4.0,
    "comment": "I'm sure this was a ground breaking design at the time but I'd always choose Kingdom Builder: the different scoring criteria and powers you can unlock give replayability, without adding extra time or complexity. I won the game I played but grabbing points from oases didn't feel satisfying.",
    "timestamp": 1760824800
  },
  {
    "username": "Bagherra",
    "rating": 4.0,
    "comment": "Feels a lot like Cathedral meets twixt. A satisfying game that does not take very long to play at all.",
    "timestamp": 1748642400
  },
  {
    "username": "NsYooN",
    "rating": 4.0,
    "comment": "Easy to teach, strategic euro",
    "timestamp": 1676415600
  },
  {
    "username": "Chuggas",
    "rating": 4.0,
    "comment": "Decent game, I think it needs something more to make it interesting.",
    "timestamp": 1671836400
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "including the Bazaar expansion\n\nAnother Knizia classic of just placing two camels on your turn. But the game is difficult by forcing you to choose between several many priorities. It's a game where you can only do 2 but you want to do 5.\n\nSo far, I prefer this over Samurai and Blue Lagoon.",
    "timestamp": 1760306400
  },
  {
    "username": "shawnmackay1593",
    "rating": 5.0,
    "comment": "It's a decent design but, like so many of Knizia's other games, just falls flat for me. The colours in the version I played were also very difficult to tell apart.",
    "timestamp": 1758664800
  },
  {
    "username": "Jackieh9",
    "rating": 5.0,
    "comment": "Reminds me of Babylonia but quicker. Learned at Awesome Con 2025",
    "timestamp": 1743804000
  },
  {
    "username": "toadles",
    "rating": 5.0,
    "comment": "I should try this again. My first few plays made me thinking it was tad too dry (even for my dry taste).",
    "timestamp": 1742338800
  },
  {
    "username": "dosxtres",
    "rating": 5.0,
    "comment": "+",
    "timestamp": 1741906800
  },
  {
    "username": "OregSamm",
    "rating": 5.0,
    "comment": "4,0 / 5,0",
    "timestamp": 1738018800
  },
  {
    "username": "BigM23",
    "rating": 5.0,
    "comment": "Haacki",
    "timestamp": 1737327600
  },
  {
    "username": "pvtparts",
    "rating": 5.0,
    "comment": "OK game, nothing special. The front loading of decisions when placing leaders is something I tend not to enjoy in games. Then the jockeying for space on the board felt too sterile and uneventful, plodding even.",
    "timestamp": 1727647200
  },
  {
    "username": "Dasoogle",
    "rating": 6.0,
    "comment": "I appreciate how simple and fast it is. It is satisfying to place camels. Two camels per turn just feels right for some dumb shenanigans. The initial leader placements is incredibly decisive for the outcome of the game. It's decent and clever. The scoring is a little boring, and it won't be staying in my collection.",
    "timestamp": 1760306400
  },
  {
    "username": "iplaybgnaked",
    "rating": 6.0,
    "comment": "Classic abstract-like \"tile\" laying game by Knizia, it's the perfect balance between an abstract strategy game and a family weight route building for VP euro that makes it an enjoyable experience to play with just about anybody. The game scales pretty well at all player counts, I do prefer it lower counts to really emphasize the abstract strategy nature of the game as opposed to the player driven chaos of the higher player counts but it's still nonetheless enjoyable at 5p. While the gameplay remains as excellent as it was when it first came out, the Allplay edition isn't great: the box is obnoxiously small making it impossible to fit it all back in it and lacks any room to use any kind of storage solution, it lacks any score pad to make tallying the points easier, and the color contrast between the pieces isn't sharp enough which hurts the legibility of the board towards the end of the game; however it's not bad enough to get me to seek out an OOP edition as it otherwise doesn't negatively affect the deeply compelling gameplay.\nStill a great game, but the competition from other Knizia tile laying games is too strong that I have a hard time justifying playing this one over those.",
    "timestamp": 1759010400
  },
  {
    "username": "iadena",
    "rating": 6.0,
    "comment": "Trying to connect your camels to make the longest route while blocking your opponents.",
    "timestamp": 1755554400
  },
  {
    "username": "drphilphil",
    "rating": 6.0,
    "comment": "The game is fine but the newest edition has potentially the ugliest plastic pieces I have ever seen. The camels with the differently coloured guys on top look horrendous. Also, this is a nightmare game for colourblind people.",
    "timestamp": 1755295200
  },
  {
    "username": "progresscity",
    "rating": 6.0,
    "comment": "A good quick family-friendly game. Easy to pick up, not too heavy, but enough strategy to not be boring. Says 45 minutes on the box but was only 30 min for our play as a 3-player group of new players.",
    "timestamp": 1754863200
  },
  {
    "username": "adamolanna",
    "rating": 6.0,
    "comment": "avevo l'app su iPad non il gioco in scatola",
    "timestamp": 1754776800
  },
  {
    "username": "gutrie_es",
    "rating": 6.0,
    "comment": "A través del desierto, alias: Ojo, que los camellos no son gominolas. Es un juego algo sobrevalorado, pero es que está muy bien diseñado y fluye tan rápido, y es que uno va a por los puntos como loco antes de que se los quiten.\n\nEl juego es muy familiar y asequible, las decisiones son muy ligeras, pero se genera mucha tensión en este abstracto disfrazado lleno de camellos color pastel.",
    "timestamp": 1754172000
  },
  {
    "username": "darthmoeder",
    "rating": 6.0,
    "comment": "Okay for some, too cutthroat and abstract for us.",
    "timestamp": 1753740000
  },
  {
    "username": "Technarius",
    "rating": 6.5,
    "comment": "Note to myself based on reading the rules and on online reviews. I didn't play the game, so please don't consider it as a review , recommendation or rating.\n\nPros:\n+ Typical R. Knizia tile laying game with it's own twists and unique mechanics\n+ No Luck elements at all\n\nCons:\n- Very difficult to visually recognize your own camels on the board, very busy board\n- A little bit to simple for regular players\n\nVerdict: This game doesn't have any frustrating problems, but IMHO this game gives us way less fun in comparison to Babylonia, Samurai and Terra Nova (2006)... So it will leave my collection. For beginners and casual players or for families it's a pretty good game though!",
    "timestamp": 1760565600
  },
  {
    "username": "Mate_B",
    "rating": 7.0,
    "comment": "just bought not played yet",
    "timestamp": 1760392800
  },
  {
    "username": "MissP1ggy",
    "rating": 7.0,
    "comment": "I was curious for this game for years, so I am very happy there is a reprint. I am a fan of Blue Lagoon, and this game is very similar, but different enough to own both. Liked my first play a lot!",
    "timestamp": 1759615200
  },
  {
    "username": "fabulani",
    "rating": 7.0,
    "comment": "The box should be much bigger than it is. It's waaaay too packed, it never closes properly. Also, 15 baggies to organize all the pieces... This game basically demands an insert. Setup and teardown is annoying.",
    "timestamp": 1759615200
  },
  {
    "username": "Ray144",
    "rating": 8.0,
    "comment": "MISSING:\n- one red rider\n\nNOTE:\n- coin capsules on tokens",
    "timestamp": 1760911200
  },
  {
    "username": "SkySkySkitty",
    "rating": 8.0,
    "comment": "Very cute theme for what is secretly a Go-inspired abstract. No frills, no luck, just a lot of tension between securing points for yourself and trying to block your opponents from securing huge sections of the board or building very long trains of camels. Definitely best at 2 players, any more and a one person usually just ends up sneaking away with victory while the others compete for space with eachother.",
    "timestamp": 1760824800
  },
  {
    "username": "kadenza",
    "rating": 7.5,
    "comment": "Can be difficult for the colour blind",
    "timestamp": 1760738400
  },
  {
    "username": "dragonchilde21",
    "rating": 8.0,
    "comment": "This was beautiful and think-y. I'd really like to play it again. Maybe own it.",
    "timestamp": 1760565600
  },
  {
    "username": "PoisonJamUK",
    "rating": 8.6,
    "comment": "Such a pure and enjoyable game for me.\n\nI had played Rebirth before I finally got to play this. I love both, but I prefer the much smaller size (and price!) of the mid2020s reprint of Through the Desert.\n\nI also enjoy Blue Lagoon and Babylonia, but this one's the winner for me.",
    "timestamp": 1761006180
  },
  {
    "username": "Euroman",
    "rating": 9.0,
    "comment": "Love this game! And it scales well for 2 to 5 players.",
    "timestamp": 1760738400
  },
  {
    "username": "LKS02",
    "rating": 8.5,
    "comment": "We love the simplicity and the fast-paced gameplay. The pal colored camels themselves are also adorable",
    "timestamp": 1760652000
  },
  {
    "username": "Frog0fWar",
    "rating": 8.5,
    "comment": "2-4 (3)",
    "timestamp": 1760479200
  },
  {
    "username": "Master Margarita",
    "rating": 10.0,
    "comment": "*",
    "timestamp": 1760306400
  },
  {
    "username": "Nivek",
    "rating": 10.0,
    "comment": "Italia",
    "timestamp": 1759442400
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "Light and fast tile-laying game. There's a number of different paths to scoring, and short-term goals are always pretty apparent even if your long-term goals are unclear. Plus, everyone loves the camels.",
    "timestamp": 1759356000
  },
  {
    "username": "whimsicaltyrant",
    "rating": 10.0,
    "comment": "#14 - 2024 (With Blue Lagoon)",
    "timestamp": 1755813600
  }
]