[
  {
    "username": "ratbulogg",
    "rating": 1.0,
    "comment": "First, a couple players manipulate the market, then the angry opponents blow up the world. Hard pass.\nBut other than that, it’s a cool game.",
    "timestamp": 1612825200
  },
  {
    "username": "Chimes",
    "rating": 1.0,
    "comment": "Eh, This game is broken in so many ways. All the expansions seem like they could help, but the end result is that the game is really not that much fun. We've tried it at least 10 times, and none were memorable in a good way.\n\nIf you like the genre, there are so many better options out there,",
    "timestamp": 1591567200
  },
  {
    "username": "HiTracey",
    "rating": 1.0,
    "comment": "Atrocious game with a totally flawed central system. Unbelievable that it generated so many add-ons, or that anyone bought them. Including me.\n\nComplexity - 1/10",
    "timestamp": 1574809200
  },
  {
    "username": "da pyrate",
    "rating": 1.0,
    "comment": "Badly flawed design that defies intelligent play.\n\nI have only rated it this highly as I was unable to give it a 'zero'.",
    "timestamp": 1489878000
  },
  {
    "username": "sirshandlar",
    "rating": 1.0,
    "comment": "Can't stand this game. Very long and boring. I can't remember ever playing where it didn't result in Nuclear Winter. Expansions only added more annoyances.",
    "timestamp": 1332972000
  },
  {
    "username": "sfox",
    "rating": 1.0,
    "comment": "Terrible game... generally ends in a situation of \"I can't win so neither will anyone else\" since the game is over once enough nukes go off. As if that wasn't bad enough the game mechanics are totally broken as well and the game takes forever to play.",
    "timestamp": 1323730800
  },
  {
    "username": "Bathory",
    "rating": 1.0,
    "comment": "One of the worst boardgame I'm never played : very long, very hazardous, with abysmal economical rules.\nNice components, with lovely nuke mushrooms.",
    "timestamp": 1287266400
  },
  {
    "username": "qrux",
    "rating": 1.0,
    "comment": "An attempt to improve Risk that just does not work. It is slow, dull and broken. Some of the expansions help but others make the game even worse. Very nice looking board and bits but beauty is only skin deep. Has anyone ever played a game that did not end in nuclear war?",
    "timestamp": 1257116400
  },
  {
    "username": "mr18196",
    "rating": 1.0,
    "comment": "Seems broken from where I'm standing (with my finger on the nuke button).",
    "timestamp": 1246226400
  },
  {
    "username": "Rattler Drake",
    "rating": 1.0,
    "comment": "Broken game that always ended in nuclear war. Always.",
    "timestamp": 1232146800
  },
  {
    "username": "bucklen_uk",
    "rating": 1.0,
    "comment": "Ugh, worst game ever. Broken awful mechanics, and I so wanted to like this one, even bought the revised rulebook and mega map to try to save this turkey ... nope it's awful. Stock market is broken and the whole game concept is broken - MAD doesn't work in a game situation (Hmm, I'm losing, lets nuke the planet ... You want to take that territory because your army is bigger than mine? Do that I'll start nuking ... Give me some money or I'll set off the nukes and end the game ... etc), finally managed to give it away! When I consider the $$$ I spent on this and the hours wasted trying to make it a playable game - this has to rank as the worst game I've ever had the misfortune to own/play",
    "timestamp": 1219096800
  },
  {
    "username": "cfarrell",
    "rating": 1.0,
    "comment": "Another dreadful piece of American dreck from the 70s (or maybe 80s?). Fans argue it's playable with certain combinations of expansions, but is the underlying game really worth the effort? Uh, no.",
    "timestamp": 1202857200
  },
  {
    "username": "opinicus",
    "rating": 1.0,
    "comment": "I never liked this game.",
    "timestamp": 1200697200
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1641769200
  },
  {
    "username": "doubt72",
    "rating": 2.0,
    "comment": "Been sitting in my collection for decades (since it came out). Wouldn't get rid of it at this point mainly because I wouldn't inflict it on anyone else.\n\n[This one has a placeholder date for play; I've played it, but not sure when, if I play it again I'll delete that.\n\nI probably never will.]",
    "timestamp": 1608937200
  },
  {
    "username": "Tomay",
    "rating": 2.0,
    "comment": "Almost every game I ever played of this went the same way. One player (lets call him Player A) goes first, floods the market with goods so no one else can make any money. He uses the money to develop and buy nukes. The other players try to boost price of goods by buying stuff; Player A then sells his own supplies of the same stuff, wrecking the market again, uses money to buy nukes. This goes on until Player A is forced by rock-bottom market prices to buy his nukes by going deep into debt. When he can't go any more in debt, he launches his nukes, eventually causing so much damage that the world is destroyed by nuclear winter. Game over.",
    "timestamp": 1572476400
  },
  {
    "username": "Capn Hook",
    "rating": 2.0,
    "comment": "terrible , broken ...",
    "timestamp": 1571695200
  },
  {
    "username": "Morgenstern",
    "rating": 2.0,
    "comment": "Dear God this was awful.",
    "timestamp": 1546383600
  },
  {
    "username": "skrutsch",
    "rating": 2.0,
    "comment": "We wish this worked.\n\nsell or trade\nGreat Purge of 2018!",
    "timestamp": 1535320800
  },
  {
    "username": "galen",
    "rating": 2.0,
    "comment": "3",
    "timestamp": 1524434400
  },
  {
    "username": "Zapata",
    "rating": 2.0,
    "comment": "Wanted to love it but... too many bugs.",
    "timestamp": 1504130400
  },
  {
    "username": "blockhead",
    "rating": 2.0,
    "comment": "I saved the mushroom markers, the rest ultimately went in the trash",
    "timestamp": 1447714800
  },
  {
    "username": "PaulGrogan",
    "rating": 2.0,
    "comment": "I got this game way back when. Wanted a long complex global wargame. Game is just awful and doesn't work at all. Goes on too long, and is very random. Expansion sets just add more randomness. This is a very old-school game, and should stay in the 80's.",
    "timestamp": 1434492000
  },
  {
    "username": "nhjelmberg",
    "rating": 2.0,
    "comment": "RISK + Monopoly. The sum succeeds in being less than the parts.",
    "timestamp": 1431554400
  },
  {
    "username": "prael",
    "rating": 2.0,
    "comment": "played this a couple of times back in the day. did not dig it.",
    "timestamp": 1314741600
  },
  {
    "username": "quantumscipio",
    "rating": 2.0,
    "comment": "3 maybe 4 plays?",
    "timestamp": 1311976800
  },
  {
    "username": "kamino72",
    "rating": 3.0,
    "comment": "Old mechanics. Nice theme but terrible execution.",
    "timestamp": 1758405600
  },
  {
    "username": "heli",
    "rating": 3.0,
    "comment": "http://spotlightongames.com/military/mnights/sk.html#suprema...\nTips for play:\nhttps://spotlightongames.com/analysis/supremacy.html",
    "timestamp": 1706655600
  },
  {
    "username": "slotus2005",
    "rating": 3.0,
    "comment": "I had some enjoyment of this game about twenty years ago. While the concept is very neat and there were some good ideas, the game was unworkable as a true game. We found early on how to manipulate the market and take out gigantic loans and destroy the world. The million expansions each with only a few pages of rules each is an early example of milking people by not giving them enough content. Particularly bad was the wording of the rules... too much for how simple the game actually was... too simple actually. Not having enough small bills was also an idiotically annoying thing with the game. However, the art and production value of the game was outstanding for the time period. The mechanics of this game could not stand the test of time then, and certainly do not stand up to people's current expectations. It is possible to house-rule it, primarily with the Neo-Supremacy rules on the Internet, but the only reason to bother would be for the sake of the theme. All of that being said, I would be interested in the game IF it were done by a famous designer such as the ones who publish games through GMT and Compass to a lesser extent.",
    "timestamp": 1641682800
  },
  {
    "username": "Prev1",
    "rating": 3.0,
    "comment": "If you want to lose friends play this game with them. Monopoly can't hold a candle to the the toxic environment this game generates.",
    "timestamp": 1605049200
  },
  {
    "username": "bqsfgame",
    "rating": 3.0,
    "comment": "The economic system was totally broken.",
    "timestamp": 1601676000
  },
  {
    "username": "AlexSpielrebell",
    "rating": 3.0,
    "comment": "great material, but the game is in my opinion flawed and players start to lose motivation half through the game, when the winner is kind of already determined, but the game keeps going...",
    "timestamp": 1592431200
  },
  {
    "username": "Dragoons_Kane",
    "rating": 3.0,
    "comment": "Most of the time ends up with the destruction of the World. Not so good game.",
    "timestamp": 1578438000
  },
  {
    "username": "mnickerson30",
    "rating": 3.0,
    "comment": "Does have some neat ideas, but the economic system doesn't work and it becomes terribly frustrating as the resource price points swing wildly from turn to turn.",
    "timestamp": 1576364400
  },
  {
    "username": "joebelanger",
    "rating": 3.0,
    "comment": "War Games the board game.",
    "timestamp": 1475445600
  },
  {
    "username": "ricardocabelo",
    "rating": 3.0,
    "comment": "Supremacia (Grow)",
    "timestamp": 1454713200
  },
  {
    "username": "red_gamster",
    "rating": 3.0,
    "comment": "Traumatised after playing an unfinished six-player game that lasted an entire afternoon, yet nothing happened. Never played it again. I do remember some fun three-player games. Initiative rolls too advantageous. Cries out for house rules. My boardgame nightmare would be to have to play this with all the expansions. Can't see why anyone would play this anymore.",
    "timestamp": 1449615600
  },
  {
    "username": "aaarg_ink",
    "rating": 3.0,
    "comment": "130929 I'd be surprised if I play this again, but its still in the collection maybe I'll try it one more time. Well I'm not sure if I ever really played it. If I remember correctly the graphic design is pretty good.",
    "timestamp": 1447714800
  },
  {
    "username": "RealTico",
    "rating": 3.0,
    "comment": "This game is as beautiful as it is broken!",
    "timestamp": 1422658800
  },
  {
    "username": "Geoboffin",
    "rating": 4.0,
    "comment": "Too many flaws to waste a (long) evening on.",
    "timestamp": 1729720800
  },
  {
    "username": "Unitoch",
    "rating": 4.0,
    "comment": "I played this once back in college and have only a faint recollection of it. Some of the mechanics seemed cool, but I don't remember the experience being all that satisfying. It was already showing suspicious signs, and I don't know that we even finished it. We never tried it again, so that certainly doesn't speak well of it. The graphic design was cool in that 1980s way.",
    "timestamp": 1713477600
  },
  {
    "username": "luisones",
    "rating": 4.0,
    "comment": "OK",
    "timestamp": 1701039600
  },
  {
    "username": "Jackwww57",
    "rating": 4.0,
    "comment": "Game was better in concept than in game play. Tried it 3 or 4 times , took a long time to setup and understand the rules, Each time the game ended when a player was about to be taken over and then pulled the nuclear option",
    "timestamp": 1664229600
  },
  {
    "username": "hohan118",
    "rating": 4.0,
    "comment": "Man I thought this game was awesome in my teenage years. I played it again and realized how bad it was... Too many games went too long. Usually, somebody got angry at the betrayal in the game (humourous or awkward depending on your personality I guess) and man the market/economy was pretty messed up. Games typically had somebody becoming mega rich and crashing the market. Every expansion just made the game longer and longer. Definitely for the nostalgia crowd.",
    "timestamp": 1611270000
  },
  {
    "username": "Andre Viana",
    "rating": 4.0,
    "comment": "Jogo quebrado. O mercado precisa claramente de uma outra regra.",
    "timestamp": 1577574000
  },
  {
    "username": "scottmoll",
    "rating": 4.0,
    "comment": "An older game that I have not played for over 15 years. From what I can remember, it really required several of the expansions, but it is hard to knock any game that allows you to put down mushroom clouds.",
    "timestamp": 1572303600
  },
  {
    "username": "gregandjan",
    "rating": 4.0,
    "comment": "Risk on steroids. But still more Risk than not.",
    "timestamp": 1543618800
  },
  {
    "username": "GHoooSTS",
    "rating": 4.0,
    "comment": "very 80s and pretty busted, but kind of fun in a retro sense occasionally",
    "timestamp": 1535666400
  },
  {
    "username": "ralmeida028",
    "rating": 4.0,
    "comment": "Played it when I was a teenager. I rated it as 4 and still believe it's overrated.\nToo long, too boring, full of flaws. Materials are high quality, but the rules suck.",
    "timestamp": 1506895200
  },
  {
    "username": "BillSkulley",
    "rating": 4.0,
    "comment": "2017 - Its been many years since I played this, but from the clearer view years later, this just wasn't a finished game - so many cool ideas and interesting systems, but really missing the \"game\". I'd probably still play it again... but I wouldn't expect much of it.\n\n----\n\nCan be fun with the right group... that group is nearly impossible to find, so I finally sold off my entire collection, a decision I am not unhappy with.",
    "timestamp": 1487199600
  },
  {
    "username": "rgdebarros",
    "rating": 4.0,
    "comment": "Good map size and decent production quality. The game may drag on forever without a turn limit or end fast with a nuclear holocaust (all players loose), which sadly is a common outcome. A mix of good rules and concepts (like companies and resources) and bad ones (like the way nukes and laser-stars are handled by the game).",
    "timestamp": 1485644400
  },
  {
    "username": "Bundyman",
    "rating": 4.0,
    "comment": "SS20 vs. Pershing. These are no magic mushrooms, these were gamma ray clouds.....SDI programm planed ahead. OMG, thats so Old school.",
    "timestamp": 1459202400
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "almost as good as risk but complexity shoots through the roof. Nice in simplist format but needs expansions to make game worthwhile.",
    "timestamp": 1759960800
  },
  {
    "username": "wread",
    "rating": 5.0,
    "comment": "Nostalgia",
    "timestamp": 1748296800
  },
  {
    "username": "Puehn",
    "rating": 5.0,
    "comment": "We played this a lot 20 to 30 years ago and heavily house-ruled it. RAW it is a 5 or maybe 6. Our house-ruled version is a 8 or 9. Solid foundation.",
    "timestamp": 1745791200
  },
  {
    "username": "SeanC",
    "rating": 5.0,
    "comment": "This game can soak up a a few hours, even more if there are expansions involved and if players really like to wheel and deal. Given the investment in time, there are other games with similar playing times that I'd rather play. History of the World, anyone?",
    "timestamp": 1739919600
  },
  {
    "username": "RedwoodCroft",
    "rating": 5.0,
    "comment": "A classic from the 1980's. the economic system I remember was flawed though.",
    "timestamp": 1666735200
  },
  {
    "username": "Rosewarne",
    "rating": 5.0,
    "comment": "Has aged poorly but at its core is still a good game. A re-write would breathe new life into this old beats.",
    "timestamp": 1661983200
  },
  {
    "username": "Cat_O",
    "rating": 5.0,
    "comment": "Never actually played the game, but have pilfered a lot of the great plastic pieces to use with sci-fi miniatures games.",
    "timestamp": 1647039600
  },
  {
    "username": "Eldard",
    "rating": 5.0,
    "comment": "The resources market has a fatal flaw greatly favoring the first player. Ending the game with nuclear attacks -- those making all the players the losers -- seems to be the most common outcome",
    "timestamp": 1587765600
  },
  {
    "username": "shoshin42",
    "rating": 5.4,
    "comment": "I remember loving this game, except for the end game. Only once did the game not end with the destruction of the world, and that was only because I did some kingmaking at the end because I wanted someone to win for once. If not for the endgame, it would have a higher rating.",
    "timestamp": 1582153200
  },
  {
    "username": "Zadigreen",
    "rating": 5.0,
    "comment": "Grow",
    "timestamp": 1529877600
  },
  {
    "username": "JimHackerMP",
    "rating": 5.0,
    "comment": "Neat lookin' box for \"version 3.0\". But there never seems to be enough paper money! Personally I think a few minor (but important) changes to the rules would make it perfectly \"workable\". Some of the expansion sets are actually quite useful-looking and I might explore those options.",
    "timestamp": 1528149600
  },
  {
    "username": "HobbyistsOrDabblers",
    "rating": 5.0,
    "comment": "Not sure why we tried so hard to keep playing this game as we could never get anywhere near a victory without someone reaching an \"F you all\" state and nuking the game into a loss for all.\nAnd perhaps that was the point of the game... which is a serious fail as far as playability IMHO.\nNot to mention the (to be charitable) quirky market. Too easy to get an immediate imbalance that makes the game pretty un-fun for anyone who didn't get a chance to get in on the action. Also may have been intentional, also a big flaw.",
    "timestamp": 1524088800
  },
  {
    "username": "DerekW1968",
    "rating": 5.0,
    "comment": "Wesley has",
    "timestamp": 1521414000
  },
  {
    "username": "leadd",
    "rating": 5.0,
    "comment": "Meh",
    "timestamp": 1515711600
  },
  {
    "username": "AfrikaKorps14",
    "rating": 5.0,
    "comment": "Owned for a while in high school--traded for other items. Unless you formed a cartel with another player to manipulate the market, resources could be hard to obtain. Play balance seemed off, as our group always seemed to find issues with the rules or the implementation, and it could take a comparatively long time to play.",
    "timestamp": 1504908000
  },
  {
    "username": "drq2u",
    "rating": 5.0,
    "comment": "5",
    "timestamp": 1493589600
  },
  {
    "username": "Bankler",
    "rating": 5.0,
    "comment": "With the right mix of expansions. But with the wrong mix it easily drops to 3 or less.",
    "timestamp": 1478646000
  },
  {
    "username": "capn_stabn",
    "rating": 5.0,
    "comment": "A little hard to get into and requires a group that can sit through the rules.",
    "timestamp": 1467842400
  },
  {
    "username": "auerbalazs",
    "rating": 5.0,
    "comment": "Kicsit túlhaladt már rajta az idő. túl komplex",
    "timestamp": 1460412000
  },
  {
    "username": "pthorton",
    "rating": 5.0,
    "comment": "Fun when I was a kid, not sure how much I'd like it now. Caveat: Never played with the various expansions.",
    "timestamp": 1444168800
  },
  {
    "username": "mi_de",
    "rating": 5.0,
    "comment": "Testosterone driven game of threatening to blow up your opponents then doing so rather than allowing them to win. Simple structure and economics, with incredible advantages in going first or last in various phases. Silly to the extreme, but fun to play if it does not go too long, and our game lasted all of three turns.",
    "timestamp": 1443304800
  },
  {
    "username": "Vrooman",
    "rating": 5.0,
    "comment": "A game with all the subtlety of a sledgehammer. It provokes \"dialog\" amongst players.",
    "timestamp": 1431727200
  },
  {
    "username": "gelharwisc",
    "rating": 5.0,
    "comment": "Too long and involved compared to more modern fare.",
    "timestamp": 1428962400
  },
  {
    "username": "Dalrik",
    "rating": 5.0,
    "comment": "Big failure in this game : the economic rules.......",
    "timestamp": 1419980400
  },
  {
    "username": "Kilgore1313",
    "rating": 5.0,
    "comment": "This has great components, but who cares? Our group bashed its collective head against this clunker, hoping to find a good game in there somewhere. It has the same problem that most conquest games have: the first two people to fight always lose. Everyone else turtles then runs out of money and goes into receivership. Not a good thing for a war game.",
    "timestamp": 1351983600
  },
  {
    "username": "Jim40percent",
    "rating": 5.0,
    "comment": "A game very much ahead of it's time albeit by today's standards basically broken. The Marshall's handbook helps with some rules clarifications but a few house rules should probably still be used. I would need the right group and around five hours to burn to get this to hit again. That said, I hope that I can find the right group with the time. I played this several times in my youth and I still have a soft spot for it.\n\nBeing a dreamer here but with the emergence of sites like Kickstarter it's my hopes that one daring individual decides to make this again with a tweaked ruleset. If someone is thinking about it and happens to read this let me know and I'll see what I can do financially/beta testing etc.",
    "timestamp": 1348351200
  },
  {
    "username": "KoehnJ",
    "rating": 6.0,
    "comment": "Strategic, nuclear, conventional, economic, and political, this game is as relevant today as it was in the mid-1980's. A few map tweaks and the game can model today's geopolitical landscape! Nuclear mushrooms... yeah... there's always somebody willing to use 'em!!!",
    "timestamp": 1755727200
  },
  {
    "username": "ruy_ferraz",
    "rating": 6.0,
    "comment": "Será usado para a versão PnP do Power Grid",
    "timestamp": 1742166000
  },
  {
    "username": "dcpepp",
    "rating": 6.0,
    "comment": "Always wanted this game to be better than it was. Loved the look of it, though!",
    "timestamp": 1739401200
  },
  {
    "username": "sculley",
    "rating": 6.0,
    "comment": "50+ plays; almost all with Mega Map and most of the expansions. Usually 2 players. This game benefits greatly by the addition of most, but not all, of the expansion sets. The rules are a bit of a nightmare at times, because of ambiguities and omissions, which are corrected or clarified in later rulebooks. I cannot see myself ever wanting to play the base game again as the Mega Map and many of the expansions make the game far more interesting, and complex.",
    "timestamp": 1679180400
  },
  {
    "username": "williamhillis",
    "rating": 6.0,
    "comment": "Another friendship-killing game. Go ahead. Nuke your neighbor. See what happens.",
    "timestamp": 1640646000
  },
  {
    "username": "RSECCOMB",
    "rating": 6.0,
    "comment": "Mushroom Clouds.",
    "timestamp": 1634594400
  },
  {
    "username": "sullijo",
    "rating": 6.0,
    "comment": "Any game that includes plastic mushroom clouds is gold in my book.",
    "timestamp": 1601935200
  },
  {
    "username": "Grunge67",
    "rating": 5.5,
    "comment": "Really wanted to like this. Another game which needs a full player count to get the best out of it. A pretty shoddy rule book though",
    "timestamp": 1589148000
  },
  {
    "username": "Arkwright99",
    "rating": 6.0,
    "comment": "Played one of the earlier versions (v2?) a lot at Sixth Form College in the '80s in Games Club; as I recall it played very well with six players.",
    "timestamp": 1585263600
  },
  {
    "username": "Constantinople",
    "rating": 6.0,
    "comment": "1984 Supremacy Games What no nazis?\n\nGENCON 2018 24",
    "timestamp": 1581202800
  },
  {
    "username": "Beyak",
    "rating": 6.0,
    "comment": "BURNED IN FIRE, OCTOBER 2017\nFun game but the rules can be so ambiguous at times it can really cause a lot of arguments.",
    "timestamp": 1556056800
  },
  {
    "username": "Yldarr",
    "rating": 6.0,
    "comment": "I was given this from a friend and we wanted to play it but we never did and I don't remember what happened to my copy",
    "timestamp": 1553900400
  },
  {
    "username": "Vince Eagle",
    "rating": 6.0,
    "comment": "A slightly improved Risk.",
    "timestamp": 1553036400
  },
  {
    "username": "jvbren",
    "rating": 6.0,
    "comment": "I remember this seemed like such a radical, new gaming experience, but not necessarily a life-changing one. Not really sure what happened to my copy. Maybe it got nuked.",
    "timestamp": 1527112800
  },
  {
    "username": "srfdevotee",
    "rating": 6.0,
    "comment": "At its heart, this is a good economic war game, but it's severely hampered by a dated appearance, by a market that is too easy to manipulate in crazy, un-thematic ways, and by end-games that tend to devolve into an unsatisfying nuclear war.\n\nThe numerous expansions that were produced later added an absurd amount of complexity and game length, and laughingly produced a combined rulebook of novel-length size.",
    "timestamp": 1520895600
  },
  {
    "username": "AmadanNaBriona",
    "rating": 6.0,
    "comment": "I know I played this a few times way back when. Probably hasn't aged well, but I'd like to play it again.",
    "timestamp": 1520463600
  },
  {
    "username": "sloan66",
    "rating": 6.0,
    "comment": "Great game, just takes forever to play",
    "timestamp": 1520463600
  },
  {
    "username": "PatentDude",
    "rating": 6.0,
    "comment": "I enjoyed this game, but it is not as good as some other board war games.",
    "timestamp": 1516575600
  },
  {
    "username": "Yossarian42",
    "rating": 6.0,
    "comment": "Got this one ages ago, lots of fun during the beginning stages.",
    "timestamp": 1491084000
  },
  {
    "username": "StormShadow",
    "rating": 6.0,
    "comment": "The Graddaddy of abstract modern wargames - this game can have it all! Nukes, L-Stars, Chemical Weapons, Resources, Armies, Navies - diplomacy at the grandest level! Beware, this game is a long one! Like Risk - it can go on for hours! I haven't played in a few years, but I can still remember vividly the emotional responses this game provokes - especaially when a nuke gets fired!",
    "timestamp": 1481756400
  },
  {
    "username": "wifwendell",
    "rating": 5.5,
    "comment": "Had fun with this back when it was new, despite major flaws in the market. Not sure we ever ended a game without full-on nuclear war.",
    "timestamp": 1480287600
  },
  {
    "username": "GeorgeMo",
    "rating": 6.0,
    "comment": "This game is somewhere in my attic, so I still own it. My 6 rating may be inflated by nostalgia; I need to dig it out and try playing it again. Part of the reason I loved the game was the cool boomer and tank minis which blew away Risk and were impressive at the time.",
    "timestamp": 1458169200
  },
  {
    "username": "cdarlage",
    "rating": 6.0,
    "comment": "The stock market and the nuclear weapons added some neat elements. Overall, it was not as fun as games like Risk or Axis & Allies.\n\nTraded.",
    "timestamp": 1451084400
  },
  {
    "username": "chriswtham",
    "rating": 6.0,
    "comment": "Played this a few times over the years. Often ends in the bored player nuking everyone... All the other sane players are desperately building LStar to avoid the end of the world.",
    "timestamp": 1440108000
  },
  {
    "username": "The Burnin8or",
    "rating": 6.0,
    "comment": "I like this game generally, finding it like a current day (well, current at the time) version of Risk. Much better with some of the expansions though.",
    "timestamp": 1427324400
  },
  {
    "username": "chuffymonkey",
    "rating": 6.0,
    "comment": "I liked this so much more than everyone else. But their lack of interest saved me from buying all those expansions. Still, nuking your mates always has an attraction, and I liked the look and feel",
    "timestamp": 1419980400
  },
  {
    "username": "Karmasmuggler",
    "rating": 7.0,
    "comment": "One of my top five games. I marked it down slightly because the market swings terribly and destroys the balance in the base game.",
    "timestamp": 1736031600
  },
  {
    "username": "ming_ameba",
    "rating": 6.5,
    "comment": "Its Risk with economic management. And yes ... you get to nuke your buddies too.",
    "timestamp": 1720303200
  },
  {
    "username": "Warlock_bylandt",
    "rating": 6.5,
    "comment": "+ Boomers - Warlords & Pirates + Boomers - Ballistic Missile Subs + Fortuna + Main Battle Tanks + Mega Map + Challenge of the New World Order + Neutron Bombs & Killer Satellites + Resource Deck Two + The Middle Powers + Warlords & Pirates of the Neutral Zone",
    "timestamp": 1717106400
  },
  {
    "username": "Innsmouth_Look",
    "rating": 6.5,
    "comment": "Risk with a market economy and nuclear bombs (and almost always nuclear winter). Too many expansion packs which take away from the speed and fun of the game. Played many many times. Small map (limited territories= lots of nukes). The new release uses the big map which will slow play, making 5+ hour games (currently around 2 hours).",
    "timestamp": 1632002400
  },
  {
    "username": "dfudd",
    "rating": 6.5,
    "comment": "Despite player elimination, rule problems when you add more expansions, and some general fiddliness, there comes a lot nostalgia and fun with this game.",
    "timestamp": 1627855200
  },
  {
    "username": "echelon",
    "rating": 7.0,
    "comment": "This is the first not widely known boardgame I played as a freshman in college which got me into liking boardgames a lot. Before this one it was Chess, Risk, UNO, Marco Polo, Monopoly, Traditional card games, and Stratego which were not bad at all of course.",
    "timestamp": 1624572000
  },
  {
    "username": "slimy_asparagus",
    "rating": 7.0,
    "comment": "war game aiming at something like accuracy and symmetry.",
    "timestamp": 1584745200
  },
  {
    "username": "Philipp Klarmann",
    "rating": 7.0,
    "comment": "Fun game, very long, needs a good, large group with the right mindset.",
    "timestamp": 1548111600
  },
  {
    "username": "EarlofBronze",
    "rating": 7.0,
    "comment": "Played pre BGG.",
    "timestamp": 1542582000
  },
  {
    "username": "Gangore",
    "rating": 7.0,
    "comment": "A classic!",
    "timestamp": 1519945200
  },
  {
    "username": "Lifer4700",
    "rating": 7.0,
    "comment": "Haven't played in many years.",
    "timestamp": 1490050800
  },
  {
    "username": "Talonz",
    "rating": 7.0,
    "comment": "Also have the marshall's handbook, neutral powers expansion, alternate resource deck, and minimap of the now sold megamap.",
    "timestamp": 1487631600
  },
  {
    "username": "Orophin",
    "rating": 7.0,
    "comment": "The very best politics game ever made. Love 10 to 12 hours sessions",
    "timestamp": 1466200800
  },
  {
    "username": "Mallet",
    "rating": 8.0,
    "comment": "Wargame. With a little tweaking of the rules it's a blast to play.",
    "timestamp": 1757023200
  },
  {
    "username": "dippermouth2000",
    "rating": 8.0,
    "comment": "An '8' for sentimental reasons! Right? C'mon, it's fun to nuke!\n\nI played this in the 90s. I wish someone would play with me now. If you live in Los Angeles...",
    "timestamp": 1663020000
  },
  {
    "username": "jamiejdc2",
    "rating": 8.0,
    "comment": "I use this game now to design new, simplified versions to the game with different conflict and market ideas. I love the board design and components.",
    "timestamp": 1588111200
  },
  {
    "username": "Hiroheatho",
    "rating": 8.0,
    "comment": "I think I still have one around the house...not sure anymore...Found it today, 2/16/2017",
    "timestamp": 1487199600
  },
  {
    "username": "Rafael Ramus",
    "rating": 7.5,
    "comment": "An old classic about geo-political and economic supremacy. I still enjoy playing it - and no, it's not long when you're having fun.\n\nP.S.: It needs some house-ruling for the market.",
    "timestamp": 1486162800
  },
  {
    "username": "Becq",
    "rating": 7.5,
    "comment": "I loved this game in younger days. Unfortunately, the time commitment means that finding players isn't possible, and even if I could, I don't have a complete game. It would be nice if they remade this as a \"complete\" version of the game with the best of the expansions built in, and the whole thing streamlined somewhat.\n\nOne thought: even with the expansion resource deck, resource allocation felt \"samey\". This could be improved dramatically by doing something like Mystic Vale: have a sleeved card for each territory, then (semi-randomly) put a resource insert into each!",
    "timestamp": 1476136800
  },
  {
    "username": "superdupergeek",
    "rating": 8.0,
    "comment": "The best global domination game I have played. Rules are not perfect but are easily fixed. A wealth of ways to win and not just a game of Attack Everything! (like risk). Well made components and again a very visually striking game when in progress.\n\n2016 - this is NOT the best global domination game I have played! It still holds a special place in my heart as it is one of the very first games that got me into gaming..",
    "timestamp": 1467669600
  },
  {
    "username": "Harae",
    "rating": 8.0,
    "comment": "Good: Strategic - Modern - Easy\n\nUnderrated and under appreciated concept The design has one -major- flaw/problem: the resource market. However this is fixed with a house rule!!\n\nSimplicity /Resources /Nukes /Atom bombs/ Resources Market. what more can you ask for? Yes: some A&A style miniatures but you can have them with the expansions.\n\nWith a changed market system this is a great game (use a d6 to determine how many resources can be sold each time).\n\nWill Fantasy Flight ever publish Reins of Power as successor??!!",
    "timestamp": 1439071200
  },
  {
    "username": "CiviliTalismaniac",
    "rating": 8.0,
    "comment": "The high ranking reflects the use of a modified 3.0 rule set that balances the game. I love the various aspects of Cold War flavored tactics. You can defeat your competitors conventionally, economically, or strategically (nuke 'em). We use a grab bag for the phase bidding step.",
    "timestamp": 1413151200
  },
  {
    "username": "Doctor X",
    "rating": 8.0,
    "comment": "Never once did we finish a game. Either everyone was drunk by the end and we signed a detente or someone would get mad, pop a nuke, and everyone else would respond in kind.",
    "timestamp": 1403215200
  },
  {
    "username": "Thrylos",
    "rating": 8.0,
    "comment": "A classic. You need to play with the updated rules, doom counter, fortuna deck, etc.",
    "timestamp": 1333663200
  },
  {
    "username": "Svenbossi",
    "rating": 8.0,
    "comment": "THE game of my youth - we played it whole weekends!",
    "timestamp": 1296428400
  },
  {
    "username": "Braddox",
    "rating": 8.0,
    "comment": "Supremacy has taunted me for years. I own the game and most of the expansions, but have only been able to play a few times. Finding enough players and (more importantly) enough time to play is a real challenge. I would have given this game a 9 for ambition but the chaotic nature of the rules (after all the expansions) would have pulled it down to a 7, so I'll settle with an 8.",
    "timestamp": 1292194800
  },
  {
    "username": "Will_Annand",
    "rating": 9.0,
    "comment": "I was Game Master / Developer on this title.",
    "timestamp": 1666130400
  },
  {
    "username": "Uktabi",
    "rating": 9.0,
    "comment": "I love this game. The first time we played, we were too aggressive and ended in nuclear winter. I was hooked. Fortunately, that was the only time we ever had nuclear winter.\n\nI still remember one game when we played with only one L star card in the resource deck and 3 nukes. Everyone had nukes, but L stars were rare. We all had about 3 nukes just to play the MAD game. Suddenly, I farmed a L star out of the resource deck, but I didn't have the money to build and cover my expenses next turn. My buddies mood went bleak as I was envisioning extorting them every turn for money to fund my new L star deployment program. (yes, I am evil, eeeevil)\n\nMy buddy Jason pulled off the greatest play I think I ever saw in the game. He nuked my entire mineral production. No L star for me, no matter how much money I had. And I had just spent all my savings mining the resource deck for the L star. I could not afford mine for mineral. God bless Jason where ever he is.\n\nThis game is LOADS OF FUN and will create memories. The only reason I only gave it a 7 instead of 9/10 is it takes time. I mean TIME. Expect to start around noon, and play the game until its time to hit the bar, if you decide to hit the bar. Many times we played on.\n\nI say it takes time, but we had all the expansions: tanks, subs, spies, unconventional forces, neutron bombs, pirates, warlords, fortuna and high tech. We even used the 5x8 huge map, which my friend had laminated.\n\nThe basic game is easy to learn and can maybe take a couple of hours depending on how you play. Each round has 2 things everyone does, and you have to choose 3 out of the next six things you can do. More forces gets a die advantage, as well as having more l stars. Its simple math, even I understood it.\n\nI highly recommend everyone to at least give the basic game a try.",
    "timestamp": 1611356400
  },
  {
    "username": "HotCoals",
    "rating": 9.0,
    "comment": "Played this a lot in the eighties and nineties as a kid. Loved it.",
    "timestamp": 1577228400
  },
  {
    "username": "CaptainNelson",
    "rating": 9.0,
    "comment": "one of the funnest, most intense, friend breaking games you'll ever play",
    "timestamp": 1569621600
  },
  {
    "username": "Stretchmo",
    "rating": 9.0,
    "comment": "better with a few of the xpacs",
    "timestamp": 1566856800
  },
  {
    "username": "Gershwin27",
    "rating": 8.9,
    "comment": "This was my first true (non- MB,PB,Hasbro) board game that I played. So this definitely has a nostalgia factor for me. I never quite understood what appears to be a general consensus that the rules are non-playable or require house rules to make the game 'better.' Although I only pull Supremacy out once a year (or two), it is always a major event. Our group plays with _every_ expansion in play, and we try to have one non-player act as Field Marshall (kind of like a GM). Yes, the game ends up being at least a 12 hour affair, but in the end everyone has had a good time; all without any custom rules.",
    "timestamp": 1510009200
  },
  {
    "username": "hursty3",
    "rating": 9.0,
    "comment": "I know this game is broken, especially the market. I stil love everything about it. Global. Thermonuclear. War.",
    "timestamp": 1377468000
  },
  {
    "username": "BigChzy",
    "rating": 9.0,
    "comment": "Pure unapologetic Ameritrash. Played this one winter with a group of coworkers when we were sleeping in our offices during a major power outage (not kidding). Love it.",
    "timestamp": 1292799600
  },
  {
    "username": "crimsondynamo",
    "rating": 9.0,
    "comment": "A fantastic game with multiple players, expansion sets, and some in-house rules that award victory points for achieving national objectives.",
    "timestamp": 1252879200
  },
  {
    "username": "kimba",
    "rating": 8.5,
    "comment": "best war game ever! 10 times better than Risk.",
    "timestamp": 1201388400
  },
  {
    "username": "landrobot",
    "rating": 9.0,
    "comment": "I absolutely LOVE this game, even though it could of been so much better. Nuclear winter always occurs, the marketplace is not fair, etc. The expansion sets help a LOT, make the game more enjoyable, albeit more complex. Even though this isn't the best game made, its still one of my all time favorites. But, I can understand why so many others do rate it bad.",
    "timestamp": 1162681200
  },
  {
    "username": "Lord_Valain",
    "rating": 9.0,
    "comment": "Great game that gets better with the expansions",
    "timestamp": 1154988000
  },
  {
    "username": "Jooky",
    "rating": 9.0,
    "comment": "Loads of fun with the right group of people. Not very popular here on the geek, but it will always be one of my favorites.",
    "timestamp": 1134255600
  },
  {
    "username": "penguinbirdies",
    "rating": 10.0,
    "comment": "10 billion dollar loan. Nuke everyone. Love it!",
    "timestamp": 1660687200
  },
  {
    "username": "evadretsof",
    "rating": 10.0,
    "comment": "This was revolutionary for an avid Risk player. The diplomacy, economies, and technology additions were like adding a racing engine and fins to a VW Bug. I couldn't get enough of this game until it broke...Please Read On.\n\nWith a few small house rules, this game is a must. The simple yet thorough DHR house rules bring this game home with a grand slam.\n\nBTW, playing time can be as low as 120 minutes if you play with the time limit option of the original rules.",
    "timestamp": 1651269600
  },
  {
    "username": "rapertchristom",
    "rating": 10.0,
    "comment": "Looking for others who like to play this game.\nI know of a web based Supremacy game that is very cool, so contact me if interested in playing Supremacy online (not the Vassal version) with other players who like this game\nOR\nThere is a Vassal version to play too.\nIf you want to play the Vassel version, contact me to play or ask questions, etc.\n\nThank you!",
    "timestamp": 1641510000
  },
  {
    "username": "PravinLal",
    "rating": 10.0,
    "comment": "An excellent modern version of the classic wargame Risk, Supremacy adds economics, resources, navies, nuclear weapons, and ABMs to the game.",
    "timestamp": 1578610800
  },
  {
    "username": "Dale111",
    "rating": 10.0,
    "comment": "Played back in the 80s and loved it.",
    "timestamp": 1577660400
  },
  {
    "username": "DarthMisster",
    "rating": 10.0,
    "comment": "The best way to lose friends : play Supremacy, help them build their empire, in the mean time, be the first to build Nukes, Them throw 12 Nukes on earth to drive the game to a DEAD end! Everybody loses! :-)\n\nMy typical approach... I had to come with a body guard the last game.",
    "timestamp": 1551913200
  },
  {
    "username": "thorfrog",
    "rating": 10.0,
    "comment": "Great group game. Make sure to grab all expansions.",
    "timestamp": 1476309600
  },
  {
    "username": "JAD2",
    "rating": 9.5,
    "comment": "Great game, nice update of Risk for the 80s and 90s",
    "timestamp": 1402956000
  },
  {
    "username": "DarthMisster13",
    "rating": 10.0,
    "comment": "The best way to lose friends : play Supremacy, help them build their empire, in the mean time, be the first to build Nukes, Them throw 12 Nukes on earth to drive the game to a DEAD end! Everybody loses! :-)\n\nMy typical approach... I had to come with a body guard the last game.",
    "timestamp": 1402869600
  },
  {
    "username": "assassin0069",
    "rating": 10.0,
    "comment": "If interested in playing Supremacy, I live In Okotoks,AB. Have expansions:Warlords :Middle Powers\n:Fortuna :Resource Deck2\n:Mega Map :MegaRules\n:Neutron Bombs/...\n\nWill Probably get some others too. Looking for others who love this game who would like to get together to play. I am 36, and my wife plays the game too. Email Jlee0069@hotmail.com if interested thx",
    "timestamp": 1259362800
  },
  {
    "username": "Cresanteagleent",
    "rating": 10.0,
    "comment": "I was lucky enough to have had the players one time to play this game. This game is awsome and we played for hours. Picture yourself as the leader of a super power, The Economics of your country is your responsablity, Your countries research and development is also in your hands. Peace and war is made by split second thinking and the need to secure resources. Be carefull because what starts out to be a simple war can explode and become a world war with Nuclure weapons being fired to a certain Apoclyptic Doom.",
    "timestamp": 1129586400
  },
  {
    "username": "Conan_the_Librarian",
    "rating": 10.0,
    "comment": "The name fits the game! I love the way you can win on diff. styles of gameplay.",
    "timestamp": 1049407200
  },
  {
    "username": "khaighle",
    "rating": 10.0,
    "comment": "I played this game non-stop for the entire summer of 1992.",
    "timestamp": 1035151200
  }
]