[
  {
    "username": "Euroman",
    "rating": 1.0,
    "comment": "Can't stand this game of great chaos and misery. Might be ok as a 2 or 3 player game, but I will never know.\n\nDid play again 15 years later with 3 players.\nWill NEVER play again. What a terrible, terrible game.",
    "timestamp": 1759874400
  },
  {
    "username": "villepa",
    "rating": 1.0,
    "comment": "I like the idea of it. Choosing roles is very interesting. This to work well you need a lot of players. This again will make the game longer than I want it to be.",
    "timestamp": 1753912800
  },
  {
    "username": "JRAMtheBandit",
    "rating": 1.0,
    "comment": "My least favorite game of all time. You wait slowly for everyone to draft roles from a hand one at a time, then people reveal their roles and your turn is skipped, so you wait as everyone slowly takes their turn one at a time. Just a truly horrible design.\n\nIf the drafting of roles and the turn-taking was simultaneous, it could at least be a short, chaotic game, and losing a turn wouldn't sting that much. Instead, it can be 10-15 minutes between your turns if you get unlucky. I will NEVER play this game again.\n\nUpdate 5+ years later: I played this game again, with a smaller, quicker group. It still SUCKED. The entire concept of the Warlord where you can move yourself farther from victory just to screw over someone else and make the game take longer for everyone is the kind of idea that should permanently get your game design license revoked. And at least let the player collect their little income if they get Assassined.",
    "timestamp": 1747951200
  },
  {
    "username": "dontnickme",
    "rating": 1.0,
    "comment": "Combines the WORST parts of Munchkins, Love Letter, Coup, \"I do this, you immediately undo it\" ad naseum. I love games that are about out thinking opponents, but this is just random chaos with zero strategic thought.",
    "timestamp": 1737932400
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "The basic concept is hilarious! Except the objective is to build boring structures for VPs, but that's acceptable for the amusing bluffing game. Though now that I think about it, the bluffing game is awfully restrained. Like it still works, but still so many of the jobs are about accumulating money and VPs. Like a euro with a tiny bit of interaction. There's something that bothers me, how the assassin/thief have no idea who they're targeting. That's the biggest part of the appeal, but being blind also makes it less mean, it was never anything personal! And that's the problem, it puts all interaction at arms length so nobody gets too offended by things going horribly wrong.\n\nI think part of it is that the drafting of roles doesn't give enough information to reliably use groupthink against each other, so the attacks just feel like random chance. It came out much later, but Love Letter does the same concept with way more interaction, and less euro-building.",
    "timestamp": 1731711600
  },
  {
    "username": "quietcorn",
    "rating": 1.0,
    "comment": "This is a game where your goals are dependent on both the random element of what cards you draw, and other player's ability to predict (or guess) what role you have thereby eliminating some part of your progress. This game takes an hour and a half to do what could and should be done in a game that takes maybe 15 minutes.",
    "timestamp": 1716415200
  },
  {
    "username": "uduhno",
    "rating": 1.0,
    "comment": "It is a bluffing game.",
    "timestamp": 1694988000
  },
  {
    "username": "Poetic_Justice",
    "rating": 1.0,
    "comment": "Holds the illustrious position of one of the handful of games I flat out refuse to play.",
    "timestamp": 1658268000
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Slow game with player elimination on a round. Can make the game drag on with the thief, assassin, and warlord.\n\nAfter playing with the expansion characters, I cannot imagine myself playing with the classic set ever again.",
    "timestamp": 1639954800
  },
  {
    "username": "Niagara62j",
    "rating": 1.0,
    "comment": "This game is the biggest piece of shit I have ever seen.",
    "timestamp": 1627077600
  },
  {
    "username": "darimm",
    "rating": 1.0,
    "comment": "Literally the worst trash ever printed. Better used as kindling.",
    "timestamp": 1511391600
  },
  {
    "username": "Distortion17",
    "rating": 1.0,
    "comment": "Large amount of time between turns with nothing to do. Far too much luck. Players too often in position of deciding who will lose.",
    "timestamp": 1485039600
  },
  {
    "username": "blu_in_green",
    "rating": 1.0,
    "comment": "Far too long for what it is. Replaced entirely by Mission: Red Planet. I hope not to play this again.",
    "timestamp": 1469570400
  },
  {
    "username": "ampoliros",
    "rating": 1.0,
    "comment": "Random 'take that', wtf???",
    "timestamp": 1454367600
  },
  {
    "username": "Bodo",
    "rating": 1.0,
    "comment": "This rating is for all the same previously stated reasons of those who gave it a 2; but they were way too kind and generous !",
    "timestamp": 1436738400
  },
  {
    "username": "ringo84",
    "rating": 1.0,
    "comment": "Too long, too boring, too frustrating (assassin + thief combo; hooray!). I played this a few times and always had a bad time hoping this game to end soon (which it did not). My absolute least favorite game. The fact that this is not a trashy or a light-hearted game, in which you could have fun mocking the game or opponents, but that you just silently wait till everyone has picked their roles, makes it my absolutely least favorite game of all time!\n\nYes, this is a hater vote, 'cause I hate the game! (As much as you can \"hate\" an inanimate object that causes no physical harm )",
    "timestamp": 1408312800
  },
  {
    "username": "krakrs",
    "rating": 1.0,
    "comment": "This game can be a real hoot. And it can also be very long and boring, depending on who/how many you play with.\n\n06-04-2014 - Had the worst time in the entire recent memory of my stupid life playing this freaking game. I hope I never see it again. Sorry BGG rating system, it's not really the game's fault, but this sucker is a 1 now with no redemption possible. \"Yer dead ta me, boy. Yer more dead ta me than ya dead mudda\"",
    "timestamp": 1404856800
  },
  {
    "username": "dkearns",
    "rating": 1.0,
    "comment": "Yuck. Randomly pick a role from the random cards that are left. Hope the thief/assassain doesn't randomly pick the role you randomly picked. Pay for whatever building you happen to be able to afford. No possibility of long term planning and yet no real short term decisions to be made. This is an illusion of a game. Terrible with 6 or 7. I assume you must be able to make some actual relevant choices in a 3 or 4 player game but I'm afraid to try. People rate this highly; they are WRONG!!! UPDATE, didn't like 4 player either. I hate this game but lord knows I keep trying. BAD MEMORIES DOWNGRADE. I really don't think anyone could convince me to play this ever again. DOWNGRADE.",
    "timestamp": 1360969200
  },
  {
    "username": "SCOBYBryant",
    "rating": 1.0,
    "comment": "{ P - 5 [6] 7 }\n\nAnalysis of a Meaningful Decision in Citadels\n\nA card is burned. The King is looking at Assassin, Thief, Magician, King, Merchant, Architect, and Warlord.\n\nTHE KING\n\"Merchant is clearly the best card here. And I'm playing a Green. Nobody can refuse that money. So should I take Merchant? I dunno - the person who picks Assassin is likely to target the Merchant because he's so powerful. And the next guy knows I either have Bishop or Merchant. But maybe the next guy also knows that I know taking Merchant is extremely dangerous! So he'll figure Merchant was burned because there's no way I'd take something so risky! So I can take Merchant because he'll assassinate Bishop! But wait ... maybe HE KNOWS that I KNOW that he knows Merchant is risky! That means he'll choose to assassinate Merchant after all! ... ... ... In that case, what happens if I take Architect?\"\n\nFive minutes later.\n\nTHE KING\n\"Whatever, I'll just take Thief, which in retrospect is one of the most broken roles because you can name not Merchant or Architect and always succeed. Additionally, you force someone else to take Assassin and perform the communal necessity of naming Merchant or Architect.\"\n\nLAST PLAYER\n\"Hmm, Merchant or Architect? Merchant is more powerful, but more likely to be assassinated. So I'd better take Architect. But wait! What if the Assassin knows that I know--\"",
    "timestamp": 1323471600
  },
  {
    "username": "harmonicaman79",
    "rating": 1.0,
    "comment": "I. Hate. This. Game. Random, theme is pasted on, can't plan ahead...zzzzzzzzzzz. There's not much here besides player screwage.",
    "timestamp": 1311631200
  },
  {
    "username": "CortexBomb",
    "rating": 1.0,
    "comment": "What is with the hype on this one? The overall mechanisms of the game have promise, gold or cards, build buildings to make different roles better for you, usw; what it boils down to though, is a whole lot of punishment. You can't have a big hand or the magician will swap with you. You can't have a lot of gold, or the thief will hit you. You're in danger taking either of the better roles (Merchant and Architect) because the Assassin will be likely to hit you. And on, and on.\n\nMy A number one complaint with this game is that planning ahead is nigh impossible because of all the constant chaos that unfolds as the game progresses. I like a lot of the ideas that it has, but the reality of its implementation is just not to my tastes at all. The game presents the illusion of interesting choices (i.e.: I think I'll create card advantage by doing this) and then randomly punishes you and renders your planning useless. Funnily, games like Fluxx, which I consider about as random as this, are less offensive to me in the grand sense because at least Fluxx doesn't have the pretension of being a game where the decisions you make are all that important. Citadels does, and what it delivers is that much more annoying to me as a result. Quite easily my least favourite game put out by both HiG and European design firms in general.",
    "timestamp": 1288216800
  },
  {
    "username": "Datharaur",
    "rating": 1.0,
    "comment": "Good god. This isn't a game. This is torture.",
    "timestamp": 1234393200
  },
  {
    "username": "Septik",
    "rating": 1.0,
    "comment": "Kill kill steal zzzzzzzzzzzzzz",
    "timestamp": 1226185200
  },
  {
    "username": "Taxers",
    "rating": 1.0,
    "comment": "My experience with Citadels is surely described in Dante's Inferno - which I could have read during the downtime. We played with 8 players and through losing my turn on consecutive turns, I once went 45 minutes without doing anything. At the end of the game, the \"Dodge\" Diplomat character got to choose the winner among three suitors. Absolutely NO catch-up mechanism. I was out one hour into our three hour game and had to endure. No incentive to draw good characters, who are either bewitched or theived. No incentive to build good structures - which are theived or destroyed. I'm bringing a book to the next gaming session just in case this hits the table.\n\nAm I really ranking this below Candyland? You can play Candyland in less than 2 hours and the random nature of the game is more apparent.",
    "timestamp": 1112997600
  },
  {
    "username": "Ragnarok77",
    "rating": 1.0,
    "comment": "slow moving and frustrating...",
    "timestamp": 1101337200
  },
  {
    "username": "Randy Cox",
    "rating": 1.0,
    "comment": "Just plain horrible. Slow. We played with a bunch of people (was it 6? was it 7? I blotted it out of my mind). Every time someone got the hand of cards passed to them, they had to read the translation sheet to see what it meant. Every time. And then had to ponder the think/counterthink opportunities. It took forever. Dreadful. Dreadful.",
    "timestamp": 1078268400
  },
  {
    "username": "Pamponiros",
    "rating": 2.0,
    "comment": "The more players, the more annoying... It ruins friendships xD",
    "timestamp": 1758664800
  },
  {
    "username": "JoshuaStarr",
    "rating": 2.0,
    "comment": "A role selection game that has not stood the test of time. Game takes far too long for what it does.",
    "timestamp": 1750024800
  },
  {
    "username": "Oninohugo",
    "rating": 2.0,
    "comment": "You could technically skip your turn all game long for the rest of your life.",
    "timestamp": 1746828000
  },
  {
    "username": "arry1",
    "rating": 2.0,
    "comment": "When there far fewer games, this could take some space. But now I find it annoying with long downtime and the mechanic of random killing meaning for a large chunk of the game time you are not playing the game.",
    "timestamp": 1743202800
  },
  {
    "username": "BoardGamingCouple",
    "rating": 2.0,
    "comment": "2/5\n\ngood social deduction game. new version has better updates.",
    "timestamp": 1735254000
  },
  {
    "username": "BackIssueBacklog",
    "rating": 2.0,
    "comment": "Its fine. A slow playing group really bogs it down and makes it a huge bore.",
    "timestamp": 1730761200
  },
  {
    "username": "FreeArt",
    "rating": 2.0,
    "comment": "Too much downtime at high playercount.",
    "timestamp": 1711148400
  },
  {
    "username": "Smeef",
    "rating": 2.0,
    "comment": "Munchkin with hidden roles. OK for the first few minutes but quickly became the worst hour of my life as I was arbitrarily stolen from and assassinated 4 turns in a row despite having the least buildings in the group. I would rather do nothing than play this again",
    "timestamp": 1710716400
  },
  {
    "username": "janglemangle",
    "rating": 2.0,
    "comment": "slow",
    "timestamp": 1708988400
  },
  {
    "username": "robinplaysgames",
    "rating": 2.0,
    "comment": "Maybe the second edition has cleaned this one up a bit but the first edition egregiously dragged more than any other game I have ever played, while also being so full of luck it could make a leprechaun jealous.\n2/10",
    "timestamp": 1701817200
  },
  {
    "username": "duodora",
    "rating": 2.0,
    "comment": "Oof - not a fan of this one. I like the concept of drafting different characters, but it's too aggressive for my tastes, and the \"knock down the leader\" aspects of the game can make it last way too long.",
    "timestamp": 1691618400
  },
  {
    "username": "sashiuma",
    "rating": 2.1,
    "comment": "2.05",
    "timestamp": 1669849200
  },
  {
    "username": "Board_All_The_Time",
    "rating": 2.0,
    "comment": "The game is bloated, takes too long, and leads to too many fights. It feels like a hobby gamer version of the way non-gamers react to Monopoly.",
    "timestamp": 1661292000
  },
  {
    "username": "REINHARM",
    "rating": 2.0,
    "comment": "Ewww. Very boring, light game with random take that elements. I can't believe this game is a popular as it is. It's 20+ years old and it shows, there is no joy or challenge in that box. Hard pass.",
    "timestamp": 1654984800
  },
  {
    "username": "ianwright",
    "rating": 2.0,
    "comment": "Rating downgraded even more after the last play was even worse than I remembered. Annoying because it masquerades as a game that I might almost like (psychology, misdirection etc), but the choices are not at all interesting and you are just likely to get screwed over in the least fun way possible without anything you can do about it for turn after turn after turn. \"Poker with a theme\" this is not. Just awful.",
    "timestamp": 1647212400
  },
  {
    "username": "cinnzel",
    "rating": 2.0,
    "comment": "Me ha desilusionado muchísimo este juego. Tenía bastantes expectativas puestas en él por ser un clásico que aún se sigue reeditando, pero me ha resultado aburridísimo. Tiene un entreturno eterno y, además, cabe la posibilidad de quedarte sin jugar la ronda. Un suplicio.",
    "timestamp": 1630533600
  },
  {
    "username": "imaginarypet",
    "rating": 2.0,
    "comment": "Is it too early to call this game a classic? It's a game that got so many into board games but has unfortunately shown it's age. It takes too long for what it is while other hidden role games have done what Citadels has down but better. Nonetheless, still fun on occasion, however it's lost its charm when better games have taken its place",
    "timestamp": 1612393200
  },
  {
    "username": "John Rogers",
    "rating": 2.0,
    "comment": "Played this really early on in my gaming life. The hype then and now blows me away; what is so good about this game? It's basically a chaotic building game wherein your turn is based on picking the character the assassin won't kill.\n\nWIFE RATING - 6\n\nTraded for Boomtown.",
    "timestamp": 1585864800
  },
  {
    "username": "indra_minsk",
    "rating": 2.0,
    "comment": "a very boring game",
    "timestamp": 1579474800
  },
  {
    "username": "rajungamer",
    "rating": 2.0,
    "comment": "Boy did I despise this game.\nDid not find the character select interesting, and most of the characters as well.\nDidn't see much to the bluffing aspect that people talk about. The card drafting from a dwindling supply is different but doesn't salvage the game.\nMuch of the game is \"take that\" - but generally the \"take that\" misfires and hits the wrong target.\n\nMechanics are simple but doesn't give many decision points.",
    "timestamp": 1551481200
  },
  {
    "username": "ziph4",
    "rating": 2.0,
    "comment": "The games lasts as long as typical medium heavy euro game. The game is simply too long for what it is. The slow progress is baked into the game because of the character murdering, money stealing, card exchanging, and building destroying. The same mechanisms also give a feeling of lack of control. There are so many other shorter and far more fun games to play on the market, that this one is simply not worth considering.",
    "timestamp": 1546038000
  },
  {
    "username": "gatchaman",
    "rating": 2.0,
    "comment": "You can get stuck where you can literally NOT PLAY just by bad luck, if the Assassin keeps killing you. Even though he's probably trying to hit someone else by that point. A terrible game.",
    "timestamp": 1527890400
  },
  {
    "username": "kisonzo",
    "rating": 2.0,
    "comment": "This game depends entirely on the group. It fell flat the times I played it and ended up being one of the worst game experiences ever.",
    "timestamp": 1527112800
  },
  {
    "username": "DeeCeptor",
    "rating": 2.0,
    "comment": "This is the game about making people feel bad.\nThe idea of secretly picking roles is interesting, but the assassin makes somebody sit out for the whole round, and not playing sucks. Robbing people also makes them feel bad. When somebody gets hit you can see their face just droop, and that's not why I play games. It simply isn't fun, and games need to be fun.",
    "timestamp": 1517612400
  },
  {
    "username": "SunnyLife",
    "rating": 2.0,
    "comment": "I have only played this with 2 players. It would probably be better with more players, but with 2 it felt mean spirited.",
    "timestamp": 1516489200
  },
  {
    "username": "texasjdl",
    "rating": 2.0,
    "comment": "This is a reminder to myself to never play this again. Too much downtime, too much capricious \"take that,\" and the \"take that\" makes the game longer, too. No, never, please.",
    "timestamp": 1513206000
  },
  {
    "username": "Coralouwho",
    "rating": 3.0,
    "comment": "Print-n-play from Asmodee: https://print-and-play.asmodee.fun/citadels/\n\nhttps://print-and-play.asmodee.fun/files/citadels/citadels_d...\nhttps://print-and-play.asmodee.fun/files/citadels/citadels_d...\n\n#LetterC\n#Cities #Castles\n#BGA #Tutorial\n* See newer edition added to BGA",
    "timestamp": 1756936800
  },
  {
    "username": "Nodens",
    "rating": 3.0,
    "comment": "Every time I played it I thought: \"why is this so long?\"",
    "timestamp": 1753912800
  },
  {
    "username": "Etr1",
    "rating": 3.0,
    "comment": "Well, after many years this game came up from one of our favourtires to our bottom liked games... how could that happen? ////One of our favourites! It's fun with 2,3,4,5,6 and 7 players! We love to play in squad of 4 and 5. Everyone, even those who do not usually play any games - loves it.",
    "timestamp": 1749333600
  },
  {
    "username": "rauschpotato",
    "rating": 3.0,
    "comment": "Several plays, 4-7p:\nI didn't like this game back in the day, and I still don't. All of the decisions feel tedious or small. You can pick a role, get a few bucks, activate a power for a small reward, and build a building. I feel like there should be more excitement or power with each role, but it feels like we grind away until someone has their building points.\n\nOverall, I'm still bored by this game, but I enjoy Mission Red Planet, which is the same thing, but with area control and more interesting powers.",
    "timestamp": 1740524400
  },
  {
    "username": "Steve Be",
    "rating": 3.0,
    "comment": "Sort of game I enjoyed when I started gaming but now detest. Random play means you can spend an entire round doing nothing, and this just feels like a version of Munchkin. Pointless and unnecessary.",
    "timestamp": 1739401200
  },
  {
    "username": "truetrueevil",
    "rating": 3.0,
    "comment": "At its core not so bad a game. But personally I'm a vacuum for the assassin. Enough it's a group in Joke. And that's not all from making obvious plays.\nI've had two games where I have had my turn skipped 4+ times. Once in a row. And that's enough to make me a salty salty gamer and sucked a lot of the fun out of it.",
    "timestamp": 1736982000
  },
  {
    "username": "Cinning",
    "rating": 3.0,
    "comment": "Gets monotonous.",
    "timestamp": 1732402800
  },
  {
    "username": "arubioh",
    "rating": 3.0,
    "comment": "While there is something to the character drafting system, the rest of the game falls flat. The core gameplay of taking money and building districts is just boring, which is not something you want to be saying about a game where winning feels so random.\nThe feel-bad moments (getting assassinated) feel a lot worse than the good moments (uhh... stealing someone else's cards?) feel good.\n\nAnd 80+% of the time, you're just waiting for someone else's turn. This is a game that tricks you into playing with a high player count and then greatly overstays its welcome. Last couple times I played I regretted it before the first round was over.",
    "timestamp": 1726005600
  },
  {
    "username": "grasa_total",
    "rating": 3.0,
    "comment": "The secret role selection is an intriguing solution to the problem of game attacks feeling personal... you don't even know who you're attacking! You try, of course, but if you mean to attack someone and succeed, it's kinda their fault for being predictable. That's interesting!\n\nBut it still feels bad being kneecapped. And at 7p it took almost two hours. And tearing the leader down to prevent the game from ending is a dynamic I think gaming has outgrown. And and and. I hated it. I respect it a little, but I still hated it!\n\n[1 play]",
    "timestamp": 1717020000
  },
  {
    "username": "galaxyxy",
    "rating": 3.0,
    "comment": "Nov 2023: This is one of the oldest games in our collection (likely 2010 game). Husband is a big fan of Faidutti designs, especially the cheeky simultaneous play. The game is long though, for the end game trigger to be pulled at 8 buildings. I hate the 2 player game, because I am forced to play characters that I dislike, or I am suffering at the hand of characters that I dislike. I see the beauty of it but I feel like I'm getting punished for my choices. Game has not been played for a good 5 years but it is still sitting around. Box is mouldy and the components are being rehoused in another box.\nMay 2024: Finally convinced the husband to place this game in the sell pile. Sold end May 2024",
    "timestamp": 1716674400
  },
  {
    "username": "EmperorEternal",
    "rating": 3.0,
    "comment": "Have played around 6 times at varying player counts. Warlord and Assassin roles should not exist. The Warlord can be replaced with Diplomat, but Witch is just as bad as Assassin.",
    "timestamp": 1715378400
  },
  {
    "username": "TheFLGN",
    "rating": 3.0,
    "comment": "I have never had a game of this that has not dragged on far past the point of being fun. 20 minutes of fun in an hour or more of game.",
    "timestamp": 1703113200
  },
  {
    "username": "Kaithas",
    "rating": 3.0,
    "comment": "Unfortunately I don't think I've ever been so bored playing a game at 7 players.",
    "timestamp": 1702854000
  },
  {
    "username": "thebaysix",
    "rating": 3.0,
    "comment": "Finally got around to playing this a couple times with larger groups (at least 5 players) and it was a bit of a let down. Seems like it should have been great at those higher player counts but it just wasn't.\n\nThe core dilemma of the game is that you want to build valuable buildings but collecting lots of money means you are risking the thief stealing from you. And not only that, by having lots of money you draw attention to yourself, so you have to be extra sneaky in choosing a role.\n\nThis in an of itself is great. The problem is when the player count gets high, and therefore the interplay of roles is most interesting (since most roles are out there) you can often just get by on luck. And when you do get caught it really hurts. Almost certainly, a couple players get picked on our of sheer luck, and are totally taken out of the running through no fault of their own. This is one of my least favorite features of a game.\n\nThe basic mechanic has nice intrigue, but I view the thief/assassin as pretty fatal to the enjoyment of the game. The best games are the ones where fun is had by all and in this game you have the opposite: a near-guarantee that someone will not have any fun.",
    "timestamp": 1700780400
  },
  {
    "username": "Salvatortoise",
    "rating": 3.0,
    "comment": "I’ve only played this once (7 players) and had the unfortunate experience of being repeatedly assassinated, meaning that for about 30% of the time I literally sat there doing nothing while everyone else got to actually play the game. That’s a lousy design choice that just doesn’t belong in games anymore. Plus it is way too long for the type of game that it is. Woeful game and one that I’ll never play again.",
    "timestamp": 1700089200
  },
  {
    "username": "Jemaima",
    "rating": 3.0,
    "comment": "Мне вообще не понравилось. Играла на ироих. Наверное хорошо от большого количества игроков, но всё равно скучный геймплей.",
    "timestamp": 1698620400
  },
  {
    "username": "yolandavi",
    "rating": 3.0,
    "comment": "While the game is slow in person, I've been enjoying the PBEM version.\n\n**edit** PBEM? Well, it was fun back in the day. That's play by email if you didn't know. I doubt I'd enjoy playing this or any other game by email today.",
    "timestamp": 1694124000
  },
  {
    "username": "hiimjosh",
    "rating": 3.0,
    "comment": "So long and so freaking boring. I don't know why such a good core mechanic was put into such a bad game",
    "timestamp": 1691013600
  },
  {
    "username": "Iron_Salamander",
    "rating": 3.0,
    "comment": "Maybe it was who I played with, as the idea is intriguing, but my experience with this one was dreadful, where everyone at the table left annoyed or angry over it.",
    "timestamp": 1687298400
  },
  {
    "username": "omnitheus",
    "rating": 3.0,
    "comment": "10+ plays",
    "timestamp": 1683928800
  },
  {
    "username": "Lawster",
    "rating": 3.0,
    "comment": "Game takes too long for what it is. Would enjoy it more if it was a guaranteed 20 minute game.",
    "timestamp": 1679353200
  },
  {
    "username": "thelefty",
    "rating": 3.0,
    "comment": "Terrible with most groups (original version).",
    "timestamp": 1676156400
  },
  {
    "username": "discalceate",
    "rating": 3.0,
    "comment": "Chris Collection\n\nThis game had its time and place. That has since passed. Takes too long for what it is.",
    "timestamp": 1674774000
  },
  {
    "username": "kyhre",
    "rating": 3.0,
    "comment": "Played it twice in the the early 2000s; it dragged on and on and I found it quite boring; sold my copy. Realising it is regarded as a classic, I would be keen to play it with a group that values it just to see what the fuss is about, but I´m never going to set that up myself.",
    "timestamp": 1672786800
  },
  {
    "username": "Gendalm",
    "rating": 3.0,
    "comment": "Nice game but sometimes too long (mostly due to the phase of selection of the characters) for the fun it can offer. We found the Assassin unbalanced for a two players game so we replace it with the Witch from the expansion The Dark City.\n\nSold to Pelé Mele",
    "timestamp": 1672614000
  },
  {
    "username": "xoopams",
    "rating": 3.0,
    "comment": "Too long. To nasty. Not enough good choices.",
    "timestamp": 1669330800
  },
  {
    "username": "High_Hopes_NC",
    "rating": 4.0,
    "comment": "This is just terrible, I will never play this when love letter exists, quicker and with no unnecessary waste of time on euro mechanics that really don't belong.",
    "timestamp": 1751752800
  },
  {
    "username": "DanKill",
    "rating": 4.0,
    "comment": "Played a ton ages ago",
    "timestamp": 1742770800
  },
  {
    "username": "looleypalooley",
    "rating": 4.0,
    "comment": "Along with Bohnanza & The Resistance, one of the few games available for a larger group. But ...\n\nMore than average down-time when choosing roles, especially when played with more than 4 players. Also there is a clear pile-on-the-leader and king-making aspect to this game which can really piss people off.\n\nTTFN",
    "timestamp": 1742338800
  },
  {
    "username": "Pickto",
    "rating": 4.0,
    "comment": "2-8",
    "timestamp": 1742252400
  },
  {
    "username": "Noehg",
    "rating": 4.0,
    "comment": "Sanete",
    "timestamp": 1741388400
  },
  {
    "username": "wkover",
    "rating": 4.0,
    "comment": "I'd rather mash up a five-player game of Pit and a two-player game of Go than play a seven-player game of this again.\n\nIf you want to invent something that promotes listlessness and deep hurting, why not put effort into an honest-to-goodness physical torture device. At least you'd get a patent out of it, or something.",
    "timestamp": 1741302000
  },
  {
    "username": "thisted",
    "rating": 4.0,
    "comment": "Getting killed multiple times in a row sucks...",
    "timestamp": 1741215600
  },
  {
    "username": "TheDanielSan",
    "rating": 3.5,
    "comment": "Just not my type of game, way to slow and way to cheesy. Probably will not play this again.",
    "timestamp": 1736290800
  },
  {
    "username": "o0dano0o",
    "rating": 4.0,
    "comment": "Added on 20090716:\nI get antsy with the downtime during the role selection, at least with lots of players. Moving rating down a bit..\n==============\nGreat after dinner party game.",
    "timestamp": 1729461600
  },
  {
    "username": "MissP1ggy",
    "rating": 4.0,
    "comment": "Sold.\nCan be very mean.",
    "timestamp": 1722722400
  },
  {
    "username": "edosan",
    "rating": 4.0,
    "comment": "UPDATE: I'm sort of burned out on Citadels and it's one of the only games that everyone in our game group seems to have anyway. Traded.\n\nGood game, although a bit of the \"gang up on the frontrunner, let the guy in second cruise by for the win.\" The two-player variants are better than I originally thought. With too big a group, the game gets unwieldy though.\n\n(I honestly don't know how they got the \"20-40 minutes\" rating on the box though -- set aside at least an hour on this one)",
    "timestamp": 1721599200
  },
  {
    "username": "lee elektrik",
    "rating": 4.0,
    "comment": "Slightly better than its abominable follow-up Masquerade. However, takes about twice as long to play as would be fun. Unless all players stay highly focused constantly, this is really a drag to play (Surprise - players get bored and never do). Recommend playing another games with a similar role selection mechanism instead. Not Masquerade, however.",
    "timestamp": 1719871200
  },
  {
    "username": "Happymrdave",
    "rating": 3.5,
    "comment": "Although this is arguably the granddaddy of the whole role selection genre, it's feeling a little long in the tooth now. Can suffer from large amounts of downtime and the game claiming to support 6-8 players is more of a detriment than a benefit. At high player counts there is a *lot* of downtime and the amount of control anyone really has plummets quite greatly. Still decent with 4-5, but there are so many games for that player count that take about the same amount of time as this that I'm not sure I'd really pick it anymore.",
    "timestamp": 1717884000
  },
  {
    "username": "adi_venturer",
    "rating": 4.0,
    "comment": "There are better social deduction games out there.\n\n(Plays: 1)",
    "timestamp": 1695765600
  },
  {
    "username": "evenstar7",
    "rating": 4.2,
    "comment": "18年8月惠州双月湾旅行，5人、7人局。5人更佳。\n规则简单，细节少，方便推新。\n人物较平衡。但刺客、盗贼猜中角色自己的收益偏少。\n最后非常容易出现由不能胜利的人决定谁最终获胜的情况。",
    "timestamp": 1692136800
  },
  {
    "username": "NormandyWept",
    "rating": 4.0,
    "comment": "A mix of card-based set collection and a hidden role draft adding some interaction with plenty of bluffing. With a group that knows the rules well and can keep the game moving, there's a bit of fun to be had here, but I've played it too often with groups where most people are new and I think it's a bit rough in those situations.",
    "timestamp": 1688248800
  },
  {
    "username": "Fulminata",
    "rating": 4.0,
    "comment": "This is one of those rare games that is good both with two players and with many players. The mechanics of the game change slightly between games with 2 or 3 players and those with 4 or more. As a result, both are very interesting games to play and I'm looking forward to many more plays of this.\n\nOne thing about this game though, the time to play seems to be directly related to the number of players in the game. A two player game only takes 20 minutes or so, but a seven player game easily takes over an hour. In fact, 10 minutes per player is probably a good rule of thumb, longer if just learning the game.\n\nEdit: This was one of the first \"modern\" board games I played. I still enjoy it, but not quite as much as I did six years ago. Lowering the rating just a bit to reflect that.\n\nEdit: Lowering the rating further to reflect that the only reason I'd play this edition of the game is that it is the only edition we own. Would rather play the newer edition, but not enough to add it to our collection.",
    "timestamp": 1687903200
  },
  {
    "username": "MorelliBuendia",
    "rating": 4.0,
    "comment": "Reminds me of Splendor with hidden roles. Not my type of game and a bit too long for what it is, but more interesting than Splendor.",
    "timestamp": 1687039200
  },
  {
    "username": "rynelf",
    "rating": 3.5,
    "comment": "--Dec2003-- Don't really mind the random factor that some have complained about. Not too bad with 2, either. Fun, and not particularly serious: appropriate, given the author!\n--Oct2011-- After a few years of not playing, my view has changed. Today, it seems unfortunately capricious to the degree that I'd usually prefer to play something else. I enjoy the game for a half hour, after which the continued knocking down the leader begins to manifest as tedium.\n--Nov2014-- With the advent of あやつり殺人事件 (which takes the character selection mechanism of Citadels for something shorter and admittedly sillier) I find myself even less inclined to play.\n\n++ ~5 unlogged plays. ++",
    "timestamp": 1680559200
  },
  {
    "username": "lexen",
    "rating": 4.0,
    "comment": "good light game, i like 4P (enjoy 3P) but anything more than 5 is just a drag! it's a drag with slow players also!",
    "timestamp": 1680127200
  },
  {
    "username": "bainewedlock",
    "rating": 4.0,
    "comment": "Rating 4 = To someone with a simliar taste like me: Play this game if you don't have anything else to do.",
    "timestamp": 1679180400
  },
  {
    "username": "Cubesonamap",
    "rating": 4.0,
    "comment": "A very mediocre game that has it's moments. Takes forever to play though.",
    "timestamp": 1678316400
  },
  {
    "username": "Kaelistus",
    "rating": 4.0,
    "comment": "My pick if we have many players and not so much time.",
    "timestamp": 1675810800
  },
  {
    "username": "Kamaitatchi",
    "rating": 4.0,
    "comment": "Very good role selection/hidden role game. My experience with the game is limited so I don't know whether it holds up at all player counts though.",
    "timestamp": 1672182000
  },
  {
    "username": "Chuggas",
    "rating": 4.0,
    "comment": "Hidden role game which doesn't really mean much as the Merchant always seems to get killed by the Assassin. Decent game, but prefer straight up card drafting games like \"7 Wonders\" or \"Sushi Go\" as they are faster and more unpredictable.",
    "timestamp": 1671318000
  },
  {
    "username": "cosmolsmith",
    "rating": 4.0,
    "comment": "Always takes way longer than I expect.",
    "timestamp": 1670626800
  },
  {
    "username": "rkleopold",
    "rating": 5.0,
    "comment": "!!!!! Goes",
    "timestamp": 1760738400
  },
  {
    "username": "badassbr",
    "rating": 5.0,
    "comment": "Jogo aclamado pela crítica que nunca clicou com meu grupo\nNo fim preferimos algo parecido com Role Selection como Coup ou Love Letter que é muito mais rápido",
    "timestamp": 1760306400
  },
  {
    "username": "skaughty",
    "rating": 5.0,
    "comment": "Play time highly variable.",
    "timestamp": 1751925600
  },
  {
    "username": "dold_",
    "rating": 5.0,
    "comment": "Edit 6/2025: 7->5. I don't think I have the right group for this game. Feels slow while not actually being that long.\n----------------------------\nSuch a strange design. The cardplay part is borderline nonsense in how \"bleh\" it is, so to see how good the role selection part of the game had to be in order to make up for that is kinda astounding.\n\nCertainly feels like an early design, and doesn't always \"pop\", but I have a lot of respect for what is here. If I was going to \"improve\" a game, in my imaginary game design job, Citadels would be one I would love to make a spiritual successor to.",
    "timestamp": 1750197600
  },
  {
    "username": "goyacorl",
    "rating": 5.0,
    "comment": "+La Ciudad oscura",
    "timestamp": 1750024800
  },
  {
    "username": "CharlieMnemonic",
    "rating": 5.0,
    "comment": "Had it for a while but the rules seemed weird so never played.",
    "timestamp": 1748901600
  },
  {
    "username": "AdrianSantos0",
    "rating": 5.0,
    "comment": "Juego para perder amigos.",
    "timestamp": 1747260000
  },
  {
    "username": "Quantum Djinn",
    "rating": 5.0,
    "comment": "A lovely card game that I liked instantly. Lots of choice and some strategy, most definately improved with more players as I have found a two player game very unwieldy.",
    "timestamp": 1745704800
  },
  {
    "username": "Jayem",
    "rating": 5.0,
    "comment": "A modern classic that's fun and clever... until it isn't. This game shows its age, and by today's standards it's overloaded with negative player interaction. After losing your entire turn several times in a row – at the very least all of your money and/or cards – it's easy to see how this game becomes a slog of accepting random fates.",
    "timestamp": 1743890400
  },
  {
    "username": "cubntin",
    "rating": 5.0,
    "comment": "2-8 players",
    "timestamp": 1743289200
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "I always enjoy this game but I don't really get to play it very often.",
    "timestamp": 1740438000
  },
  {
    "username": "boardtemplar",
    "rating": 4.5,
    "comment": "Passable as mid complexity party game. High randomness and badly balanced.",
    "timestamp": 1738623600
  },
  {
    "username": "lennon90",
    "rating": 5.0,
    "comment": "NO TORNAR A COMPRAR!",
    "timestamp": 1737327600
  },
  {
    "username": "houm",
    "rating": 5.0,
    "comment": "Good game for family meetings where there's lot of people and you don't wanna spend half an hour explaining the rules. Simple, small and quite fun. Also drags forever with 8 players.",
    "timestamp": 1736809200
  },
  {
    "username": "_teece_",
    "rating": 5.0,
    "comment": "Perhaps there was too much randomness for me in a game that was supposed to be strategic. Or perhaps I am just very bad at it....",
    "timestamp": 1729980000
  },
  {
    "username": "a_traveler",
    "rating": 5.1,
    "comment": "Fun, easy game. Lots and lots of downtime, though. It's good fun to play mindgames with the role selection and targetting other roles, but the conclusion is always a bit of a letdown, not at all helped by the big bonus for the first person to build 8 buildings.\nNever sees the table anymore, as nowadays there are just much better games out there.",
    "timestamp": 1727820000
  },
  {
    "username": "hugh1a",
    "rating": 5.0,
    "comment": "Commercial Version\nDonated to local game cafe",
    "timestamp": 1726869600
  },
  {
    "username": "davidinlow",
    "rating": 5.0,
    "comment": "2",
    "timestamp": 1726869600
  },
  {
    "username": "invervegas",
    "rating": 5.0,
    "comment": "Complexity √ - At this moment in time, not really into the whole hidden role thing",
    "timestamp": 1724450400
  },
  {
    "username": "Ideology",
    "rating": 5.0,
    "comment": "Played twice before started tracking in BGG",
    "timestamp": 1724277600
  },
  {
    "username": "AFABBI",
    "rating": 5.0,
    "comment": "Classic Bruno Faidutti. Citadels isn't my favorite of Bruno's games, but it is still good. The premise is simple. Each round you secretly select a role to play in order to use its specific power to help yourself win the game. The ultimate goal is to build buildings with enough value to win. Of course sometimes this means murdering other players, making money, etc. artistically the game is quite easy on the eyes but it has a pretty absent theme.",
    "timestamp": 1724018400
  },
  {
    "username": "benjaminehlers1",
    "rating": 5.0,
    "comment": "I loved this one the first couple times I played, and then after that it felt very much the same each time... Grew boring quickly, but I'll still play occasionally if someone else has never played before. Also, this slows down drastically with more players, I wouldn't play with more than 4-5...",
    "timestamp": 1723845600
  },
  {
    "username": "filwi",
    "rating": 5.0,
    "comment": "Bit too slow and way too much social deduction for me.",
    "timestamp": 1722808800
  },
  {
    "username": "jubal1",
    "rating": 5.0,
    "comment": "8 Players",
    "timestamp": 1720994400
  },
  {
    "username": "lukedgh",
    "rating": 5.0,
    "comment": "pasado a Agus",
    "timestamp": 1720562400
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 5.0,
    "comment": "The shine is off this one. I've had fun with it, mostly 2-3 player. But I've moved on.",
    "timestamp": 1720476000
  },
  {
    "username": "grimbo",
    "rating": 5.0,
    "comment": "A bit too much luck",
    "timestamp": 1718575200
  },
  {
    "username": "emily84",
    "rating": 5.0,
    "comment": "Hard to play this game with any sorts of tactics.",
    "timestamp": 1716328800
  },
  {
    "username": "Oezz",
    "rating": 5.0,
    "comment": "Solid gateway game, a fair amount of chaos mixed with a splash of strategy. Usually good for a couple of outrageous moments each play. However towards the end it devolves a bit into bash the leader, although it ends fairly quickly. Can feel frusturating to be killed by the assassin multiple times.",
    "timestamp": 1714946400
  },
  {
    "username": "Dessyreqt",
    "rating": 5.0,
    "comment": "Best at: 5 - Plays: 2-7",
    "timestamp": 1712613600
  },
  {
    "username": "mikerubens",
    "rating": 5.0,
    "comment": "5€",
    "timestamp": 1710716400
  },
  {
    "username": "Stas",
    "rating": 5.0,
    "comment": "I like the concept of this game and the design, but I'm not sure that I have the right game group for it.\n\nToo long as written. Definitely requires a few house rules.\n\nLast played: June 2005",
    "timestamp": 1710630000
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "Quick to learn, quick to play and fun enough. There's something here which rubs me the wrong way, but can't figure out what it is, and it's not unique nor interesting enough for me to want to find out.\n\nRating: \nNumber of players:\n5~6\n2~3\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "mcrstar",
    "rating": 5.0,
    "comment": "Думал будет дерьмо, а оказалась ничего. Напомнило мафию, но в хорошем смысле. Хотел бы сыграть большой компанией, интересно что выйдет.",
    "timestamp": 1708815600
  },
  {
    "username": "jkach91",
    "rating": 5.0,
    "comment": "Enjoyed it a lot when I first got it but I think the game runs a little long.",
    "timestamp": 1705705200
  },
  {
    "username": "xbluejayx",
    "rating": 5.0,
    "comment": "Great game. The original game still surpasses the newer release with extra jobs & etc. However, Citadels gameplay can lag if other players are not feeling the competitive essence of this game.",
    "timestamp": 1700434800
  },
  {
    "username": "ColinONeill",
    "rating": 5.0,
    "comment": "Easy to learn, fun to play.",
    "timestamp": 1699916400
  },
  {
    "username": "cicerunner",
    "rating": 5.0,
    "comment": "Quick first rating - in November 2023 - based on recalled experience/impressions.\n\n(first play December 2021)",
    "timestamp": 1699138800
  },
  {
    "username": "Valza92",
    "rating": 5.0,
    "comment": "Easy to prepare, hard to enjoy",
    "timestamp": 1698793200
  },
  {
    "username": "bomberleung",
    "rating": 5.3,
    "comment": "Set Collection",
    "timestamp": 1696888800
  },
  {
    "username": "Educatedguess",
    "rating": 5.0,
    "comment": "The character distribution system is the best thing about this game, the building phase is rather simple and unremarkable. With more than four players it becomes really slow and tedious, because you have to wait until everybody has chosen a character to finally start the round, and choosing the right character can take a while as you have to think about the character everyone else may have picked. There are better, faster games for 5-7 people, such as 7 Wonders or Between two cities. Vaalbara is quite similar and clearly improved on the formula.",
    "timestamp": 1696111200
  },
  {
    "username": "Misiodziej",
    "rating": 5.0,
    "comment": "x",
    "timestamp": 1695765600
  },
  {
    "username": "jtakagi",
    "rating": 5.0,
    "comment": "Fun as long as it doesn't drag out too long. I like the character selection mechanic, and I can see how the thief/assassin can be annoying. But as long as the game moves along quickly, I really enjoy it. If given a choice, I would probably choose Fist of Dragonstones or Mission: Red Planet over this one, though they are not all that similar.",
    "timestamp": 1695074400
  },
  {
    "username": "thebillyj",
    "rating": 5.0,
    "comment": "Got me into card drafting but my opinion of it has dropped off, I feel it takes far too long for what it is and I nearly always want to throw in a different role to mix things up.",
    "timestamp": 1692050400
  },
  {
    "username": "GemTimeGames",
    "rating": 5.0,
    "comment": "I would love to rate this higher, as it is so close to being great. There are fun mind games and the decisions are meaningful, yet simple. The game also prevents leader-bashing since you normally target characters instead of players... all except for the warlord.\n\nThe warlord ruins this game and turns it into a 2 hour-long leader-bashing slough that lasts far too long for what the game is.",
    "timestamp": 1690149600
  },
  {
    "username": "Zepheus",
    "rating": 5.3,
    "comment": "Citadels takes role selection and variable player order and simplifies gameplay down to its most essential elements. It's all about trying to figure out what your opponents picked and either targeting them or avoiding their wrath. Not a bad game, but maybe too light for those looking for something strategic.",
    "timestamp": 1688508000
  },
  {
    "username": "RandaPrince",
    "rating": 5.0,
    "comment": "Played on a friend's copy. It's OK.",
    "timestamp": 1687125600
  },
  {
    "username": "kurabiye",
    "rating": 5.0,
    "comment": "SciLifeLab Pub",
    "timestamp": 1687125600
  },
  {
    "username": "TyDeL",
    "rating": 4.5,
    "comment": "Got a chance to play this old classic. Was fun, I enjoyed it, but it's age shows with how long the game takes for such little content. The game feels like it should take a third as long as it does.",
    "timestamp": 1686866400
  },
  {
    "username": "Ranior",
    "rating": 5.0,
    "comment": "Played a few times. Meh to me. Nothing special really going on, don't really get a lot of enjoyment out of this one.\n\nIt's also annoying that you can just lose a turn or two and pretty much be irreparably behind, as well as luck of the draw impacting the ability to build things that work well. Overall it's a very meh game that I rarely play for that reason.",
    "timestamp": 1685484000
  },
  {
    "username": "sykano",
    "rating": 5.4,
    "comment": "+ interesting idea of drafting roles that interact with each other\n- a bit too simple in structure\n- artworks",
    "timestamp": 1684101600
  },
  {
    "username": "verandi",
    "rating": 5.0,
    "comment": "I haven't played much, but it seems to me that the flaw with this game is that it can't decide how serious it wants to be, which is a typical flaw in Faidutti games. There are ostensibly strategic options to pursue, but chaos overrides these in an obnoxious way, but taken as a casual game of sorts it isn't exciting enough (to me).",
    "timestamp": 1677538800
  },
  {
    "username": "frankqb",
    "rating": 6.0,
    "comment": "Not bad at all, but never rushing out to get it.",
    "timestamp": 1760824800
  },
  {
    "username": "armouryfriends",
    "rating": 6.0,
    "comment": "* Michael",
    "timestamp": 1760479200
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "Solomodes:\n\nhttps://www.boardgamegeek.com/thread/2556752/article/3647230...\n\nhttps://boardgamegeek.com/thread/122393\n\nhttps://boardgamegeek.com/thread/109584/citadels-1-player-ru...\n\nhttps://boardgamegeek.com/filepage/216033/2020-solomode-cita...\n\nhttps://boardgamegeek.com/filepage/203412/citadels-solo-rule...\n\nhttps://boardgamegeek.com/filepage/181948/citadels-automa-so...\n\nhttps://boardgamegeek.com/thread/2773939/citadels-solo-varia...\n\nIt's just okay.",
    "timestamp": 1759874400
  },
  {
    "username": "DiceLord",
    "rating": 6.0,
    "comment": "Board game",
    "timestamp": 1759874400
  },
  {
    "username": "danperrault",
    "rating": 6.0,
    "comment": "Good old standby. Sometimes it plays just a little too long.",
    "timestamp": 1759788000
  },
  {
    "username": "mondauge",
    "rating": 6.0,
    "comment": "A good group game/activity when we are many, but otherwise not something to go for. Can feel terribly random, especially if some do not pay attention.",
    "timestamp": 1759442400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "In some ways, it feels like a more interactive Puerto Rico (or maybe San Juan, as they are both card games...). There's some great take-that moments, but the game is both overly-arbitrary and overly-long. Fun for the occasional game, but not my go to for role-selection.",
    "timestamp": 1759269600
  },
  {
    "username": "mhinto",
    "rating": 6.0,
    "comment": "2-7 players.",
    "timestamp": 1759096800
  },
  {
    "username": "rogedavi",
    "rating": 6.0,
    "comment": "Good family game of bluffs and double bluffs. Basically its yomi in a box.",
    "timestamp": 1758319200
  },
  {
    "username": "fuzzyfox",
    "rating": 6.4,
    "comment": "At 2 players this is a really tense game, you better have a good pokerface.",
    "timestamp": 1757973600
  },
  {
    "username": "kmaho",
    "rating": 6.0,
    "comment": "FFG edition that includes Dark City expansion",
    "timestamp": 1757887200
  },
  {
    "username": "discordass",
    "rating": 6.0,
    "comment": "Verkocht Rommelmarkt kattenberg 2025?",
    "timestamp": 1757800800
  },
  {
    "username": "MaaloxVoltaren",
    "rating": 6.0,
    "comment": "Owned by Gianluca\nToo long, same problem as Munchkin: take that and bashing the leader which leads to games too long",
    "timestamp": 1757368800
  },
  {
    "username": "kimmo_juhani_makinen",
    "rating": 6.0,
    "comment": "A quick-to-play simple card game with emphasis on how you read the intentions of other players. Doesn't really work that well with lower player counts but tends to be lots of simple fun with five or more players simultaneously trying to figure out the intentions of those around them.",
    "timestamp": 1757196000
  },
  {
    "username": "trilamb",
    "rating": 6.0,
    "comment": "GIVE AWAY",
    "timestamp": 1755468000
  },
  {
    "username": "Zozobaltazar",
    "rating": 6.0,
    "comment": "Sukhy 6.5",
    "timestamp": 1755208800
  },
  {
    "username": "bamftw",
    "rating": 6.0,
    "comment": "#Emy",
    "timestamp": 1754604000
  },
  {
    "username": "byrec",
    "rating": 6.0,
    "comment": "Played several times. Good secret role game that really affects the main objective of building the citadel.",
    "timestamp": 1754172000
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "Engine-building with a chaotic and backstabby touch, which is neat and cute. I don't mind that players can repeatedly miss turns and that it is a bit confrontational, but it just tends to take too long.",
    "timestamp": 1753999200
  },
  {
    "username": "Ciffy",
    "rating": 6.0,
    "comment": "Needs a good number of players to be good.",
    "timestamp": 1752184800
  },
  {
    "username": "Madmadnezz",
    "rating": 6.0,
    "comment": "It's good with 6 or more players",
    "timestamp": 1751407200
  },
  {
    "username": "jonnyalpha",
    "rating": 5.5,
    "comment": "Divider Kallax 4E",
    "timestamp": 1751320800
  },
  {
    "username": "Twel001",
    "rating": 6.4,
    "comment": "A mean pretty much role drafting game. Its still fun though. Gotta drop the end game to seven buildings or it is just too long.",
    "timestamp": 1750802400
  },
  {
    "username": "artman_russian",
    "rating": 6.0,
    "comment": "3 партии с 2023 года\n\nРаньше была оценка 8, по результатам 30+ партий, до 2012 года.",
    "timestamp": 1750284000
  },
  {
    "username": "retro_luv",
    "rating": 6.0,
    "comment": "5",
    "timestamp": 1750284000
  },
  {
    "username": "belespe",
    "rating": 6.0,
    "comment": "Good classic for a reason, just have so many other games I enjoy more now. Still nostalgic!",
    "timestamp": 1749333600
  },
  {
    "username": "Yokiboy",
    "rating": 6.0,
    "comment": "Citadels is a very cool role selection game, in which roles are selected in secrecy, with some being removed each round at random, leading to a fantastic double-bluffing element and lots of \"well I can clearly not drink the wine in front of you\" lines of thinking.\n\nThe theme is city building in a medieval-like fantasy setting, and it has very good components for a card game. I also love the old Silver Line boxes.",
    "timestamp": 1749074400
  },
  {
    "username": "Deltonbrack",
    "rating": 6.0,
    "comment": "Update: Selling it. Just not One that I find wanting to play.\n\nThe original liars game. Good game, I like the role selection aspect. Can be there for a lot of thought.",
    "timestamp": 1748901600
  },
  {
    "username": "Barbarrodja",
    "rating": 6.0,
    "comment": "Esta bien, pero demasiado simple y no consigue que te metas en el juego.",
    "timestamp": 1747864800
  },
  {
    "username": "Col Hogan",
    "rating": 5.5,
    "comment": "2 - 8 players",
    "timestamp": 1745618400
  },
  {
    "username": "gyroscope1045",
    "rating": 6.0,
    "comment": "Sleeved",
    "timestamp": 1745359200
  },
  {
    "username": "tommaas616",
    "rating": 6.0,
    "comment": "Needs at least four players to make it interesting",
    "timestamp": 1744754400
  },
  {
    "username": "aetwitch",
    "rating": 6.0,
    "comment": "I've found just about anybody can pick this one up and get into this. Just don't play with more than 5 because then the downtime is too long.",
    "timestamp": 1744236000
  },
  {
    "username": "Salvinha_vlc",
    "rating": 6.1,
    "comment": "It can be quite mean. I have had nice and awful experiences playing it.",
    "timestamp": 1744149600
  },
  {
    "username": "Meeple_Mike",
    "rating": 6.0,
    "comment": "Very simple bluffing and deduction game. Wish there was a bit more kick to it",
    "timestamp": 1743976800
  },
  {
    "username": "neXusUmpra",
    "rating": 6.0,
    "comment": "Machiavelli",
    "timestamp": 1743976800
  },
  {
    "username": "Wiplash",
    "rating": 6.0,
    "comment": "Hobby World",
    "timestamp": 1742857200
  },
  {
    "username": "MohammadKamyabi",
    "rating": 6.0,
    "comment": "the new version is much better",
    "timestamp": 1742598000
  },
  {
    "username": "glabberfasted",
    "rating": 6.0,
    "comment": "Everybody has this...",
    "timestamp": 1742425200
  },
  {
    "username": "queerchameleon",
    "rating": 6.0,
    "comment": "sleeved",
    "timestamp": 1742079600
  },
  {
    "username": "geoffder",
    "rating": 6.0,
    "comment": "It has been a long time since I played, but my copy got quite a lot of use in my previous life of gaming more frequently. I definitely had some exciting rounds, but I think my memories are a bit soured by too many high player count rounds that resulted from grabbing the box that could account for too many people showing up. It can feel like ages between turns, particularly if you miss out on rounds by being dead. Maybe revisiting it with more appropriate counts will raise my score, but I'm not itching to table it over other games that I'd love to play more of.",
    "timestamp": 1741906800
  },
  {
    "username": "Ramavoir",
    "rating": 6.0,
    "comment": "4-6 (5)",
    "timestamp": 1741129200
  },
  {
    "username": "tayl0496",
    "rating": 6.0,
    "comment": "An interesting twist on hidden role games. Combines it with a small tableau and city building mechanic. Runs just a bit long for what it is.",
    "timestamp": 1739660400
  },
  {
    "username": "izarum",
    "rating": 6.0,
    "comment": "SP - Spanish version",
    "timestamp": 1739660400
  },
  {
    "username": "WebKoala",
    "rating": 6.0,
    "comment": "One of my first games and really helped me down the dark path of becoming a gamer \n\nI generally like Faidutti games and this one is great!\n\nHowever, play this only with 4-5 players or very fast players, otherwise the downtime can be too big...",
    "timestamp": 1739574000
  },
  {
    "username": "PauloSantoro",
    "rating": 6.0,
    "comment": "",
    "timestamp": 1739314800
  },
  {
    "username": "juanodark",
    "rating": 6.0,
    "comment": "10",
    "timestamp": 1739055600
  },
  {
    "username": "Tina_T",
    "rating": 6.0,
    "comment": "2025.\nQuite fun but takes a bit too long.\n\nRated after fewer than 3 games.",
    "timestamp": 1738278000
  },
  {
    "username": "FamilyGamer20",
    "rating": 6.0,
    "comment": "Received as a birthday gift ~2014. Decent little game, although teaching the roles can take a minute. Not a regular game at the table.",
    "timestamp": 1738105200
  },
  {
    "username": "Dave Davies",
    "rating": 6.0,
    "comment": "A fun strategic card game with decisions and intrigue. It can be a little slow as people labor through chosing their character.",
    "timestamp": 1738018800
  },
  {
    "username": "Hpsun",
    "rating": 6.0,
    "comment": "Too long, overstays its welcome",
    "timestamp": 1738018800
  },
  {
    "username": "runarm",
    "rating": 6.0,
    "comment": "Unchanged rating Feb 2021: 6\nCollection: B-Shelves",
    "timestamp": 1737586800
  },
  {
    "username": "Ravid_and_Mor_table",
    "rating": 6.5,
    "comment": "Best: 5\ncomplexity 2.05",
    "timestamp": 1760652000
  },
  {
    "username": "Technarius",
    "rating": 7.0,
    "comment": "Nice to have for casual party evening with 5-7 party guests, who are not into board games.",
    "timestamp": 1760565600
  },
  {
    "username": "regisburin",
    "rating": 7.0,
    "comment": "Seul jeu à rôle caché/bluff que j'aime bien... Construction de tableau",
    "timestamp": 1760479200
  },
  {
    "username": "SJS1971",
    "rating": 7.0,
    "comment": "Some really great mechanisms in this one. I generally don't like games with take that or that are chaotic. This is both, but one of the handful of games with these characteristics that I give a pass to. This edition has 3 sets of character cards, making it possible to play without the more frustrating ones.",
    "timestamp": 1760306400
  },
  {
    "username": "MoMahili",
    "rating": 7.0,
    "comment": "Sale",
    "timestamp": 1759874400
  },
  {
    "username": "slahti",
    "rating": 7.0,
    "comment": "Good game that starts to repeat itself too soon.",
    "timestamp": 1759528800
  },
  {
    "username": "Grantos",
    "rating": 7.3,
    "comment": "Includes expansion",
    "timestamp": 1758664800
  },
  {
    "username": "DarthHenryAllen",
    "rating": 7.0,
    "comment": "A classic game that I no longer own only because the newer edition includes everything needed to play the classic game, as well as two alternative characters for each role that are well considered and breath new variety and life into the game: https://boardgamegeek.com/boardgame/205398/citadels.\n\nI consider that the definitive edition now so I've transferred my play logs to that entry (since it's really an iteration/version of the same game).",
    "timestamp": 1758578400
  },
  {
    "username": "stofke",
    "rating": 7.0,
    "comment": "R010",
    "timestamp": 1758492000
  },
  {
    "username": "mjhm",
    "rating": 7.0,
    "comment": "in wpg",
    "timestamp": 1758319200
  },
  {
    "username": "PoisonJamUK",
    "rating": 6.5,
    "comment": "Solid and interesting game for higher player counts. It was a welcomed break from 7 Wonders, which I do rate higher but it suffers from its own success of being the go-to game in that niche.",
    "timestamp": 1758146400
  },
  {
    "username": "strayllama",
    "rating": 7.0,
    "comment": "Really enjoyed with only two or three as you get to play two characters",
    "timestamp": 1757800800
  },
  {
    "username": "slantysteve",
    "rating": 7.0,
    "comment": "Good party game-like. Hidden roles, city building for points",
    "timestamp": 1757541600
  },
  {
    "username": "daviwai",
    "rating": 7.0,
    "comment": "#areaprenotazione",
    "timestamp": 1756677600
  },
  {
    "username": "Shababalabada",
    "rating": 6.5,
    "comment": "Free (acquired 2025)",
    "timestamp": 1755813600
  },
  {
    "username": "haruyell",
    "rating": 7.0,
    "comment": "filler caja pequeña",
    "timestamp": 1755727200
  },
  {
    "username": "Jesenberg",
    "rating": 7.0,
    "comment": "B",
    "timestamp": 1755468000
  },
  {
    "username": "FeiJai24",
    "rating": 7.0,
    "comment": "Initially I thought this was a great little game for higher player counts but got fed up with the lack of variety in gameplay.",
    "timestamp": 1755208800
  },
  {
    "username": "PeterHendee",
    "rating": 6.5,
    "comment": "Removed in August 2025 game space purge.",
    "timestamp": 1755036000
  },
  {
    "username": "Yunow",
    "rating": 7.0,
    "comment": "Fede",
    "timestamp": 1754690400
  },
  {
    "username": "GamewalkerGX",
    "rating": 7.0,
    "comment": "Good simple game, pretty neat gateway into boardgames for new players",
    "timestamp": 1754604000
  },
  {
    "username": "Azacan1977",
    "rating": 7.0,
    "comment": "N.º Jugadores: Mejor 5 / OK 3-4-6-7",
    "timestamp": 1753999200
  },
  {
    "username": "MaelDassonville",
    "rating": 7.0,
    "comment": "Jeu très fort thématiquement. Plus sympa a 4 ou +",
    "timestamp": 1753653600
  },
  {
    "username": "Oliksandra",
    "rating": 7.0,
    "comment": "Really good and not too difficult for a big company. Also played for 3 ppl, but not so funny and everybody has to choose 2 roles each round, so it was not so smooth. Beter for 4+",
    "timestamp": 1752962400
  },
  {
    "username": "Rabo",
    "rating": 7.0,
    "comment": "B",
    "timestamp": 1752876000
  },
  {
    "username": "LunaFate",
    "rating": 6.9,
    "comment": "Love this game so much but lately I feel that the line of playing process in Citadels is so broken and routine when other people have knowledge about characters roles and have a define experience in game.\nBut I still think that Citadels is a good start for beginners in hobby despite all other contemporary games on field of board game industry.",
    "timestamp": 1752789600
  },
  {
    "username": "DoomTurtle",
    "rating": 7.5,
    "comment": "Bought: September 2011\n5 - 12, L2\n\nMy Review: A Year With Citadels",
    "timestamp": 1760479200
  },
  {
    "username": "thierrydms",
    "rating": 8.0,
    "comment": "= Machiavelli",
    "timestamp": 1760047200
  },
  {
    "username": "vtopa",
    "rating": 7.5,
    "comment": "Great game even for beginners. Easy to understand the rules. Huge interaction between players and almost no random events. Doesn't take much surface, so may be played out of kitchen.",
    "timestamp": 1759615200
  },
  {
    "username": "fahr",
    "rating": 7.5,
    "comment": "I really enjoyed! With two players gets a kinda cool game, with 3 becomes great! With 6 is good too, but less strategic, I liked more with 3 people!",
    "timestamp": 1758924000
  },
  {
    "username": "wangwei726",
    "rating": 8.0,
    "comment": "最佳6人团战（3对3） 不想玩",
    "timestamp": 1758751200
  },
  {
    "username": "xSacred",
    "rating": 8.0,
    "comment": "24/09/2025 - 567",
    "timestamp": 1758664800
  },
  {
    "username": "shannyn_north",
    "rating": 8.0,
    "comment": "Sean N. 7.5\nIn some ways, it feels like a more interactive Puerto Rico (or maybe San Juan, as they are both card games...). There's some great take-that moments, but the game is both overly-arbitrary and overly-long. Fun for the occasional game, but not my go to for role-selection.",
    "timestamp": 1758232800
  },
  {
    "username": "miha_lis",
    "rating": 8.0,
    "comment": "2-7 игроков",
    "timestamp": 1758060000
  },
  {
    "username": "DSmitty",
    "rating": 8.0,
    "comment": "Modern classic. We've had so many good times with this game and find that it really opens up people's eyes to modern games if they've never played newer stuff. My brother has a newer version/printing, which I like better because the buildings have a little more variety. I do like my small box version though, because it's so portable. We often play to 7 buildings instead of 8 in order to shorten the game.",
    "timestamp": 1757628000
  },
  {
    "username": "albertrim",
    "rating": 7.7,
    "comment": "코보게 한글판, 2016.3 출판",
    "timestamp": 1757368800
  },
  {
    "username": "mamor52",
    "rating": 8.0,
    "comment": "♠ deduction draft",
    "timestamp": 1757023200
  },
  {
    "username": "revloc06",
    "rating": 7.8,
    "comment": "Most people know citadels for it's ability to have a lot of players (up to 8), but actually I think this game shines as a two player game with people of equal ability. It is ridiculous at how good the intrigue gets during these sessions (I say sessions instead of games because if you play this way you will want to play again and again and again...)",
    "timestamp": 1756504800
  },
  {
    "username": "Muppetus Galacticus",
    "rating": 8.0,
    "comment": "Archived",
    "timestamp": 1755900000
  },
  {
    "username": "pralat",
    "rating": 8.0,
    "comment": "A very good card game for a bigger party based on deception, plotting, bluffing.",
    "timestamp": 1755208800
  },
  {
    "username": "scrub",
    "rating": 8.0,
    "comment": "Seems fun. Need to play it again.",
    "timestamp": 1754863200
  },
  {
    "username": "mich4soft",
    "rating": 8.0,
    "comment": "The bluffing part is exciting. Sometimes this small-box game sparks with a lot of fun! But the players have to play fast to minimize downtime. Avoid playing with more than 5.(*Bluffing)",
    "timestamp": 1754604000
  },
  {
    "username": "Dzeimis",
    "rating": 8.0,
    "comment": "Easy to grasp the rules, requires some dedication to learn how to win",
    "timestamp": 1754517600
  },
  {
    "username": "Lauron The Dark Lady",
    "rating": 7.5,
    "comment": "De Fernando.",
    "timestamp": 1754344800
  },
  {
    "username": "mafkegel",
    "rating": 8.0,
    "comment": "Sleeved cards (FFG Clear Standard American Board Game Sleeves)",
    "timestamp": 1754258400
  },
  {
    "username": "antiussentiment",
    "rating": 8.0,
    "comment": "great game for a large group... can be a bit slow whith newbies as they try to work out the cards in the choose a character phase.. still one of my faves though..",
    "timestamp": 1753567200
  },
  {
    "username": "Xmanhk",
    "rating": 8.0,
    "comment": "Print and play demo",
    "timestamp": 1752962400
  },
  {
    "username": "midnightfaerie",
    "rating": 8.0,
    "comment": "2025",
    "timestamp": 1752962400
  },
  {
    "username": "tms1003",
    "rating": 7.5,
    "comment": "Pretty good game, I think we played it a little incorrectly the first time, but it was fun to try to be sneaky with your choices. I only played 3 player, so we each got two roles, but it'd be far more interesting with only one roll I think. With three players it was pretty easy to gang up on the person who was winning, which was frustrating, but typical of some games. It was a good time though and I would play again.",
    "timestamp": 1752098400
  },
  {
    "username": "TomaszP",
    "rating": 8.0,
    "comment": "This old version from 2000 looks better than the new versions. Gameplay the same. Very satysfying especially with more players.",
    "timestamp": 1751580000
  },
  {
    "username": "muncleuncle",
    "rating": 8.0,
    "comment": "2-8, Best: 5 / 20-60 min\n\nÀ-la-carte 2000 (BLEIBT!)\n\nSleeved\n\nIM SAUERLAND",
    "timestamp": 1751580000
  },
  {
    "username": "PSimone",
    "rating": 7.5,
    "comment": "This was my first and only game for two years. I played it with my two roommates almost daily and we were incredibly addicted.\n\nThe experience with three players of the same level is comparable (in my opinion, almost better) to 4p, and the game feels different because each of the three players plays two characters per turn.\n\n2p of the same level is a duel of minds that can be quite intense, and it can change depending on the opponent you're facing and how familiar you are with each other.\n\nSince then, I've played 2p to 7p occasionally.\n\n4-7p can be incredibly fun. Besides, since the basic dynamics are quickly grasped, with so many players, any prior experience you think you have with the game won't give you much of an advantage, even could be counter-productive.",
    "timestamp": 1750716000
  },
  {
    "username": "TrallaMcTralla",
    "rating": 9.0,
    "comment": "Really fun game. The ressource gathering/building can be basic nowadays but has a good balance with the roleplaying and to guess who-is-who.",
    "timestamp": 1759874400
  },
  {
    "username": "Godgaming",
    "rating": 9.0,
    "comment": "The drafting your character mechanic is very fun and the bluffing aspect make this game very enjoyable.",
    "timestamp": 1757887200
  },
  {
    "username": "eldergames",
    "rating": 9.0,
    "comment": "מתאים לעצמאים",
    "timestamp": 1757628000
  },
  {
    "username": "bngabletofly",
    "rating": 8.5,
    "comment": "Bought by SO February 2020, €17. Role selection. Although I usually do worse than him in predicting which role the other will select, I am increasingly appreciating this game for how fun the deduction is.",
    "timestamp": 1750629600
  },
  {
    "username": "zebracat",
    "rating": 9.0,
    "comment": "Nice game speed with even 8 players!\nsuper big replayability!\nCitadels is very exciting and intense, specially when the game is near to end.\nGreat interaction! Nice art.",
    "timestamp": 1748815200
  },
  {
    "username": "Maarten1998",
    "rating": 9.1,
    "comment": "Nice game with social deduction in it (often I do not like social deduction). Playing it with max player count takes a bit too long. The fun also depends on the group.",
    "timestamp": 1747432800
  },
  {
    "username": "Evertore",
    "rating": 9.0,
    "comment": "sleeved",
    "timestamp": 1745964000
  },
  {
    "username": "joshelliott1513",
    "rating": 8.5,
    "comment": "My go to card game for a mix between hidden roles, strategy, and fairly light. Top shelf game.",
    "timestamp": 1744063200
  },
  {
    "username": "robartin",
    "rating": 9.0,
    "comment": "A great little game. The cards and pieces are beautiful and it's fun and easy to play.",
    "timestamp": 1741993200
  },
  {
    "username": "Gvreerean",
    "rating": 9.0,
    "comment": "Оригинал",
    "timestamp": 1741042800
  },
  {
    "username": "hikurino",
    "rating": 9.0,
    "comment": "Because this is my gate way.\n\nObjective assessment is 7.",
    "timestamp": 1739401200
  },
  {
    "username": "Heltor25",
    "rating": 9.0,
    "comment": "2-7?",
    "timestamp": 1736809200
  },
  {
    "username": "hurles",
    "rating": 9.0,
    "comment": "Sunnyvale",
    "timestamp": 1735945200
  },
  {
    "username": "DodgerDoug",
    "rating": 8.5,
    "comment": "One of the original games that got me into the hobby. An evergreen.",
    "timestamp": 1735254000
  },
  {
    "username": "Korrun",
    "rating": 8.5,
    "comment": "Initial Rating (2022): 7.5\n\nNew rating is for 2-player. Fantastic dueling game. The balance between Assassin, Thief, Warlord, etc. seems perfectly balanced with only 2 players. The double think for the drafting is excellent.\n\nDon't like it with larger player counts. Takes too long and randomly losing your turn isn't fun.",
    "timestamp": 1734390000
  },
  {
    "username": "mathieulabelle73",
    "rating": 8.5,
    "comment": "Very good games, in a small box, could be played with a lot of people but would be tooo too too long for the depth of the game play.",
    "timestamp": 1734044400
  },
  {
    "username": "ousgg",
    "rating": 8.5,
    "comment": "There's something rather beautiful about Citadels. I don't know whether it's the bluff and backstabby elements; the strategic but not overpowering resource juggling; the simple economy; or having a King who will read out the character list as if he's introducing pro-wrestlers (thanks, Stu!), but there's no better time to be had for a table of 5-7 people. Easily explained to beginners (who will become cut-throat powermongers after the first half-dozen rounds) and perfectly enjoyable by seasoned gamers who know the cards and can speed a game through. Best of all with a dedicated group of Citadels-nuts who can indulge in devious groupthink.\n\nFaidutti has produced some first-class games, and a couple of absolute stinkers, but this is a work of genius.\n\nCheap  Quality\nAbstract  Themed\nLight  Heavy\nShallow Curve  Steep Curve\nElementary  Complex\nTactics  Strategy\nIntegrated  Artificial\nLuck  Skill\nActive  Passive\nShort  Long\nBest with 5",
    "timestamp": 1732662000
  },
  {
    "username": "Tenebreros",
    "rating": 9.0,
    "comment": "My most played game.",
    "timestamp": 1731106800
  },
  {
    "username": "zavijahbeta",
    "rating": 9.0,
    "comment": "I like it a lot, i have spent the most tense moments with this game. However I am tired to play it!!",
    "timestamp": 1730934000
  },
  {
    "username": "Samh7",
    "rating": 9.0,
    "comment": "Family- Strategy-City building-Mafia game- Thematic and historical- Buffing best: 4-7, it is good for 2 player",
    "timestamp": 1728597600
  },
  {
    "username": "amaizzza",
    "rating": 9.0,
    "comment": "Vendido",
    "timestamp": 1727388000
  },
  {
    "username": "symbioid",
    "rating": 8.6,
    "comment": "Very fun game - guessing the role's of your neighbors and trying to figure out what the best role is for you based on what you think your neighbor's have and what you have in your hand, and what's left as a choice for you to choose. Less complicated than I expected, but not as simple as something like For Sale. I dig it.",
    "timestamp": 1726956000
  },
  {
    "username": "lippo",
    "rating": 9.0,
    "comment": "Bruno Faidutti at his best! Chaos, luck, tactics, screwing opponents, bluff, secret powers. A masterpiece! Must be played in 4-6 players. Any other number, weakens the game.",
    "timestamp": 1726524000
  },
  {
    "username": "Douggy",
    "rating": 8.5,
    "comment": "Un jeu de cartes stratégiques qui s'emporte facilement et qui est facile à apprendre, mais difficile à maîtriser.\nIl est très satisfaisant de prévoir sa stratégie et de voir que celle-ci se déroule comme prévu. À l'inverse, il faut vite savoir s'adapter, si la stratégie qu'on pensait faire ne peut plus être mise en place, ce qui rend ce jeu très intéressant mentalement.\nC'est selon moi, un indispensable à avoir dans sa bibliothèque\nIl est aussi très intéressant de jouer avec les variant à deux ou trois joueurs pour avoir plus d'un seul rôle, ce qui change totalement les stratégies",
    "timestamp": 1725400800
  },
  {
    "username": "AnotherSwedishGuy",
    "rating": 9.0,
    "comment": "N.",
    "timestamp": 1725314400
  },
  {
    "username": "ramonruizf",
    "rating": 9.0,
    "comment": "Roles ocultos equilibrado, divertido y de mecánica sencilla. Muy divertido y bien ajustado a la variedad del numero de jugadores.",
    "timestamp": 1723759200
  },
  {
    "username": "ColineHeisse",
    "rating": 10.0,
    "comment": "Great to play when you travel !",
    "timestamp": 1755813600
  },
  {
    "username": "russellg",
    "rating": 10.0,
    "comment": "This is a perfect game for 5-6 players. Doesn't need any expansion or variants.",
    "timestamp": 1753135200
  },
  {
    "username": "Staban Tuek",
    "rating": 10.0,
    "comment": "After playing this game a few times I have revised my initial rating of it. I love the concept of the game but it can have a lot of down time with a large group (i.e. more than 4 people) particularly if some players are not familiar with the roles you can choose. Still, with a smaller group this is a good game with a good mix of luck, strategy, and player interaction.",
    "timestamp": 1752616800
  },
  {
    "username": "eldistopico",
    "rating": 9.5,
    "comment": "No puedo negar que le tengo un cariño especial y es, sin duda, uno de mis juegos preferidos, sobretodo para grupos grandes de 6-8 jugadores (no aconsejo jugar en grupos inferiores a 4-5 jugadores). En cada ronda elegiremos personaje e intentaremos construir nuestra ciudad, pero ojo, que los demás jugadores intentaran hacer lo mismo, y puede que lo hagan a tu costa. Muy divertido, táctico y variado, con interacción constante y muy mala leche. Puede parecer un filler por la caja pequeña, pero las partidas suelen ser largas y siempre hay complejidad.",
    "timestamp": 1752530400
  },
  {
    "username": "priestessjenna",
    "rating": 10.0,
    "comment": "The perfect quick pickup game for a group",
    "timestamp": 1751320800
  },
  {
    "username": "BlaAlla",
    "rating": 10.0,
    "comment": "Clever and simple, easy to teach, hard to master. Love the Mind game",
    "timestamp": 1743717600
  },
  {
    "username": "frankmal",
    "rating": 10.0,
    "comment": "An all time classic! Anyone can start playing this game in 5 minutes, and the mechanics are incredibly deep! I go back to this game all the time",
    "timestamp": 1740351600
  },
  {
    "username": "cotomel",
    "rating": 10.0,
    "comment": "Classic.",
    "timestamp": 1737673200
  },
  {
    "username": "ShiannLin",
    "rating": 10.0,
    "comment": "2000 Spiel des Jahres Nominee",
    "timestamp": 1735599600
  },
  {
    "username": "javicacheiro",
    "rating": 10.0,
    "comment": "Very fun!",
    "timestamp": 1735254000
  },
  {
    "username": "KA3KAP_UA",
    "rating": 10.0,
    "comment": "My first and one of my favorite games since being a teenager. It gave me many unforgettable impressions with its simple, and at the same time quite exciting gameplay, and helped to establish many pleasant and useful acquaintances. I recommend to try it at least once for everyone who hasn't tried yet. You will be delighted.",
    "timestamp": 1733958000
  },
  {
    "username": "nosferatumak",
    "rating": 10.0,
    "comment": "3-7, best 5",
    "timestamp": 1715119200
  },
  {
    "username": "jacksun007",
    "rating": 10.0,
    "comment": "Very good even for large groups of players!",
    "timestamp": 1714946400
  },
  {
    "username": "Thane13",
    "rating": 10.0,
    "comment": "NIS",
    "timestamp": 1711494000
  },
  {
    "username": "JESUSisCHRIST",
    "rating": 10.0,
    "comment": "10 modern classic\n\n\n7.5 really enjoy the game theory when I played 4players",
    "timestamp": 1708297200
  },
  {
    "username": "parallelpark4",
    "rating": 10.0,
    "comment": "Played this game for the better part of two decades now. I highly recommend this version, as I've heard the newer one is not as good (can't say if it's any different as I don't have it). Requested to bring at every game night. My top game of all time!",
    "timestamp": 1705100400
  },
  {
    "username": "WaPla",
    "rating": 10.0,
    "comment": "Want to outwit your friends? Do you like unmasking your adversaries, and building grand cities? Then this is the game for you! If you play with a veteran, the learning curve will become pretty clear. Choosing a character, reminding yourself of what characters are chosen, and keeping an eye on how much gold is in play... These are just a few of the determining factors that change your gameplay each round. The expansions add more variety and aren't a luxury if you want to keep the gameplay crisp.\n\nRemarks: the cards are susceptible to wear and tear after heavy use, so sleeving is advised. Try to avoid games where the murderer or the witch gets picked every round, this will only frustrate the table.\n\nOverall, great game!",
    "timestamp": 1700953200
  },
  {
    "username": "melent",
    "rating": 10.0,
    "comment": "Players: 8",
    "timestamp": 1699398000
  },
  {
    "username": "TOOMUCHGOOD",
    "rating": 10.0,
    "comment": "Love the idea that a lot of people can play this.",
    "timestamp": 1699052400
  },
  {
    "username": "misterbattleship",
    "rating": 9.5,
    "comment": "The original European version (published in 2000 as Ohne Furcht und Adel) only contained the basic eight roles (for up to seven players). When the American edition was published in 2002 it added both a ninth role to facilitate an eighth player, and an alternate role for each of those nine, a total of eighteen roles, only eight of which are in any game, (or nine for an eight player game). There were also two rule changes: a player could not have more than one identical district in their city, and if a player chooses the King and is assassinated they still get the Crown (albeit not until the end of the round).\n\nI don't understand why there aren't two different BoardGameGeek entries for these when there is a 2016 version of Citadels adding a third set of potential role that does get a separate BGG entry.\n\nThe other interesting difference between those two versions is that the plastic gold tokens in the initial version were replaced by cardboard tokens because the publishers were afraid a child could mistake the plastic ones for butterscotch candy and choke to death. I note that the \"butterscotch candy\" style gold pieces was restored in the 2016 reprint.\n\nBoardgamegeek now considers Citadels to be a \"card drafting\" game, but that term didn't exist when it was first published in 2000. The earliest game I consider to be \"card drafting\" is the 2004 game Fairy Tale, where all players draft concurrently. I believe the reason I don't think of Citadels as a drafting game is because players take turns choosing one role card from a shrinking set of role cards, and because it has so much more going on than just the drafting, the roles being drafted having so much variety to them.\n\nSome roles enhance the controlling player's ability to obtain more gold, and other roles hamper other players either directly, (Warlord), or indirectly as the controller of other roles, (Assassin, Thief). So one must choose a role that is profitable and doesn't attract the attention of the other roles that can cause harm.\n\nThe overall goal is to obtain the most victory points by using one's gold to purchase districts. The more expensive the district, the more victory points it gives.\n\nI think Citadels is best with more players, as then fewer roles are skipped each turn. With seven or eight players, the only skipped role is the one randomly and secretly removed each turn to make it harder to guess which role other players have chosen.",
    "timestamp": 1696284000
  },
  {
    "username": "Azeri1",
    "rating": 9.5,
    "comment": "Hiden roles",
    "timestamp": 1693346400
  },
  {
    "username": "Dellgadoe",
    "rating": 10.0,
    "comment": "Hard to get my hands on, but tons of fun. Not a quick game, but always a good one with the right group.",
    "timestamp": 1683583200
  },
  {
    "username": "vip_chicken",
    "rating": 10.0,
    "comment": "One of the earliest games that got me into the wider hobby. Always enjoyed it and it hasn't changed 20+ years later. I enjoy the bluffing/reading of other players with the character selection. Later editions of the game speed up gameplay and add more roles, which are fun to experiment with.",
    "timestamp": 1678057200
  },
  {
    "username": "Dmartynas",
    "rating": 10.0,
    "comment": "Amazing. So many joy!!!!",
    "timestamp": 1677106800
  },
  {
    "username": "JasonTatanka",
    "rating": 10.0,
    "comment": "One of my favourite games and is not expensive",
    "timestamp": 1673391600
  },
  {
    "username": "kitta2612",
    "rating": 10.0,
    "comment": "BED-2B-3F",
    "timestamp": 1671836400
  }
]