[
  {
    "username": "Engoduun",
    "rating": 1.0,
    "comment": "It's like indifference hitting your head with a hammer and you don't care... Still not sure what to think about this one.",
    "timestamp": 1645916400
  },
  {
    "username": "jerkman",
    "rating": 2.0,
    "comment": "By itself, it's not a bad game, it's simply no game for us - way too competitive and 'take that' for our flavor. You can trade in or buy for 10,- € plus portage.",
    "timestamp": 1757023200
  },
  {
    "username": "taragalinas",
    "rating": 3.0,
    "comment": "Sluggish, a never ending series of tedious negotiations and way too long.",
    "timestamp": 1693605600
  },
  {
    "username": "jatang",
    "rating": 4.0,
    "comment": "It has purple player pieces. Otherwise pass.",
    "timestamp": 1612652400
  },
  {
    "username": "warlock000",
    "rating": 5.0,
    "comment": "An oldschool design with a huge amount of player interaction. There are some interesting elements in this game, but the scoring system is a bit convoluted and the action selection takes far too long - the game is very heavy on negotiations and it just tends to drag.",
    "timestamp": 1747087200
  },
  {
    "username": "Takhyon",
    "rating": 5.0,
    "comment": "Re: \"Domaine\". Domaine, the more streamlined later iteration is fantastic, where as this is not very good. It's bizarre how different these two feel despite being so similar. What this original has going for is that it has better components and looks nicer, the colourful player pieces and black fences really pop against the mostly white map. Some of the scoring dynamics are also better, I kind of like how it encourages large areas instead of specific features, but would need more plays to confirm which is actually better. However the whole freaking bidding and negotiation shenanigans over the action card is absolutely dreadful. I hate negotiation anyway, but this is particularly egregious cause it grinds the flow of the game down to a halt and causes a lot of frustrating moments. Would never play this over Domaine.",
    "timestamp": 1727647200
  },
  {
    "username": "CarlosSpicyweener",
    "rating": 6.0,
    "comment": "-traded away in a MathTrade- and rebought\n\nCompared to Settlers of Catan (both from Klaus Teuber) Löwenherz always wins.\nI like the bidding mechanism that strongly limits your actions. In combination with the area control and the player interaction, it merges to good strategy game.\nA little worn out and replaced by newer heavier ones it still is a game I'd play from time to time.",
    "timestamp": 1760565600
  },
  {
    "username": "ytreka",
    "rating": 6.0,
    "comment": "Pontedera",
    "timestamp": 1753826400
  },
  {
    "username": "liketheboys",
    "rating": 7.0,
    "comment": "5/19/25: I'll keep this brief because we may have missed a rule or two.\n\nThe concept is appealing out the box. I think the negotiation is stricter than how we played it, but I didn't think we seriously damaged the game the way we played it. I was unimpressed by the political deck (in fact it gave me flashbacks to my Catan days with that annoying deck).\n\nWe had a player that scored a huge region on his turn. I wasn't paying attention to what was happening, but when it did, I realized we couldn't do much to hurt this player. Prolly mitigates kingmaking some, but it was frustrating to feel so helpless in this scenario.",
    "timestamp": 1747605600
  },
  {
    "username": "Technarius",
    "rating": 7.5,
    "comment": "Initial Impression after two 4 player games:\n\nPros:\n+ Pretty solid and overall streamlined area control game with auction and negotiation mechanics\n+ Replayability is high due to modular map and shuffled action card deck\n\nCons:\n- Outdated, old design and very thin layer of mechanics\n- Might feel repetitive after a while because the same mechanic is repeated over and over again\n- The Bonus Cards are very unbalanced - and this is IMHO the biggest problem of this game. The one who gets the first couple of cards will have a big advantage over other players. Everyone will try to get first cards, which will always result in \"conflicts\" with almost all players on table.\n- only for max. 4 players\n- Players are not fully in control of their situation and their actions. Luck and Kingmaking might be a thing here\n\nVerdict: I liked this game a lot, but I don't see playing it again, especially because there are soo many modern area control games with deeper gameplay, more replayability and less problematic mechanics.",
    "timestamp": 1760565600
  },
  {
    "username": "Creativenothing",
    "rating": 9.0,
    "comment": "To call the mechanic that runs Löwenherz economy \"auction/bidding\" does this game a massive disservice. There is a magical interplay between several mechanics here that is pure diabolical genius.\n\nNegotiations take place with the looming threat of it going to a sealed bid at any point. This means that players are not going into negotiations at an even power level, as one player will always have far more leverage if it goes to the sealed bid.\n\nThis is mixed with the values of these items in constant flux from the ever changing board state, with power determined by knights, borders, access to mines and controlled towns. Every decision players make here has potential immediate consequences. Territory expansion can't just randomly happen to you and players must carefully consider their opportune moments to defend or go on the offensive.\n\nMake no mistake about it, this is an extremely cut throat game in every possible aspect. If you play nice and fair, then you are the sheep for the slaughter. Good sportsmanship is a must have attribute to get the most out of this game. Löwenherz is a hidden gem, and I completely understand why Catan went mainstream and this didn't. Löwenherz is a gamers game.",
    "timestamp": 1760824800
  },
  {
    "username": "JamieRufe",
    "rating": 10.0,
    "comment": "Rating: Love\nRethemed PNP - Lowenherz...in Space!\n\nFirst Play Impressions\nMy group enjoyed our first play so much that we automatically re-racked and played a second time. Lowenherz has everything I love in multiplayer games - heavy interaction, table talk, negotiation and lots of fun. I can already tell Lowenherz is going to be a long-time favorite.",
    "timestamp": 1759615200
  }
]