[
  {
    "username": "asfhgwt",
    "rating": 1.0,
    "comment": "Flowless, boring, non-fun, overlong waste of time.",
    "timestamp": 1738882800
  },
  {
    "username": "atomiczap",
    "rating": 1.0,
    "comment": "Played GK 2-13-19",
    "timestamp": 1709506800
  },
  {
    "username": "Zanmor",
    "rating": 1.0,
    "comment": "just for show. use the 2019 edition for actual play",
    "timestamp": 1623880800
  },
  {
    "username": "5mokus",
    "rating": 1.0,
    "comment": "Tactical \"1\"\nThe new version is strictly better.",
    "timestamp": 1599688800
  },
  {
    "username": "jboy666",
    "rating": 1.0,
    "comment": "pnp",
    "timestamp": 1578006000
  },
  {
    "username": "Mattrick",
    "rating": 1.0,
    "comment": "Worst game ever.",
    "timestamp": 1469916000
  },
  {
    "username": "andersed",
    "rating": 1.0,
    "comment": "3 player doesn't work.",
    "timestamp": 1204844400
  },
  {
    "username": "dreadnaught",
    "rating": 2.0,
    "comment": "Didn't see the charm or the hype",
    "timestamp": 1558562400
  },
  {
    "username": "Boltana",
    "rating": 2.0,
    "comment": "Noticed in my second play through that recovering from an early battle loss is almost impossible. Without spice to afford Treachery cards your leaders will die in combat and feed additional spice to others.\n\nThis is compounded with the Fremen who do not have access to alternative means of getting spice. Once I lost an inital battle, all future spice blows were contested and without threachery cards I faced a losing battle till the end.",
    "timestamp": 1494540000
  },
  {
    "username": "kamixx",
    "rating": 2.0,
    "comment": "after lot of thoughts I must say I dislike this game. Everything is not completely bad and I like hidden combat but negative factors outweight it for me.\n\nFirst of all it plays quite long and second issue which is even more highlighted by long playing time is that I think some alliances are too powerfull (I mean those fractions which can read your combat plan - if there is alliance of Atreides and second reading side you are limited to decide very few things and this broke it for me). In such situation I knew that 80% of time I will loose combat and there is nothing I could do against that and it was too frustrating.",
    "timestamp": 1358636400
  },
  {
    "username": "kathench",
    "rating": 2.0,
    "comment": "In plastic bag, no box.",
    "timestamp": 1344549600
  },
  {
    "username": "TeknoMerk",
    "rating": 2.0,
    "comment": "An experience of misery for 4 hours (6-player game) with vague and convoluted rules, unbalanced economic rules that encourage turtling. The game has serious flow and mechanics problems.\n\nThe sad part is that I really wanted to like this game as it has some neat elements to reflect the books/movie. I like the asymmetrical faction abilities and start, the sand storm, Treachery and Traitor cards, the Spice Blow. The \"chrome\" is enjoyable, but the core game mechanics are frustrating. It's hard to build and conquer something.\n\nSummary: nice idea, poor design and execution.",
    "timestamp": 1340229600
  },
  {
    "username": "Black Sea",
    "rating": 2.0,
    "comment": "Didn't get this - almost not a game in my eyes!",
    "timestamp": 1324422000
  },
  {
    "username": "GSReis",
    "rating": 2.0,
    "comment": "It may have been good for the time it was published, but it has not aged well. Long, boring and incredibly random for a game without dice!\n\nFirst, you have a series of pointless card auctions where you don't know what you are buying (OK, the Atreides player can see the cards, but it would save a lot of time to allow players just to buy cards at a fixed price and let the Atreides draw two and keep one, for example).\n\nThen, most of the cards are used in combat to kill or defend leaders in a guessing way, with some blind bidding of troops occurring at the same time. The winner may have huge benefits and the loser is severely penalized. Just one or two losses may result in impossible recovery, making the player suffer through the rest of the game - and the playing time may vary immensely. Some cards can also cause huge swings of luck outside of combat, not to mention an absolutely ridiculous special power that allows the Bene Gesserit player to simply steal the victory by guessing the winner and the turn the game ends.\n\nThe fascinating universe of Frank Herbert's books and the rich implementation of the theme draw interest to the game, but do little to save it after the novelty goes off (after a few turns). And let's not even talk about production values.",
    "timestamp": 1306360800
  },
  {
    "username": "High Elf Andrew",
    "rating": 3.0,
    "comment": "Same as newer version",
    "timestamp": 1617573600
  },
  {
    "username": "HiTracey",
    "rating": 3.0,
    "comment": "You really have to be a fan of the turgid novel to get this turgid game, which probably isn't as bad as I'm making out. I quite like the turgid film, which may prompt me to another go.\n\nComplexity - 4/10",
    "timestamp": 1574722800
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "The theme of this game is really impressive. The design of the print and play version I had by Ilya Baranovsky is a sight to behold. The mechanics are so much smoother than it's child, Rex that it's not even funny. This game suffers a little bit from it's age. Lots of the battles wind up being harsher than they need to be thanks to betrayals. The economics are so tight that if you aren't a faction that gets money through the actions of the other factions, you can easily land yourself in an untenable situation. Battles are very costly, but the game gives you very little to do other than battle.\n\nThis game is so much player negotiation that despite it being a really cool game, it was completely incompatible with my group.",
    "timestamp": 1574204400
  },
  {
    "username": "tempar",
    "rating": 3.0,
    "comment": "Didn't play, too long",
    "timestamp": 1487631600
  },
  {
    "username": "RodZ",
    "rating": 3.0,
    "comment": "Old and Tired....",
    "timestamp": 1399240800
  },
  {
    "username": "B_Moores",
    "rating": 3.0,
    "comment": "Far too much down time and so few options.",
    "timestamp": 1354057200
  },
  {
    "username": "alfredo lorente",
    "rating": 3.0,
    "comment": "At least the new FFG edition, while very pretty, left me cold. The asymmetrical nature of the game means a steeper learning curve, and it is a game that has to be played with people at the same experience level.\n\nBut those spaceships... God, they are a beauty!",
    "timestamp": 1341784800
  },
  {
    "username": "DONALD65",
    "rating": 4.0,
    "comment": "Has some awkward rules that could have been better developed. Game play depends heavily on players attitude about the book. Have played with people who did not appreciate the book and respect the game. Also played with fanatical fans who play almost to the faction resulting in poor decision making and thus impacting game play.",
    "timestamp": 1742338800
  },
  {
    "username": "joeofthetimelords",
    "rating": 4.0,
    "comment": "Perhaps if you really like Dune this will replicate the experience of that - but this is just not good at a fundamental level. It's close, but every mechanic is just a little bit outdated, which comes together into an incredibly long, clunky and unbalanced mess.\n\nStill very impressive for its time, but a new edition really needs some actual revisions in order to justify being played - it's very reminiscent of the awful games parents speak of from their youth, which take 5 hours, are incredibly rules-dense for seemingly no payoff, and just end in a drawn-out anticlimax (that is, everyone gets bored and just lets someone win a few combats)",
    "timestamp": 1705186800
  },
  {
    "username": "verdunjp",
    "rating": 4.0,
    "comment": "In my opinion, you must be an amateur of the fantastic world of DUNE to like the game. If not, you will probably be disappointed like me. One bad action can put you out of the game. In addition, the chart and the components are not attractive.",
    "timestamp": 1641769200
  },
  {
    "username": "Yttrenolv",
    "rating": 4.0,
    "comment": "Very long game. Old school feel, and will probably not be played again any time soon. The board is god-awful even bearing in mind the game's age. I liked the mechanisms and the flavour is just unmatched. But too heavy in terms of gameplay and messy for me. Very AP-prone, very slow game flow. A relic of the past.",
    "timestamp": 1585263600
  },
  {
    "username": "plysbjorn",
    "rating": 4.0,
    "comment": "Only played it once and that time one player threw the game because he just wanted too prove that a game where one player can hand the victory to another player if he decides to must be a sucky game. Well, that particular game definitely sucked.\n\n*Update* Just got to play this again. While I can see the game's charm and respect the design, I feel the problems outweigh the fun: the components are horribly dated, the playing time fluctuates wildly, the limited resources allows no sense of build up, just biding time like some scorpion (just hoping that it's not your own neck you're stinging when you decide to strike).",
    "timestamp": 1584918000
  },
  {
    "username": "abdiel",
    "rating": 4.0,
    "comment": "Dune is basically just an inferior Cosmic Encounter knock off with some really good ideas. It's inferior because the added complexity distracts from the player interaction. You spend more time fiddling with rules than playing your opponents.\n\nI love the process of bidding for cards--only some players know what everyone is actually bidding for. The combat resolution, including possible traitors, is fantastic. Someone should steal this idea. Bizarrely and unforgivably the combat resolution was modified when FFG publish its Dune knock-off Rex.\n\nSuperficially it captures the feeling of the book it's based on. This feeling goes away after a few plays when the CE internals start to manifest in a gamey and un-Dune like fashion. In the end the great ideas are wasted on a game that is too much limited by the source material and its similarity to CE. If you want Dune, read the book. If you want a good game of shifting alliances, play CE. Dune the board game functions best as a novelty collectible.",
    "timestamp": 1579647600
  },
  {
    "username": "candoo",
    "rating": 4.0,
    "comment": "First play in May 2019 (before the re-release), this rated from that perspective:\n\nA grail game first played 40 years after its initial publication.\nI can appreciate how innovative it was in its day. The faction asymmetry would have been off the charts at that time. But all the mechanics and elements have since been redone hundreds of times, and there are now many better choices than Dune.\nIt’s aged well enough that it’s still decent in 2019, but I don’t see revisiting this.\n\nBased on one 4 player game:\nIt’s a grind to have 4 players fight over 5 possible VPs. Can’t imagine 6 hours of 6 players fighting over 5 VPs.\nEconomics of the game seem tight and not fun. Fighting over such little money (“spice”) was another grind. I just don’t think the game of Dune offers enough to sit there for 3-6 hours to slog through it. There’s been a lot of new games in the last forty years that may be derivative, but have done this genre and flavour much better.",
    "timestamp": 1578006000
  },
  {
    "username": "USSRocker",
    "rating": 5.0,
    "comment": "Too long auctions",
    "timestamp": 1740092400
  },
  {
    "username": "manuelxhoracio",
    "rating": 5.0,
    "comment": "Es denso, lento y largo, pero de alguna manera genera una narración que luego recuerdas como algo épico. No es un juego para todos los públicos, ni para todos los días, pero si te gusta la mitología de Dune puede que te guste entrar en este desierto",
    "timestamp": 1718143200
  },
  {
    "username": "hoojeebo",
    "rating": 5.0,
    "comment": "My friend loves this game, but I just do not understand the appeal. There are so many exceptions, edge cases, and fiddly little abilities that I just could not be buggered to keep track of what would happen if I did X or Y. Battle is especially strange.",
    "timestamp": 1714514400
  },
  {
    "username": "Pandorzecza",
    "rating": 5.0,
    "comment": "Stara gra - w posiadaniu Kormiego. Grałem 2x i nie wiem czy chciałbym 3-ci... Raczej nie",
    "timestamp": 1708124400
  },
  {
    "username": "greeklettertau",
    "rating": 5.0,
    "comment": "Confession, I payed an embarrassing sum of money for this on ebay when I was young and naive and have never actually played it. It's obviously a brilliant game, but it's from the 70s. The components and rule book are not up to contemporary standards. Save money and play Rex instead, but call all the factions by their Dune universe names. Maybe when Denis Villenueve reboots the franchise, we'll get a proper reprint.",
    "timestamp": 1684274400
  },
  {
    "username": "realityfoible",
    "rating": 5.0,
    "comment": "Dune is... interesting.\nIt's an area control war game, but to play it like a conventional one is a sure way to loose. In most such games, units are an expensive resource that you must manage efficiently to win.\nIn Dune, they're here today and gone tomorrow. You never know what random card will be drawn from the deck to decimate your forces, or what terrible card will be played against you when entering a fight with another player.\nIt feels far too random and pointless. Strategy and tactics are simply irrelevant. More emphasis is placed on opportunism and hoping for the best than player plans. In 4 plays the game was over by turn 3. Dune literally took more time to teach than play. In another 3 the game was over by turn 4. I've only played once where the Dune went long enough to show the true potential of its systems, and that game was a tedious slog.\nNot once has Dune felt meaningful or rewarding.\n\nStill, it continues to hit the table. Time erodes our memories. Past grumpiness trumped by nostalgic shiny factor, like the lure of an Anglerfish.",
    "timestamp": 1678230000
  },
  {
    "username": "tiagoVIP",
    "rating": 5.0,
    "comment": "One play. Not a good play - it took more time to teach the game then to play it. Once it started, two alliances were made - one with three players, other with two (one of the players stayed out of both). It took around 45 minutes for the alliance with three players to attack the alliance with two, in order to take the last city they needed. It was a lost battle for the alliance with two, since the other one had a much bigger army (since, with one more player, they could afford leave little behind). But they wanted to crush and used the strongest General they had - and he was a double agent. So the alliance of two won the battle and crushed the army. The game was over after this - the alliance of two won.\n\nThough the end was great (because of the major swing of sure-thing battle), overall I wasn't impressed at all. The possibility of an alliance that can lead everyone on it to victory is a bad thing.\n\nAfter this I learned that there are some variants that make the alliance thing do not happen. But I have yet to play like this (since I don't own the game), so I will keep the average rating.",
    "timestamp": 1675551600
  },
  {
    "username": "FakeDutch",
    "rating": 5.0,
    "comment": "Where to start?",
    "timestamp": 1648591200
  },
  {
    "username": "halbower",
    "rating": 5.0,
    "comment": "Tons of rules issues. Corner cases that are not fully explained in the rules pamphlet. Lack of support from the publisher means there are tons of house rules to remedy this. But since I hate house rules, I have to rate this game poorly.",
    "timestamp": 1648249200
  },
  {
    "username": "rabid_schnauzer",
    "rating": 5.0,
    "comment": "The pinnacle of 1970s hobby game design. This is fascinating as a historical artifact, and great with a nerdy enough group.\n\nBut due to legth, complexity, alliances, and helpfulness of familiarity with the source novel, it's not really playable for a typical twenty first century game night.\n\nKinda the same reason you see Ford Model Ts at car shows and museums, but not as daily drivers.",
    "timestamp": 1646521200
  },
  {
    "username": "rayzg",
    "rating": 5.0,
    "comment": "I really don't like dudes-on-a-map games, especially those that take a really long time.\n\nThe incredible powers of each of the houses are deceptive: The base game rules are so restrictive that the powers essentially allow you to do \"normal\" things you'd expect to do in a dudes-on-a-map game.",
    "timestamp": 1634248800
  },
  {
    "username": "MrBigUK",
    "rating": 5.0,
    "comment": "A game from 1979 that stands above many of todays designs. With the full complement of players this is amazing. It loses a point however in that it drops off significantly with less players.",
    "timestamp": 1626645600
  },
  {
    "username": "azizmandar",
    "rating": 5.0,
    "comment": "I have fond memories of this game but it has not aged well. Rex and the reprint are recommended today",
    "timestamp": 1608937200
  },
  {
    "username": "celacanto",
    "rating": 5.0,
    "comment": "Print & Play",
    "timestamp": 1603490400
  },
  {
    "username": "lapin",
    "rating": 6.0,
    "comment": "Attic",
    "timestamp": 1753740000
  },
  {
    "username": "MichaelaPat",
    "rating": 6.0,
    "comment": "2025",
    "timestamp": 1751407200
  },
  {
    "username": "lexen",
    "rating": 6.0,
    "comment": "Although i should love this game, I do not think it's the greatest... The traitor aspect is a nice touch.",
    "timestamp": 1749506400
  },
  {
    "username": "Johnathan Ray",
    "rating": 6.0,
    "comment": "I have played this copy, and I really like the art and the theme, but the game falls a little flat to me, especially with what else is out there. I think for the late '70s, this was probably the best game in existence next to Cosmic Encounter, but nowadays, it is just above okay. But it gets extra points for coolness and art.\n2025 update. Had a bad experience playing the 2019 version, so I'm knocking this down half a point.",
    "timestamp": 1741474800
  },
  {
    "username": "ts0ng",
    "rating": 6.0,
    "comment": "My plays of this were warped due to some turn 1 victories— the result of an experiment of sorts from experienced players in playing without some essential factions. I would have to revisit this with the real experience as these aren’t representative of the game and probably weren’t worth rating.",
    "timestamp": 1740524400
  },
  {
    "username": "kastel",
    "rating": 6.0,
    "comment": "Rd4",
    "timestamp": 1733439600
  },
  {
    "username": "Exozik",
    "rating": 6.0,
    "comment": "I like the idea of super asymetric factions abilities thou I dislike quite a few things about the game, particularly the blind bidding. It feels tacked on just so 1 faction could have a crazy ability related to it. And the fact you can grab a useless item on top of the blind bidding create some unnecessary 'feel bad' moment. I also dislike how the game can either take forever to end because everyone is pretty much stuck in a stalemate or end early because 1 person commited a mistake. There is also no comeback mechanics. It is like Risk with asymetric factions. Modern area control moved away from that approach and for a good reason. Still, I can see why some might like this game but it is not for me.",
    "timestamp": 1732921200
  },
  {
    "username": "Theratcatcher",
    "rating": 6.0,
    "comment": "Print & Play",
    "timestamp": 1727042400
  },
  {
    "username": "Tyson2015",
    "rating": 6.0,
    "comment": "Bought it after seeing the 1984 film. I enjoyed the game if I could find players who enjoyed the topic. Many wargamers did not appreciate the game so it was difficult to play. Attempted and failed at solo play.",
    "timestamp": 1725141600
  },
  {
    "username": "vejrum",
    "rating": 6.0,
    "comment": "Finally got to try this classic \"Cosmic Encounter Lite on a map\" conquest game. Good.",
    "timestamp": 1724450400
  },
  {
    "username": "Hobbes",
    "rating": 6.0,
    "comment": "Rating could improve with repeated plays (if it gets played!).",
    "timestamp": 1713909600
  },
  {
    "username": "Mijjy",
    "rating": 6.0,
    "comment": "I wish someone would explain the popularlity of this game to me beyond the theme.... (which is admittedly fantastic & the only reason it's on my wishlist & why I keep coming back to play the game & I think I answered my own question)",
    "timestamp": 1676761200
  },
  {
    "username": "CHRISDH",
    "rating": 6.0,
    "comment": "I am not familiar with theme having not read any of the books. After my initial plays of the game I liked it. There is quite a bit of information to take in initially, especially with all the different characters, and there is a good amount of interacting among players. The game length hinders getting this to the table as often, it's unclear how long a game could last.",
    "timestamp": 1672182000
  },
  {
    "username": "vladdswrath",
    "rating": 6.0,
    "comment": "I've only gotten to play this legendary game a couple of times. I have to say, I came away with some mixed emotions. Most of the game is surprisingly simplistic, looking at the gameboard and reading about it here on the geek I expected it to be a lot harder to learn than it actually was. (That's a good thing!)\n\nI love the asymmetric sides and the way that all of the different factions mess with the board, each in their own unique way. This design does the best job of capturing a theme that I've ever seen. For instance, check out how the Bene Gesserit faction works (summary from wikipedia): The Bene Gesserit player may \"coexist\" with other players' units without causing a confrontation, and may command other players to use or not to use certain cards during combat (representing their use of \"the Voice\"). At the beginning of the game the Bene Gesserit player secretly records the name of another player and the turn at which they think that other player will win the game. If the Bene Gesserit correctly guesses who will win and when, they win the game instead.\n\nIs that the most thematic special ability ever? Yes, yes it is.\n\nAs for what holds this back from a truly stellar rating, the rules assume a certain amount of self-policing by the player's to protect the experience. Modern gamers have unfortunately been somewhat trained to look for and exploit loopholes, which can make the game break down a bit. The rules allow alliances to share both powers and a win, so technically a player can join an alliance just before the game ends and provide a victory point to someone else who has a big lead get a share of victory they clearly didn't deserve. Worse, they can form one at the very beginning of the game and never even consider betraying the alliance because there is little reason to do so. This can be a problem because some of the faction special abilities can be pretty game-breaking when combined with the special abilities of another allied faction, which in turn can lead to a very lopsided game from the outset, particularly if players align quickly and the rest of the table doesn't react to it.\n\nAnother thing that can sink the game before it starts is that it relies rather heavily on players leveraging turn order to force later acting players to absorb the resource and action cost of preventing game end. While strictly speaking this isn't quite the same as the \"everybody loses\" mechanic found in a lot of competitive co-op games, it functionally can end up that way if a player being leveraged decides to just not participate, as a counter-threat. That may just be a natural part of negotiation games in general, I'm not sure...but I do know that if the players are overly sensitive to economic bullying or quick to sabotage the game, it falls apart very quickly.\n\nAt any rate, the game requires selfish play and everyone at the table to be attempting to hold each other back at all costs, or it will end before it even starts. Dune is one of those weird games that almost guarantees a terrible experience on your first couple of plays, but if you stick with it and can find a group that is psychologically wired to do what the game asks them to do, then it is easily one of the most inique and thematic licensed games out there.",
    "timestamp": 1646348400
  },
  {
    "username": "ainataqe",
    "rating": 7.0,
    "comment": "Interesting game, not all that complex.",
    "timestamp": 1750197600
  },
  {
    "username": "spiraldaddy",
    "rating": 7.0,
    "comment": "This game has some very interesting elements to it both in terms of theme and mechanics. I look forward to playing more.",
    "timestamp": 1742511600
  },
  {
    "username": "happyjosiah",
    "rating": 7.0,
    "comment": "How do you even begin to discuss such a venerable classic? Dune has been around since 1979 and I'm just getting to play it in 2025? Better late than never I guess. Based on Frank Herbert's seminal novel, Dune was long considered a \"grail game\" for collectors and players. The Herbert estate was highly opposed to licensing, and so after the author's death in 1986, the game became very hard to find and was not reprinted. As you might have guessed, with the success of the more recent films, the promise of piles of money has assuaged the consciences of Mr. Herbert's heirs, and many Dune-themed games are now in print or back in print. So how does the first of such games hold up today?\n\nEach player will take the role of one of the factions from the book (Bene Gesserit, Harkonnen, etc.), each of which has its own special rules and powers. This concept of \"variable player powers\" was pioneered a couple years earlier by the same design team with Cosmic Encounter. But here the powers are more complex, as is the game itself.\n\nThe goal of the game is to control three of the strongholds on the map. These are the most important territories for that reason, but players will be obliged to deploy troops onto other map spaces as well, since they may contain spice. Spice is the currency of the game, and is used to fund the recruiting of more troops. Combat is resolved with a \"blind bid\" mechanism that strongly influenced later games like Scythe. Spice is also used to bid on treachery cards in each round. These cards can provide surprise combat advantages or perform other rule-breaking types of actions that can give your faction the edge.\n\nAccurate assessment of the strength of each player's position is an important skill, especially when it comes to alliances. These are formalized alliances via game rules and are unbreakable until allowed by the game. In fact, these alliances often lead to joint victories between players, a compromise that is nearly always required for success.\n\nIt's easy to see why Dune captured gamers' hearts when it first released. Even today, it's rare to see so much thematic integration lovingly woven into a game's mechanics. And at the time it was all but unheard of. Yet this faithfulness to the source material is a double-edged sword. It creates moments of rarely-useful rules exceptions and fiddliness that would likely be ironed out if it were released today. Moreover, it lacks the grand openness of possibility that Cosmic Encounter brings by virtue of its hundreds of variable player powers instead of \"the six from the book\".\n\nDune will connect with players who love the book and want a way to live it out. Yet it also works well for those seeking an hours-long negotiation/war game, theme aside. You'd do better choosing Dune than Diplomacy or A Game of Thrones, for example. Most modern gamers don't see this as a niche that needs to be filled in their gaming lives, but for those who do, it's easy to see why Dune has stood the test of time.",
    "timestamp": 1740092400
  },
  {
    "username": "rws2029",
    "rating": 7.3,
    "comment": "• A classic.\n• Played a lot back in the day.",
    "timestamp": 1739401200
  },
  {
    "username": "blinks",
    "rating": 7.0,
    "comment": "Print & Play version.",
    "timestamp": 1737327600
  },
  {
    "username": "blake33",
    "rating": 7.0,
    "comment": "Not a bad game, but not a great one, either. There is a bit too much cat and mouse to be thoroughly enjoyable, in my opinion.",
    "timestamp": 1736118000
  },
  {
    "username": "icheyne",
    "rating": 7.0,
    "comment": "http://cheyne.net/blog/2010/04/dune",
    "timestamp": 1730070000
  },
  {
    "username": "JamesJimmyNolan",
    "rating": 7.5,
    "comment": "Fun Asymmetric Dudes on a map game. Two full unlogged plays",
    "timestamp": 1744149600
  },
  {
    "username": "jwarrend",
    "rating": 8.0,
    "comment": "Very nice game; combat system is clever, and works very well! Game really works best with all 6 players, and it takes some experience playing with each to learn how best to use their powers. That, combined with the fact that the game takes at least 2 or 3 hours to play makes it a big investment to get good at the game. But, it's worth the investment of time.",
    "timestamp": 1737414000
  },
  {
    "username": "nshadoz",
    "rating": 8.0,
    "comment": "Enjoyed, but got the new version and no room on the shelf for two versions of the same game",
    "timestamp": 1735599600
  },
  {
    "username": "svenv",
    "rating": 8.0,
    "comment": "I can't believe I own this. Kelci tracked me down a copy with unpunched tokens.",
    "timestamp": 1731020400
  },
  {
    "username": "samcreator337",
    "rating": 8.0,
    "comment": "A very in depth, engaging and entertaining game. Games can actually run 4-6 hours due to the complexity of each player essentially having their own set of rules. A great strategy game to play with other enthusiasts!",
    "timestamp": 1730674800
  },
  {
    "username": "jormungandr",
    "rating": 8.0,
    "comment": "Edit: have played several more times over the last few years and enjoyed it a lot more. I think the key is to play with 4 or 6 players (never 5) and (for me) to stick with the basic rules.\n\nRecently played again for the first time in a couple decades. Great theme and reasonably low complexity. Unfortunately, the gameplay isn't nearly as exciting as it should be and the game feels underdeveloped once you start playing it. I remembered it as being a better game than it turned out to be.",
    "timestamp": 1729548000
  },
  {
    "username": "myopia",
    "rating": 8.0,
    "comment": "Precursor to so many modern game mechanics and enormously thematic. No need to own this but will never turn this down",
    "timestamp": 1724623200
  },
  {
    "username": "Ryan Keane",
    "rating": 8.5,
    "comment": "I’ve never played the original, but I rate the 1999 GF9 edition a 9 and I think I would rate the original the same.",
    "timestamp": 1756418400
  },
  {
    "username": "edooardo",
    "rating": 9.0,
    "comment": "In France",
    "timestamp": 1753048800
  },
  {
    "username": "fabericus",
    "rating": 9.0,
    "comment": "Fab'\nNovember 2013 (2nd Hand found by tis')\n\nThe rating is 100% nostalgia. I fear to give it a try and check wether the older me still likes this 6-7 hours backstabbing monstuosity.\n\n3x 5-player game in the 90s",
    "timestamp": 1752012000
  },
  {
    "username": "Sky Knight X",
    "rating": 9.0,
    "comment": "Dune has stood the test of time as a great, thematic, multiplayer conflict game. So many awesome elements make it a crazily enjoyable game. They did a wonderful job with the 2019 edition.\n\nWhen compared to other multiplayer conflict games:\n\nAbout as fun as:\nDune 1979 - I'll play either edition equally.\nTwilight Imperium\nI’ll add: Here I stand and Virgin Queen as other great six player games. Although, Dune is much more accessible.\n\nSlightly more fun than:\nCosmic Encounter\nBlood Rage, et al\nCyclades\nVast\n\nLess fun than:\nNothing. Still at the top, after all these years.\n\nWhy I think this is one of the best games ever made:\n\nGameplay elements are fun and inspire tactical and strategic thinking. Spice blows, tanks, storms, worms, alliances, faction abilities, shipments, movement, everything.\n\nCrazy asymmetrical factions. You can go through each one and conclude that the faction is over powered. Emperor always has money and nobody else does? OP. Atreides can see what cards are coming up and nobody else gets too? OP. Faction abilities are insanely fun, and although the factions seem wildly unbalanced, the game design keeps everyone in the running through alliances, and clear and open objectives.\n\nBattles are tense, deadly, and very meaningful. Battle mechanics are immensely enjoyable with the dials, leaders, and weapons.\n\nDune is a masterpiece of multiplayer conflict gaming.\n\nWhy some may not like this one:\nPotentially too long. Why do I end up listing this as a negative for many of my favorite games? It doesn’t bother me. I like fun for a long time. I guess it comes down to other players. I need other players. I need them for a long time. For so many of my games. Sigh.",
    "timestamp": 1749420000
  },
  {
    "username": "bdeink",
    "rating": 8.5,
    "comment": "Incl. Dune: Variant Cards and the treachery cards from Dune: Spice Harvest and Dune: The Duel (PnP). We tend to play without the extra treachery cards.",
    "timestamp": 1740870000
  },
  {
    "username": "BennyHennessy",
    "rating": 9.0,
    "comment": "Great theme, great art, great gameplay.",
    "timestamp": 1737846000
  },
  {
    "username": "shoochuk",
    "rating": 9.0,
    "comment": "Reserve",
    "timestamp": 1733180400
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "War Game\n Science Fiction Game\n\nThis game did manage to convey the book in an interesting way. The six factions flawlessly mesh mechanics with theme. The hard-diplomacy is one of the best I've seen implemented, and the variable player plowers are near unbeatable. The combat is pretty weird, though, and you need to make sure that you raise the win-condition limits as you add players to alliances.",
    "timestamp": 1760652000
  },
  {
    "username": "Gaius",
    "rating": 10.0,
    "comment": "As a 6-player game this consistently is some of the most memorable gaming experiences I've had. Dune has all my favorite aspects in a game: unique powers, army combat, card bidding, changing map elements, and awesome theme. Each faction plays so uniquely different in abilities and situations that the replay value is insanely high. An area control wargame at heart, but a very \"real\" one where every faction has a chance to play (but no necessarily win) unfairly in their own way, and that's rather refreshing in today's gaming scene.",
    "timestamp": 1758492000
  },
  {
    "username": "dr.morton",
    "rating": 10.0,
    "comment": "The only true Dune. Everything else is not even close!",
    "timestamp": 1756936800
  },
  {
    "username": "Grugnur",
    "rating": 10.0,
    "comment": "Best Cutthroat (do anything to win) boardgame that brings back memories of the early 1980's. Love the alliances/treaty feature. First game I played with an Upkeep and boardgame turn sequence.",
    "timestamp": 1752357600
  },
  {
    "username": "Odor555",
    "rating": 10.0,
    "comment": "Just fantastic!",
    "timestamp": 1748642400
  },
  {
    "username": "casadeisogniburritts",
    "rating": 10.0,
    "comment": "Lorenzo's Collection",
    "timestamp": 1745013600
  },
  {
    "username": "cotomel",
    "rating": 10.0,
    "comment": "Classic.",
    "timestamp": 1737673200
  }
]