[
  {
    "username": "sah777",
    "rating": 1.0,
    "comment": "Name says it all. Gave it away to a stranger after two plays.",
    "timestamp": 1061330400
  },
  {
    "username": "njsauer",
    "rating": 1.0,
    "comment": "Hans Im Gluck should be embarrassed.",
    "timestamp": 1052863200
  },
  {
    "username": "Zadok13",
    "rating": 2.0,
    "comment": "The artwork is racist, the gameplay is dull, this game is a real...wait for it...klunker!!!",
    "timestamp": 1296428400
  },
  {
    "username": "Rich_Z",
    "rating": 2.0,
    "comment": "I absolutely hate this game not least of which for it's hideous card art",
    "timestamp": 1287698400
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "I found that there's not much trade-off here compare to Bohnanza.",
    "timestamp": 1640041200
  },
  {
    "username": "jens_hoppe",
    "rating": 3.0,
    "comment": "Card game about jewelry collecting. This was reasonably fun, as far as I can recall, but it was a long time ago, and my group didn't like the theme much.",
    "timestamp": 1551049200
  },
  {
    "username": "eunnyya",
    "rating": 4.0,
    "comment": "골동품판매 테마는 좋았는데 게임이 재미가없다;; 같이했던 그 누구도 재밌다고해준적이 없다. 나홀로 3인플할때가 제일 흥겨웠던 듯....",
    "timestamp": 1586037600
  },
  {
    "username": "jgoyes",
    "rating": 4.0,
    "comment": "2016-03-28\n\nInitial Rating: 6.0 (March 2016)\n\nI like most Uwe Rosenberg´s games so I bought Klunker only for the designer.\n\nThe rules are fairly simple, you can explain them under 7 minutes. Playtime is around 45 minutes.\n\nThe game components are ok. I know there are two versions of the game with different art and one of them is very superior, art wise, to the other.\n\nKlunker is a light hand management card game. The real interesting decision is to choose how many jewels you will offer in your window, anything else is (mostly) obvious, or so it seems. That doesn’t mean the game is obvious. Also, I feel the game has a lot of uncontrollable luck of the draw (a huge negative for me).\n\nBottom line, it seems luck of the draw can decide the winner most often than not. The game explainer had some doubts, so I need to read the rules and give it another try before deciding if I should keep it. Right now I’m leaning toward selling it. For me, it is at the same level of Bohnanza (a game I no longer enjoy). Perhaps it is a great family and/or casual game. For now I’m rating it a borderline 6.0\n\nCurrent Rating: 6.0\n\n\n2020-02-01\n\nI finally played Klunker again and but this time around, I´m much harsher with my game ratings. It´s a quirky, counterintuitive game from one of my all time favorite game designers, but I don´t really like it.\n\nI was wrong before, you can explain the game under 3 minutes and it plays around 30 minutes.\n\nThe artwork is kind of nice when you take time to really look at it, I disliked it when I was only glancing at it.\n\nThe decisions needed to play the game aren’t that interesting and luck plays a significant role in the game but as it plays, relatively, fast it doesn’t bother me much. It can be the game has a bit more depth that I think, but still I´m not having much fun nor I´m excited in any way when I play it. In any case I feel it is on the light end of the spectrum, hidden depth or not. Due to all of those reasons, I will sell it ASAP.\n\nCurrent Rating: 4.0",
    "timestamp": 1580511600
  },
  {
    "username": "BankofDracula",
    "rating": 5.0,
    "comment": "I guess tempting other players by flashing my... wares at them can be fun, but I feel like its so much more successfully done in Bohnanza that there isn't anything to bring me back to this one. It has some shit caricatures based on racial stereotypes that I could have lived without as well.",
    "timestamp": 1756504800
  },
  {
    "username": "rynelf",
    "rating": 4.5,
    "comment": "--Apr2009-- It's trivially amusing, and might well get a better rating with further play. But, equally, it didn't have that spark of intrigue to it that will demand those additional plays.",
    "timestamp": 1680559200
  },
  {
    "username": "OGNOG",
    "rating": 5.4,
    "comment": "Probably OG. (Rating non-indicative of game quality.)",
    "timestamp": 1649109600
  },
  {
    "username": "Koko_Lores",
    "rating": 5.0,
    "comment": "JKS",
    "timestamp": 1643238000
  },
  {
    "username": "NormandyWept",
    "rating": 6.0,
    "comment": "A strange card game which, along with the likes of Bohnanza and Mamma Mia, is typical of Uwe Rosenberg in the 1990s, before he got caught up in iterating on worker-placement farming games and personal-player-board jigsaw puzzles.\n\nMy first plays of this game saw confused players struggling with the turn sequence and card flow of this strange card game, with the result that play was often quite unsatisfying. But my two more recent plays have been better taught and better grokked by the players, with the game shining a lot better in the latest one. Therefore I'd say that this game can be tricky to learn as it's quite quirky for a \"light\" card game, but if you can get everyone up to speed, there's some interesting trading, hand management, and turn order manipulation fun to be had.",
    "timestamp": 1747000800
  },
  {
    "username": "ShiannLin",
    "rating": 6.0,
    "comment": "1999 Fairplay À la carte Runner-up\nKlunker features elements similar to Uwe Rosenberg's Bohnanza,",
    "timestamp": 1735167600
  },
  {
    "username": "krit1789",
    "rating": 6.0,
    "comment": "Uwe Rosenberg's old card game. Set collection in essence. Trading without haggling. Bohnanza's less popular cousin.",
    "timestamp": 1695679200
  },
  {
    "username": "multi_killer",
    "rating": 6.0,
    "comment": "Storehub ??\nSleeved. RIB",
    "timestamp": 1683324000
  },
  {
    "username": "wizhyun",
    "rating": 7.0,
    "comment": "I don't know why, but my kids love this game.\nI like this game because it makes them happy.",
    "timestamp": 1706223600
  },
  {
    "username": "booned",
    "rating": 7.0,
    "comment": "Could have easily been set in the Bohnanza Cinematic Universe, if a different publisher. It's kind of like Bohnanza, but instead of direct negotiation, you're making attractive offers to everyone and picking others' offers. I like it, though I need to play it more.",
    "timestamp": 1702335600
  },
  {
    "username": "rharn",
    "rating": 8.0,
    "comment": "Tense and mind-bending set collection game with a big emphasis on turn order initiative and looking ahead to what your opponents directly upstream want to do. Given more plays, I could see this rising to Bohnanza's level!",
    "timestamp": 1757541600
  },
  {
    "username": "ChimBlade",
    "rating": 8.0,
    "comment": "A game of implicit negotiation. I need to play this more, but I think I like it more than Bohnanza.",
    "timestamp": 1732489200
  },
  {
    "username": "David Vander Ark",
    "rating": 9.0,
    "comment": "Wonderfully balanced and fast. Invites repeat plays. Does take a bit to get used to, especially figuring out what to offer in your shop window. Great as a closer.",
    "timestamp": 1567202400
  },
  {
    "username": "alzsara",
    "rating": 9.0,
    "comment": "100+ plays. In 20 years of rating games, this takes the trophy (which went straight to the pool room btw) for the game I got most wrong. It just rubbed me the wrong way (and it can do that if the cards don’t fall right in your initial plays) and came in at a 5. But it somehow developed into our regular late night closer and I began to “see” it. There's a heap of luck, but it’s fun to tempt people into purchases, it's fun when you're spurned and have to suck it up, it’s nice when you get great cards, and groaning fun when you get one of everything. The sell/take feature makes this game significantly different from others, and once you're past the initial weirdness, it's highly attractive.\n\nThere tend to be two workable strategies:\n\n1) Get most if not all your hand out each turn, happy to score 1's, get the 5 or 6 card re-draws, plus the occasional gold if someone takes your window. If cards work well, you may eventually transmute into strategy 2, being ...\n\n2) Target scores of 4, 3 and 2, playing carefully, happy to donate gold to others to keep your scores clean. But you've got to know your other players. If they're going to play dirty and not offer good stuff, you'll eventually be forced into strategy 1 when the redraws don't go your way.\n\nThere's definitely an art to the offer. We've found:\n\na) If two people are building the same jewel, you can contemplate placing 1 of that jewel, but you only want to do this if they're getting close, they're keen to build, they won't be drawing many cards and there's something else out there you can take. Otherwise, 1 card is a dangerous offer. It's usually more advantageous to force someone to eat their own dog food to screw up their future scoring potential, especially if you're drawing lots of cards.\n\nb) targeting 1 player, say offering 1 of each when they're on 2 of each, is seen but again only if there's something else out there you can afford to take and opponent is not drawing many.\n\nc) offering a pair is the most popular and safest, especially when there's little you want on offer from the others. You can safely keep and play it yourself.\n\nd) offering a mix of junk that you'll be happy to take yourself because you're playing the cleanout strategy.\n\nWe've found the charm of Klunker to partly be the reading of other players – as in, how prepared will they be to not take your decent offer and head down strategy 1 instead. So the game is more about the player interplay than the cards themselves.",
    "timestamp": 1528063200
  },
  {
    "username": "fogus",
    "rating": 9.8,
    "comment": "My copy has 10 Shaufenster Dollars printed by Looney Labs way back in the day. It helps to get the game rolling a little faster by injecting extra funds for the players at the start of the game.\n\n2017\n====\n\nThis has taken over both Bohnanza and Agricola as my favorite Uwe game. I prefer the WTS variant that includes 2-extra bucks to start per player.\n\n2016\n====\n\nKlunker is one of my favorite implicit negotiation games. What I mean by that is that while some players try to sell their wares, the best negotiations in Klunker occur implicitly via the contents of the players' shop window offers. While players attempt to sell their goods to benefit themselves, rarely will players do well by playing in a wholly selfish manner. Instead, each shop window should be populated with enough to entice your opponents without helping them too much. The games is a delicate balance of conflicting and complimentary interests.\n\n[2014.03.30]\nThe first game that I played where I had to manage more than one hand. This is my first Uwe game and still my favorite of every other game that he's created (so far).\n\n[2015.06.01]\nAgricola has overtaken this as my favorite Uwe game.",
    "timestamp": 1521673200
  },
  {
    "username": "TVTom",
    "rating": 10.0,
    "comment": "Really this game should be rated much higher, but it isn't because it has a few flaws. However, I have a dozen friends that have played this game for 15 years, some of them game designers, and they have tweaked the rules a little, making it a wonderful game: the two main tweaks are that you add two starting dollars for everyone, but not from the deck (make them or use money from another game), and that you shuffle discarded cards back into the draw deck before each round, making for a slightly longer but much more satisfying game.\n\nThe author did come out with a 2nd version, which is horrible and much worse (too bad he didn't know about and adapt the improvements we play with) and this means the first version won't be re-released, so eBay is the best shot at finding a copy. The designer, Uwe Rosenberg, has designed other, award-winning games, such as Bohnanza and Agricola, But I think Klunker is his masterpiece by far.",
    "timestamp": 1417474800
  }
]