[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I like the auctions better than Ra, more possibilities to interact over similar goods. Was less of a fan of too many ways to score, cross-checking each other for sums, all for the end result of going up on tracks. Where's the fluid markets and storytelling of Modern Art? I guess it wasn't terrible, but still too tedious for what I wanted. And Ra fans won't enjoy bidding their VP away, so they probably won't play this either.\n\nThe most boring theme and title ever, I honestly keep forgetting this game even exists.",
    "timestamp": 1731711600
  },
  {
    "username": "larienna",
    "rating": 1.0,
    "comment": "This game is so bad and boring. One of the problem is that it is a game for mathematecians. You must be able to calculate the value of a hand in order to bid correctly. But that is way more too complicated to do. At least in RA, you have 3 tokens with a printed value on it to use for bidding. You might not know the exact value of a hand but you can know aproximately what it is worth. So using predetermined values is easier.",
    "timestamp": 1200524400
  },
  {
    "username": "brownsound",
    "rating": 2.0,
    "comment": "Abstrakcyjne, nie porwało mnie, marnotrawienie papieru i kartonu.",
    "timestamp": 1690063200
  },
  {
    "username": "JohnnyBackflip",
    "rating": 2.0,
    "comment": "There is no luck in this game and when someone gets ahead there is almost no chance in winning anymore.\n\nI really like math in games and auctions too but this is just a mess of a game. A soul crunching pile of sadness that me and my group never want to play again.\n\n1 Star + 1 Star for the Art = 2 Stars",
    "timestamp": 1641510000
  },
  {
    "username": "DenverKris72",
    "rating": 3.0,
    "comment": "Bidding game, not my favorite mechanism.",
    "timestamp": 1711494000
  },
  {
    "username": "Citery",
    "rating": 3.0,
    "comment": "This was already underwhelming in a vacuum, but after finally getting Ra to the table and seeing what Knizia managed to achieve with the once-around lot-creation format, I'm happy to let Medici rot in the annals of history.\n\nSure, this might be the more \"elegant\" of the two, but it lacks the excitement and the theatrics of Ra and is even more susceptible to overwhelming luck of the draw . Playing up to 6 doesn't earn you a pardon, Medici, good riddance.",
    "timestamp": 1668726000
  },
  {
    "username": "opks22",
    "rating": 4.0,
    "comment": "iOS version",
    "timestamp": 1744063200
  },
  {
    "username": "Zeusman",
    "rating": 4.0,
    "comment": "Non-Library Copy",
    "timestamp": 1732230000
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "UPDATE: Starts to show it's age. The N+1 bidding is getting really lame, and The Estates end up being a more profound experience.\n\n===============\n\nOne of the best auction game and push-your-luck game in the planet. It goes up to 6 players, but the game is so easy to teach and so fast to play. It is also a very simple form of those economic games of \"spend money to get more money\" types. Very interesting decisions all around. Much purer than Ra or Amun-Re.\n\nI prefer Modern Art, but this is still a master class in elegance + depth.\n\nThe Grail Games edition got stupid scoring track that is difficult to use. Poker chips are used instead, which is easier for usability and also easier accounting.",
    "timestamp": 1760306400
  },
  {
    "username": "David_Artrex",
    "rating": 5.0,
    "comment": "Simples Biet-Spiel.",
    "timestamp": 1740178800
  },
  {
    "username": "4characters",
    "rating": 5.0,
    "comment": "Probably my favorite Knizia title.",
    "timestamp": 1737154800
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "The first time I played this game it did not sit well with me. However, the game has great potential.",
    "timestamp": 1731366000
  },
  {
    "username": "rharn",
    "rating": 6.0,
    "comment": "Solid auction game that scales well to 5p/6p. It lacks the greedy tension of Ra though, and there's too much mathing it out at the end of the last round. I sold this because every time I played Medici, I found myself wishing I was just playing Ra instead.",
    "timestamp": 1760220000
  },
  {
    "username": "shmonkey",
    "rating": 6.0,
    "comment": "This was simple and clever, in typical knizia fashion. build lots to auction and then score two ways: total value on your cards and by using the suits to go up tracks and claim majorities on tracks.\n\nthe game was quick, punchy, but missing one more layer that would really make it sing for me. simpler but slightly better than Ra IMO. definitely better than amun re. High society might beat this for me.",
    "timestamp": 1759874400
  },
  {
    "username": "adi_venturer",
    "rating": 6.0,
    "comment": "The weakest of the trilogy in my opinion, this game has some design flaws. The main one in my opinion is that due to the random draws, you can find yourself in a position where the only way to stop someone from running away with the game is by hurting your own chances. This can work in a game balanced by table talk, but Medici doesn't support that. This would work better as a party/filler game but then this game needs to be shorter than it is.\n\n(Plays: 1)",
    "timestamp": 1754776800
  },
  {
    "username": "MisterBond",
    "rating": 6.0,
    "comment": "Pure auctions.",
    "timestamp": 1750456800
  },
  {
    "username": "Drb89_",
    "rating": 7.0,
    "comment": "Auction\nSet collection\nIncome\nPlayed at 3, thinking it would be better with more\nMoves very quickly at 3, probably a half hour game",
    "timestamp": 1760911200
  },
  {
    "username": "aPilgrim",
    "rating": 7.4,
    "comment": "A lot more fun than it sounds. Short and sweet and the more the merrier...although six can produce a little downtime and card counting. Can deteriorate with silly bidding.\n[5-6]4-6",
    "timestamp": 1760911200
  },
  {
    "username": "Ephorus",
    "rating": 8.0,
    "comment": "What I like:\n- Classic Knizia auction game. Players bid points on sets of cards showing commodities with different types and values. Each turn, the active player reveals one to three cards, and the highest bidder takes them all. The round ends when players' ships are full or the deck runs out.\n- The tension comes from balancing how much to spend on each auction. Overpay early and you'll be priced out later. Wait too long and the commodities you need might be gone. Points are awarded for having the most of each commodity type and the most valuable cargo overall, so you need to decide whether to focus on specific types or spread your bets.\n- Creates interesting dynamics where players need to read the table, when to push hard for a set and when to let others overspend.",
    "timestamp": 1760824800
  },
  {
    "username": "icarussc",
    "rating": 8.0,
    "comment": "Great auction game that plays up to six!",
    "timestamp": 1760392800
  },
  {
    "username": "CicutaGames",
    "rating": 9.0,
    "comment": "Adoro cómo funciona este juego. Subastar con puntos y la manera en que se cuentan los puntos. Uno que sale seguro si tienes 6 personas y no quieres jugar un party.",
    "timestamp": 1759269600
  },
  {
    "username": "btasam",
    "rating": 8.5,
    "comment": "Good fun!\nSomething about spending your own victory points and/or forcing other's to spend theirs just makes me giggle.",
    "timestamp": 1759183200
  },
  {
    "username": "silenceisgolder",
    "rating": 10.0,
    "comment": "My favorite game. It's a game that I love introducing to new players as well as competing with those more experienced. In the first act, you're trying to decide what to commit to. In the second, it's about how you're going to pull ahead in the lanes you've chosen without losing sight of the bottom line. In the third, every card flip is so consequential as who wants what is so crystal clear. It's such a fun arc and never fails to put a smile on my face.",
    "timestamp": 1750802400
  },
  {
    "username": "leagle89",
    "rating": 10.0,
    "comment": "Homebrew",
    "timestamp": 1749592800
  }
]