[
  {
    "username": "DaniDCR",
    "rating": 1.0,
    "comment": "Qué cosa mas mala de juego! Más simple que el mecanismo un chupete. El sistema es parecido al del 'Tiburón!' que regalé a mi sobrina pero aún mucho peor!",
    "timestamp": 1429826400
  },
  {
    "username": "DaveD",
    "rating": 1.0,
    "comment": "The minutes I spent playing this game were probably the worst wasted of my life\n\nɅV",
    "timestamp": 1345759200
  },
  {
    "username": "darkfinale",
    "rating": 2.0,
    "comment": "15 rounds bidding game, where ties are removed. Ok for a quick and snappy game, but not very exciting.",
    "timestamp": 1744495200
  },
  {
    "username": "kesulin",
    "rating": 2.0,
    "comment": "filler sencillo, de partidas muy cortas.\nLa gracia cuando varios jugadores coinciden en su número, dando lugar a risas generalizadas.\n\nPor lo demás es un juego con muy poca chicha.",
    "timestamp": 1644188400
  },
  {
    "username": "David_Artrex",
    "rating": 3.0,
    "comment": "Extrem simpel. Mehr ein Mechanismus als ein komplettes Spiel.",
    "timestamp": 1755208800
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "It is another version of GOPs.",
    "timestamp": 1724796000
  },
  {
    "username": "rjones53",
    "rating": 4.0,
    "comment": "Mostly luck. High society is an improved version.",
    "timestamp": 1702422000
  },
  {
    "username": "threhane",
    "rating": 4.0,
    "comment": "Forgettable.",
    "timestamp": 1692655200
  },
  {
    "username": "viridon",
    "rating": 5.0,
    "comment": "+/- Extremely simple gameplay\n+/- Simultaneous selection has very little strategic depth\n- Non-existent, boring theme",
    "timestamp": 1759442400
  },
  {
    "username": "realityfoible",
    "rating": 5.0,
    "comment": "I respect What The Heck for being short and simple, but I don't particularly enjoy it.\nTrying to guess how each round will go just feels arbitrary to me.",
    "timestamp": 1753653600
  },
  {
    "username": "xmorridin",
    "rating": 5.0,
    "comment": "BGA",
    "timestamp": 1726610400
  },
  {
    "username": "Zalbar",
    "rating": 4.5,
    "comment": "B: 5\nC: 1,17\nT: 20",
    "timestamp": 1723068000
  },
  {
    "username": "tscox87",
    "rating": 6.3,
    "comment": "Bought for research. It was OK.",
    "timestamp": 1759874400
  },
  {
    "username": "enavico",
    "rating": 6.0,
    "comment": "+ Pure bluffing and bidding game\n\n- Not that engaging",
    "timestamp": 1758405600
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 4005556011605\nL4",
    "timestamp": 1757196000
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 8720289476120\ncd rek 9",
    "timestamp": 1756504800
  },
  {
    "username": "sh4mike",
    "rating": 7.0,
    "comment": "A great filler. Teach is 1 minute, game is 5 minutes, fun outcomes from the tie-cancel rule. Perfect for non-gamers.\n\nOption to play 3 rounds and sum the scores.",
    "timestamp": 1751839200
  },
  {
    "username": "BeepoisonGameMadness",
    "rating": 7.0,
    "comment": "Juego hecho por un psicópata terrorista probablemente.\n\nDa risas cuando varios desperdician sus cartas altas o algún juego mental toma lugar, pero después de las risas viene el llanto porque te pasó a ti, este juego te odia.",
    "timestamp": 1750629600
  },
  {
    "username": "Phillybeefandcheese",
    "rating": 7.5,
    "comment": "Nice, quick, fun lil card game that can play 5 well.",
    "timestamp": 1760652000
  },
  {
    "username": "NormandyWept",
    "rating": 8.0,
    "comment": "A lovely short game of just 15 auctions which you have to navigate through, trying to manage your hand of cards to outwit your opponents. The wonderful \"tied players don't exist\" rule from Big Shot is used here, and feels even more vicious in an auction than it does in an area majority contest.",
    "timestamp": 1747000800
  },
  {
    "username": "oursino",
    "rating": 9.0,
    "comment": "C'est plus un jeu coup de coeur et souvenir pour moi. On a passé d'excellents moments à enchaîner les parties. Ce que je reproche à Streams est aussi valable ici: la hauteur des cartes jouées va se stabiliser petit à petit.",
    "timestamp": 1744927200
  },
  {
    "username": "Skycosmo",
    "rating": 9.0,
    "comment": "독수리눈치싸움",
    "timestamp": 1738710000
  },
  {
    "username": "bernstein82",
    "rating": 10.0,
    "comment": "Simplicity at it's best.",
    "timestamp": 1759960800
  },
  {
    "username": "gidorah",
    "rating": 10.0,
    "comment": "09.2023\n\nGAMEPLAY\nIn a round, a tile is flipped revealing a value, either positive (1 to 10) or negative (‒1 to ‒5). Players then simultaneously reveal one card. The highest card wins when a positive tile is up for grabs while the lowest card “wins” a negative tile. After 15 rounds, players total positive and negative tiles for their final score.\n\nTHOUGHTS\nRaj is certainly a different game but the quick and dirty comparison here is Knizia’s High Society. The simultaneous reveal adds a fun tiebreaking rule where players cancel each other out and the tile is taken by the next highest/lowest card; it's something that happens more than you might think from a 15-card deck.\n\nThe special sauce in Raj is in fact the simultaneous card play: lots of groans and halloos from that simple reveal. Raj keeps the buoyant, beer-and-pretzel atmosphere going through the whole thing as it probably takes fewer than 10 minutes to play.\n\nAs my buddy asked, “Why isn’t this game on shelves everywhere? Everyone should have it!”",
    "timestamp": 1751148000
  }
]