[
  {
    "username": "Haqwau",
    "rating": 1.0,
    "comment": "Boring",
    "timestamp": 1601416800
  },
  {
    "username": "spieleben",
    "rating": 2.0,
    "comment": "nicht sehr hübsch.",
    "timestamp": 1585692000
  },
  {
    "username": "chaniatreides",
    "rating": 3.0,
    "comment": "199?-2024/11",
    "timestamp": 1749420000
  },
  {
    "username": "jackycola",
    "rating": 4.0,
    "comment": "Die Idee klingt gut aber so richtig Spaß hatten wir dann doch nicht lol.",
    "timestamp": 1759874400
  },
  {
    "username": "Quail_Daddy",
    "rating": 5.0,
    "comment": "The game is just fine, it was a bit too on the light side and relatively easy to work out peoples colours or at least what colours were in play (because there are only 5 buildings of each colour). Therefore voting wasn't as exciting as I'd hoped and clever tile placement seemed more effective.\n\nIt might be better as you improve your bluffing game but the game is just too light and more of a silly family game. I'd rather play clans for hidden colour mind games or butterfly garden/indigo for shared track dickery.",
    "timestamp": 1757109600
  },
  {
    "username": "pavin",
    "rating": 5.0,
    "comment": "Thème du jeu est n'importe quoi",
    "timestamp": 1744754400
  },
  {
    "username": "chadgibbons",
    "rating": 6.0,
    "comment": "Walls Storage",
    "timestamp": 1753394400
  },
  {
    "username": "johnrudolph",
    "rating": 6.0,
    "comment": "Very simple, but fun decision-making and quick turns. Enjoy this every time.",
    "timestamp": 1747260000
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Played this, but have no recollection of it.",
    "timestamp": 1759442400
  },
  {
    "username": "cromagz",
    "rating": 8.0,
    "comment": "Silly fun voting and bluffing game, a bit like clans with a bit more bite. Done in 30 minutes, very simple teach and should appeal to a wide variety of tastes.",
    "timestamp": 1760306400
  },
  {
    "username": "Boardgameswithb7",
    "rating": 9.0,
    "comment": "Is this game a hidden gem? I've included this game in my video series over on YouTube, Spotlighting Hidden Gems in Board Games. Watch the entire episode here:\nhttps://youtu.be/lISpRLFaVrw\n\nOr\nRead my review here:\nhttps://boardgamegeek.com/thread/3570907/the-charm-and-chaos...",
    "timestamp": 1757714400
  },
  {
    "username": "GypoNolan",
    "rating": 10.0,
    "comment": "It's hilarious\n\nGenuinely one of the most interesting and best games I've played. I collect old games from the 90s and I've played this one with people more than all the others put together because I insist on showing it to everyone. It's always a multi layered delight. An unheard of mixture between hidden identities and tile laying, with snaking walls that are just as offensive as they are defensive. It's a game with cooperation between players, and bluffing and manipulating them as well. Every move can be interrogated for meaning, ever move made an opportunity to poke and prod at opponents as you attempt to determine their hidden color. There's nothing quite like it and few games that rival what it accomplishes",
    "timestamp": 1745791200
  }
]