[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Every time I played this, there were maybe 2 fun rounds out of 6. There is some haggling fun, but every dealmaking game has some of that? There's a bit too much calculation, trying to figure out what something is actually worth, before you can even start talking to each other. Noticing that in a lot of Euros, it's such a slog. Ironically the games made by mathematicians try to hide all the number details so nobody notices them.\n\nThe box art is so gross it's actually kind of funny.\n\nedit: thinking more about this (sadly), and how there isn't a SINGLE currency in this besides money, most other negotiation games have something else to barter with. Not a single one, damn.... and that probably hints at who's gonna be attracted to this design. Zoo Vadis has a ton of positioning variables, I'm The Boss has attack cards out of nowhere. Even CATAN had more than this, with the goods that might be useful but there's no guarantee you can spend them. Strangely, Chinatown most reminds me of John Company, how even though there were a few alternate currencies available, almost every single deal was just for short-term money. Plus the limited timeframe to accomplish anything at all, so nobody even had time to form relationships.\n\nHuh, now I realize. It's trying to be Acquire with trade negotiations (probably inspired by Catan), but fails at both!",
    "timestamp": 1757887200
  },
  {
    "username": "glanfam",
    "rating": 1.0,
    "comment": "after completing my trades, i sat there for 15-20 minutes for 6 turns doing absolutely nothing, while everyone else kept trading. Optimizing players slow this game to a crawl. Would gladly play again with a 10 minute time in which to trade. Without a timer...I would find someone else to play two player games with between turns. Highly unrecommended",
    "timestamp": 1726005600
  },
  {
    "username": "IsabelAstrid",
    "rating": 1.0,
    "comment": "It is a 100% about negotiating in the air without interesting criteria… and what you have to deal with is pure luck. It should take at the most 20 minutes. And it can take easily more than the 60 minutes mentioned in the description  definitely not for me. Also, there can be quite some dead time while others negotiate. Awful",
    "timestamp": 1725746400
  },
  {
    "username": "amon1223",
    "rating": 1.0,
    "comment": "for 5-player",
    "timestamp": 1676242800
  },
  {
    "username": "Rednas79",
    "rating": 1.0,
    "comment": "Don't like bidding.",
    "timestamp": 1666648800
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Update: Dec 2021\n\nA rather devilish mix between having arbitrary input from the game on players' shop tiles and lot cards, and how all the values in this game are so dead set that there's little leeway on negotiations. No asymmetric interests and values that allows trade to happen organically.\n\nTrade happens because Location A values X at 15 \"value units\" and Location B values it at a higher value. This creates demand for X in B where they'll trade with A to obtain X. While this happens in a basic level in Chinatown, the values are so rigid that negotiation talks becomes obvious and rote.\n\nErgo, the value of Chinatown as a negotiation game has an incredibly diminishing value as you play it more.\n\n==========================\n\nVery accessible and fun trading game. However, the game is very random at the start and then pivots hard to predictable at late game. Not a good show.\n\nBohnanza beats this easily.",
    "timestamp": 1640646000
  },
  {
    "username": "7Sevenfold",
    "rating": 1.0,
    "comment": "— Part of my March 2018 Games Wrap-up —\nPretty garbage unless you love screwing over your friends (suggested by my cut-throat friend, actually). Too fast paced and loud for my taste. Hey, I'm biased, I like more quiet and friendly games.",
    "timestamp": 1522447200
  },
  {
    "username": "SCOBYBryant",
    "rating": 1.0,
    "comment": "Imagine a simpler (lol) version of Ra with auctioning replaced by free-for-all trading of tiles, except the lucksackery is squared because players randomly draw not only the set-collection business tiles but also the locations in which they're placed. (Contiguous placement required, the numbering system on the board recalls Acquire here.) Players can suffer shortages if tiles from the set they're collecting aren't pulled, arbitrarily causing loss of income provided that they were fortunate enough to have already accumulated the needed build space, but the bag contains more copies than just the complete set so players are more frequently screwed by needing area to build their already assembled sets of businesses. Lucking into numbers that border is crucial, and the process takes multiple rounds. If the numbers you need are never drawn, kept, or opponents hold out because you have nothing (and cannot obtain something) to offer them, expect to lose income for each round you're tardy. Players can haggle on price but the information is perfect - you know exactly how much the benefit is worth and for how many rounds - so I would imagine a few plays might even codify the numbers.\n\nOr think of it another way: trading is mutually beneficial to the parties involved, meaning their position improves relative to everyone not involved. Thus, the person that trades most often has the greatest chance of winning. To be able to trade most often, you must have the most to offer. Having the most to offer requires drawing all the best business tiles and building cards. See the dilemma?",
    "timestamp": 1323385200
  },
  {
    "username": "jtrleone",
    "rating": 1.0,
    "comment": "100% negotiation; 0% fun. Too much effort for haggling for 5 rounds of play.",
    "timestamp": 1323385200
  },
  {
    "username": "Ravenia",
    "rating": 2.0,
    "comment": "no hidden information to make advantageous deals",
    "timestamp": 1726005600
  },
  {
    "username": "Alyssa Oolacile",
    "rating": 2.0,
    "comment": "This game isn't bad at all, I just don't like negotiating.\n\nIf you like Catan for its negotiation aspect, you might want to try this one.",
    "timestamp": 1723327200
  },
  {
    "username": "realjw",
    "rating": 2.0,
    "comment": "Game feels quite outdated, it's really all luck and they're trynna put this 'negotiation' cover in front of it. Well guess what no one's gonna wanna negotiate with you if your properties or tiles are just not relevant to them, negotiation my arse.\n\nLords of Vegas is absolutely the better game. It's got lots of luck too but it's part of the thematic casino las Vegas theme. You can try yanking stuff out of people in LoV with some cost. In chinatown you really can't do shit if they just won't budge. If someone gets a good cluster early game in Chinatown they have won the game, and there is nothing you can do about it.\n\nAbsolutely no interest in playing it again.",
    "timestamp": 1639522800
  },
  {
    "username": "mazzyfred",
    "rating": 2.0,
    "comment": "Always an awful experience. Just wait until other players overpay for some of the tiles you have and win the game.",
    "timestamp": 1608159600
  },
  {
    "username": "MardigrasDescendres",
    "rating": 2.0,
    "comment": "This game is just randomness and negotiations. It is way too long for what it is.\n\nCarcassonne is much much better. If you want a negotiation and bluff game, go for the Sheriff of Nottingham.\n\nPlayed it twice and it is one of the rare games I do not want to play anymore.",
    "timestamp": 1593900000
  },
  {
    "username": "CortexBomb",
    "rating": 2.0,
    "comment": "Chinatown is a game with way too much open information and it additionally, like most trading/negotiation games, depends heavily the personality of the group you're playing it with for maximum enjoyment.\n\nThe basic idea behind this game is pretty simple: you want to control blocks of businesses on a board depicting Chinatown. The business tiles are randomly drawn, as are the lot ownership rights, and both of these can then be swapped about freely during the trading phase of the game, which is the real meat of the game. Players ideally want to get connected lines of like businesses, with the rarer business types paying out larger returns if you get a complete \"set\".\n\nI played it with a group of 5 people, which seems like it would be the best scale, but the luck of the draw, though fixable by dealing, seems a little too dominant in dictating who has the upper hand. Chinatown felt like a math puzzle at some level as well. The game should be fun for its free-wheeling haggleathons, but everything ended up feeling too calculable which really stifles negotiations.\n\nThe \"I've got what you need and refuse to deal with you\" aspect is also a large one for me, if someone is in the lead and you're in second, and they draw the last tile you need there is no way to get it away from them. The real killer though is the nigh completely open information, it is way too easy to calculate the value of a given trade out, and hence, negotiations frequently end up stalling out. The only place you can get ahead against savvy opponents is in the draw, which isn't exactly a mark of distinction for me. Calculable information can be OK, but I think that it has to be transitory, i.e.: there can be events that occur which change that value significantly. This is why, for instance, the calculations of Modern Art work for me (you don't know when the round is going to end, you don't know if the painting is going to maintain its current value) and why games like Container and Chinatown don't...you know what the stuff is worth, flat out, and it's just a question of trying to get a fair cut of the action.\n\nOne of the early alea disappointments from back when the label was actually reliable. I had expected that its reputation would suffer noticeably when it was reprinted, but somehow this one continues to attract fans, and I can honestly say it's one of the few well-regarded games that I dislike where I can't even academically understand what people are seeing here that I'm not. I think Traders of Genoa is still and likely always will be my go-to in the pure negotiation genre. It has all of the haggling of this one, but adds a lot of closed information about the value of items which makes things move along much better.",
    "timestamp": 1500760800
  },
  {
    "username": "Knave",
    "rating": 2.0,
    "comment": "A pointless game. The value of a given tile is fairly easy to determine. The group determines the appropriate \"price\" for a given tile. In our group it was 50% of the expected value, but it could be any arbitrary percentage. The group will trend towards that percentage for all trades. So it comes down to who gets better tiles.\n\nThere needs to be more ambiguity in the value of the tiles. For example, \"Modern Art\" has a range of values, and it can be hard to determine that value. A game like \"Ra\" makes it even more difficult to determine appropriate value. Without ambiguity, the game is a simple mathematical exercise.\n\nI guess if I was playing with mental weaklings, I could take advantage of their inability to make the appropriate calculations, but I played this game with strong players, which was, as I stated right at the beginning, completely pointless.",
    "timestamp": 1388530800
  },
  {
    "username": "Shleprock",
    "rating": 2.0,
    "comment": "When I play this game it feels like I'm at work trying to talk someone into something. Not fun at all.",
    "timestamp": 1370383200
  },
  {
    "username": "bramadan",
    "rating": 2.0,
    "comment": "Really liked this one when I got it. Later realized it is total information negotiation game. It means that with serious players every negotiation comes either down to exact split or some sort of game of chicken.\nHaven't played it since.",
    "timestamp": 1288825200
  },
  {
    "username": "superkrm",
    "rating": 3.0,
    "comment": "Meh.",
    "timestamp": 1749506400
  },
  {
    "username": "adi_venturer",
    "rating": 3.0,
    "comment": "Played it once. Opinion may change upon further plays but a few glaring issues stood out to me:\n\n1. The game has a lot of racial stereotyping.\n2. It's almost impossible to catch up to someone who may have established an early lead, unless everyone actively decides to block that player out - which is unlikely to happen.\n3. Most of the game is concentrated in rounds 4 and 5. So it feels like you're just going through the motions in the early rounds and then the last round is just place your leftover tiles to get $20K.\n\nWe played with 5 players and the game lasted about 1.5 hours. I feel that's too long for a game that's purely negotiation and has no catch up mechanism. My rating would be higher if this game lasted 40-45 minutes instead (and wasn't racist!).\n\n(Plays: 1)",
    "timestamp": 1748901600
  },
  {
    "username": "SharpieSniffer44",
    "rating": 3.0,
    "comment": "I played this game with 4 other classmates. It took a good round, and a couple of times of the teacher explaining the rules, for us to get how this game worked. The game felt like a normal board game with lots of moving components. It was a fun game to play but I wouldn't say enjoyable since it took so long for us to understand how to play. The game could be improved on, for example, maybe making the cash easier to read and not all one color. We didn't end up changing anything and the game audience is geared towards younger teens.",
    "timestamp": 1739055600
  },
  {
    "username": "ghosthack",
    "rating": 3.0,
    "comment": "Too luck dependent. You may do an excelent game, but if the cards you get aren't the right ones, you might as well just quit.",
    "timestamp": 1714600800
  },
  {
    "username": "shamizzu",
    "rating": 3.0,
    "comment": "It's a trick game disguised as a strategy game, so you can easily see one person.",
    "timestamp": 1653343200
  },
  {
    "username": "JustinRRizzo",
    "rating": 3.0,
    "comment": "Open information negotiations don't work for me.",
    "timestamp": 1647990000
  },
  {
    "username": "evancheah",
    "rating": 3.0,
    "comment": "Very very bad game",
    "timestamp": 1629237600
  },
  {
    "username": "John Rogers",
    "rating": 3.0,
    "comment": "Feels like Acquire + Big City with the negotiations of Genoa thrown in for good measure. The result is an easy game both to teach and play and does so in under an hour.\n\nUPDATE: 2.15.11\nI've somewhat cooled on Chinatown. If you get the right plot/shop draws early on its much easier for you to snowball your way to victory. Supposedly the negotiations mitigate this but a good player isn't stupid enough to trade away a good combination of plots/shops. Chinatown does play quickly but if I'm going to suggest a trading game it will be Genoa.\n\nWIFE RATING - 7",
    "timestamp": 1609110000
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "As the game progresses, it becomes easier and easier to calculate the exact potential worth of any asset. Not only does it slow down the game to an excruciating length, but it also solves it, sucking all the interest away. At which point Chinatown reveals its dirty underbelly: a convoluted pasttime that boils down to gambling on the luck-of-the-draw. So you're basically in this weird situation where you need to frustrate the players further by houseruling arbitrary limitations (like enforcing a timer and disallowing calculators) for Chinatown to sort of work, but only insofar as the player with the fastest mathematical intuitions will make deals based on the least incorrect data. No real gameplay happens there.",
    "timestamp": 1599948000
  },
  {
    "username": "Bobekistan",
    "rating": 4.0,
    "comment": "Main issue with the game is that it pretty much needs bad players to allow the crap deals to still exist. Otherwise the trading can be somewhat stagnant after a certain point, ie players that are better at mental maths are going to very quickly realise the order of good - middling - bad trades. As a result this isn't really my type of game, though I understand why so many others fall in love with it.",
    "timestamp": 1760047200
  },
  {
    "username": "Mageknight12",
    "rating": 4.0,
    "comment": "Chinatown relies heavily on negotiation, but without the right group, it falls completely flat. The randomness in tile draws can overshadow any real strategy, making deals feel forced.",
    "timestamp": 1750456800
  },
  {
    "username": "parpari",
    "rating": 4.2,
    "comment": "It is just a cool family game to play with kids. However; I do not like it because the last two rounds of the game is solvable which is dead sentence in negotiation game for me.",
    "timestamp": 1730070000
  },
  {
    "username": "DaneTheBeast",
    "rating": 4.0,
    "comment": "Played (IRL & TTS)",
    "timestamp": 1724882400
  },
  {
    "username": "Smeef",
    "rating": 4.0,
    "comment": "Negotiation where no one ever reaches a deal because you can easily calculate how much value you're getting out of any transaction so you know if it's worth it or not.",
    "timestamp": 1710716400
  },
  {
    "username": "ginsbu",
    "rating": 4.0,
    "comment": "Not for me. I don’t enjoy the free simultaneous negotiation. Too much commotion at the table.\n\nNeeds more uncertainty to be less calculable in later rounds. Otherwise a nicely streamlined design.",
    "timestamp": 1688248800
  },
  {
    "username": "dieteto",
    "rating": 4.0,
    "comment": "Bargaining territory and money",
    "timestamp": 1682719200
  },
  {
    "username": "verandi",
    "rating": 4.0,
    "comment": "Chinatown is in my opinion a poor design. There is a two-tier set collection aspect which is pretty straightforward and boring, the twist being that players get dealt a bunch of tiles randomly and then have to trade with each other to hopefully complete more and better sets than the others. The major problem here is that despite all the randomness there isn't enough ambiguity. Deals are dry as the values of what is being traded are pretty straightforward. The calculable nature of the game makes the randomness seem that much more offensive.",
    "timestamp": 1677538800
  },
  {
    "username": "jmsmith2434",
    "rating": 4.0,
    "comment": "My enjoyment of this game highly depends on who I play it with. Some people are just no fun to negotiate and trade with, which is basically what this game is all about.",
    "timestamp": 1652565600
  },
  {
    "username": "rharn",
    "rating": 5.0,
    "comment": "I like the premise, just felt kinda exhausted. Decisions aren't very interesting, it becomes a spreadsheet calculation near the end. I guess that's just what the negotiation genre is. But won't actively seek out again.",
    "timestamp": 1755900000
  },
  {
    "username": "quadroskeptic",
    "rating": 5.0,
    "comment": "With Ashwin",
    "timestamp": 1751493600
  },
  {
    "username": "lexen",
    "rating": 5.0,
    "comment": "one of the better negotiating games, but could take longer than wished for... maybe a timer would work great, make the deal or lose....",
    "timestamp": 1749506400
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "I liked the game it felt kind of like Big City with negotiations. Something felt off about the game but I can't quite put my finger on just what that was.",
    "timestamp": 1745272800
  },
  {
    "username": "pwoloszun",
    "rating": 5.0,
    "comment": "Fun negotiation game. Good although Panic on Wallstreet seems to be better",
    "timestamp": 1737586800
  },
  {
    "username": "bigfranco",
    "rating": 4.6,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "nametheus",
    "rating": 5.0,
    "comment": "4-5\nabstract",
    "timestamp": 1717365600
  },
  {
    "username": "shmonkey",
    "rating": 5.0,
    "comment": "neat hour long negotiation/trading game.",
    "timestamp": 1716674400
  },
  {
    "username": "esayitch",
    "rating": 5.0,
    "comment": "1) Negotiate and open businesses in Chinatown.\n2) A negotiation game where you can trade prospetic business tiles, already open businesses, lands, and money, over 6 rounds.\n3) I liked: Interesting spatial element, negotiation is always fun.\n4) Could be improved: Too long, too calculable at the end, kingmaker problem without any fuzzy logic did not entice me to play this again.\n5) Modern Art shares similarities (you want to make deals / buy from the weakest player), but is much shorter. Still Chinatown is a good game that should be played at least once.",
    "timestamp": 1715896800
  },
  {
    "username": "turmoilbyrd",
    "rating": 5.0,
    "comment": "Easy to grok for non-gamers. Needs significant calculation",
    "timestamp": 1715119200
  },
  {
    "username": "Daniel109",
    "rating": 5.0,
    "comment": "I dislike negotiation games where trades have an inherent value that can be \"solved.\" It encourages calculation, which should never be involved in a game like this, in my opinion.",
    "timestamp": 1714687200
  },
  {
    "username": "Lemem",
    "rating": 5.0,
    "comment": "A trading game that has a bit too much randomness for my liking along with the fact that trades eventually become fairly calculable.",
    "timestamp": 1712527200
  },
  {
    "username": "Rudbeckia144",
    "rating": 5.0,
    "comment": "A well designed game with lots of interaction going on between players. Each round you get to expand your business on the board. The card and tile draw is random, but you get to be strategic with your limited options and make further deals with your opponents to get what you want.\nThat being said, I 'm not really into negotiation/trading games (Bohnanza being an exception), so this was unfortunately not my cup of tea. But I'm glad I tried it.",
    "timestamp": 1710630000
  },
  {
    "username": "ThingsThing",
    "rating": 5.0,
    "comment": "2.25 Complexity\nPlayed once, I won.\nI am not a fan of the negotiation mechanic, although in this game it does it really well, without feeling forced.\nBasically a business person trying to earn as much as possible while giving as a little as possible for massive gains.\nTook a little over an hour and at the end I can't do it, I can think of many other games that I'd rather play over this game.\nThe board and pieces are a bit drab and hard to grasp at times especially the numbers in the bag.\nI found some parts of this game a little racist, this did not effect my rating of the game, although I am happy to hear it is getting a reprint to be more ethnic friendly (theme park or something)",
    "timestamp": 1695592800
  },
  {
    "username": "jtakagi",
    "rating": 5.0,
    "comment": "I enjoyed playing the new version more, but this was probably because of the people I played with. The new version's box is way too big, as the game has very few components (thus meaning it is way overpriced), but for reprinting a highly-coveted OOP game, I can understand. The board itself is very nicely done and the business tiles are nice, thick and sturdy. Overall I like how this version looks better.\n\nI don't remember the business outlook cards from the other version too much, so I can't comment on that. Ultimately I think I like other negotiation games better. There is a huge amount of luck riding on the card and tile draws, and the end of the game ends up being pretty unexciting as people just collect money, and most tiles and cards drawn are of little value.",
    "timestamp": 1695074400
  },
  {
    "username": "SirDadelot",
    "rating": 5.0,
    "comment": "Sleeved",
    "timestamp": 1692741600
  },
  {
    "username": "silent117",
    "rating": 5.0,
    "comment": "Interesting negotiation game.\n+ Simple mechanics\n+ Decent game length\n- Randomness can and frequently will strongly favor a player (get right building number, draw your own type to complete a building, get good bargaining chip)\n- Very dependent on group to have a great game\n- Typically 1 player is early out of the game\n- Requires players of equal skill",
    "timestamp": 1674514800
  },
  {
    "username": "Trevor03",
    "rating": 5.0,
    "comment": "Chinatown really shows its age, and needs a very loosey-goosey approach to work. Since everything can be mathed out as the game progresses, you almost need the whole group to be inebriated for it to be properly enjoyable. Also certain quieter people can be taken advantage of quite easily in terms of poor deals.",
    "timestamp": 1666821600
  },
  {
    "username": "btasam",
    "rating": 6.0,
    "comment": "Talks of negotiation seep among developing real estate and business opening with the mathing of softly spoken offers amidst shoutful sleight of hand rouses. A harmful sentiment undermines a perfectly stitched together operation while another interloper fights to be valued.\n\nChinatown accomplishes the essence of negotiation beautifully and yet for me, falls short of being an excellent design. Drawing adjacent locations is significantly advantageous, and as the game unfolds on a static board, it's prone to have uneventful rounds.\n\nWaterfall Park nuances the structure of the board and provides more adjacency by offsetting squares, but the result seems to dampen negotiation.",
    "timestamp": 1760652000
  },
  {
    "username": "Bempa24",
    "rating": 6.0,
    "comment": "It is a good game. I'm just not good at auction and trading/bidding/negotiation games.",
    "timestamp": 1759269600
  },
  {
    "username": "Punchiiez",
    "rating": 6.0,
    "comment": "Weight: 2\nPlayer: 3-5",
    "timestamp": 1756677600
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "Like the rulebook expicitly says: Anything goes!\n\nStart talking and make deals. Get the ball rolling. Be willing to negotiate. Negotiate for as long or as little as you’d like. Be creative about it.\n\nIt's purely human stuff.\n\nThe rules are very simple and all complexity comes from psychology and human interaction. With this comes freedom, empowerement, flexibility and variabilty.\n\nCommon points of crticism seem to be:\n1) (Too much) randomness\n2) (Too much) math\n3) (Too) calculable\n\nI assume that these points of criticism, like seeking an anchor in the player aid and being repelled by random chance are related to certain ideas where one is looking for control, from fear of losing out or from desire for balance and fair competition.\n\n1) Yes, estimating values in Chinatown does involve math like many other Euro-style games. This comes in form of multiplications that can be carried out in short time by anyone who hasn't dyscalculia. However, it is not my impression that this point of criticism is typically coming from persons who are affected by functional arithmetical weakness, but from individuals who want everything well calculated by well known formula. That being said, if one overemphasizes perfect calculations he or she is clearly going down the wrong path. This black and white idea of \"I win and you lose\" is meant to be avoided in a good negotiation. A good negotiation is not when someone is cheated or outsmarted, but when everyone profits mutually from each other.\n\n2) Yes, the position of power shifts from one round to the next based on random chance. First, this creates incentives for short-term deals. Second, it makes the game open-ended, creates surprises and affects the social meta.\n\n3) Yes, the final round is calculable. The game creates a certain arc of tension. The first turn is relaxed, cautious, peaceful, where one is connecting to the vibes. In the third to fifth turn things get tense, where people feel all tingly with excitement and where the beauty of the group dynamics unfold. In the end random chance is excluded and it all comes together.",
    "timestamp": 1752789600
  },
  {
    "username": "mynameisthis",
    "rating": 6.0,
    "comment": "Fell flat across multiple plays and multiple groups. Players never felt confident enough in their understanding of the relative value of different things while trading and had little desire to come back to it.\n\nTime to move on.",
    "timestamp": 1752616800
  },
  {
    "username": "Lee_is_me",
    "rating": 6.0,
    "comment": "Chinatown is a simple but fun game about tricking your friends into advancing your agenda. I played with four of my friends who had never played the game before, and it was very easy to pick up and understand. The balancing act of trying not to advance your opponents' prerogative while still getting what you need in a trade creates an interesting gameplay loop, but with a lack of other gameplay elements Chinatown started to feel stale quickly. In my experience, the person who is going to win the game has been obvious by about halfway through. I believe this game would benefit greatly from a sort of \"catch-up\" mechanic. With that being said, if you have a dedicated group of people who enjoy making deals and want an easy-to-understand strategy game this is a good fit.",
    "timestamp": 1739142000
  },
  {
    "username": "juanodark",
    "rating": 6.0,
    "comment": "10",
    "timestamp": 1739055600
  },
  {
    "username": "LexxT",
    "rating": 6.0,
    "comment": "Recently I was able to play Chinatown with a few friends, overall it was enjoyable. Getting started took some time, as the rulebook was detailed, and we had to clarify some points before beginning.\n\nEarly on, I controlled a key location that another player desperately needed to complete their business. He offered a fair trade, but I didnt do it, Eventually, I secured an extra tile that gave me a competitive advantage, showing how strategic withholding and timing matter.\n\nIn the later rounds, two players realized I was in a strong position to win, so they collaborated to weaken my influence by making trades that would benefit each other more than me.\n\nAs a group, we experimented with setting a time limit for negotiations to keep the game moving at a steady pace. This small tweak made discussions more concise and reduced the risk of prolonged deadlocks. It also took us about 30 mins to know what to do.\n\nChinatown is best suited for players who enjoy social strategy games and are comfortable with negotiation-heavy mechanics. People that like deal-making and economic tactics will get the most out of this experience.\n\nThe only thing I didnt like is the rules are a bit complex, as stated. but overall really fun with friends!",
    "timestamp": 1738882800
  },
  {
    "username": "Herakleitos",
    "rating": 6.0,
    "comment": "A pure trading game with an easy to digest ruleset. Chinatown falters for me in its deterministic and calculative endgame. Over the rounds, the game transforms from freeform wheeling-and-dealing (which is good) to a simple mathematical exercise. Everyone knows everything and there is not much to do but churn the numbers. It is really a shame, because the basic premise is quite good and I tend to like these sorts of games. Unfortunately, it has to compete with Bohnanza on the one side and Lords of Vegas on the other -- both of which I'd rather play.",
    "timestamp": 1738450800
  },
  {
    "username": "NormandyWept",
    "rating": 6.0,
    "comment": "Players randomly receive plots of land and businesses to build on them, and then negotiate with one another to try to build sets of contiguously-connected alike businesses to maximise their income - and therefore score.\n\nThe rules are extremely straightforward and are quickly out of the way as the wheeling and dealing takes centre stage.",
    "timestamp": 1734044400
  },
  {
    "username": "resolvecherry",
    "rating": 5.5,
    "comment": "Maybe slightly prefer it to Bohnanza but both suffer from \"I'm trading just for points, which is kinda boring\" - and Bohnanza is quicker and smaller. Both take longer than I'd like for the experience they deliver.",
    "timestamp": 1733266800
  },
  {
    "username": "GoldenTorch",
    "rating": 6.0,
    "comment": "This is decent but not amazing, at least in our three-player game. I'm guessing a bigger group improves the dynamics greatly. And we didn't shuffle our deck well enough to really mix it up.\n\nAdditionally, I realized that the final round is pointless, since there are no future rounds to factor into trade values. Every trade would have to be perfectly balanced to make sense, thus, no trades should occur, unless you're going for pure aesthetics with your store groupings.",
    "timestamp": 1733094000
  },
  {
    "username": "TyrantNomad",
    "rating": 6.0,
    "comment": "Although fun, as both uncertainty & remaining profits dwindle, the final couple of years feel like you're just going through the motions to get to the end - the space for interesting interactions are over long before the end, and there's a lack of mechanics that support this endgame process.",
    "timestamp": 1732834800
  },
  {
    "username": "Brucie_Lee",
    "rating": 6.0,
    "comment": "Tentative rating 6-6.5\n\nI enjoyed this well enough but I felt my decisions were quite limited as I needed A or B and if other players didn't have A or B there wasn't much I could do. It seemed the same for others also.\n\nIt reminded me a lot of Lords of Vegas in terms of how the businesses occupy spots on the board and how larger businesses score more points/get more money and this was similar to how the casinos grow.\n\nThe trading aspect was also quite similar to Lords of Vegas at times with the option to trade money for tiles which is similar to trading lots or dice for money or other things.\n\nBut my main takeaway was that while I enjoyed this and at one time wanted to own it I think Lords of Vegas does enough things similarly are arguably better so I'll stick with that game instead.\n\n\"Don't Buy This\" Reason: Kristoffer owns this.",
    "timestamp": 1729548000
  },
  {
    "username": "Qhorin",
    "rating": 6.0,
    "comment": "2 plays. Sets up a bit like Acquire, but with a ton on negotiation. Very fun for a negotiation game.",
    "timestamp": 1728165600
  },
  {
    "username": "RogerDHyman",
    "rating": 6.0,
    "comment": "Finally sold b/c nobody here wanted to play.",
    "timestamp": 1720216800
  },
  {
    "username": "skyjoee",
    "rating": 6.0,
    "comment": "Played",
    "timestamp": 1719871200
  },
  {
    "username": "HON_BG",
    "rating": 6.0,
    "comment": "A classic, that must be in everyone collections, which gamers, non-gamers, family and everyone will enjoy.",
    "timestamp": 1718834400
  },
  {
    "username": "Alex_P_",
    "rating": 7.0,
    "comment": "Amazing simple introduction into the genre of negotiation games. Super fun.",
    "timestamp": 1760911200
  },
  {
    "username": "TheKilljoy",
    "rating": 7.0,
    "comment": "If you're looking for a game that gets your heart racing, look no further. This boardgame is a real backroom brawler; just straight talk, sharp deals, and a whole lot of second-guessing.\n\nThe mechanics are simple but don’t let that fool you, this game has layers. Wheel and deal property cards and business tiles across the bustling blocks of Chinatown, swapping, selling, and swindling like your livelihood depends on it.\n\nThe juice of the game is in the negotiation; pure, uncut human interaction. Barter. Bluff. It always seems fair until it's not. You think you made the deal of the century? Don’t count your dollars too quick, my friend; half the fun (and all the frustration) is that gnawing feeling that maybe, just maybe, you handed away a goldmine for a corner noodle shop and a handshake. It’s a rollercoaster of emotions and as cutthroat as a back-alley bookie, with more double-crosses than a crooked precint. One minute you’re king of Canal Street, the next you’re crying into your eggroll, wondering how you got took. It’s fast, it’s fiery, and by the end, everybody’s got a story. And probably a grudge.\n\nBottom line? If you have a silver tongue and a stomach for regret, you'll have a great time. Just keep in mind that the only thing more dangerous than a bad deal is thinking you made a good one.",
    "timestamp": 1758751200
  },
  {
    "username": "rongbeo93",
    "rating": 6.5,
    "comment": "I don’t understand why some people consider the theme of Chinatown problematic. To me, it’s a charming negotiation game full of interaction that works equally well with both new and experienced players. While there are elements of randomness, in this case the fun factor far outweighs the lack of strict strategy.",
    "timestamp": 1757023200
  },
  {
    "username": "CunningAllusionment",
    "rating": 7.0,
    "comment": "Racist theme notwithstanding, Chinatown is one of my favorite trading games. It's minimal structure and turnlessness keeps the focus squarely on the trades. I'm never getting it to the table though because the theme is genuinely, pointlessly racist. I know that it got a needlessly convoluted water park retheme, but they also changed the perfectly good mecahnics for no reason.\n\nYOU COULD LITERALLY REPRINT THIS GAME BUT CALL IT \"DOWNTOWN\". WHY!?!?!?!?!?\n\nAnyway, I made my own pnp version of this game that's called Downtown so I could use it to teach economics to my high school students without subjecting them to racist caricatures of their or their friends' communities.",
    "timestamp": 1755727200
  },
  {
    "username": "juasri",
    "rating": 7.0,
    "comment": "//",
    "timestamp": 1755554400
  },
  {
    "username": "shannyn_north",
    "rating": 7.0,
    "comment": "Sean N. 8.5\nFantastic negotiation game. The rules are simple enough to learn in two minutes, and when everything is completely up for grabs, everyone is deal breaking like we were in... well, Chinatown. The board looks absolutely beautiful when the game is done, too. (I was lucky; I picked up my Alea copy for a song...)\nForget it, Jake...",
    "timestamp": 1754172000
  },
  {
    "username": "Jayadevhaddadi",
    "rating": 7.0,
    "comment": "meh",
    "timestamp": 1754085600
  },
  {
    "username": "archite",
    "rating": 7.3,
    "comment": "It's fun enough, but super chaotic. I think there's sometimes kingmaking involved when you begrudgingly accept a trade after loads of debates. But this is really a game that come alive with a group of competitive friends. | With Thi",
    "timestamp": 1753826400
  },
  {
    "username": "Jackieh9",
    "rating": 7.0,
    "comment": "A lot like monopoly but ONLY trading (no game track, rent, etc). It's all about negotiation, with a little bit of building style like foundations of Rome. Also, racially insensitive because it stereotypes the shop categories. The first 4 rounds were awesome because it feels like the possibilities are endless. The last 2 rounds aren't as interesting because you've kind of made your bed. Kyle M taught us at board room.",
    "timestamp": 1753394400
  },
  {
    "username": "darhoog",
    "rating": 8.0,
    "comment": "4-5 | Negotiation",
    "timestamp": 1760479200
  },
  {
    "username": "badassbr",
    "rating": 7.5,
    "comment": "Esse jogo é bem interessante, basicamente é negocie tudo que é possível!\nGostaria de ter jogado mais vezes, mas mecânicas de negociação não é muito meu forte.",
    "timestamp": 1760306400
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "Rules: https://boardgamegeek.com/filepage/22484/chinatown-english-r...",
    "timestamp": 1759960800
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "Could be the GOAT negotiation game, but I got rid of it, just didn't have the drive to really fight for it to stay in the collection.",
    "timestamp": 1759356000
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Fantastic negotiation game. The rules are simple enough to learn in two minutes, and when everything is completely up for grabs, everyone is deal breaking like we were in... well, Chinatown. The board looks absolutely beautiful when the game is done, too. (I was lucky; I picked up my Alea copy for a song...)\n\nForget it, Jake...",
    "timestamp": 1759269600
  },
  {
    "username": "Griffted",
    "rating": 8.0,
    "comment": "A lovely game of trading that is entirely fueled by table-talk interaction and it absolutely sings.",
    "timestamp": 1759269600
  },
  {
    "username": "icheyne",
    "rating": 8.0,
    "comment": "Finally after over 20 years I got to play this classic. I should have bought it back then.\nClean design. One hour long. Lots of tough decisions and player interaction.",
    "timestamp": 1758664800
  },
  {
    "username": "abdurrahim",
    "rating": 8.0,
    "comment": "Pnp sleeved",
    "timestamp": 1758578400
  },
  {
    "username": "AlPacino11",
    "rating": 7.6,
    "comment": "Nice negotiation - economic game!",
    "timestamp": 1757800800
  },
  {
    "username": "darkk_",
    "rating": 9.0,
    "comment": "Build an empire!\n\nCaptivating ✅\nEngaging ✅\nReplayability ✅\nRules ✅\nQuality ✅\n\nMy BGG Perfect 10?\nAcquired 2+ ❌",
    "timestamp": 1760824800
  },
  {
    "username": "sid4321",
    "rating": 9.0,
    "comment": "I have Waterfall park which is a re-theme of this",
    "timestamp": 1759010400
  },
  {
    "username": "EugeneLiu49",
    "rating": 9.0,
    "comment": "Generally negotiation is the genre I like, but Chinatown is very solid and nostalgic for me.",
    "timestamp": 1758060000
  },
  {
    "username": "docker37",
    "rating": 9.0,
    "comment": "Custom Insert",
    "timestamp": 1756764000
  },
  {
    "username": "adel9591",
    "rating": 9.0,
    "comment": "I loved how hectic the negotiation is. So many deals involve every player. I did not run into overly mathy later rounds. Set up takes 30 seconds, fast game play, regular sized box all plusses. Did not like how similar the money is, I might have accidentally traded away a lot more money than I meant to, though that may be important to keep how much money everyone has private.\n\nBest pure negotiation game I've played.",
    "timestamp": 1754776800
  },
  {
    "username": "Oscarplaysboards",
    "rating": 9.0,
    "comment": "Classic negotiation game. Gets players involved.",
    "timestamp": 1754517600
  },
  {
    "username": "TimTimTimTim",
    "rating": 9.2,
    "comment": "3-5",
    "timestamp": 1753567200
  },
  {
    "username": "ianjj",
    "rating": 9.0,
    "comment": "Love this game, got banned from playing it. Still love it.",
    "timestamp": 1753480800
  },
  {
    "username": "MaxTurbo4600",
    "rating": 9.0,
    "comment": "(TTS)\n\nAfter holding out on this forever, I finally played it on TTS and what a phenomenal social negotiation game this is. I can't believe this is not more popular.\n\n---------------------\n\nAs this is out of stock everywhere, and I didn't like the look of the spiritual successor Waterfall Park, I picked up a Chinese copy off of AliExpress. What a great game.",
    "timestamp": 1752962400
  },
  {
    "username": "NOOCX",
    "rating": 10.0,
    "comment": "First time I've played Chinatown was when I found an Alea copy at a public library many years ago, later I got the Z-Man version for myself (both versions have their own charm imo).\n\nI enjoy negotiation in games quite a bit and Chinatown is \"Negotiation - The Game\". Can a game be more stripped down to its core? Minimal ruleset, anything goes, it's all about trading, making win-win deals and the interaction with the other players. I love it, because it is as simple and also random as it is, but you still can play it somewhat serious. Imagine a mixture of Bohnanza and Acquire (at least I can imagine, as I have still not played this classic), where everybody is trading at the same time. A light econonic game, but firstly it's a social game for me.\n\nVery fantastic.",
    "timestamp": 1760824800
  },
  {
    "username": "ethanbg20",
    "rating": 10.0,
    "comment": "This game got me into board games and will forever be a 10.",
    "timestamp": 1751925600
  },
  {
    "username": "Jestertrek",
    "rating": 10.0,
    "comment": "Monopoly as it should have been. This is my favorite negotiation game. You can teach it in about five minutes flat and the social interaction between players is off the chart!",
    "timestamp": 1751234400
  },
  {
    "username": "Gnufie",
    "rating": 10.0,
    "comment": "Masterpiece, board gamer or not great for anyone, absolutely amazing negotiation game.",
    "timestamp": 1742684400
  },
  {
    "username": "kingwilli",
    "rating": 10.0,
    "comment": "[#9] (#7) I had only played this game twice, but loved it from the start. The first negotiation game on the list. I had to wait forever for this one to get reprinted, and now that I finally have my own copy need to get this played more. 10/11/21 I got it back to the table and confirmed how much I love this game. So much that I had to move it into my top 10 games of all time right now. I love this game so much and I also happen to be better at this game than most board games. This one is harder to get to the table, since the negotiation aspect of the game isn't for everyone.",
    "timestamp": 1741993200
  },
  {
    "username": "thealexhopp",
    "rating": 9.5,
    "comment": "This is THE negotiation game. My favorite this about this game is that it's hard to know exactly how much things are worth. A space could be super valuable one turn but could become worthless next turn if you get too greedy and don't make a deal. I love this game.",
    "timestamp": 1739660400
  },
  {
    "username": "khepriq",
    "rating": 10.0,
    "comment": "Love to have a reprint like Ra",
    "timestamp": 1738191600
  },
  {
    "username": "zachmane",
    "rating": 10.0,
    "comment": "Straightforward negotiation game.",
    "timestamp": 1737500400
  },
  {
    "username": "ShiannLin",
    "rating": 10.0,
    "comment": "1999 Spiel des Jahres Recommended",
    "timestamp": 1736982000
  }
]