[
  {
    "username": "ratbulogg",
    "rating": 1.0,
    "comment": "Shortage of city tiles caused the game to go into stalemate. and the destination thing doesn't make much sense.",
    "timestamp": 1533938400
  },
  {
    "username": "TheDS",
    "rating": 1.0,
    "comment": "Rules are completely impossible to understand. Looks pretty, though.",
    "timestamp": 1491343200
  },
  {
    "username": "ExcitingJeff",
    "rating": 2.0,
    "comment": "Never again. Truly painful downtime, math out the ass, and a completely interminable playtime. I respect the design, and clearly it's a very deep game, but it's not even a little fun, and I hate it. A lot.",
    "timestamp": 1438639200
  },
  {
    "username": "BrettK",
    "rating": 2.0,
    "comment": "See my comments about 1830.",
    "timestamp": 1162422000
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "It has a very long tail. I'd never choose this over 1850 and that is a 5-6 hour game.\n–Dislike destination runs here versus 1850.\n–Huge map with low city density, makes for tile track laying contests. If you have multiple companies you can control it better. Later it leads to tile upgrade issues, you use track in silly routes and shut others out.\n–Yellow phase can stick around for ages. It seems to be a feature.\n–Game decided in auction / early phases. For a long game this is bad.\n–Efficiency ops game, squeeze bucks out of multiple companies (1-2 in yellow to buy trains for the others). When the winner runs 4 companies I've lost interest.",
    "timestamp": 1727042400
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not my theme",
    "timestamp": 1646521200
  },
  {
    "username": "kendallgrubbs",
    "rating": 4.0,
    "comment": "What 70 wants to do, it does. It just isn’t that interesting. Share protection is.. cool? But damnit there are too many trains, the bank is too big, the map is just dull as hell. I know people like it. I’ve tried. I don’t.",
    "timestamp": 1758751200
  },
  {
    "username": "saccenti",
    "rating": 4.0,
    "comment": "1870 has a big map, a big company roster, a big train roster. It has destinations. It has price protection. A more complicated market, with alternate ledges. Companies can issue and redeem shares.\n\nNot one thing on that list interests me.",
    "timestamp": 1729288800
  },
  {
    "username": "Jclancy15",
    "rating": 5.0,
    "comment": "Some cool ideas, but not great as a \"game\" on first play. There are a lot of advocates so perhaps more would become apparent with more plays.\n\nMy first impression is that every company being viable is not an intrinsically desirable feature, and it was achieved by making the map hopelessly boring and flat. There isn't -no- tactical intrigue, but much of the game texture seems sanded away.",
    "timestamp": 1756332000
  },
  {
    "username": "evilm2twjunkie",
    "rating": 5.0,
    "comment": "Way too long for what it is.",
    "timestamp": 1705791600
  },
  {
    "username": "Cavedog_pdx",
    "rating": 5.0,
    "comment": "Extremely long 18xx with a lot of trains to buy. After more than a dozen games I think I've had enough and no longer want to play it anymore as I still don't feel like I have any control of the game whatsoever. The winner will often be a player who gets two or three companies and runs one that frequently withholds and stays in the yellow part of the stock market while the other runs for dividends. This is sometimes hard to arrange and hard to stop someone who has successfully started doing so in the 4+ hours you have left to play before they win. The last two hours of this game are the hardest as you're tired after playing 6+ hours but this is when you need the most brain power to figure out how to lay your brown tiles, make your destination runs, and make your destination markers pay off the best. The tile manifest seems maddeningly insufficient for the game. I do like redeeming shares that you reissue later to help raise funds for bigger trains and price protection but otherwise I'd rather play other 18xx titles that are shorter or have a better payoff for the amount of time it takes to play like 2038. Or I'll play 18c2c which is based off of this game but is more about pairing up good companies.",
    "timestamp": 1664834400
  },
  {
    "username": "BayushiKira",
    "rating": 5.0,
    "comment": "Didn't get a chance to play this.",
    "timestamp": 1586124000
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Train Game\n\nThe short game has some great mechanics, and is a lot of fun. The main game has some good ideas too, like the stock market, but I can't help but feel that they aren't properly implemented. When it comes to brass tacks, I just think the game should start about halfway in. Real slow start. I'd like to see what this game does again, but in a much more streamlined experience. A pity, since I love the idea of playing with the MKT in Missouri.",
    "timestamp": 1759356000
  },
  {
    "username": "Lowengrin",
    "rating": 6.0,
    "comment": "After two back to back plays of 1870, I've decided that I just don't enjoy it as much as I thought I might (after my first play). It just runs too long, has at least one too many phases and too many different statuses on the market. Like the Mississippi, it meanders and leaves me lost in the weeds.",
    "timestamp": 1753826400
  },
  {
    "username": "lexen",
    "rating": 6.0,
    "comment": "It's less intense than the iothers in the series wich may be better for others but not for me...",
    "timestamp": 1749506400
  },
  {
    "username": "Balleflass",
    "rating": 6.0,
    "comment": "Too operational for me.\nFound the game to drag on for way too long, but I guess that's because of inexperience.\nThe game would have benefited heavily by being developed in the graphic department some more before a possible reprint.\nAlso, the track laying was way too restrictive for me.",
    "timestamp": 1742425200
  },
  {
    "username": "jatang",
    "rating": 7.0,
    "comment": "Large-ish map for track laying.",
    "timestamp": 1734735600
  },
  {
    "username": "SteffenBarth",
    "rating": 7.0,
    "comment": "Looks interesting, but also a bit long. hmmm....",
    "timestamp": 1724364000
  },
  {
    "username": "Glanzmuecke",
    "rating": 8.0,
    "comment": "I cannot stress how much I love the \"old\" 18xx games, which have SO MUCH to explore and to learn!! These games are just gorgeous and a must-play for 18xx-gamers!",
    "timestamp": 1752530400
  },
  {
    "username": "bankrupt",
    "rating": 8.0,
    "comment": "nfs",
    "timestamp": 1740610800
  },
  {
    "username": "cowbellthunder",
    "rating": 9.0,
    "comment": "Personal PnP project",
    "timestamp": 1756936800
  },
  {
    "username": "arehb",
    "rating": 9.0,
    "comment": "Out of all the 18XX-variants I've played (of which few are modern), 1870 is by a clear margin the most interesting strategically, because there are so many options and possibilities, both early on and later in the game. In my experience there's little reason to play any other 18XX, except if you play 1870 sufficiently enough for it to be nice with some variation. I'm curious to look into if there's any newer or modern 18XX that are in fact better than 1870.",
    "timestamp": 1749852000
  },
  {
    "username": "Stoffey",
    "rating": 10.0,
    "comment": "One of the classics with great replay value, but it can take very long compared to other 18xx titles.\n\nI own the Rails on Board Wooden Station upgrade set.",
    "timestamp": 1739833200
  },
  {
    "username": "cltravag",
    "rating": 10.0,
    "comment": "This is a game of subtleties and razor thin balance. Unlike most recent, popular 18xx games that feature sledgehammer macguffins, 1870 takes a ton of plays to fuly understand the systems in place that govern good play (price protection! Getting a proper set up for a yellow company [different, in practice, than just trashing stock into yellow]! Maintaining destination runs! Burning through the enormous train roster!). The timing game here is subtle, and the tools that govern positional differences are suprisingly opaque. It's possible to win with any starting corporation. Price protection can throw a game as easily as it can win it. Understanding why the sharks who love this game will consistently dumpster you is quite a bit harder to understand than in 1830 or its other derivatives.\n\nI'm not convinced it's \"more fun\" than more standard full cap games, but it is extremely obvious I need (many, many) more plays to form an informed opinion.\n\nEDIT: Yes, this is absolutely a top tier 18xx.",
    "timestamp": 1682373600
  }
]