[
  {
    "username": "ververken",
    "rating": 1.0,
    "comment": "Killed by downforce ! So will play downforce instead when asked.",
    "timestamp": 1560895200
  },
  {
    "username": "Rabbits",
    "rating": 1.0,
    "comment": "If you're a juvenile who likes to laugh at the pain of others because they got screwed by cards or turn order, then this is for you. If you want to play a real game, move on.",
    "timestamp": 1485644400
  },
  {
    "username": "ParisRoubaix",
    "rating": 1.0,
    "comment": "Probably the worst racing game ever.",
    "timestamp": 1361574000
  },
  {
    "username": "Kathrynne1",
    "rating": 1.0,
    "comment": "Lame.",
    "timestamp": 1207519200
  },
  {
    "username": "kherubim",
    "rating": 1.0,
    "comment": "C'est un jeu ça ? Trois parties, que de l'ennui, et le sentiment qu'il est impossible de rattrapper celui qui a pris la tête. Poubelle !",
    "timestamp": 1198105200
  },
  {
    "username": "neuya",
    "rating": 1.0,
    "comment": "Ugly, uninteresting tending to bloody boring, repetitive, and above all : expensive... I don't like this game and I'm surprise with this overall rating...",
    "timestamp": 1159221600
  },
  {
    "username": "RobotFan",
    "rating": 1.0,
    "comment": "I hate this game. The outcome is determined after the second round. The rest of the game is a true waste of time. The last two times I played this game, I wrote down my guess of the winner's name on a peice of paper, folded it and placed it under the game board. This ritual was performed on the second turn of the game. I was right both times. First and second player are the only ones with any chance to win the game unless they do something completely by accident (or stupidity) at some point during play.\n\nThere is no strategic thinking to this game at all. MB's \"The Game of Life\" has more to offer in terms of excitment.\n\nBooooo.",
    "timestamp": 1129413600
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Nothing special",
    "timestamp": 1628546400
  },
  {
    "username": "Kukko",
    "rating": 2.0,
    "comment": "A quick-ish filler, favors the starting player unless he/she draws a really crappy initial hand. Not much game here, you might have 1-2 turns in a game where the choice isn't obvious. Maybe, just maybe, this could be better with a few beers and some spare change for bets, if the balance issues can somehow be dealt with.\n\nUPDATE: Top Race took this in exactly the right direction, rendering Ave Caesar obsolete. The first-second players' edge is so huge the game is borderline broken.",
    "timestamp": 1454454000
  },
  {
    "username": "beckeykevin",
    "rating": 2.0,
    "comment": "Much better than Chutes and Ladders. However, only slightly better than Sorry!",
    "timestamp": 1353020400
  },
  {
    "username": "cymric",
    "rating": 2.0,
    "comment": "A silly racing game in the spirit of Formula Dé and Top Race. Play a card, move your chariot the appropriate amount of spaces, move through one annoying obstacle to get rid of a coin, and be the first to cross the finish line. Although Ave Caesar plays very quickly, it isn't much of a challenge. Now the fact that everyone owns a draw stack means that the luck of the draw evens out to a nice extent, but what card to play doesn't require much thought. It's probably more fun if you play with children.",
    "timestamp": 1323644400
  },
  {
    "username": "mistermarino",
    "rating": 2.0,
    "comment": "Ave Caesar is--and there's no kind way to say it--a bad game. Move to a blocking position if you can. Otherwise, move along the inside track (or larger squares that allow you to move further). Lather, rinse, repeat.\n\nIt's boring and trivial. At least it's mercifully short. Not short enough, though. The optimal playing time for this game would be zero minutes. I take that back. Optimal playing time is minus 20 minutes. It's so bad it should add time to your life as reparations for being such a massive suck.\n\nI played this with four zany, smart guys--not smart enough to avoid this game, but still smart--and even so the experience was exactly like being turned inside out and used as a wash rag in Paris Hilton's bathroom.",
    "timestamp": 1316642400
  },
  {
    "username": "Gryfon",
    "rating": 2.0,
    "comment": "strategy = play the obvious card, hope you aren't blocked.",
    "timestamp": 1309039200
  },
  {
    "username": "djberg96",
    "rating": 2.0,
    "comment": "Way too easy, decisions obvious. Kid's game.",
    "timestamp": 1309039200
  },
  {
    "username": "grasa_total",
    "rating": 3.0,
    "comment": "I was willing to be patient when the game presented me with the inanity of losing-- skipped turns are dumb but hand management to be ready to make the most of a future opportunity was interesting. But then I also discovered the inanity of winning! I was in the lead with two 6s in my hand and so I think had literally no choices for 2/3 of a race. Perhaps I missed a subtlety. But if I'm being unfair to Ave Caesar, well, Ave Caesar started it.\n\n[one partial play, stopped after two races]",
    "timestamp": 1756936800
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "(Don't kill me Darryl.)\n\nWe're bordering party game territory here: short rules, low skill floor, lots of gambling (on the surface), pettiness and comebacks; plus having do a pit stop - er, I meant \"pay respects to the emperor\" - is both a loud funny bit and prevents the same player from being ahead for too long. Take Ave Caesar seriously, though, and it becomes pretty vapid. You can count in advance the length of each track section and determine the exact leeway you have to take the long road before decking out. On a turn to turn basis, it's usually very obvious plays (which is good for the flow, especially at higher player counts that the game wants, but bad for stakes) and smidge of card counting; and you end up blocking other players when you have two options of seemingly equal personal efficiency, so why not screw someone else. When that happens, it does look like something interesting is happening, and maybe that everyone can make faces and shouts words that entertain the illusion, but the intentionality of the perpetrator usually didn't really go beyond \"I did because I could\".\n\nThen comes the deflating energy at the table once a player has cleared the finish line, everyone else gunning for some compensatory gradient of having lost. It only makes sense in the context of some league play with multiple races/tracks - which I have yet to see anyone partake in - but would also probably sway play towards some unwelcome (to me) conservatism. Swap the default scoring for some more top-heavy incentives.",
    "timestamp": 1741302000
  },
  {
    "username": "ultimoratio",
    "rating": 3.0,
    "comment": "Simple and fast racing fun, but rather meh overall and a bit forgettable with so many racing games now",
    "timestamp": 1729116000
  },
  {
    "username": "Ambro11",
    "rating": 3.0,
    "comment": "c.D.",
    "timestamp": 1706050800
  },
  {
    "username": "Quayde",
    "rating": 3.0,
    "comment": "Dated race game which uses multiple plays to 'balance out' evidently better starting positions. Few meaningful choices and some obvious plays left me thinking I'm glad boardgames have moved on.",
    "timestamp": 1634940000
  },
  {
    "username": "ct5150",
    "rating": 3.0,
    "comment": "First play with 6 players was not exciting. I can't see playing this again. I'd rather play Formula De.\n\nLight racing game for up to 6 players.\n(4-6, best w/ 5-6)\n_Weight 1.4\n♥ 45 min",
    "timestamp": 1612566000
  },
  {
    "username": "verandi",
    "rating": 3.0,
    "comment": "oh gawd. In fairness, it's really tough to make a good race game, but this sure ain't it.",
    "timestamp": 1590703200
  },
  {
    "username": "BankofDracula",
    "rating": 4.0,
    "comment": "I guess the enjoyment is derived from blocking other players or possibly with hand management. I've also heard that it's essential to do several races, but I am always ready to be done with it after the first race.",
    "timestamp": 1757455200
  },
  {
    "username": "kniziagamer",
    "rating": 4.0,
    "comment": "Obvious decisions and not much player agency. I would still prefer this over many other racing games though because of its simplicity.",
    "timestamp": 1726956000
  },
  {
    "username": "hiimjosh",
    "rating": 4.0,
    "comment": "Found a cheap second-hand copy in a shop when I was travelling and decided to pick it up. It's great for what it is - a simple, fast-paced racing game. It certainly zips around faster than any other racing game I've seen. The gameplay itself - it's pretty basic. I tend to prefer when racing games have a bit more meat to them\n\nEDIT: Feel about the same the second-time around. Both games at 4p. I think I'd like it more at higher counts as the leader is likely to get blocked by someone they are trying to lap which I find amusing. The simple board is also ripe for more flavorful effects like traps and speed limits. I'm sure you could come up with other variants which would bump this up for me.",
    "timestamp": 1691013600
  },
  {
    "username": "Ranior",
    "rating": 4.0,
    "comment": "I like how simple and interactive and mean the game is...\n\nYet unfortunately I don't think it quite works, at least not at the 5p count I tried it at. You can so easily be unable to play a number you want to be able to, watch someone else do it, fall behind and just keep losing turns where you can't move and are stuck behind everyone, and watch the leader just go on to win the race and front run the whole time.\n\nI think if the map had a few more points where passing was easier this would be eliminated, but then again all the choke points and blocking each other is the only thing the game really has going for it...\n\nSo it falls in this weird spot of it highlights that blocking element prominently, but then it doesn't create a very fun/fair game. Which look not all games have to be fair, but it's not particularly fun to consistently be in the back and losing turns and unable to make a move, while watching the leader just zip around the track and stay in the lead via some well executed moves that you can't do while stuck behind.",
    "timestamp": 1688940000
  },
  {
    "username": "Lecaro",
    "rating": 4.0,
    "comment": "\"Ave Caesar\" ist ein Rennspiel, das schon einige Jahre auf dem Buckel hat und sich anfühlt, als wäre es direkt aus dem antiken Rom entsprungen!\n\nDie Spieler erhalten zu Spielbeginn ein identisches Deck an Karten, von denen sie immer drei auf ihrer Hand halten. Außerdem starten ihre Figuren auf gleicher Höhe auf dem Spielbrett. Wer an der Reihe ist, spielt eine Karte aus der Hand aus und zieht seine Spielfigur um die angegebene Anzahl Schritte nach vorne. Der führende Spieler darf dabei keine '6' ausspielen, es sei denn, er hat lediglich diese Kartenart auf der Hand. Drei Runden sind zu absolvieren, wobei eine davon an Cäsar in einer Art Boxengasse vorbeigezogen werden muss, um ihn zu huldigen.\nNachdem es ein Spieler nach drei absolvierten Runden über die Ziellinie geschafft hat, endet das erste Rennen. Nach drei Rennen mit unterschiedlicher Streckenführung gewinnt ein Spieler und darf sich freuen!\n\nIch habe das Gefühl, dass in \"Ave Caesar\" der zweite Spieler einen enormen Spielvorteil hat. Er kann sich bis zum Schluss im Windschatten des Führenden ausruhen, seine zurückliegenden Kontrahenten blockieren und am Ende mit einer '6' am Führer vorbeiziehen. Der Führende indes wird durch seine eigene Kartenhand blockiert, sobald er zwei 6er auf der Hand hält. Alle anderen Spieler werden durch die verschiedenen Engpässe des Parcours gezielt ausgebremst und verlieren damit zu viele Bewegungspunkte, um effektiv voran ziehen zu können!\n\"Ave Caesar\" wurde mir als Vorgänger zu \"Flamme Rouge\" beworben und es mag durchaus so sein, doch sein 'Nachfolger' ist um Welten besser designt und ich spiele es sehr gerne. Dieses Spiel kann ich nicht wirklich empfehlen.",
    "timestamp": 1673132400
  },
  {
    "username": "Chuggas",
    "rating": 4.0,
    "comment": "Don't really like this kind of racing game but it isn't bad.",
    "timestamp": 1671318000
  },
  {
    "username": "Gelete",
    "rating": 4.0,
    "comment": "Racing games are not my cup of tea and I prefer Winner´s Circle or Formula De over this one.",
    "timestamp": 1636326000
  },
  {
    "username": "SammySnijbonen",
    "rating": 5.0,
    "comment": "This game is full of youth sentiment. There was a copy at the North Sea apartment where I used to spend two weeks during the summer holidays as a 10-11-12-... year old. But I think I would've been better off cherishing the memories of playing this game, rather than tracking down a copy to play it again. It just doesn't hold up against the many high-quality games I've discovered during the past decennium.\n\n Clever card play and forcing your opponent to waste cards (i.e. making them take the outer bend) form much of the tactical play in this game. As a kid, you felt really clever when you made your dad run out of cards before he made it to the finish line.\n\n There's a good variety of different tracks.\n\n----\n\n The tracks in the 2005 reprint have been redesigned. The clever card play mentioned above seems to have been completely eliminated. Try to look for a 1989 printing instead of the new one. It's more fun.",
    "timestamp": 1759701600
  },
  {
    "username": "Beastly_Venturer",
    "rating": 5.0,
    "comment": "4 plays. Not terrible but nothing something I would clamber to play either. At least it is quick.\n\nStill the best racing pure game I've played.",
    "timestamp": 1740265200
  },
  {
    "username": "erwinhabes",
    "rating": 5.0,
    "comment": "SOLD!",
    "timestamp": 1739142000
  },
  {
    "username": "niblet22",
    "rating": 5.0,
    "comment": "Only played one race so rating might change at a future attempt. Race plays quickly, rules say 'being mean' is the best way to play but that's not really my type of game.",
    "timestamp": 1715378400
  },
  {
    "username": "Stas",
    "rating": 5.0,
    "comment": "Took a lot longer than I expected, but this is definitely a fun light game. And by light, I mean feather-weight.\n\nNot to be taken too seriously considering the main goal is to make life difficult for your fellow racers and they will be doing the same to you.\n\nLast played: Nov 2007",
    "timestamp": 1710630000
  },
  {
    "username": "titianbonce",
    "rating": 5.0,
    "comment": "Not really my cup of tea and I find it banal. But, it's clearly a popular game and good fun to play with the family on Christmas Day.",
    "timestamp": 1701212400
  },
  {
    "username": "GarcianIII",
    "rating": 5.0,
    "comment": "Just about passable for 1989 family entertainment but I would also like to think that families of 1989 could get a whiff of the lack of catch up mechanisms partnered with outright randomness.\n\nWhat is worse is that at high player counts, there is a compounding negative factor of those grouped together inevitably blocking each other more often, furthering the advantage of the breakaway. The leader not being able to play a 6 is not enough.\n\nI wondered about allowing players not in first place to play sets from their hand. I found if you draw into 1s or 2s, you tend to keep them in your hand as a last resort and hope to dig into your higher numbers. However, with this filtering tendency, you can often draw into multiple low numbers and have little choice. If a non-leading player could play sets (or even runs) from their hand, it will allow them to more readily refresh their hand whilst duly surprisingly opponents and further catching any leader who cannot do this. Indeed, players may even save their higher numbers in order to play x2/x3 for a big swing of fortune. Of course if the track is open enough for such a boost.",
    "timestamp": 1696975200
  },
  {
    "username": "Ellogeyen",
    "rating": 5.0,
    "comment": "5-20 plays (2010)",
    "timestamp": 1696802400
  },
  {
    "username": "zardon",
    "rating": 5.0,
    "comment": "Played the original version. Pure race game. Play a card, move that distance; but could cause blocking or become blocked.\n\nThe first player has a huge advantage if they have play a 6 as their first go, and its almost impossible to catch them.\n\nThere are way better race games out there.\n\n5/10",
    "timestamp": 1691877600
  },
  {
    "username": "ToreDenmark",
    "rating": 5.0,
    "comment": "It was probably a good game at 1989. Today it feels very dated and uninteresting.\n\nI can think of at least 10 better racing with a racing theme. Downforce is the direct improvement and for a way better racing experience look at Flamme Rouge or Heat",
    "timestamp": 1690063200
  },
  {
    "username": "stiltr01",
    "rating": 5.0,
    "comment": "Zippy pacing and nice production, but it doesn't seem like the choices you are presented with are very interesting.",
    "timestamp": 1687039200
  },
  {
    "username": "rynelf",
    "rating": 4.5,
    "comment": "--Feb2007-- Pleasant race game of modest complexity. While it pales a bit (for me, at least) in comparison to Daytona 500 and its siblings, it's satisfactory.",
    "timestamp": 1680559200
  },
  {
    "username": "okram",
    "rating": 5.0,
    "comment": "Rating based on 1 play.\n\nAn unlucky start throws you to the back of the pack which probably means you'll lose movement points as the leader(s) can dictate the pace and block the best paths. It's still quite fun, but modern racing games accomplish the same things more elegantly even without adding too much complexity.",
    "timestamp": 1679954400
  },
  {
    "username": "superdupergeek",
    "rating": 5.0,
    "comment": "This is a beautiful production! Amazing plastic chariot sculpts and thick chunky plastic coins to throw to the emperor. The artwork, boards, cards, chits and all playing pieces are really well done and as a product this is really top notch. Unfortunately I didn't really enjoy the gameplay as its just too simplistic with very few decisions and most moves being totally obvious. I enjoyed a single quick 5 player game with buddies but by the end of it I was confident that I have other racing games that I would always pick over this. Fortunately I managed to sell it the day after I bought it and got exactly what I paid for it!",
    "timestamp": 1679612400
  },
  {
    "username": "jaceycole",
    "rating": 6.0,
    "comment": "6.0 - 1 play, 6 player - Not really many interesting decisions, perhaps even less than Magical Athlete. Considering the boring theme, I don't see this getting played compared to Magical Athlete or Winner's Circle. It's less exciting then both.",
    "timestamp": 1759788000
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 4005556264056\nIJL5",
    "timestamp": 1757196000
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "A very very very VERY boring racing game.",
    "timestamp": 1755295200
  },
  {
    "username": "s-man",
    "rating": 6.0,
    "comment": "I used to be over the moon about this game. It is in essence a tight charriot racing game with fast turns and sufficien interaction when you reach a chicane. The fact that being forced to take the longer outer lanes too often will leave you without sufficient cards to even finish the game, forces you to clean up your card balancing act constantly. Paying tribute to the emperor as a condition for victory elegantly fixed what might otherwise have been a runaway leader issue. A lot of good stuff here, but unfortunately it hasn't aged all that well.\n\n[i]Rating: 7 (like it) - 1 for datedness/I]",
    "timestamp": 1754776800
  },
  {
    "username": "ueyinnafesh",
    "rating": 6.0,
    "comment": "씁 이게 살짝 아쉽다. 기대와 다르진 않은 재미이나, 선턴이 결국 이긴다. 변주도 얼마 없다. 변형 룰은 많지만 결국은 비슷한 양상.",
    "timestamp": 1753308000
  },
  {
    "username": "pininforthefjords",
    "rating": 5.9,
    "comment": ".",
    "timestamp": 1752616800
  },
  {
    "username": "Mayaheine",
    "rating": 6.0,
    "comment": "A hand-management racing game with a slight similarity to Downforce in that you have to choose the best option from several at each move.",
    "timestamp": 1749765600
  },
  {
    "username": "Alquerque",
    "rating": 6.0,
    "comment": "Divertido, accesible, cuantos más jugadores mejor. Ideal para no jugones. Después de unas cuantas partidas se hace repetitivo; los niños no pusieron interés y Jesús, con el que lo jugamos normalmente, se hizo su copia. Vendido.",
    "timestamp": 1742598000
  },
  {
    "username": "Gaius",
    "rating": 6.0,
    "comment": "Beautifully simple and straightforward racing game with great components. Having only played once, other than the occasional blocking of your opponent it seems very obvious what your move should be. Almost more of a party game than a strategy game as the winner seems to come down to the luck of the draw. Perhaps more plays would allow me to appreciate the subtle strategy here, but for how simple and fast it plays it definitely gets kudos for not pretending to be something it is not.",
    "timestamp": 1741388400
  },
  {
    "username": "arcastbooster",
    "rating": 6.0,
    "comment": "Asmodee edition.",
    "timestamp": 1730934000
  },
  {
    "username": "mischip",
    "rating": 6.0,
    "comment": "Dan",
    "timestamp": 1723068000
  },
  {
    "username": "Joel_L",
    "rating": 6.0,
    "comment": "Easy to teach, easy to play. Fun table banter and short play-time.",
    "timestamp": 1717711200
  },
  {
    "username": "von wildensee",
    "rating": 6.0,
    "comment": "/Partially painted chariots.",
    "timestamp": 1710025200
  },
  {
    "username": "Manpower84",
    "rating": 6.0,
    "comment": "4, 5, 6, (5) (6) Spieler\n30 Min",
    "timestamp": 1703718000
  },
  {
    "username": "Jillys",
    "rating": 7.0,
    "comment": "180kr med frakt blocket",
    "timestamp": 1758319200
  },
  {
    "username": "mawilson4",
    "rating": 6.5,
    "comment": "I don't want a lot of rules overhead in my racing games. Get me into it quickly, provide some funny moments, and end quickly, and I'm happy.\n\nI haven't played enough to know if there are spectacular moments here. But it checks all those boxes I just mentioned, which is good enough to call it a solid experience.",
    "timestamp": 1757973600
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 4005556015788\nGL2",
    "timestamp": 1757628000
  },
  {
    "username": "forslund",
    "rating": 7.0,
    "comment": "Very quick and fun racing game",
    "timestamp": 1757541600
  },
  {
    "username": "Fuzzel",
    "rating": 7.0,
    "comment": "Kurzweiliges Familienspiel. Je mehr Spieler, desto chaotischer/besser.\nEine gute Alternative zu dem gehypten \"Heat - pedal to the metal\".",
    "timestamp": 1751148000
  },
  {
    "username": "Zenfire",
    "rating": 7.0,
    "comment": "I don't usually like racing games, but this one I do enjoy playing. Flamme Rouge done right! We used \"Ram\" variant, which I feel is essential, makes the game so much more fun.",
    "timestamp": 1749333600
  },
  {
    "username": "Holzmichel01",
    "rating": 7.0,
    "comment": "Well, after playing it, I know now why this game is so hard to rate...\n\nOn one hand, it is just effortless fun - you play cards, and see what happens... and usually, all kinds of fun situations (and emotions) will be triggered... when people are blocked, getting in the lead of their declared personal rival, or one just revealed the 3rd value 1 card in a row... there is always laughter around the table.\n\nNow, when it comes to strategy and tactics, there is not much here - the cards you should ideally play are in 95% of all cases obvious, and who is winning is largely dependent in which order cards come up... so, mechanically speaking, the game plays itself...\n\nHowever, in a Kids and Family, or Beer and Pretzels kind of situation, it is perfect.",
    "timestamp": 1749247200
  },
  {
    "username": "Ddyraw",
    "rating": 8.0,
    "comment": "Crazy fun, could go to a 10 if my family likes it too!\n\nneeds family play and more plays",
    "timestamp": 1759442400
  },
  {
    "username": "G4rzilla",
    "rating": 8.0,
    "comment": "Fast, furious and fascinating chariot racing game.\nIts to play for casual plays but, it shines at a tournament mode. At low players countdowns its fine, but for 4-6 players its shines. And have a few variants in the rulebook. My favorite one its the combat variant.",
    "timestamp": 1756764000
  },
  {
    "username": "Openair",
    "rating": 8.0,
    "comment": "Good fun in a big group",
    "timestamp": 1756159200
  },
  {
    "username": "Laingy",
    "rating": 8.0,
    "comment": "Love this race game.",
    "timestamp": 1751839200
  },
  {
    "username": "JohnGrimes",
    "rating": 7.5,
    "comment": "Evergreen",
    "timestamp": 1750716000
  },
  {
    "username": "Yokiboy",
    "rating": 8.0,
    "comment": "This is a great game of fast and furious take-that action. It is not for everyone though, as it is quite mean spirited, but holy heck is it fun with the right crowd. We normally laugh to the point of crying when playing this game.",
    "timestamp": 1749074400
  },
  {
    "username": "Mease19",
    "rating": 8.0,
    "comment": "This is an excellent light racing game. Its easy to teach and fun to hear people stand up and shout \"Ave Caesar\" when they toss their coin. The screwage is delightful, yet seldom malicious or personal. I only wish they had an expansion with a few more tracks...",
    "timestamp": 1745704800
  },
  {
    "username": "FR_IT",
    "rating": 9.0,
    "comment": "Still the best game to end your game-night.\nFast and for bad guys...may i block others palyers? Yes off course, you must",
    "timestamp": 1760824800
  },
  {
    "username": "rigacu",
    "rating": 9.0,
    "comment": "Vienna",
    "timestamp": 1760220000
  },
  {
    "username": "magdalencox",
    "rating": 9.0,
    "comment": "School",
    "timestamp": 1758492000
  },
  {
    "username": "oursino",
    "rating": 9.0,
    "comment": "L’un de mes jeux préférés, ambiance garantie autour de la table. Une course de chevaux simple et prenante.",
    "timestamp": 1744840800
  },
  {
    "username": "VesterbroBraetspil",
    "rating": 9.0,
    "comment": "Great fun. Feels really good to completely destroy another players turn",
    "timestamp": 1741647600
  },
  {
    "username": "TheMitchMaster",
    "rating": 9.0,
    "comment": "The best racing game out there, and one of the best 6p game also.",
    "timestamp": 1738537200
  },
  {
    "username": "King_Nav",
    "rating": 9.0,
    "comment": "I own the Korean reprint.",
    "timestamp": 1734908400
  },
  {
    "username": "100pcBlade",
    "rating": 10.0,
    "comment": "Fun, fun game. Lots of luck (although not without a degree of decision making) but that doesn't matter 'cos it plays quickly and it's just fun. \"please don't force me to go round the outside again\"; \"You can't seriously be thinking of stopping me Hailing Caesar!\" My favourite 'filler' by far (note that total plays is actually 4x that listed) as we always play best of 4 races but I only log this as one play)",
    "timestamp": 1756418400
  },
  {
    "username": "HANNUMAN",
    "rating": 10.0,
    "comment": "Best racing\ngame",
    "timestamp": 1735513200
  },
  {
    "username": "Cuchulainn1795",
    "rating": 10.0,
    "comment": "I received this classic for Christmas, making me insanely happy!\n\nIn Ave Caesar we find ourselves being whisked back in time, to the days of the Roman Empire, the Caesars, and the Circus Maximus. Caesar has ordered a day of chariot racing, and we - the best drivers in the Empire - will risk life and limb to entertain the crowd, win the approval of the Emperor, and make a chariot load of money in the process.\n\nIn this game, each player starts with an individual deck of 24 numbered cards, ranging from one to six repeating four times, and a coin to be thrown at Caesar at the end of either lap one or two.\n\nThe cards control the number of spaces your chariot can move each turn, but there's a very small surplus in the total number of movement points each deck contains, being forced to take corners on the outside too many times can see you run out of movement, your horses getting totally exhausted, and you not able to make it to the finish line! Along the home straight, there is a narrow channel, The Emperor's Ally, which each chariot must enter at the end of one of the first two laps, stop, throw their coin in the game box, and shout at the top of their voice, \"AVE CAESAR!!!\" Failure to do this will see that player disqualified from the race. Worse still, it's now the law in most countries that this is done, and failing to do so will result in arrest and imprisonment for five years hard labour, cleaning out the stables! :O)\n\nAfter three gruelling laps, the driver who has best conserved the strength of his/her horses, will cross the line, bringing an insanely cheering crowd to its feet, and winning fame and glory throughout the Empire!",
    "timestamp": 1735426800
  },
  {
    "username": "Icy Manipulator",
    "rating": 9.8,
    "comment": "2023: 19\n2024:",
    "timestamp": 1704409200
  },
  {
    "username": "SergeBabiychuk",
    "rating": 10.0,
    "comment": "Winning is not the point of this game!",
    "timestamp": 1703804400
  },
  {
    "username": "cyrunicorn",
    "rating": 10.0,
    "comment": "Great even with 2 players only (thanks to the Team Gladiator variant)",
    "timestamp": 1702767600
  },
  {
    "username": "Invicta Bricks",
    "rating": 10.0,
    "comment": "A pure racing game. The game is simple and plays quickly enough not to get in the way of the race, but still gives you agency and great interaction.\nFor me this is a perfect racing game.",
    "timestamp": 1687989600
  }
]