[
  {
    "username": "voynitsky",
    "rating": 1.0,
    "comment": "Oh god. Never again...never.",
    "timestamp": 1502748000
  },
  {
    "username": "larryjrice",
    "rating": 2.0,
    "comment": "Another speed game which can get really confusing when the left becomes right and right becomes left cards are put into play. Basically, you seek to play out of your cards first in a speed reaction game where you can challenge someone for being too slow or playing incorrectly and force them to take the pot. It will almost force you to develop a bit of a twitch as you try to keep up with the flow of the game! However, for me, Jungle Speed scratches this itch so avoid the Twitch!",
    "timestamp": 1218146400
  },
  {
    "username": "Tsaar",
    "rating": 3.0,
    "comment": "Speed game. Yuk.",
    "timestamp": 1499119200
  },
  {
    "username": "mi_de",
    "rating": 4.0,
    "comment": "Game or torture device for the fumle-fingered? You decide!\nSimilar to Jungle Speed, just harder to read the cards.",
    "timestamp": 1502748000
  },
  {
    "username": "Mulligans",
    "rating": 5.0,
    "comment": "okay game , nothing special.",
    "timestamp": 1322002800
  },
  {
    "username": "catjuggler",
    "rating": 5.0,
    "comment": "Loved this until I got Jungle Speed.",
    "timestamp": 1249423200
  },
  {
    "username": "-Johnny-",
    "rating": 6.0,
    "comment": "Very Jungle Speed-esque, but harder.",
    "timestamp": 1327100400
  },
  {
    "username": "ArqMage",
    "rating": 6.0,
    "comment": "It's a game of mental reflexes which I enjoy as light filler. Some brains don't work at the same speed, though, so some people will get really frustrated with this game right off the bat.",
    "timestamp": 1319407200
  },
  {
    "username": "pezpimp",
    "rating": 6.5,
    "comment": "Based on one play: A speed game as it should be, just play a card and follow the rules as it passes the turn to another player. The card can read left, right, redo, play again or even send the turn to a specific player. It makes for some laughs and likely the same player will always be the one making mistakes as speed games tend to do. The randomness of the cards can make it so that you do not play for a while but you can never look away.",
    "timestamp": 1453330800
  },
  {
    "username": "Kankra",
    "rating": 8.0,
    "comment": "owned 1998\n\nplayed about 10x more\none of the best reaction-games ever\nbetter working with odd number of players",
    "timestamp": 1470866400
  },
  {
    "username": "matthulgan",
    "rating": 8.5,
    "comment": "I love Jungle Speed, but I might like this one a little better. The challenge cards really make the game sing. You have to be paying attention to play on your turn, but you are also constantly on the offensive to bust your opponents. The frequent catchphrase in this game is, \"The bowl never lies.\" I highly recommend this one.",
    "timestamp": 1573686000
  },
  {
    "username": "stephenkeller",
    "rating": 9.5,
    "comment": "It's almost entirely a pure dexterity game but what fun it is.",
    "timestamp": 1456441200
  }
]