[
  {
    "username": "lawmen",
    "rating": 1.0,
    "comment": "這遊戲玩了兩次，每次牌都可以被拿走，還有一場被拿走兩次，然後牌被拿走後只能空轉，只能說我不會再玩了",
    "timestamp": 1750284000
  },
  {
    "username": "Fantazindy_",
    "rating": 1.0,
    "comment": "A popular party game from the old days\n- Heavily focused on negotiation, which may not appeal to everyone\n- Feels too outdated to stand out among modern board games",
    "timestamp": 1740956400
  },
  {
    "username": "SithCats",
    "rating": 1.0,
    "comment": "The only game I've ever hated more than this one was Diplomacy.",
    "timestamp": 1673305200
  },
  {
    "username": "WasanCH",
    "rating": 1.0,
    "comment": "Burn it !!\nGame doesn't make sense no rule mess up &@#$",
    "timestamp": 1613689200
  },
  {
    "username": "DaniDCR",
    "rating": 1.0,
    "comment": "Un interminable puteo sin sentido alguno! Mojonazo del 1!",
    "timestamp": 1425596400
  },
  {
    "username": "Lawnjob",
    "rating": 1.0,
    "comment": "As is, I consider the game broken and unplayable. The Permanent Investors make it so that it's always in your interest to offer to accept the LOWEST amount possible as long as you are included in a deal, because you don't lose anything and at least you're getting some money instead of none. I think if you took away the Permanent Investors and reworked some other ideas you could have a nice game.",
    "timestamp": 1224194400
  },
  {
    "username": "jayouzts",
    "rating": 1.0,
    "comment": "This game was extremely popular when it was first released. Basically the last person to make a trade wins the game. There is no planning, no decision-making. Just a lot of swapping cards with no purpose. Its like Pit without the Chaos.",
    "timestamp": 1198882800
  },
  {
    "username": "kirkusmaximus",
    "rating": 1.0,
    "comment": "Not a game. Including a D6 doesn't make random cardboard a game.",
    "timestamp": 1198364400
  },
  {
    "username": "Wassail Games",
    "rating": 1.0,
    "comment": "Excellent. A game I really don't like. I cannot believe how bad I thought (I know others like it but...)this game was. To make it worse is it in a big box - how many boxes of Fluxx can you fit in there. I am still in a state of shock. So glad I have played it though cos I don't have to play it again. I won't either. I'm glad we all like different games - I'd hate to like this one.",
    "timestamp": 1150840800
  },
  {
    "username": "pezboy",
    "rating": 2.0,
    "comment": "SELL - A3 - SELL ?35? (Mike has?)",
    "timestamp": 1732230000
  },
  {
    "username": "DisasterAiR",
    "rating": 2.0,
    "comment": "No structure and time limit of negotiation. The game drags forever when someone screws the deal with TAKE THAT cards.",
    "timestamp": 1535061600
  },
  {
    "username": "gojaejin",
    "rating": 2.0,
    "comment": "Broken mechanic where card-switching cards are overwhelmingly more powerful than anything else. Most of the strategy is exchanging everything but the switchers, and the winner is determined by who draws more of them. For a light mafia/loot-sharing type game, I prefer Cash & Guns or Mafia de Cuba.",
    "timestamp": 1522533600
  },
  {
    "username": "StephenV",
    "rating": 2.0,
    "comment": "Good for loud people, which I am not.",
    "timestamp": 1485471600
  },
  {
    "username": "davebo",
    "rating": 2.0,
    "comment": "This has grown on me after my second play.",
    "timestamp": 1430949600
  },
  {
    "username": "bellynice",
    "rating": 2.1,
    "comment": "Thought I'd like it, but this just isn't my type of game.",
    "timestamp": 1427410800
  },
  {
    "username": "sourwyrm",
    "rating": 2.0,
    "comment": "too many 'screw you' cards in circulation that get in the way of this being any good at all",
    "timestamp": 1323730800
  },
  {
    "username": "wkover",
    "rating": 2.0,
    "comment": "A negotiation game with endless interruptions? Ugh. God, do I hate this game.\n\nEverything that is brilliant about other negotiation games (Intrigue, e.g.) - breakable promises, the reliance on others for victory, temporary alliances, etc. - is missing here.\n\nAnd as much as I dislike this Sackson \"classic\", it gets ten times worse when people even come close to taking it seriously:\n\n\"You're all ganging up on me!\"\n\n\"You won't let me play cards!\"\n\n\"I can't win!\"\n\nSweet lord - someone kill me.",
    "timestamp": 1294700400
  },
  {
    "username": "cnaujok",
    "rating": 2.0,
    "comment": "Not a game for my taste. Too hectic, without real decisions to be made. Agonizing ebb and flow of \"Bidding & Shouting\"-battles and long periods of stupid card collecting. Don´t understand the fame it got...",
    "timestamp": 1294441200
  },
  {
    "username": "Alxz21",
    "rating": 3.0,
    "comment": "sold 750",
    "timestamp": 1722895200
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not for me",
    "timestamp": 1628892000
  },
  {
    "username": "Jimmy_Dean",
    "rating": 3.0,
    "comment": "Unfortunately the game is broken with a certain play style of the other players. The first game is usually great, but the following games are boring and static.",
    "timestamp": 1618178400
  },
  {
    "username": "eddiebessiere",
    "rating": 3.0,
    "comment": "Im not a confrontational person\nIF you like arguing and manipulating and pushing your luck\nIgnore my rating",
    "timestamp": 1534456800
  },
  {
    "username": "brassomason",
    "rating": 3.0,
    "comment": "Can't seem to get players to stop decreasing their share just to get into the deal, making the game less fun.",
    "timestamp": 1458601200
  },
  {
    "username": "curtc",
    "rating": 3.0,
    "comment": "Either the game is broken, or I don't understand the strategy. It seems like you always want to lowball everyone else. I think there are better negotiation games out there (e.g. Chinatown, Traders of Genoa). As such, I certainly won't be playing again to try to figure it out.",
    "timestamp": 1445292000
  },
  {
    "username": "orange",
    "rating": 3.0,
    "comment": "Rowdy negotiation game, with luck of the draw, and high screwage factor. Needs the right crowd to play. Enjoyable once in a while if played fast. the player who can withold his best cards the longest or the one who keeps drawing good cards tends to win.",
    "timestamp": 1396389600
  },
  {
    "username": "enzo622",
    "rating": 3.0,
    "comment": "While this started off engaging and exciting, I ended up very disappointed with the experience and would be hard-pressed to try this one again. This is the type of game that I say \"collapses under its own weight\" in that what makes it fun ends up making it burdensome. We'd often negotiate for several minutes but then when the deal was finalized, someone would say, \"Oh, I don't like the sounds of that, let's [quash it/take it over/send someone on a plane and introduce a new character, etc]\". At first this was crazy-fun amusing(!) but it got tiring for me quickly. Perhaps there should be a \"speak now or hold your peace\" around the table in order. After constantly having deals worked out, quashed, restarted, quashed, etc. I grew tired of the whole experience.\n\nThe cherry on that parfait was when one player was able to consummate two deals entirely by himself and make an absurd amount of money (15 and 16M). We all felt the game was effectively over and called it there two hours into the game. I'd need some kind of modification to the negotiation process if I were to try this again.",
    "timestamp": 1356822000
  },
  {
    "username": "Ninebreaker2",
    "rating": 3.0,
    "comment": "Chaotic negotiation game which is further proof that negotiation games are not my bag.",
    "timestamp": 1322953200
  },
  {
    "username": "RConsonni",
    "rating": 4.0,
    "comment": "Negotiation game with simple rules, and LOTS of backstabbing and take that. King-making is very common. Fortunately, the games tend to be short.",
    "timestamp": 1702767600
  },
  {
    "username": "jtakagi",
    "rating": 4.0,
    "comment": "A fun negotiation game, though not as frenetic or loud as I anticipated. The card distribution can make a big difference, but as long as the game moves quickly, it doesn't bother me. Even the take that cards don't really matter all that much. I'm not sure how much skill there is to the negotiations, it seems like it's best to hold back as long as you can as the share prices increase.",
    "timestamp": 1695074400
  },
  {
    "username": "Nathardicus",
    "rating": 4.0,
    "comment": "It's a bit clunky and really just a negotiation game. It's interesting that you can have cards to limit some negotiations but it's not a strong enough game to keep coming back to the table.",
    "timestamp": 1648504800
  },
  {
    "username": "Ange_Berlin",
    "rating": 4.0,
    "comment": "That's an anachronistic game. I guess it was good back in the day, but we got so many better games today",
    "timestamp": 1579474800
  },
  {
    "username": "Eric Brosius",
    "rating": 4.0,
    "comment": "I'm rarely a fan of open ended negotiation games. And the temptation to try to wait to play your \"I'm the Boss\" card until the end ruins the game when played by people like me.",
    "timestamp": 1531605600
  },
  {
    "username": "byturn",
    "rating": 4.0,
    "comment": "a very cutthroat negotiation game. the design itself is brilliant but this is not for me. many people seem to like this though.",
    "timestamp": 1525212000
  },
  {
    "username": "poome",
    "rating": 4.0,
    "comment": "Well I hate this game. However it seems my friends love it. It is too annoying. I have games that people have interaction or bluffing. But This game is too much. I still give 5 stars because some of my friends join our board game night because of this game haha.",
    "timestamp": 1517180400
  },
  {
    "username": "stanace",
    "rating": 4.0,
    "comment": "Best for 5 to 6",
    "timestamp": 1516834800
  },
  {
    "username": "puzzleme",
    "rating": 4.0,
    "comment": "-\n\nThe English title is, I'm the Boss.\nA completely random and extremely chaotic ‘negotiation’ game. I feel it is overrated, perhaps because of Sid Sackson's name. I do like Sid Sackson (Focus, Acquire, Sleuth,) but I'm very disappointed with this game. It's total chaos. More than half the playing cards are designed to throw the game off its normal flow. If you take this game seriously, you will be very disappointed, otherwise for an hour’s worth of a crazy wild ride it can be fun.\n\n-",
    "timestamp": 1514588400
  },
  {
    "username": "PotatoKing_",
    "rating": 5.0,
    "comment": "이 게임의 원초적인 상호작용이 떠오를 때가 있다",
    "timestamp": 1739746800
  },
  {
    "username": "Origami_Shido",
    "rating": 5.0,
    "comment": "Good game. But it has requirements, just like a free-trade market--you never play this with people with intimacy.",
    "timestamp": 1722808800
  },
  {
    "username": "Beru",
    "rating": 5.0,
    "comment": "#archived",
    "timestamp": 1701558000
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "A light game of wheeling and dealing! I just love how silly the whole thing is",
    "timestamp": 1687039200
  },
  {
    "username": "leaucat",
    "rating": 5.0,
    "comment": "depends on the people involved",
    "timestamp": 1674255600
  },
  {
    "username": "LabRat002a",
    "rating": 5.0,
    "comment": "This game is half pure negotiation and half playing randomly drawn cards. It's an odd balance since it can be very take that, but at the same time you need people to want to side with you. I prefer my negotiation games to have something more tangible to trade, like in Catan or Monopoly. In this game, yes you have a role card that is needed to meet some deal requirements, but other players can have other members of your family in their hand to play to fill those needs. Or a deal could be struck only to be upended by someone playing a travel card on one of the people. Or a stop card could be played to cancel a card play. You could also play 3 recruitment cards (they are worthless as singles) to steal role card. The cards are just randomness, and they make the negotiations harder and add to players holding grudges. On each player's turn, they get to be the boss to work out the current deal. Or if they don't like the deal, roll the die to land on another. Fortunately you don't count already concluded deals, so there's always some deal that can be worked out. But if you still don't like the rolled deal, you can draw cards instead. As the boss of the deal, you negotiate trying to get the families required for the specific deal by splitting up the shares the deal is worth. They become worth more as the game goes on, but you may have burned your bridges by that point. And once 10 deals have been met, you roll a die after each deal with increasing likelyhood that the game will end. So you don't know how long the game is going to go. You draw your cards randomly. The deal that you are allowed to broker is random. And you have to convince people to work with you, but everyone wants to be in the lead cause all that matters is having the most money at the end. It's just too random and too much pure negotiation for me. It's not a bad implementation for what it is, but it just doesn't attract me. Good artwork for the theme though. And it is rules light. The box is bigger than it needed to be.",
    "timestamp": 1667343600
  },
  {
    "username": "BenRon",
    "rating": 5.1,
    "comment": "1",
    "timestamp": 1656972000
  },
  {
    "username": "stroutqb22",
    "rating": 5.0,
    "comment": "Quite a fun, simple negotiation game.",
    "timestamp": 1655244000
  },
  {
    "username": "2KittiesAreNotEnough",
    "rating": 5.0,
    "comment": "Fun game. I'm just not a very aggressive player usually, so its not entirely my kind of game.",
    "timestamp": 1650492000
  },
  {
    "username": "cscottk",
    "rating": 5.0,
    "comment": "Traded for Flower Power.",
    "timestamp": 1646866800
  },
  {
    "username": "FranklinTV",
    "rating": 5.0,
    "comment": "I like how clean the game is, even though I'm not great at negotiation games, but willing to give a go. However, this doesn't seem to work with my current gaming group, so a melancholy 6 (2/3/13). UPDATE: Still to play another game, but Im getting itchy to play this again, as I have hope it will be a better experience next time (Rating 6.815, Mar 2015). UPDATE: Pub Meeple Ranking Engine Dec 2020 (Rating: 7.291). UPDATE: This type of negotiation game does not work with me or my group (Rating 5.007, Jan 2022)",
    "timestamp": 1640991600
  },
  {
    "username": "Lightstorm",
    "rating": 5.0,
    "comment": "This one's a blast! Especially fun when somebody gets angry during play - \"c'mon! Lighten up!\"",
    "timestamp": 1630360800
  },
  {
    "username": "leeuw62",
    "rating": 5.0,
    "comment": "albernes, hektisches Spiel aus den Anfängen des Brettspiels",
    "timestamp": 1627509600
  },
  {
    "username": "shammois",
    "rating": 5.0,
    "comment": "It's an ok game if you're ok with the chaotic nature of it all. I don't mind swinginess in games if they're brief, or if they have some sense of narrative. But here the game feels too long, and the swinginess more about the cards themselves than the players holding them.",
    "timestamp": 1609801200
  },
  {
    "username": "mdelesd1",
    "rating": 5.0,
    "comment": "Delightfully evil game. Plays quickly and easily and is better the more people there are playing. A negotiation game everyone should own.",
    "timestamp": 1587160800
  },
  {
    "username": "Boxer Santaros",
    "rating": 5.0,
    "comment": "On the surface this game was appealing to me because it featured negotiation. After a few plays I was enjoying the subtle economy of drawing cards and playing cards and the backstabbing. However, I soon realized that it's not just negotiation that I like, but trading and the incentive to trade.\n\nThat incentive is lacking because with 6 players all the tools are in everyone's hands to complete all the deals. And the extra investors are quickly pulled in at lower player counts. What results is a game of knife-fighting back and forth making sure you get cut the least.\n\nThere is also hidden trackable information with regards to money. I have played it open money which I feel evens out the game a little.\n\nOverall, big old case of \"It's not you, it's me\".",
    "timestamp": 1568757600
  },
  {
    "username": "grasa_total",
    "rating": 5.0,
    "comment": "Pure negotiation is just not for me.",
    "timestamp": 1553468400
  },
  {
    "username": "tmarozas",
    "rating": 5.0,
    "comment": "Great if you like to haggle.",
    "timestamp": 1521932400
  },
  {
    "username": "TheSlushySnake",
    "rating": 6.0,
    "comment": "Investor-Themed, Deal-Making Negotiation Game.\n5-6 Players. (Best With 6 Players).",
    "timestamp": 1756591200
  },
  {
    "username": "Coralouwho",
    "rating": 6.0,
    "comment": "#LetterI\n#BGA, #Tutorial",
    "timestamp": 1756072800
  },
  {
    "username": "Punchiiez",
    "rating": 6.0,
    "comment": "Weight: 1.5\nPlayers: 3-6\nParty game",
    "timestamp": 1755554400
  },
  {
    "username": "tbrofromspace",
    "rating": 6.0,
    "comment": "love that this and intrigue came out at the same time.",
    "timestamp": 1743804000
  },
  {
    "username": "atticus1347",
    "rating": 6.0,
    "comment": "VGC",
    "timestamp": 1738710000
  },
  {
    "username": "schafffff",
    "rating": 6.0,
    "comment": "Less fun than I expected..",
    "timestamp": 1731452400
  },
  {
    "username": "mixmixmix",
    "rating": 6.0,
    "comment": "A pretty enjoyable game for 4-5 players, especially when a leader is evident and everyone picks on them.. not quite enough fun for repeated plays.",
    "timestamp": 1716933600
  },
  {
    "username": "bneffer",
    "rating": 6.0,
    "comment": "Good social game. YOu must pay attention to who has pulled down what deals, or they will sneak a victory past you and make you think someone else is winning. Not well balanced, the players must balance this game.",
    "timestamp": 1711580400
  },
  {
    "username": "jokris",
    "rating": 6.0,
    "comment": "Negotiation game. A little too chaotic card play though",
    "timestamp": 1711062000
  },
  {
    "username": "GeorgW",
    "rating": 5.5,
    "comment": "Monopoly: The party game?\n\nPros:\nThe openness of the negotiation and the freedom that the card play offers makes it so the game quickly disappears and all that's left is players interacting.\n\nI like that the game ramps up and has an uncertain end-point, it means that the game remains tense throughout.\n\nCons:\nThere is very little you are allowed to negotiate about, which means that each deal ends up feeling samey. There's supposed to be some nuance to the board, with some spots being more specific or requiring more investors, but since all payouts scale to the number of investors, it's way, way too easy to default to 1 share per investor and 1 to the boss as a fair deal. Sure, you can threaten to use your cards or to kill the deal but that's also the full extent of your wiggle-room and that mostly just shuffles around the payout. Killing the deal isn't nearly threatening enough to matter, it will cost the active player 1 share compared to the fair deal so you can't pressure them for more than that as a collective.\n\nThe eponymous \"I'm the Boss!\" card is way too good, also for whoever sits after you in turn order, but I guess that's fine for what amounts to a silly fun game.\n\nThere are a bunch of variants in the rules, which puts me off. Find the best rule-set and publish that, I shouldn't have to play-test the game for you.",
    "timestamp": 1703372400
  },
  {
    "username": "AmandaDesignsGames",
    "rating": 6.0,
    "comment": "I've played this game twice, and had two very different experience. I think the game is bad at presenting that it is a party game for people who like to make their friends angry. I usually am very up for that, but I think many other games (QE, Ponzi Scheme, High Society) do it muuuuuuuuch better.",
    "timestamp": 1701817200
  },
  {
    "username": "sunyi199179",
    "rating": 6.0,
    "comment": "算是我最喜欢的聚会游戏之一了。我玩这个游戏的时候从来不考虑输赢的，怎么开心怎么玩。",
    "timestamp": 1698271200
  },
  {
    "username": "zsknight",
    "rating": 6.0,
    "comment": "CJ YY",
    "timestamp": 1688508000
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "Not really my sort of game.",
    "timestamp": 1672182000
  },
  {
    "username": "OGNOG",
    "rating": 6.0,
    "comment": "OG. (Rating non-indicative of game quality.)",
    "timestamp": 1649109600
  },
  {
    "username": "holf",
    "rating": 6.0,
    "comment": "一個吃咖的遊戲，主軸本來應該是玩家之間互相合作完成交易，透過報酬的分配來談判、說服，但若是玩家之間都不合作，那也只是抽牌遊戲而已",
    "timestamp": 1645311600
  },
  {
    "username": "tiagoVIP",
    "rating": 5.5,
    "comment": "Designer: Sid Sackson\nPlaying time: 60 Min\nWeight: 1.97 / 5\nPublisher: Eagle-Gryphon Games\n\nCOMPLEXITY: Low\nCOMPONENTS: N/A\nDOWNTIME: Medium\nFUN: Medium\nINTERACTION: High\nPLAYING TIME: Medium\nLUCK: High\nREPLAY VALUE: High\nSOLITAIRE: Very low\nTHEMATIC: Low\n\nComments: I'm the Boss! is a strategy game about negotiation, dice rolling, take that, set collection and hand management. The ideia is that players draft cards in order to make the best house, using bonuses, tools and worker move around the board, and in the spot they stop they can either draw cards or start a deal. Deals, if done, earn money to everyone involved (normally more for the \"boss\", the one leading the deal). Cards can do all sorts of effects, even be able to make deals all by himself. Once a number of deals is done, the game will be over, and the player with the most money will be the winner!\n\nI'm the Boss! has a lot of interaction, but can be dangerous in some groups, as the play, to have a fine pace, demands people to want to make deals, furthermore, with the openess of the negotiation, is quite easy to cut some people off, making bashing the perceived leader (which might not even be, as money is secret) very easy, along side a lot of room for take that (stealing cards, changing who is the boss, blocking the use of some cards, etc).\n\nOverall, I'm the Boss! is an alright game, but is heavily group dependent, and, with the amount of luck built in, many people will be at odds with it. I had some good games, and also some dreadful, thus I'm very on the fence, and find I'm the Boss! better for occasional plays with a more light-hearted crowd.",
    "timestamp": 1642892400
  },
  {
    "username": "charlest",
    "rating": 6.0,
    "comment": "Mean game of pure negotiation. Enjoyed it but not something I want to go to often. I enjoy my negotiation in a less pure form, typically with area control or dudes on a map.",
    "timestamp": 1638572400
  },
  {
    "username": "SVan",
    "rating": 7.0,
    "comment": "One of the best negotiation game I've ever played. Simple, but plenty of options. You have to know when to play your cards and when to bow out.",
    "timestamp": 1756677600
  },
  {
    "username": "Card",
    "rating": 6.7,
    "comment": "[$] Best with 6 (3-6) 60 mins, Age:12, 1.97 [$40]",
    "timestamp": 1756072800
  },
  {
    "username": "Generalkhun",
    "rating": 6.5,
    "comment": "Good talking game. Fun if you got your close friends together to act nasty breaking promise and backstabing around. Still not as opaque as it should be. Deals are too easy to figure out the value so the spice will just come mainly on how entertaining level of the group. Like zoo vadis, if the group is not close friends enough the game will be as flavorful as a drinking water",
    "timestamp": 1752962400
  },
  {
    "username": "rossum",
    "rating": 7.0,
    "comment": "Sold to Mai's friend for $25",
    "timestamp": 1752357600
  },
  {
    "username": "Zephyr_Falcon",
    "rating": 7.0,
    "comment": "7",
    "timestamp": 1749160800
  },
  {
    "username": "Indoril007",
    "rating": 7.0,
    "comment": "Great negotiation game. Sort of game I enjoy making the wrong decision in. I know I shouldn’t be playing half my hand to protect my stake in this deal, but I have already come this far, and it’s too much fun laying down a vengeful stop card or sneaky I’m the boss card.",
    "timestamp": 1741993200
  },
  {
    "username": "Gumstep",
    "rating": 7.0,
    "comment": "Deals deals deals. Pure deal making and take that.",
    "timestamp": 1740697200
  },
  {
    "username": "john1212",
    "rating": 7.3,
    "comment": "1.0",
    "timestamp": 1740697200
  },
  {
    "username": "Rustic",
    "rating": 7.0,
    "comment": "Nikki: 7",
    "timestamp": 1736982000
  },
  {
    "username": "jerevinan",
    "rating": 7.7,
    "comment": "강력한 우정파괴 게임\n재밌다",
    "timestamp": 1757455200
  },
  {
    "username": "Addiction2k",
    "rating": 8.0,
    "comment": "An absolutely amazing game that's more about playing the players than playing the actual game.",
    "timestamp": 1752703200
  },
  {
    "username": "speter22",
    "rating": 8.0,
    "comment": "The BGA implementation is pretty bad, and maybe not just because it's in Beta? I don't know if a game like this can truly find its groove online. Very much looking forward to an in-person game of this, one day.\n\nFeels like the silliest version of a negotiation game you could get while still having solid mechanisms behind it. Worried that too much of the game might devolve into a shouting match about who has the most/least money (but honestly, that's maybe not the worst thing).",
    "timestamp": 1750111200
  },
  {
    "username": "dbucak",
    "rating": 8.0,
    "comment": "Typically accompanied by a lot of yelling in our house.",
    "timestamp": 1747519200
  },
  {
    "username": "leviathangr",
    "rating": 8.0,
    "comment": "What a blast! Never expected that from such an old negotiations game.",
    "timestamp": 1747432800
  },
  {
    "username": "Adil3tr",
    "rating": 7.5,
    "comment": "The only thing this needs is more variable/interesting things being awarded from deals. Like if they added the commodities from QE, three times with their own scoring logic, it would make the game more interesting to the end and would have less pressure to just split deals down the middle.",
    "timestamp": 1744149600
  },
  {
    "username": "ShiannLin",
    "rating": 8.0,
    "comment": "1994 Spiel des Jahres Recommended",
    "timestamp": 1733353200
  },
  {
    "username": "wimb",
    "rating": 8.0,
    "comment": "3H",
    "timestamp": 1732575600
  },
  {
    "username": "dirtball",
    "rating": 8.0,
    "comment": "Gryphon Games (2013)\nEnglish language edition\nComplete and in excellent condition.",
    "timestamp": 1731884400
  },
  {
    "username": "jaceycole",
    "rating": 8.5,
    "comment": "8.5 - 1st play, 6 players - What a romp of a good time! It's all about getting in on those deals. The negotiations work surprisingly well, but its the special cards that really make this game a blast! You gotta roll with the punches. You gotta pick your times to get cards vs being the boss which is a difficult trade-off. It helps to know who is out fo stop cards if you wanna steal an investor. And it played in about an hour, which was perfect. I think this is gonna beat our Zoo Vadis and Dragon's Gold as my preferred big group negotiation game.\n\n8.5 - 2nd play, 6 players - Tried with some non-gamers, and one found it very stressful. You do need a somewhat bold group, perhaps even moreso than Zoo Vadis. I think this game is a riot, though I'd probably want a generally cut-throat group. If everyone plays nice, it's less fun. Great to have a not-too-long game that plays six well. As far as negotiation games at this count I prefer it to both Zoo Vadis and Bohnanza.",
    "timestamp": 1759010400
  },
  {
    "username": "vergilkilla",
    "rating": 9.0,
    "comment": "Clever card play keeps this from being a \"who is the loudest\" sort of affair. Has way more dimension than most negotiation games i play or have played",
    "timestamp": 1757800800
  },
  {
    "username": "Samuel Vriezen",
    "rating": 8.5,
    "comment": "Fun, frustrating, silly, ugly",
    "timestamp": 1755727200
  },
  {
    "username": "OMD56",
    "rating": 9.0,
    "comment": "Initial Score: 9",
    "timestamp": 1741388400
  },
  {
    "username": "AlexCLD",
    "rating": 8.6,
    "comment": "Great classic. Bought a new copy of the game (7,10 euros in Mathom) of this discontinued game here in Spain.\n\nNegotiation, take that elements and lots of fun with the right group. If you enjoy interaction and having to talk your way out of tricky situations you'll probably enjoy this one inmensely.",
    "timestamp": 1734735600
  },
  {
    "username": "salkind",
    "rating": 9.0,
    "comment": "This game has the ability to turn everyone who plays it into the most evil, shrewd negotiator you've ever dealt with. I'm The Boss has a magic to it that other negotiation games with more interesting mechanics don't have, and to me makes it a much better game",
    "timestamp": 1728856800
  },
  {
    "username": "MAKOKI",
    "rating": 8.5,
    "comment": "#1 free-form negociation game",
    "timestamp": 1723500000
  },
  {
    "username": "PeleWebb",
    "rating": 9.0,
    "comment": "Incredibly cutthroat but I love how relatively quickly it plays",
    "timestamp": 1704322800
  },
  {
    "username": "genoan",
    "rating": 9.0,
    "comment": "A joy",
    "timestamp": 1703026800
  },
  {
    "username": "TForever",
    "rating": 10.0,
    "comment": "This game is a riot! You are being unfair to your friends to their faces, and you need their help. Best with 5 players.",
    "timestamp": 1744408800
  },
  {
    "username": "zachmane",
    "rating": 10.0,
    "comment": "It's always been a hit each time I played it. But it can be played too many times, otherwise it loses its charm.",
    "timestamp": 1738537200
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "Negotiation that is WILD and changes constantly as cards get flung down. When I think of most negotiation games, they’re the total opposite, slow and quiet. But there’s still some structure here, if nobody can cancel a certain card, maybe one player is guaranteed to be in the deal. So it’s more orderly than it appears, just buried in the chaotic outer shell. Love this about Sackson’s games.\n\nReminds me of Cosmic Encounter -- people either love it or hate it. You have to be a scheming jerk with no morals to be good at it, which is just awful. Who would like such a game?! Me, that's who.\n\nMy greatest boardgaming memory of all time: playing \"I'm the Boss\" card three times in a row, all of them getting cancelled by the boss. And then meekly slinking back and admitting, \"you're the boss.\" So few games even attempt that kind of drama, much less ones about business.",
    "timestamp": 1732316400
  },
  {
    "username": "tea93",
    "rating": 9.5,
    "comment": "A4",
    "timestamp": 1701817200
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "new\nface2face 2004 multi language edition",
    "timestamp": 1685397600
  },
  {
    "username": "vladsee",
    "rating": 10.0,
    "comment": "Really fun game of business negotiations game with backstabbing, deal making and breaking! Cards are used to make or break deals. Will play this anytime!",
    "timestamp": 1682719200
  },
  {
    "username": "Urbanwatts",
    "rating": 10.0,
    "comment": "With the right group, not many games get better than this!\n\nSeems fragile but it works oh so well.",
    "timestamp": 1648677600
  },
  {
    "username": "drlongbottom",
    "rating": 10.0,
    "comment": "No, I'M the Boss!",
    "timestamp": 1638486000
  },
  {
    "username": "Mrticktack",
    "rating": 10.0,
    "comment": "Very fun, back stabbing game. It was a hit with my friends. I pull it out strategically knowing who i will be playing with.",
    "timestamp": 1521673200
  }
]