[
  {
    "username": "DadDialTone",
    "rating": 1.0,
    "comment": "Posted.",
    "timestamp": 1734649200
  },
  {
    "username": "Boltana",
    "rating": 2.3,
    "comment": "Playtime is way too long and rules feels like an early prototype",
    "timestamp": 1430258400
  },
  {
    "username": "darker",
    "rating": 3.0,
    "comment": "Fun: Setup, the theme, the phased battle (and some effects therein).\n\nFlaws: Using the published rules, if you lose the 5-minute game called 'Setup', you're hosed for the 3+ hour game called 'Battlemist' . Lots of fiddling with chits. The common econo-wargame problem of \"when A and B fight, C wins\". Takes a long time to play.\n\nThe big, huge problem which is the main reason I haven't played in years: Victory nearly always comes via the hero questing, which is the most random, arbitrary part of the game, and barely ties into the main wargame at all - it's like you're playing two parallel games: one flawed but interesting, the other infuriatingly arbitrary...and it's the latter that determines who wins.\n\nGets what credit it does from the theme, the fun parts of the wargaming, and the fact that setup is neat. If you and your friends care more about playing through an epic fantasy struggle together than victory being achievable via your strategy, you might enjoy it.",
    "timestamp": 1403128800
  },
  {
    "username": "philip.dutre",
    "rating": 4.0,
    "comment": "I think I played it once, then sold it.",
    "timestamp": 1552777200
  },
  {
    "username": "primordia",
    "rating": 5.0,
    "comment": "Not very good really. Of course, I don't care for Twilight Imperium either.",
    "timestamp": 1497477600
  },
  {
    "username": "multi_killer",
    "rating": 5.0,
    "comment": "Can consider 1",
    "timestamp": 1366581600
  },
  {
    "username": "OldManMerton",
    "rating": 6.4,
    "comment": "I have a nostalgic fondness for this game due to it being the first game I purchased on my own as an adult. 20 years later, I'm finally thinking it's not really my thing. I love the combat system in the game, but the quest system is tedious and unexciting and the game leans far more heavily into \"wargame\" territory than really suits my tastes.",
    "timestamp": 1541458800
  },
  {
    "username": "enderhuntiii",
    "rating": 6.0,
    "comment": "Old fantasy wargame.",
    "timestamp": 1535234400
  },
  {
    "username": "Enthused Dragon",
    "rating": 7.0,
    "comment": "KEEP\nPlayer Count: Recommended with 3, Best ?\n\nNotes:\nOwn a second copy (smells like tobacco)",
    "timestamp": 1753221600
  },
  {
    "username": "Lord_Loren_Soth",
    "rating": 8.0,
    "comment": "2-6",
    "timestamp": 1707951600
  },
  {
    "username": "Jammer",
    "rating": 9.0,
    "comment": "Epic fantasy gaming at it's best. Set aside a good six hours and journey into the world of Mennarra as one of six different races with different strengths and weaknesses and no two games will ever play the same.",
    "timestamp": 1054418400
  },
  {
    "username": "ReignsEternal",
    "rating": 10.0,
    "comment": "I have loved this game since I bought it, release day, at Gencon.",
    "timestamp": 1258326000
  }
]