[
  {
    "username": "Buzz",
    "rating": 1.0,
    "comment": "Wha?????? Who is what when?",
    "timestamp": 1055714400
  },
  {
    "username": "chaddyboy_2000",
    "rating": 2.0,
    "comment": "I'm not at all a fan of the core mechanism of bluffing/guessing when people are bluffing, and I'm even less a fan of the memory element required in this game. Never again.",
    "timestamp": 1610492400
  },
  {
    "username": "lee elektrik",
    "rating": 3.0,
    "comment": "Impressively convoluted gameplay. Three different resources that you don't really need. Terrible artwork and \"funny names\". We tried several rounds to find the interesting part about this game, but without success. All the same, generally an interesting concept, only executed poorly.",
    "timestamp": 1467324000
  },
  {
    "username": "Emile",
    "rating": 4.0,
    "comment": "When people say that this game requires the right kind of players, they mean people not like me. I can play social games, but anything requiring me to shout out something before someone else will probably not be a favorite.\n\nI finally had a game that went past blind guessing into educated guessing. I think this game requires multiple plays with the same people, because its usually pretty easy to know what new players are doing. I'd say Die Kutschfahrt zur Teufelsburg is a big improvement, although a fair bit longer as well.",
    "timestamp": 1215727200
  },
  {
    "username": "Mazoon",
    "rating": 5.0,
    "comment": "Sein oder Nicht sein - Hexagames",
    "timestamp": 1611010800
  },
  {
    "username": "Red Dress",
    "rating": 5.0,
    "comment": "Not a bad social deduction game at all, however it lacks the elegance and mechanics of Avalon - a game I would rather play.\n\nHowever, if you cannot scrounge 5 players, then Hoax is a fun game for 3-4 players.",
    "timestamp": 1505599200
  },
  {
    "username": "rynelf",
    "rating": 6.0,
    "comment": "--Mar2012-- A blast from the past: not sure which group this should be aimed at; but I think it might be amusing with the right set of people (and fall dead with the wrong set.)\n--May2012-- Worked nicely for my two older children: they thought it was great fun.",
    "timestamp": 1680559200
  },
  {
    "username": "JayIsTired",
    "rating": 6.0,
    "comment": "Hoax is fun, but it lacks something. You get to a point where it basically becomes clue mixed with Werewolf, but doesn't exactly hit the sweet spot that werewolf has. It does work for 4 players though, so if you want a werewolf type game for little players, this may be it.",
    "timestamp": 1499378400
  },
  {
    "username": "rseater",
    "rating": 7.0,
    "comment": "this is the best incorporation of lying into a game that I've ever seen. You have to lie to win, and you have to lie a lot, but others are afraid to call you on it. But if anyone catches you telling the truth, it's really bad.\n\nhowever, it is hard to teach and thus hard to get onto the table",
    "timestamp": 1715119200
  },
  {
    "username": "Mallet",
    "rating": 8.0,
    "comment": "Fun game !",
    "timestamp": 1483570800
  },
  {
    "username": "Eggo",
    "rating": 9.0,
    "comment": "a classic and predecessor of many new games",
    "timestamp": 1192140000
  },
  {
    "username": "Ottia",
    "rating": 10.0,
    "comment": "The Future Pastimes team never took prisoners when designing board games, but Hoax is radical even by their own standards: one character out of six is assigned to each player for the game (two players can share a character, actually) but any character at all can be usurpated to use its abilities and discover other players' characters, the quicker the better. Beside the normal use of a character's abilities and making formal guesses in their turn, players can ignore the turn order to call out hoaxes, accuse players of being this character or the other and even use some other characters' abilities.\n\nThe result is a monster that revels in its own disorder: a game can last barely minutes or go on for ages while players try to disentangle the mess brought by too many calls at the same time. Don't expect fair endings either: getting the resources for formal guesses isn't that easy when some characters can't be used any longer (this happens after a player's hoax has been discovered), so that in the end a player can win or lose purely on last-ditch accusations.\n\nAnd this must be played without taking any single note.",
    "timestamp": 1379541600
  }
]