[
  {
    "username": "Kamaitatchi",
    "rating": 1.0,
    "comment": "Play cards to move the spaces on said card, try to keep as many tokens on the board as you can in as big a blob as you can.",
    "timestamp": 1478300400
  },
  {
    "username": "Engoduun",
    "rating": 2.0,
    "comment": "Pretty boring, doesn't really grab me. Meh.",
    "timestamp": 1645570800
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "It has its moments but card draw can be painful.",
    "timestamp": 1724796000
  },
  {
    "username": "metalitiousness",
    "rating": 4.0,
    "comment": "The game is OK. Nothing flashy or interesting, but I can't really knock it for a negative game experience. Just feels bland and unmemorable.",
    "timestamp": 1753567200
  },
  {
    "username": "hyde_70s",
    "rating": 5.0,
    "comment": "I was hoping this would be one of those chess like games for people who don't like chess, but it is just the former. Pitty, as I adore most of Kosmos 2 player line. That said, If you like chess, this would probably be much higher for you.",
    "timestamp": 1760220000
  },
  {
    "username": "Fevin",
    "rating": 5.4,
    "comment": "Plats mais rapide. Pas immonde mais pas passionant.",
    "timestamp": 1735167600
  },
  {
    "username": "VibroChimp",
    "rating": 6.0,
    "comment": "I can appreciate some degree of randomness in an otherwise abstract game like this, but in this case I feel that there’s too much luck as the game progresses and your choices become more constrained.",
    "timestamp": 1760652000
  },
  {
    "username": "peacmyer",
    "rating": 6.0,
    "comment": "Pleasant tactical two-player affair. Two copied Traded.",
    "timestamp": 1754431200
  },
  {
    "username": "jrloy",
    "rating": 6.5,
    "comment": "A fun two player confrontation game.",
    "timestamp": 1761011820
  },
  {
    "username": "n3423",
    "rating": 8.0,
    "comment": "장미전쟁 엘보드",
    "timestamp": 1761115080
  },
  {
    "username": "scottdarrington",
    "rating": 8.6,
    "comment": "A superb couples game, with the ideal balance between snappy turns and slowing down to think things through. This is one we'll be playing for a while to come.\n\nUpdate: Wow, the older version of this is gorgeous! The wooden tokens are one thing, and I can understand why cardboard might be cheaper, but why in the world would you replace all the hand-drawn illustrations with cheap-looking 3D renders?? Every illustration in this edition is more appealing and fully thought through. Why would you do this hard of an own-goal, Kosmos?",
    "timestamp": 1740697200
  },
  {
    "username": "Purri",
    "rating": 9.5,
    "comment": "Sleeved",
    "timestamp": 1738278000
  }
]