[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "A very euro approach to rock paper scissors..... and that's it? The way money transfers around the table, the way arresting thieves earns VP, the way sets are compared, everything feels so rigid and lifeless. Like it doesn't trust players to create an economy, nor to play rock paper scissors. Glimmers of mindgames peek through the cracks, but it's so hard to access. And just to make sure nobody falls behind too far, there's CATCHUP VP.\n\nThe whole objective of grouping sets of fancy artwork makes me think of Modern Art, but with 0 attention on the theme here. It's just possessions, the game is about collecting them and showing them off, not about judging their value. A very euro approach to that sort of thing, though I guess it still feels modern (as a concept it was born old).",
    "timestamp": 1754690400
  },
  {
    "username": "mrbeankc",
    "rating": 1.0,
    "comment": "Tedium on a stick. Takes 10 minutes to see this is nothing more than 4 player rock paper scissors and nothing else. This game is so bad that when I played it for the first time way back when it was first released in the US by Avalon Hill it put me off euros for more than a decade.",
    "timestamp": 1390777200
  },
  {
    "username": "Krenshar",
    "rating": 1.0,
    "comment": "Simply awful. I can't even begin to describe how awful this game is.",
    "timestamp": 1292540400
  },
  {
    "username": "Tsaar",
    "rating": 1.0,
    "comment": "Once played with 6. Random, ridiculous and repetitive.",
    "timestamp": 1276898400
  },
  {
    "username": "thorndor",
    "rating": 1.0,
    "comment": "Miserable. Simply Miserable.",
    "timestamp": 1250805600
  },
  {
    "username": "Der Ubermolch",
    "rating": 1.0,
    "comment": "It's rock paper scissors crossed with rummy. Which is to say it has a point arbitrarily arrived at. No thank you.",
    "timestamp": 1149631200
  },
  {
    "username": "Gr.R.",
    "rating": 1.0,
    "comment": "Any game that I can win, with just doing random actions isn't worth playing...",
    "timestamp": 1143410400
  },
  {
    "username": "EinGlasWurstWasser",
    "rating": 2.0,
    "comment": "{\n\"min_duration\": 20,\n\"max_duration\": 45,\n\"players\": [4,5]\n}",
    "timestamp": 1687644000
  },
  {
    "username": "harbanne",
    "rating": 2.0,
    "comment": "Boooorrrrriing. Just a game of guessing and of luck. The bluffing aspect of the game isn't for me.",
    "timestamp": 1409004000
  },
  {
    "username": "Kate2538",
    "rating": 2.0,
    "comment": "Very mechanical game that doesn't suit a small group. Might be better in a larger group, if I could ever muster the enthusiasm to try - but I think that is unlikely. For now, it is buried at the bottom of games I prefer. Likely to be traded or sold in the near future.",
    "timestamp": 1389826800
  },
  {
    "username": "HalloSchwester",
    "rating": 2.0,
    "comment": "One of the games I do not like. IMO, the actions of the fellow players are too unpredictable.",
    "timestamp": 1367186400
  },
  {
    "username": "HannibalUltor",
    "rating": 2.0,
    "comment": "Box shows some wear. Components are in good condition.",
    "timestamp": 1320447600
  },
  {
    "username": "Engoduun",
    "rating": 2.0,
    "comment": "I'm not sure about this one... it was okay to play once, yes - but a second time? Hmmm. I don't think so.",
    "timestamp": 1315346400
  },
  {
    "username": "bramadan",
    "rating": 2.0,
    "comment": "Horrible. Worst Alea by far...",
    "timestamp": 1288825200
  },
  {
    "username": "oursino",
    "rating": 3.0,
    "comment": "De l'engouement pour pas grand chose. A oublier.",
    "timestamp": 1744840800
  },
  {
    "username": "Benjismama",
    "rating": 3.0,
    "comment": "The graphic design is just gorgeous (i mean the german version), but the game itself is not appealing. So much repetition, almost the same exhibition all the time.",
    "timestamp": 1718834400
  },
  {
    "username": "HPLobster",
    "rating": 3.0,
    "comment": "My wife brought an old copy of this one into our marriage :-D Maybe one day, when there won´t be any \"Buzz Lightyear\" - games left to be played, I will give this one a try",
    "timestamp": 1634508000
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not for me",
    "timestamp": 1628373600
  },
  {
    "username": "sutrebuh",
    "rating": 3.0,
    "comment": "Who is taken in by whom? In constant repetition, you first lay out one (of 2) place cards and then one (of 5) action cards. If you are lucky, you will be alone at the place and profit a lot. If you are unlucky, others are there and you make life difficult for each other. This does not offer much variety and the mutual stalking becomes such a permanent state that the end of the game is not inconvenient.",
    "timestamp": 1597615200
  },
  {
    "username": "ratbulogg",
    "rating": 3.0,
    "comment": "The only time I ever won this game was when I randomly chose my card 80 percent of the turns.",
    "timestamp": 1525816800
  },
  {
    "username": "Vendictar",
    "rating": 3.0,
    "comment": "Most of the game feels like I'm playing Rock Paper Scissors. Better hope you guess right!",
    "timestamp": 1500328800
  },
  {
    "username": "s-man",
    "rating": 4.0,
    "comment": "Novel and innovative in it's time but it hasn't aged all that well. It is best described as \"Educated Guessing, The Boardgame\". It doesn't have what it takes nowadays to keep me interested.",
    "timestamp": 1738969200
  },
  {
    "username": "teaDorit",
    "rating": 4.0,
    "comment": "Donated to Projekt JoJo-Laden.",
    "timestamp": 1686952800
  },
  {
    "username": "zardon",
    "rating": 4.0,
    "comment": "Due to the fact we overlooked a significant rule we all ran out of money. The game moved too slowly for me. Most of your decisions are binary. The detective seems like the weakest character.\n\nPoor.",
    "timestamp": 1680991200
  },
  {
    "username": "rynelf",
    "rating": 3.5,
    "comment": "--Feb2008-- Not entirely compelling game of successive sessions of blind bidding. There's definitely some strategy involved here, though I'm not terribly interested in either buying the game nor playing again soon. I wouldn't object to a session with the right opponents, but I won't suggest it.",
    "timestamp": 1680559200
  },
  {
    "username": "CormorantLighthouse",
    "rating": 4.0,
    "comment": "Nicht schrecklich, aber wir haben es vielleicht zwei mal gespielt und... naja, wir haben nicht den Drang, es so bald wieder herauszuholen.",
    "timestamp": 1642633200
  },
  {
    "username": "Chrisrob",
    "rating": 4.0,
    "comment": "A system that allows trailing players to stay with the pack . . . gets old fast though.",
    "timestamp": 1639782000
  },
  {
    "username": "jpgoeller",
    "rating": 4.0,
    "comment": "Verkauft",
    "timestamp": 1634248800
  },
  {
    "username": "Drazhar487",
    "rating": 4.5,
    "comment": "We had a game where it was not possible to go on playing, design really is not good. All in all you see it's 30 years old.\n\nPlay another game, there are so many better ones!",
    "timestamp": 1753135200
  },
  {
    "username": "Joka61",
    "rating": 5.0,
    "comment": "BR 1990 Adel verpflichtet",
    "timestamp": 1752876000
  },
  {
    "username": "Eispirat",
    "rating": 5.0,
    "comment": "Geerbt",
    "timestamp": 1749592800
  },
  {
    "username": "grasa_total",
    "rating": 5.0,
    "comment": "I love it when I play an older game, and it's a mix of familiar things and something totally out of left field. For me, the scoretrack that determines the stakes of the current auction was the latter. This game wasn't bad even judged with decades of hindsight, but I really loved that scoretrack!\n\n[1 play]",
    "timestamp": 1746655200
  },
  {
    "username": "Bajord",
    "rating": 5.0,
    "comment": "Spiel Nominee",
    "timestamp": 1738278000
  },
  {
    "username": "ElBanana87",
    "rating": 5.0,
    "comment": "Keine schlechte Idee, hat aber irgendwie nicht gezündet. Am Ende auch sehr repetitiv.",
    "timestamp": 1734994800
  },
  {
    "username": "Massche",
    "rating": 5.0,
    "comment": "€10",
    "timestamp": 1726524000
  },
  {
    "username": "Stas",
    "rating": 5.0,
    "comment": "Last played: GASPcon 2008",
    "timestamp": 1710630000
  },
  {
    "username": "rexchow2015",
    "rating": 4.7,
    "comment": "bluffing and simultaneous action game\neach player chooses to acquire painting or exhibit paintings or steal other players' painting or cash\nthe main aim is to advance to the last step\nhowever game dragged on a bit long and quite repetitive during the later stages of the game",
    "timestamp": 1706914800
  },
  {
    "username": "Hilbert en Christine",
    "rating": 5.0,
    "comment": "",
    "timestamp": 1700434800
  },
  {
    "username": "Scossa",
    "rating": 5.0,
    "comment": "Hoity Toity original name",
    "timestamp": 1696197600
  },
  {
    "username": "StefanieB",
    "rating": 5.0,
    "comment": "Keller",
    "timestamp": 1693260000
  },
  {
    "username": "PuellaSilvestris",
    "rating": 5.0,
    "comment": "Hat Mutti original verpackt im Secondhand-Geschäft ergattert. Nach ein paar Partien wieder verkauft.",
    "timestamp": 1687212000
  },
  {
    "username": "camocoffey",
    "rating": 5.0,
    "comment": "This needs plenty of players; with only 3 or 4, it doesn't work at all. I can see that there's a good game in there, with plenty of sneakiness and subterfuge -- but the options are just too obvious each turn with too few players.",
    "timestamp": 1680991200
  },
  {
    "username": "Zalbar",
    "rating": 6.0,
    "comment": "B: 4-5+\nC: 1,86\nT: 45",
    "timestamp": 1759528800
  },
  {
    "username": "achkomm",
    "rating": 6.0,
    "comment": "Peter und Monika",
    "timestamp": 1759269600
  },
  {
    "username": "Fernegul",
    "rating": 6.0,
    "comment": "it's alright but broadly i felt that the most boring strategies work best in this game",
    "timestamp": 1754776800
  },
  {
    "username": "gmcnish",
    "rating": 6.0,
    "comment": "Good game plays 6 (Hoity toity edition)",
    "timestamp": 1754344800
  },
  {
    "username": "Marius n Milan",
    "rating": 6.0,
    "comment": "SdJ winner. Played this to death with my son when he was little.\n2012\n100\nT",
    "timestamp": 1747951200
  },
  {
    "username": "WhiteSeal",
    "rating": 6.0,
    "comment": "2-6 spelers Best 5+\n8+",
    "timestamp": 1746828000
  },
  {
    "username": "dirk_leipzig",
    "rating": 6.0,
    "comment": "Spiel des Jahres 1990",
    "timestamp": 1740524400
  },
  {
    "username": "rauschpotato",
    "rating": 6.0,
    "comment": "Several plays, 4-6p:\nI like the silly theme of the game, but I don't feel empowered when I play it. You make a bet on Auction or Castle, and then make a bet on bidding/stealing/detecting/showing. I know there's smart plays, but when I guess wrong I feel frustrated. Playing my moves randomly proves to be equally valuable and more fun, so I enjoy seeing how fate drives my actions.\n\nOverall, a game that I should like, but I only kinda enjoy when I'm fucking around.",
    "timestamp": 1740524400
  },
  {
    "username": "Patmac20",
    "rating": 6.0,
    "comment": "It played ok.",
    "timestamp": 1737586800
  },
  {
    "username": "docktorkai",
    "rating": 6.0,
    "comment": "Played it a long time ago. Will give it another try, but it looks, like it's not my type of game anymore. Let's see! :-)",
    "timestamp": 1736722800
  },
  {
    "username": "Cologne55",
    "rating": 6.3,
    "comment": "2-5 Spieler\n45 Minuten\nhttps://www.ggnf.de/spielanleitungen/adelverpflichtet/adelve...",
    "timestamp": 1733353200
  },
  {
    "username": "arad70",
    "rating": 6.0,
    "comment": "Artwork: 6\nMechanic: 5\nTheme: 6\nFun: 7\nQuality: 5\nReplayability: 6\nStrikes: none\n———————————-\nSCORE: 5.8\n———————————-",
    "timestamp": 1731452400
  },
  {
    "username": "Lgb-JohnDoe",
    "rating": 6.0,
    "comment": "Signed by the designer.",
    "timestamp": 1730156400
  },
  {
    "username": "roo414",
    "rating": 5.5,
    "comment": "Aug",
    "timestamp": 1720648800
  },
  {
    "username": "red_gamster",
    "rating": 7.0,
    "comment": "The more I play it, the more I enjoy it. Lots of double guessing and bluffing involved. When it comes off, fantastic, but it is one of those games where coming last is completely frustrating and you feel like never playing the game again. Excellent scoring system such as the ability to score 5 points if you're coming last by choosing the detective and capturing a thief means you don't always want to be miles ahead - it's fairly easy to catch the leader.",
    "timestamp": 1759615200
  },
  {
    "username": "kwalzl",
    "rating": 7.0,
    "comment": "4B",
    "timestamp": 1758492000
  },
  {
    "username": "Maximaler",
    "rating": 7.0,
    "comment": "Adel verpflichtet",
    "timestamp": 1757455200
  },
  {
    "username": "Nodens",
    "rating": 7.0,
    "comment": "Who outguesses the outguesser? People who like this also might like RoboRally.",
    "timestamp": 1757023200
  },
  {
    "username": "Samuel Vriezen",
    "rating": 7.0,
    "comment": "Legacy RPS",
    "timestamp": 1754690400
  },
  {
    "username": "chadgibbons",
    "rating": 7.0,
    "comment": "Walls Storage",
    "timestamp": 1753394400
  },
  {
    "username": "Twel001",
    "rating": 6.8,
    "comment": "More fun that it probably should be",
    "timestamp": 1752357600
  },
  {
    "username": "DiceLord",
    "rating": 8.0,
    "comment": "Board game",
    "timestamp": 1759701600
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Nice and simple game about collecting art and thieving art. Good catch-up mechanics make it good to introduce to people.",
    "timestamp": 1759269600
  },
  {
    "username": "Knothyelf",
    "rating": 8.0,
    "comment": "the original art is classy, while the hoity toity version is garbage.\n\ngreat game.",
    "timestamp": 1754604000
  },
  {
    "username": "gamesbook",
    "rating": 7.5,
    "comment": "_aka Adel Verpflichtet\n\nClassic game of bluff. I am really bad at bluffing...",
    "timestamp": 1746828000
  },
  {
    "username": "DonJunk",
    "rating": 8.0,
    "comment": "Last Verified\nFebruary 8, 2025",
    "timestamp": 1738969200
  },
  {
    "username": "byfed",
    "rating": 7.8,
    "comment": "Juego de subastaas en dos fases. Cada jugador juega dos cartas. Una para indicar en qué fase participa en la subasta y otra para determinar qué hace en la subasta.\nEn la casa de subastas, se pueden jugar cheques y el mejor cheque conseguirá una obra e arte. También se pueden jugar ladrones que se quedan con el dinero pagao por el mayor pujador.\nEn la segunda fase se puede hacer una exposición, jugar un ladrón - para robar obras de arte a otros jugadores que exponen -, o jugar un detective para apresar a los ladrones y e paso sumar tantos puntos como la posición que opcupas en el track.\nEl juego es una carrera por un track, con un premio final para la mejor exposición. Muy familiar, divertido, y fácil de jugar, aunque complicado e jugar bien. Exige mucha psicología y averiguar qué piensa hacer el otro. Muy recomendable para toddo el mundo",
    "timestamp": 1725055200
  },
  {
    "username": "BearDen",
    "rating": 8.2,
    "comment": "Adel Verfliphtet (1st edition)\nThis needs a reprint called Castles or Auctionhouse.\nOnly with 5.",
    "timestamp": 1711580400
  },
  {
    "username": "beardandglasses",
    "rating": 9.0,
    "comment": "Thrift/yard sale find",
    "timestamp": 1736290800
  },
  {
    "username": "beardandglasses",
    "rating": 8.5,
    "comment": "Thrift/yard sale find",
    "timestamp": 1736290800
  },
  {
    "username": "misterbattleship",
    "rating": 9.0,
    "comment": "Best and most original game ever designed by Klaus Teuber. In the thirty+ years since this game won Spiel des Jahres, I have never seen another design remotely similar to this.\n\nIt's a fascinating spin off of Rock, Paper, Scissors. Each turn has two phases, each requiring simultaneous guesswork. The mechanics of phase one are simply to choose between going to the Auctionhouse or the Castle. In the second phase the mechanics of guessing in the Auctionhouse differ than the mechanics of guessing in the Castle.\n\nBest with a full complement of five players, though it is still good with four or even three.\n\nStrategy Hint: go to the Castle most of the time. It's the only way to get victory points, either via Exhibiting or by catching Thieves with your Detective.",
    "timestamp": 1684792800
  },
  {
    "username": "Fiske Warren",
    "rating": 9.0,
    "comment": "ADEL VERPLIFLECT\nI'm not a fan of bluffing games but this is the exception - psychological stuff with added strategy thrown in. What a dreadful name \"Hoity Toity\" is - whoever thought that up should be sacked.",
    "timestamp": 1663970400
  },
  {
    "username": "John Weber",
    "rating": 9.0,
    "comment": "A long-time favorite, because of its quick playing time. There's a bit of guessing and psychology in knowing your opponents, and while the game mechanism is a bit repetitive, it is easy to grasp yet engrossing for experienced game players as well as novices. I have bought all three editions of the game, the original (Adel Verpflichtet, By Hook or Crook, and the more recent Hoity Toity which added a sixth player and some more art cards.) Always a great amount of tension, particularly when you have all the players jammed up 2-3 spaces from the finish line, all going to the castle on the final turn or two ...",
    "timestamp": 1661810400
  },
  {
    "username": "Cavedog_pdx",
    "rating": 9.0,
    "comment": "This game is truly great with five players. I have never played it with less and I have no desire to do so as the game loses the tension. Besides, with four we play Edel(Stein&Reich) and with five we play Adel. This game is lively and tense, fast and fun, deep and surprising. A great game to introduce a non gamer to the world of German games. I tried the six player Hoity Toity which just felt chaotic and frustrating. I much prefer five players.",
    "timestamp": 1636153200
  },
  {
    "username": "Murlock22",
    "rating": 9.0,
    "comment": "30 years old, bought by ebay for 1 DM",
    "timestamp": 1612393200
  },
  {
    "username": "Conrad1978",
    "rating": 10.0,
    "comment": "Picked up a first edition west German copy in Sioux Falls",
    "timestamp": 1634421600
  },
  {
    "username": "San Il Defanso",
    "rating": 10.0,
    "comment": "Before there was Catan, Teuber's first hit (at least in the American market) was Adel Verpflichtet, a great little bluffing game. It's easy to think that it's a litte one-note now, but it hits that one note so perfectly and stays just the right amount of time that it's a true winner.\n\nPlaying it for the first time in 2013, it didn't seem as revolutionary as it might have felt to the first Americans to try it. As one of the first German games to make it across the Atlantic, there are things like simultaneous turns and victory points that must have felt completely unreal. A fun game, and one that should be back in print if there were any justice.",
    "timestamp": 1618610400
  },
  {
    "username": "Chris Schreiber",
    "rating": 10.0,
    "comment": "My first love of gaming... Adel Verpflichtet is the game that started it all for me: elegant, balanced, social, and with a very quick pace.\n\nOne of my favorite parts of this game is that the little victories and emotional swings are never far away. Even when things are going poorly, you are less than a minute away from a great little victory. I LOVE THE PACING! Everyone can stay engaged and the decision making to time ratio is very dense.\n\nLike the greatest of games, the game grows as your awareness expands within your gaming group—so this game is limited ultimately and inescapably by being so damn human. As such, the skills of this game are those of poker (with less math)—your game knowledge is servant to your knowledge of the people at the table. The experience of this game is my sweet spot for competitive games - playfully trying to outsmart my friends with a crisp system to tie it all together and that doesn't drag on too long.",
    "timestamp": 1609887600
  },
  {
    "username": "Magritte",
    "rating": 10.0,
    "comment": "Light game with most original gameplay I have ever seen. To win this game you have to analyse your opponents mind and then take some simple decisions. What a pity that this cannot be played with 2 players.\n\nMinus: 1",
    "timestamp": 1535925600
  },
  {
    "username": "CharlesMruz",
    "rating": 10.0,
    "comment": "This game is fantastic and I've never played anything like it.",
    "timestamp": 1529964000
  },
  {
    "username": "Pol56",
    "rating": 10.0,
    "comment": "Outstanding. Fast paced game with lots and lots of tactical decisions. Plenty of interaction and very easy to learn/explain. One of the best games ever.",
    "timestamp": 1485298800
  },
  {
    "username": "lionhawk",
    "rating": 10.0,
    "comment": "My favourite bluffing game and also one of my favourite games at all. Always fun.",
    "timestamp": 1472767200
  }
]