[
  {
    "username": "810ivangizmo",
    "rating": 1.0,
    "comment": "El peor juego que he jugado nunca.",
    "timestamp": 1760133600
  },
  {
    "username": "RobRose",
    "rating": 1.0,
    "comment": "How much strategy does it take to attack every time you get in range???",
    "timestamp": 1011481200
  },
  {
    "username": "mmc chuck",
    "rating": 2.0,
    "comment": "Maybe we just didn't understand the rules?!",
    "timestamp": 1257030000
  },
  {
    "username": "Conteck",
    "rating": 2.0,
    "comment": "My friends like this a lot, but it does nothing for me.",
    "timestamp": 1254607200
  },
  {
    "username": "SYGF",
    "rating": 3.0,
    "comment": "played this once as a child in michigan with family friends. I remember thinking it was totally broken, but I don't trust the opinions of 10yr old me.",
    "timestamp": 1717106400
  },
  {
    "username": "Chris Barnard",
    "rating": 3.0,
    "comment": "After watching Ben Hur who doesn't want to play this game? Unfortunately the presentation is so lacklustre that it put me off back in the 80's and this aspect hasn't improved with age.",
    "timestamp": 1706569200
  },
  {
    "username": "Vain_Melody",
    "rating": 4.0,
    "comment": "A decent game, but a bit slow and clunky for chariot racing. Certainly doesn't conjure up the feeling of being in a fast paced race. Players who want furious excitement should probably play something else as this is a little dry and geeky. Formula De is a much better racing game.\n\nKeep the numerous charts handy while you play - I'd be lost if I hadn't made my own player aids as each form of attack is resolved differently. This game needs to be streamlined.\n\nProbably best if played as an ongoing campaign where you can sabatoge, bet and level up your racing teams over the course of several races.\n\nI would probably rate this game higher if I were using painted miniatures as some players do. The components are rather dull.\n\nCaveat: I have only played solitaire and 2-player. Considering this is a multiplayer game my opinion may have less weight?",
    "timestamp": 1659218400
  },
  {
    "username": "jens_hoppe",
    "rating": 4.0,
    "comment": "Chariot racing in ancient Rome. Reasonably fun game for its time, but clunky and ugly by today's standards.",
    "timestamp": 1551049200
  },
  {
    "username": "Micastiz",
    "rating": 5.0,
    "comment": "I used to own this game and played it many times, but it has been many years. We had some great games. It really is not something I would seek to play at this stage of my gaming.",
    "timestamp": 1742857200
  },
  {
    "username": "cherdan",
    "rating": 5.0,
    "comment": "Interesting and thematic game, just a lot of upkeep/admin required.",
    "timestamp": 1712268000
  },
  {
    "username": "smootz",
    "rating": 5.0,
    "comment": "Will comment and rate later!",
    "timestamp": 1583535600
  },
  {
    "username": "Denist",
    "rating": 5.0,
    "comment": "2-8\n3 games approx before June 2018",
    "timestamp": 1575846000
  },
  {
    "username": "kwalzl",
    "rating": 6.0,
    "comment": "7A",
    "timestamp": 1758664800
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "Too long, players get eliminated, and the rules are a terrifying mess of legalese. Thank goodness it is so much fun! Probably not needed, but I am glad I had chances to play this in the past.",
    "timestamp": 1730674800
  },
  {
    "username": "oldgoat3769967",
    "rating": 6.0,
    "comment": "Much better if you play using miniatures. The game requires a revamp for streamlining to modern board gaming standards to reduce the tedium game play. building the Variable powers and reduce the chart referencing. Still a great theme idea. Of course, miniatures are required.",
    "timestamp": 1725573600
  },
  {
    "username": "GaryCollins68",
    "rating": 6.0,
    "comment": "Play Chariots of Rome instead. It's smoother and faster.",
    "timestamp": 1720044000
  },
  {
    "username": "Ternal2",
    "rating": 7.0,
    "comment": "I8",
    "timestamp": 1741734000
  },
  {
    "username": "DannyDoo",
    "rating": 7.0,
    "comment": "1 Missing race track board",
    "timestamp": 1740351600
  },
  {
    "username": "pupykises",
    "rating": 7.5,
    "comment": "i just upped my rating from '7' because the description of 'enjoy playing it and would suggest' deserves a nod.\nthis one is old and has old mechanics. but here is the deal: the campaign is really goddam interesting. seriously. one of my favorites of all time. the skullduggery is delicious. bribing drivers...drugging horses...wagering on outcomes where you know something others may not...knocking down the overall leader...even to the point of killing their horses or even the actual driver.",
    "timestamp": 1758837600
  },
  {
    "username": "digitalbeachbum",
    "rating": 8.0,
    "comment": "A great game even though it tends to be longer than it should, but hours of fun. Nothing like the memories of being dragged across the finish line with no chariot",
    "timestamp": 1735426800
  },
  {
    "username": "panzerfaust501",
    "rating": 9.0,
    "comment": "Played.",
    "timestamp": 1739487600
  },
  {
    "username": "quietman",
    "rating": 9.0,
    "comment": "One of the games I have played more times, I think. Great laughs when played in big groups.",
    "timestamp": 1711922400
  },
  {
    "username": "alaemortis",
    "rating": 10.0,
    "comment": "JUEGARDO histórico, no apto para generación de cristal (por eso no se reedita). Todos los que aman este juego ya se han muerto o nos queda poco",
    "timestamp": 1746396000
  },
  {
    "username": "teufelhunde87",
    "rating": 10.0,
    "comment": "One of my first games way back when. Love it!",
    "timestamp": 1685052000
  }
]