[
  {
    "username": "TheGoblin",
    "rating": 1.0,
    "comment": "An abstract and ordinary card game without anything to do with vampires. Really, you won't catch me dead playing this. Very bad.",
    "timestamp": 1047596400
  },
  {
    "username": "Klausi300",
    "rating": 2.0,
    "comment": "2",
    "timestamp": 1483570800
  },
  {
    "username": "candoo",
    "rating": 3.0,
    "comment": "Not much game play here. Can find better card games from a standard deck of cards.",
    "timestamp": 1565128800
  },
  {
    "username": "jayjonbeach",
    "rating": 4.0,
    "comment": "A light luck filled set collection game, might not be bad for kids. Reminds me just a little of rummy with a pasted theme but it works, well almost does.\n\nSome push your luck, luck of the draw is huge here, pretty much what the game relies on, this and how far you push your luck in the timing of playing your sets ie how long to wait. When drawing 2 cards you are sometimes forced to discard something good into a good pile which will benefit someone else, don't like this mechanic. Basically rummy with a slight knizia scoring twist",
    "timestamp": 1394924400
  },
  {
    "username": "syphon",
    "rating": 5.0,
    "comment": "Weakly themed. That's why I don't rate this one higher. The mechanics are decent, though.\n\nSold for $10 via the 2024 CH flea market.",
    "timestamp": 1721944800
  },
  {
    "username": "krit1789",
    "rating": 5.4,
    "comment": "A rummy variant by Knizia. The theme is obviously thin. It could be anything. Vampire is simply not my favorite theme.",
    "timestamp": 1695765600
  },
  {
    "username": "Raul Catalano",
    "rating": 6.0,
    "comment": "The theme is very pasted on, but I find it interesting.",
    "timestamp": 1753653600
  },
  {
    "username": "tphon",
    "rating": 6.0,
    "comment": "Sleeved - Sleeve Kings",
    "timestamp": 1729807200
  },
  {
    "username": "Table43",
    "rating": 7.0,
    "comment": "Reiner Knizia makes many good card games, and this is another one. It's a rummy and set collection variation with majorities. The weakest sets in each suit are discarded, which adds tension to when to play your cards to the tableau. You can draw two and keep one from the deck, with the discarded choice going into a matching row available to all players or take all of one suite from the row but then you must make a set.",
    "timestamp": 1758405600
  },
  {
    "username": "mrdrofficer",
    "rating": 8.0,
    "comment": "2 copies owned.",
    "timestamp": 1694037600
  },
  {
    "username": "cherksken",
    "rating": 9.0,
    "comment": "We played this one a lot, during the time that our game collection didn't have that much filler games.\nAlways exciting until the very end.\nLight card entertainment.\nStill a pleasure and good company on many trips.",
    "timestamp": 1448665200
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "Simple children's game, but I liked it! The smallest score of each color is cancelled, so speed has to be balanced with big sums. I notice this in several of Knizia's card games, but maybe it's weirder that nobody else ever uses it. I think I liked this better than High Society.",
    "timestamp": 1743116400
  }
]