[
  {
    "username": "Panzerhamster",
    "rating": 1.0,
    "comment": "very boring",
    "timestamp": 1703718000
  },
  {
    "username": "giltleaf",
    "rating": 1.0,
    "comment": "Essentially plays itself at 3, doesn't work at 2, and can aspire to be worse than ticket to Ride at 4 or 5. - draw cards, draft tiles to help those cards, taking time to hurt your opponent hurts you more.\n\nWe kept re reading the rules while we were playing because we assumed we had to be missing something. This game just doesn't have it.",
    "timestamp": 1567548000
  },
  {
    "username": "Der Ubermolch",
    "rating": 1.0,
    "comment": "I don't mind games that don't give you many options -- in the right circumstances, those games can be fun. I cannot, however, tolerate a game that systematically nullifies all of your planning, all of your strategy, arbitrarily. This is the only game I can think of that I would absoltely refuse to play again.",
    "timestamp": 1253224800
  },
  {
    "username": "opinicus",
    "rating": 1.0,
    "comment": "I never want to see this game again.",
    "timestamp": 1172790000
  },
  {
    "username": "landrobot",
    "rating": 1.0,
    "comment": "bah!",
    "timestamp": 1162681200
  },
  {
    "username": "Kamaitatchi",
    "rating": 2.0,
    "comment": "Dated design.\n\nCould be fun with kids or nostalgic (grand)parents.",
    "timestamp": 1580252400
  },
  {
    "username": "FuriousBroccoli",
    "rating": 2.0,
    "comment": "One of my least favorite games. The play was tedious, limited, uninspiring, and very very loosely themed. That little peg is an elf prince? riiiiiight. Might as well have been a serial killer or the pony express. I love Ticket to Ride but will outright refuse to play this one.",
    "timestamp": 1521932400
  },
  {
    "username": "DanielTroi",
    "rating": 2.0,
    "comment": "One of the worst games I have played! Glad to be rid of it!",
    "timestamp": 1291849200
  },
  {
    "username": "EvilTimmy",
    "rating": 2.0,
    "comment": "(2-6 players) Simple game that just doesn't impress me. Shortest route hacking that feels more like a programming exercise than a fun game. Supposed to be better with the gold economy expansion but I'm not inclined to try to polish this turd.",
    "timestamp": 1251756000
  },
  {
    "username": "Mikeg99",
    "rating": 2.0,
    "comment": "Reminds me of Candy Land. I will try it again when my children get a little older.",
    "timestamp": 1245967200
  },
  {
    "username": "hiimjosh",
    "rating": 3.0,
    "comment": "Mechanically I like what Elfenland is doing, but wow do I dislike the little tuning decisions. Plan perfectly or die. The lack of much interaction mixed with the randomness and no catchup mechanic leaves me pretty salty. It's old school in a bad way. Elfenland left me very cold, and I'd prefer to not play it again.",
    "timestamp": 1735686000
  },
  {
    "username": "peratti91",
    "rating": 3.0,
    "comment": "Quite simple mechanism, no challenge.",
    "timestamp": 1613343600
  },
  {
    "username": "ekloff",
    "rating": 3.0,
    "comment": "Elfenland is one of the many traveling salesman style games from Alan R. Moon, but is distinct from its successor Ticket to Ride in a few key areas. Since players in Elfenland are more limited by transportation tokens than by cards, they are encouraged to somewhat lump together on the map, as to hopefully leverage the tokens placed by opponents. However, this close proximity exposes them to risk as they are more likely to be cut off or blocked. This creates the game's central tension, but it feels hallow and arbitrary. With tokens coming at such a premium, they are rarely spent spitefully, so whether or not you can travel along opponent tokens is mostly random, and makes the game frustratingly constrained. There is little room for flexibility or cleverness, unlike Ticket to Ride which supports various play styles.",
    "timestamp": 1595887200
  },
  {
    "username": "spieleben",
    "rating": 3.0,
    "comment": "1h+\n\nRacegame\nKartenlegespiel bei dem man versucht möglichst effizient Routen auszuspielen, um in 4 Runden die maximale Anzahl an Orten zu erreichen.\n+ Holzkomponenten\n+ Erweiterung lässt mehr Strategie zu\n- sehr Karten/Plättchenlastig Glück > Strategie\n- gewisse Routenkombinationen wiederholen sich, weil effizient",
    "timestamp": 1585692000
  },
  {
    "username": "Rob Beekman",
    "rating": 3.0,
    "comment": "Owned by Lieuwe",
    "timestamp": 1580943600
  },
  {
    "username": "sutrebuh",
    "rating": 4.0,
    "comment": "The appeal of the game lies in finding the best possible route, which is possible in view of your own cards and the tiles of transport laid out. That's quite appealing. Therefore, maps and means of transport must match. But when things go wrong, it doesn't balance itself out more or less (as in good games of chance would do), so you are in a lost position. With three players there is not enough action on the board, and with five or six of them not everyone becomes starting player. Only with four players the game is well-balanced. On the one hand the game is entertaining, on the other hand it can also have a high frustration factor.",
    "timestamp": 1760133600
  },
  {
    "username": "Nodens",
    "rating": 4.0,
    "comment": "I just couldn't make myself care about this.",
    "timestamp": 1757368800
  },
  {
    "username": "BGGJeffBergziege",
    "rating": 3.5,
    "comment": "Haben das Spiel damals oft gespielt. Ist ein Klassiker, aber kommt irgendwie nicht mehr auf den Tisch. Hmm...",
    "timestamp": 1746568800
  },
  {
    "username": "Elvatuar",
    "rating": 4.0,
    "comment": "This won the 1998 Spiel des Jahres, which goes to show how underwhelming boardgames were in the 90 or at least those considered by the jury. This is a simplistic, straightforward family game you will stop playing after a few sessions while desperately longing for something more. After a few sessions this will be a hard sell to your kids. The box art promises adventure and magic, neither will you find inside.",
    "timestamp": 1741993200
  },
  {
    "username": "garry_rice",
    "rating": 4.0,
    "comment": "May well be a classic but doesn't do much for me. I'd play with friends if they really wanted to play this again, but it can be frustrating to not get tiles that match up with one's cards...",
    "timestamp": 1739055600
  },
  {
    "username": "tscox87",
    "rating": 5.0,
    "comment": "Bit dated now, but fun enough",
    "timestamp": 1755122400
  },
  {
    "username": "Joka61",
    "rating": 5.0,
    "comment": "BR 1998",
    "timestamp": 1752876000
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "not as good as Elfenroads.\nRequires the expansion.",
    "timestamp": 1745272800
  },
  {
    "username": "enavico",
    "rating": 5.0,
    "comment": "+ Simple yet challenging family game\n\n- Low interaction\n- May become almost a multiplayer solitaire",
    "timestamp": 1743116400
  },
  {
    "username": "Micastiz",
    "rating": 5.0,
    "comment": "The original game was fun and the recent implementation on BGA makes playing it quick and easy. The downfall is that Elfengold, or the reimplementation of Elfenroads is so far superior that, anytime I play Elfenland on BGA it makes me wish I was playing one of the newer versions.",
    "timestamp": 1742857200
  },
  {
    "username": "VinnyPaul2",
    "rating": 5.0,
    "comment": "A decent race game that for some reason my family did not take to.",
    "timestamp": 1737846000
  },
  {
    "username": "marliv",
    "rating": 5.0,
    "comment": "It's OK medium weight game. There is some confrontation and luck.",
    "timestamp": 1737154800
  },
  {
    "username": "rauschpotato",
    "rating": 5.0,
    "comment": "1 play, 4p:\nDecisions never felt interesting. It seemed designed to teach kids certain mechanics more than being a fun game. If you don't draw cards well for your map position, there's not much you can do. Players are not incentivized to save up for big rounds with cool moves. I felt I was robotically moving along and hoping for lucky breaks from other player actions.\n\nThe theme of elves walking around a generic fantasy land didn't resonate for me. I guess I'd like a tiny bit better as a space theme or modern city theme.\n\nOverall, the game is fine, just not fun for me. We didn't play the full four-round game, but I was happy to stop after three rounds. I like Moon's Ticket to Ride better, which is kinda similar.",
    "timestamp": 1721858400
  },
  {
    "username": "tommynomad",
    "rating": 5.0,
    "comment": "My favourite thing about Elfenland is pronouncing the city names.",
    "timestamp": 1717711200
  },
  {
    "username": "Fencejummper",
    "rating": 5.0,
    "comment": "Decent route building game. Some luck with the cards you draw, and bad actors can ruin it.",
    "timestamp": 1715983200
  },
  {
    "username": "MissP1ggy",
    "rating": 6.0,
    "comment": "Family favorite. Adventurous, a bit of luck, some planning, great fantasy artwork.",
    "timestamp": 1755554400
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "boring game",
    "timestamp": 1755295200
  },
  {
    "username": "VioletSquirrel",
    "rating": 6.0,
    "comment": "[checked out - tried]\n1st play: lost sparkle too fast\n\nTried few times on BGA, didn't return to it, probably because I don't see much challenge / things to figure out how it works anymore since map is fixed.",
    "timestamp": 1750975200
  },
  {
    "username": "LePijdu14",
    "rating": 6.0,
    "comment": "Règles sont si peu précise et si mal rédigées, un fois cet écueil passé, le jeu est sympa.",
    "timestamp": 1746223200
  },
  {
    "username": "andrewsgame12",
    "rating": 6.0,
    "comment": "Pretty fun game actually, but every move you make feels like you're walking into a trap. It's like ticket to ride where you're building up cards to lay track, maybe over several turns, only to be blocked! Only in this game getting blocked is even more devastating! It's not for everyone.",
    "timestamp": 1745359200
  },
  {
    "username": "oursino",
    "rating": 6.0,
    "comment": "Jeu plutôt agréable, le début de partie est très important; à jouer avec un maximum de personnes.",
    "timestamp": 1744840800
  },
  {
    "username": "capnwaffer",
    "rating": 6.0,
    "comment": "Decent game with some light \"programming\" and path building.",
    "timestamp": 1742511600
  },
  {
    "username": "dosxtres",
    "rating": 5.5,
    "comment": "+4",
    "timestamp": 1741906800
  },
  {
    "username": "mdsb",
    "rating": 6.0,
    "comment": "xx",
    "timestamp": 1740006000
  },
  {
    "username": "MrMistysea",
    "rating": 6.0,
    "comment": "Only played on BGA. Better with 4 players than less.",
    "timestamp": 1736809200
  },
  {
    "username": "Antiquus",
    "rating": 7.0,
    "comment": "Useful changes:\n- setup: do not place all player cubes on the map, put a cube when you visit a place\n- the tiles that block a way: change in a wild card tile that can be placed anytime on other tile and permit you to move using other symbol and respective cards at choice",
    "timestamp": 1760306400
  },
  {
    "username": "Born-of-Ashes",
    "rating": 7.0,
    "comment": "Funny that this decades old game succeeds at semi-cooperative play where newer attempts overdo it. Still, there is just so much luck that even accounting for the puzzle of being flexible it can be frustrating to come up one card short. And the game ties so much that the luck seems like the kingmaker.",
    "timestamp": 1759788000
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 4007396083002\nGL2",
    "timestamp": 1757628000
  },
  {
    "username": "fahr",
    "rating": 6.9,
    "comment": "A good game! Fun, simple, fast... Easy to please everyone!",
    "timestamp": 1756850400
  },
  {
    "username": "SuAlfons",
    "rating": 7.0,
    "comment": "plus Erweiterung Elfegold",
    "timestamp": 1755554400
  },
  {
    "username": "denverarch",
    "rating": 8.0,
    "comment": "need more people to fully figure out",
    "timestamp": 1760392800
  },
  {
    "username": "Zouzou825",
    "rating": 8.0,
    "comment": "Pretty fun game, simple, but a lot of fun",
    "timestamp": 1758319200
  },
  {
    "username": "Oliver_D",
    "rating": 8.0,
    "comment": "Nostalgia for me. I love the art by Doris Matthäus!",
    "timestamp": 1752012000
  },
  {
    "username": "MaxxoBass",
    "rating": 8.0,
    "comment": "Elfenland bietet durch das Sammeln von Ressourcen und das Reisen durch das Land ein stark emergentes Gameplay. Die Interaktion mit den Mitspielern und die ständige Notwendigkeit, sich an den Spielverlauf anzupassen, machen jede Partie einzigartig.",
    "timestamp": 1743631200
  },
  {
    "username": "thierrydms",
    "rating": 8.0,
    "comment": "⭐️\nSPA-III lente 2025 (Piet, Luc, Peter, Franky, ikke).\nTerug zeer goed bevonden.",
    "timestamp": 1742511600
  },
  {
    "username": "Tonybo",
    "rating": 9.0,
    "comment": "I played this game so much as a kid. Still great fun today.",
    "timestamp": 1760392800
  },
  {
    "username": "LandoSystem10",
    "rating": 8.5,
    "comment": "Sleeved",
    "timestamp": 1739574000
  },
  {
    "username": "Janist",
    "rating": 9.0,
    "comment": "2-6",
    "timestamp": 1738364400
  },
  {
    "username": "ShiannLin",
    "rating": 9.0,
    "comment": "1998 Spiel des Jahres Winner",
    "timestamp": 1733353200
  },
  {
    "username": "IrwinMFletcher",
    "rating": 8.7,
    "comment": "I see Ticket to Ride in this, but I actually like it better because it has more player interaction than just blocking. Being able to use other people's routes and anticipating where people will go as they begin making plays is very engaging. It feels like there is more room for clever play.",
    "timestamp": 1713996000
  },
  {
    "username": "leshazlewood",
    "rating": 10.0,
    "comment": "A regular family favourite and also a favourite of our U3A group, and usually challenging enough without the road blocks.",
    "timestamp": 1748037600
  },
  {
    "username": "Ginewra",
    "rating": 9.5,
    "comment": "bga",
    "timestamp": 1736636400
  },
  {
    "username": "travelers_spirit",
    "rating": 9.5,
    "comment": "2015: 10/10 Elfenland is beautiful and charming classic that I could never part with. I find the mechanics unique and cleaver. It is just a joy to get this to the table.\n\n2024: 9.5/10 To this day I just love playing this game. Its become nostalgic. I really enjoy puzzling out how best I can make it work while navigating other peoples choices. I don't know if its a solid 10 anymore, but I couldn't tell you why.",
    "timestamp": 1710111600
  },
  {
    "username": "Nocdraco",
    "rating": 9.5,
    "comment": "My parents and I love playing this game. We bought it 1998 and probably played it multiple of times every year since then.\n\nIt's kind of our most favourite game and I always feel kind of nostalgic playing it.",
    "timestamp": 1706569200
  },
  {
    "username": "faidutti_ludotheque",
    "rating": 10.0,
    "comment": "Alan Moon aime bien les elfes - d'ailleurs, si j'étais elfe, je me méfierai.... Avant de caser Elfenland chez un grand éditeur, il avait publié lui-même, en édition limitée, plusieurs superbes jeux sur ce thème.\n\nDans Elfenroads, la version hard d'Elfenland, les jeunes elfes visitent tous les recoins de leur beau royaume.\nDans Elfengold, un beau petit jeu de bluff, les mêmes elfes explorent, avec son accord, la mine d'un troll débonnaire pour y trouver de l'or.\nDans Elfenwizards, un jeu de diplomatie subtil mais léger, chaque magicien elfe cherche à devenir grand druide à la place du grand druide.\nLe principal défaut de ces trois perles est cependant d'être devenues à peu près introuvables.\n\nReste Elfenland. Dans ce jeu au plateau et aux cartes magnifiquement illustrées par une Doris Matthaus au mieux de sa forme, chaque joueur est un jeune elfe qui, avant son passage solennel et initiatique à l'âge adulte, doit visiter toutes les cités du royaume enchanté. Vous l'aurez peut-être compris, cela n'est qu'un prétexte pour nous servir une adaptation en jeu de société du fameux problème du représentant de commerce: comment passer par toutes les villes en un minimum de déplacements.\n\nLe génie d'Alan Moon, dans ce jeu qui restera certainement comme son chef d'œuvre, a été de transposer habilement ce problème mathématique dans l'univers féérique, et d'introduire, par un système de cartes, de jetons et d'enchères, de l'interactivité. Les elfes disposent en effet de nombreux moyens de transport pour parcourir leur terre: cochons sauvages, radeaux, licornes, char à trolls, dragons et nuages magiques, sans compter les fameuses bicyclettes à voile. Et à chaque tour de jeu, seul un moyen de transport peut-être utilisé sur chaque route. Pour qu'un elfe puisse emprunter une route, il faut donc qu'un jeton transport soit placé sur la route et qu'il ait la carte correspondante en main. Cela permet aux joueurs non seulement de préparer les routes qu'ils pourront parcourir avec leurs cartes, mais aussi de tenter de gêner leurs adversaires.\n\nSans être complexe, le jeu originel, Elfenroads, s'adressait à des joueurs confirmés. Il était en effet assez long, joué sur une carte permettant de nombreux parcours et stratégies différents, et intégrait un système d'enchères des jetons. Pour Elfenland, qui vise un public familial, la carte a été réduite, et les enchères ont disparu, les jetons étant désormais piochés comme les cartes. Cela rendait le jeu certes plus rapide et plus fluide, mais au détriment de la richesse et de l'interactivité. Fort heureusement, l'extension Elfengold (à ne pas confondre avec le vieux jeu Elfengold, également d'Alan Moon), dont je conseille fortement l'achat à tout possesseur d'Elfenland, réintroduit les enchères, ainsi que quelques jetons spéciaux fort astucieux, faisant ainsi du couple Elfenland + Elfengold une sorte de mini Elfenroads tout à fait acceptable - même si chez moi, c'est encore mon Elfenroads aux cartes toutes usées qui sort le plus souvent.\n---\nAlan Moon likes elves. If I were an elf, I'd be careful. Before selling Elfenland to a big publisher, he published by himself, in a very limited edition, a few very good games on this same topic.\n\nIn Elfenroads, the first version of Elfenland, young elves are visiting the whole magic kingdom.\nIn Elfengold, a clever little game of bluff, the same elves are digging a troll's mine, looking for gold. Happily, the troll seems to be a good guy.\nIn Elfenwizards, a very subtle diplomacy game, each elf druid tries to take the great druid's seat in order to be the great druid instead of the great druid.\nWell, those three jewels have a great flaw: they are very hard to find, and incredibly expensive - especially Elfenroads.\n\nHappily, there's now Elfenland. The map and cards of this boardgame are gorgeously illustrated by Doris Matthaus at her best. Each player is a young elf who, before his solemn initiation into adult life and status, has to visit all the villages and cities of the enchanted realm. Some of you may have already understood that this is only a clever way to bring back the old salesman problem: how to get through all towns with as few moves as possible.\n\nAlan Moon is at his best in this game, which will probably be remembered as his masterpiece. He not only displaced the salesman problem in the enchanted world of fairies and dragons, but he added to the race, through the use of cards, tokens and bids, a great deal of interaction. The elves use many forms of travel through the magic kingdom: giant pigs, rafts, unicorns, trollwagons, magic clouds, dragons and the notorious wind powered elfcycles. On each turn, only one travel mode may be used on each road on the map. An elf can travel on a road only if a transportation token was placed here, and if he has the corresponding transportation card in hand. With this system, players can not only prepare their movement, but also hinder their opponents moves.\n\nAlthough the original Elfenroads was not really complex, it was nevertheless a gamers game, mainly because of its large map, with many different tactics available, and because of the bidding system. All this led to a game that could last for four hours, sometimes even more. Elfenland is aimed at the German family market: the map is smaller, and the bidding system has disappeared. The tokens and the cards are now drawn in a similar way, and the game has therefore less variety and less interaction. happily, there is the Elfengold expansion (not to be missed with the old Elfengold game, also by Alan Moon), which brings into Elfenland all the features from Elfenroads, except for the big map, plus a few extras. That's why all owners of Elfenland have to buy Elfengold, because though Elfenland is already a wonderful game, Elfengold still makes it ten times better. In my gaming group, however, my old copy of Elfenroads, with its worn out cards, is still the most played.",
    "timestamp": 1695938400
  }
]