[
  {
    "username": "Topanga",
    "rating": 1.0,
    "comment": "Just not my cup of coffee.",
    "timestamp": 1677711600
  },
  {
    "username": "rabid_schnauzer",
    "rating": 1.0,
    "comment": "This does improve the base game. In much the same way that local anesthetic improves a lobotomy. It's now just horrible and life-ruining, but less immediately painful.",
    "timestamp": 1396303200
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "Positive additions: None.\nNegative additions: Adds empty fillers and even more time to play.",
    "timestamp": 1286575200
  },
  {
    "username": "Blackwind",
    "rating": 1.0,
    "comment": "I read this elsewhere and it sums it up....\"The advanced version is more of a wargame, losing much of the elegance of the system in the process. Now there is no longer any strategy in trying to lock others out of certain civilization cards as anyone may buy anything at any time, which admittedly may be more realistic. But it no longer rewards the fine sense of timing and judgement that the original required. On the other hand, it is now no longer possible to lock anyone out of the entire game as players buy combat abilities and turn on the leaders. Combat has become much more important and the endgame tends to be marred as it develops into a popularity contest often as not. Strange situations in which the player doing the best does not necessarily win can result vis-à-vis victory points in the endgame.\" It's not \"broken\" per se, but it certainly \"breaks\" Civilization.\n\nCivilization was never intended to be a realistic simulation of Earth's development. The idea of not getting all the developments doesn't mean that one culture didn't learn it and another did. What it does mean is that the culture that developed it FIRST gets the most benefit from it. Just because you don't hold the Music card doesn't mean you can't play music. When the Assyrians developed iron weapons and the rest of the world was using bronze, they quickly overran the known world and held dominance for a time. Soon others learned the use of Iron weapons, but it certainly wasn't as profitable for them. This is a very simple mechanic that most people just miss or don't seem to understand.\n\nAdvanced Civilization is not an excellent game. It adds much more time to an already LONG game, it breaks the carefully balanced mechanisms found in the original and it attempts to turn the game into some pseudo-war game that only serves to leader bash at the end. In my opinion, it breaks Civilization and isn't worth the effort to play. I think a majority of people that have the view that Advanced Civ is somehow better, missed the elegance of the original game and try to turn Civ into some kind of \"simulation\" that it wasn't intended to be.",
    "timestamp": 1250200800
  },
  {
    "username": "Gandy Dancer",
    "rating": 1.0,
    "comment": "My copy got ruined and I need to replace both the game and the expansion. If you have a copy in good condition contact me.",
    "timestamp": 1062367200
  },
  {
    "username": "Zerosum",
    "rating": 2.0,
    "comment": "No sir. I don't like it.\n\nReview: http://boardgamegeek.com/thread/781654/",
    "timestamp": 1571608800
  },
  {
    "username": "skipcs",
    "rating": 2.0,
    "comment": "Ugh. Enormous amounts of essentially mechanical movement and setup in preparation for the once-hourly trading sessions that are truly the heart of the game. Incredibly influential events based solely on luck can result in being hopelessly shut out the entire game. No differentiation between different nations make the game bland game. There is very little strategy, as most of the game is about making obvious choices in order rebuild from calamities. If you are losing, the calamities affect you more strongly, making it dishearteningly punishing. First time players get raked over the coals if they do not have the various goods and their scaling values memorized. Takes TWELVE HOURS to play. Ain't nobody got time for that. Utterly miserable, but rates a 2 because it has the potential for winning and losing, as opposed to tic-tac-toe. One of the worst games I have ever played.",
    "timestamp": 1550617200
  },
  {
    "username": "domus_ludorum",
    "rating": 1.5,
    "comment": "I have played this only once and that play was using an online implementation which was not the most robust or intuitive and which also allowed some serious 'exploits' which would not have been possible if playing face to face. So my rating of the game may be somewhat unfair, but as that play represents the most unpleasant gaming experience I ever had, it's difficult for me not to take it into account, particularly as it left such an unpleasant taste in my mouth that I would never want to play it again in any format.\n\nSome observations -\n\n- An awkward game for the experienced and noobs to play at the same table.\n- It runs long.....\n- .....too long for the level of randomness introduced by the calamities\n- The calamities are too swingy, with some of them being simply too calamitous",
    "timestamp": 1514847600
  },
  {
    "username": "Chimes",
    "rating": 2.0,
    "comment": "Nothing like taking a truely great game and removing all of the tough decisions, cool balancing and making it a 8 hour game of beat up the leader.\n\nBleh - regular civ was a finely balanced game.\n\nThe lack of advancement limits, the extra advancements, simplified trading (and endless trading of disastors) took a really cool game and just made it longer with out any of the cool stuff.\n\nThe expansion looks good at first, becuase it seems to add some neat stuff, but in reality it is a game breaker.",
    "timestamp": 1422054000
  },
  {
    "username": "Tom Lehmann",
    "rating": 2.0,
    "comment": "An expansion which completely misunderstood the original game's design and gutted it by removing the essential tension of not having enough civ cards to go around.\n\nIf the designers wanted to invent civ-the-spreadsheet (and there is clearly interest in such a thing), why didn't they go design their own game, rather than completely mucking up an existing game?\n\nA really disgraceful and disrespectful hack job.",
    "timestamp": 1366668000
  },
  {
    "username": "Balleflass",
    "rating": 3.0,
    "comment": "It's really long and felt extremely dated and I never felt the game developed into anything interestning as every turn felt the same after the 2 hour mark.\n\nFeels kinda Splotter'ish in mechanics as every phase is really simple, but without the Splotter magic.\n\nOne of my worst gaming experiences of the last 10 years.",
    "timestamp": 1721512800
  },
  {
    "username": "bonillarau",
    "rating": 3.0,
    "comment": "Esta es otra de esas expansiones de juego tremendamente populares - incluso más que el excelentísimo juego original - y que no son otra cosa que un accidente de tráfico con muertos y mutilados. El único criterio empleado al diseñar AC fue echarle más cosas al juego original, sin entender de qué iba realmente.\nBásicamente, la fase de comercio queda reventada. 1º Se fragmentan los mazos de comercio de manera que te cuesta horrores juntar todas las cartas de una materia y la negociación se hace frustrante. 2º No te puedes guardar las calamidades comercializables, como en el original, sino que las tienes que pasar o te las comes. Y si las recibes, se las puedes pasar a otro. 3º La compra de avances se hace después de la resolución de calamidades, y no antes, como en el original. Ya no puedes comprar avances para mitigar las calamidades que te hayan podido colar. Estos tres puntos desincentivan el comercio entre los jugadores sobremanera.\nAparte de esto las condiciones de victoria son por puntuación, con el grueso de los puntos llegando por vía de los avances comprados. Hay una única estrategia viable en este AC: comprar todos (los 24) avances. Ninguna otra. El juego se alarga hasta que consigues completar todas las compras de manera lo más eficiente posible. Ya no tienes la tensión del original, en el que había que decidir 11 de entre los 16 avances, y cogerse los más baratos te condenaba a perder.\nEn resumen: una mierda como una casa.",
    "timestamp": 1693951200
  },
  {
    "username": "AKHawkster",
    "rating": 3.0,
    "comment": "Previously my favorite game of all time, now obsolete with the much improved Western Empires out.\n\nFrom 2009 - Anytime I can get 8 people to buy into the 8-10 hour play time, I'm all for it. This is the weekend done right. A trading game with board jockeying, balance mechanics, and loads of interesting decisions with the civilization advancements.",
    "timestamp": 1619906400
  },
  {
    "username": "Boltana",
    "rating": 3.0,
    "comment": "Way too long and predictable. Played only twice, but each was an all day session.",
    "timestamp": 1469224800
  },
  {
    "username": "thisisnotatest",
    "rating": 3.0,
    "comment": "In the immortal words of Strong Bad, \"Too long, Clanky, too looong!\"",
    "timestamp": 1457391600
  },
  {
    "username": "Desiderata",
    "rating": 4.0,
    "comment": "This game does a nice job of simulating the advance of civilizations. Epic play takes many long hours and at times it seems like the same thing over and over. More combat would make a game like this more interesting. Trading resources is interesting, but can take a long time, and benefits experienced players. The civilization advances are hit and miss (some are powerful, others are crap). Calamities have too big of an impact on the gameplay. I was impressed with the great mechanics of expanding population and the mix of stock and treasury. Lastly, it requires a lot of record-keeping and calculating (i.e. when purchasing civ cards). Overall, not bad to play once a year, but I would rather spend that time playing several games of, say, Mare Nostrum where trading is a big focus.",
    "timestamp": 1750197600
  },
  {
    "username": "FrankRyan",
    "rating": 4.0,
    "comment": "The most interesting part of this game is the trading round. Otherwise, it is merely balancing a budget through the use of discounts in order to be more efficient in your purchases than your opponents.",
    "timestamp": 1578870000
  },
  {
    "username": "gardi",
    "rating": 4.0,
    "comment": "The game itself is quite beautiful and intriguing, but I am horrible at these know-the-market-value games and it is such a big deal of this game making it not my cup of tea.",
    "timestamp": 1563919200
  },
  {
    "username": "tckoppang",
    "rating": 4.0,
    "comment": "Advanced Civ is a huge game with a massive play-time and an enthusiastic core of fans that will evangelize to you if you let them. And that's great! But it's also not for me. I appreciate the elegance of the game's mechanics, and how they nonetheless translate into a game of deep strategy. Yet I can't help but feel like the play-time is working against this game. I know people enjoy the epic story the game tells, but I feel it had said nearly all it needed to say halfway into our eight-hour session. The rest was reveling in the implications of those decisions. I won't say the last four hours were pointless -- they weren't! -- but I was ready to move on. All the trading, inter-player negotiation and backstabbing wasn't enough to keep me engaged. For that I find a game like Diplomacy holds my interest much more rapturously. But the truth is that, for civ games, I like the crop of modern (but admittedly less epic) games that shorten the playtime.\n\nThe only thing I really miss about this older design is just how little chrome it has, and I actually wonder if I wouldn't prefer the original incarnation of the game more for its even bigger commitment to this minimalistic aesthetic -- but I doubt anyone would be willing to spend the time playing it when Advanced Civ is available. This is an event game that gets played around here once or twice a year, and so there is a commitment to playing \"the best\" version by the hardcore fans. That's understandable, but I don't think I'll be joining them again when I could be playing Tresham's masterpiece: 1830.",
    "timestamp": 1523397600
  },
  {
    "username": "autumnweave",
    "rating": 4.0,
    "comment": "10/29/17: Will probably not play this again. Instead will probably always chose to play mega civilization instead.\n\n5/26/12: Although this might be heresy, I find that I probably prefer the base game of Civilization to this. Unforgiving to beginners, I find that that the added 1-2 hours that this takes over the length of Civilization makes it very rare to hit the table with my gaming group. I play against people who have been playing for 25 years, so it's pretty much a given that I'll be trampled.\n\n5: Rating for playing with anyone other than Jon and Nate.\n3: Rating for playing with Jon and Nate. Will strongly resist playing.",
    "timestamp": 1509228000
  },
  {
    "username": "arehb",
    "rating": 5.0,
    "comment": "Played it again in modern times, a few years ago. This hasn't stood the test of time, now there are far more interesting titles to play with the same time allotment.",
    "timestamp": 1747778400
  },
  {
    "username": "Link007",
    "rating": 5.0,
    "comment": "Played it online over a period of 4 months. The game is very dated, with unnecessary mechanics bloating the playtime. I had fun due to the format in which I had played it, but can easily see it outstaying it's welcome if played offline. It's a pretty simple game, and the complexity is mainly due to the poor UI/UX (which is solved by the online implementation).",
    "timestamp": 1726351200
  },
  {
    "username": "pmmeyer",
    "rating": 5.0,
    "comment": "This game is amazing with one glaring flaw: the tech tree is outrageously convoluted. Other than that, would play again. Plus, there is now a better version on the market, so I would just play that instead.",
    "timestamp": 1678748400
  },
  {
    "username": "djberg96",
    "rating": 5.0,
    "comment": "Nice addition to the standard game. This version makes all events hidden and, by changing the victory conditions, it's now actually possible to comeback from a couple of calamities. They also removed the 11 card limit that could hose you, though I don't know if that's a good thing, as it basically removes all purchasing tension.\n\nUnfortunately, this game has aged badly, as the length of play is very long, but there really aren't that many decision points. Most of your time is spent in trading and purchasing. And, with the addition of even more calamities, there are a few civ cards that are frankly never going to be purchased because everyone is too busy playing defensively, while other civ cards should always be purchased to mitigate the most common calamities. Plus, I still think Civil War can be too deadly, especially if received more than once and/or in conjunction with another calamity. As one famous BGG'er said, Advanced Civ is all about calamity management.\n\nI'd still play from time to time, but would generally prefer to play one of the \"lighter\" civ games these days, e.g. Through the Ages, Antike, etc.\n\nUpdate: Honestly, I don't think I would ever play this again. In addition to my mechanical quibbles with it, another problem is that eurogamers want to play it like a eurogame, but it isn't. There's conflict. The problem is that too many eurogamers completely lose their minds if someone makes even a modest attack into one of their areas and it can really wreck the game.",
    "timestamp": 1635807600
  },
  {
    "username": "apostateant",
    "rating": 5.0,
    "comment": "I can see why it's appreciated but, at the same time, it feels dated and not like something I want to revisit very often. While the trading becomes much more interesting at higher player counts, so does the downtime. I don't think I need to play this again.",
    "timestamp": 1635026400
  },
  {
    "username": "Mrmisfit",
    "rating": 5.0,
    "comment": "Was okay to play, not my favourite, takes decidedly too long to play.",
    "timestamp": 1628978400
  },
  {
    "username": "Lou_Crazy",
    "rating": 5.0,
    "comment": "Fixing a game which didn't need fixing",
    "timestamp": 1623189600
  },
  {
    "username": "B41939",
    "rating": 5.0,
    "comment": "I think (perhaps “feel” is the better term) the Advanced Civilization module is the better option. I like the increased amount of disasters, civ cards, and trade cards. I also favor not messing with the arithmetic necessary to avoid trapping oneself in the “basic” game.\n\nOne drawback to both versions, encountered by my group, is that once the leader gets a good lead, he’s hard to stop because everyone wants to trade with him instead of working to slow him down. Remember 1979 and Roger Hallmark and the Thrashers’ “A Message to Khomeni”? “Do you know what ‘embargo’ means? It’s American for ‘starve’!”\n\nEver feel left out of trade circles (or cliques)? Here’s an option for you and buddies also frozen out. Play the game-within-the-game: “Back to the Stone Age!” Take down your cities, send forth the wampum belt, and go visit your neighbors. Score points for every step you go back, and for anyone you cause to do likewise, also for every time one of them bitches, whines, or moans.\n\nOverall, I don’t mind playing for society’s sake (like Mark Twain in hell), but I’m not the one to initiate it.",
    "timestamp": 1613170800
  },
  {
    "username": "Reverend Pete",
    "rating": 5.0,
    "comment": "Good game, but I'll never realistically be able to play it again...way too much time committment.",
    "timestamp": 1592776800
  },
  {
    "username": "emperormark",
    "rating": 5.0,
    "comment": "Great expansion for the game, but hasn't aged well. Woulda' been a '10' in it's day.",
    "timestamp": 1560031200
  },
  {
    "username": "turntable",
    "rating": 6.0,
    "comment": "Loved playing this with 7 or 8 players when I was a kid, but I don't have time for game like this anymore, especially not one where so many of the decisions are obvious and there are so few non-obvious but meaningful decisions.\n\nI guess you could look at this game as a precursor to the \"recent\" trend of popular games like Scythe. The mechanics are very different, but the ratio of time to non-obvious meaningful decisions isn't so different.",
    "timestamp": 1687730400
  },
  {
    "username": "realityfoible",
    "rating": 5.6,
    "comment": "I can see how this was revolutionary back in 1990, not so much now.\nThe population growth and negotiation mechanics are interesting, but the game is very random and heavy handed in how it hands out devastating punishments.\nIt was fairly common for some players to be utterly devastated by card draw, while others coast by without any issues or meaningful player interactions.",
    "timestamp": 1660687200
  },
  {
    "username": "punkin312",
    "rating": 6.0,
    "comment": "It wasn't a full game. We played roughly 5 hours worth and were getting into the early stages of the finals. I can see how this game is elegant and is a leader that paved the way into modern gaming. For me, I don't love the trading and the calamities and the teardown and rebuild in the game. It was all just too long and I was just not into it. I get why it is so loved.",
    "timestamp": 1631224800
  },
  {
    "username": "thirtybrowns",
    "rating": 6.0,
    "comment": "Bit of a game for accountants but OK although a bit long and drawn out sometimes",
    "timestamp": 1606172400
  },
  {
    "username": "GrandAt",
    "rating": 6.0,
    "comment": "Never have time to play this game anymore due to it's massive playtime. In many ways a good game, but in the end the trading of resources and calamitys tend to slow things up a lot. Still, the trading part works ok and is part of the excitement (will i get a hidden calamity or not?).",
    "timestamp": 1604530800
  },
  {
    "username": "RaDiKal",
    "rating": 6.0,
    "comment": "I know this invites flame wars, but I prefer the original Civilization. I find the uniformity and lack of competition for the technology tree to be a game breaker. For a game of such length, I fall into the group that prefers an integrated aspect to the technology race rather than an all things equal approach. I also am an advocate for giving someone the win when everyone else is out of the running.",
    "timestamp": 1594850400
  },
  {
    "username": "smcneil",
    "rating": 6.0,
    "comment": "There used to be a time where people thought that “this is a great game” and “this game takes at least eight hours to play” could be simultaneously true statements.",
    "timestamp": 1593640800
  },
  {
    "username": "dseagle",
    "rating": 6.0,
    "comment": "Do you have 4-6 friends who are willing to spend 8-12 hours playing a sprawling area control game?\n\nIf no, then look elsewhere.\n\nIf yes, look here...maybe.\n\nI've played this one a few times, but I don't think I've ever finished a game. It takes SO long, but it is really fun. The trading of cards is the draw of this one. The fact that you must trade at least 3 cards but you only have to be honest about 2 of the cards you are trading keeps it entertaining (and devastating when you receive a calamity) for all those long hours.\n\nThis is the same game as Western Empires, just an older print.",
    "timestamp": 1591826400
  },
  {
    "username": "SeanC",
    "rating": 6.0,
    "comment": "Some improvements over the original Civ, but some steps back as well - e.g. takes much longer to play, you are even more at the mercy of calamities.",
    "timestamp": 1582671600
  },
  {
    "username": "Superfage",
    "rating": 6.0,
    "comment": "A classic from the past. It requires a lot of time and seven good players to realize a wonderful two night along playing.",
    "timestamp": 1563487200
  },
  {
    "username": "chrisbrandt",
    "rating": 7.0,
    "comment": "I don't like this as much as the original, but it does make more sense because civilizations are not locked out of some technologies just because others have taken all the cards. I'll play it whenever I have at least six people available for double-figure hours... which is to say ... Never.",
    "timestamp": 1746309600
  },
  {
    "username": "DaSpottishKing",
    "rating": 7.0,
    "comment": "Advanced Civilization is a chill, slow-paced eco game. It has a great trading mechanic and an elegant economy. The balancing of the game is largely done by those who are playing it as it is more advantageous for the leading players to fight each other. However fighting is usually bad for everyone and in order to win your people must endure the calamities and rebuild the quickest after war. I like the game. Not as much possibility space as TI4 or Eclipse: Second Dawn for the Galaxy, but still a fun game. I think it most compares to a Cities and Knights Settlers of Catan game. I might prefer Advanced Civilizations more than Settlers, but it is hard to say. Actually, if it is a big game with Seafarers + Cities and Knights, I think Catan wins this round. Perhaps the newer edition (Western Empires) will change this opinion, so I will have to play that too.",
    "timestamp": 1743202800
  },
  {
    "username": "pezboy",
    "rating": 7.0,
    "comment": "SELL - A1 -",
    "timestamp": 1732230000
  },
  {
    "username": "kijoe",
    "rating": 7.0,
    "comment": "Was a fun game back in the day. I suspect the rating could be lower if it would hit the tables.",
    "timestamp": 1699225200
  },
  {
    "username": "Clidenor",
    "rating": 7.0,
    "comment": "Except for the rather slow pace at the first phases, it is a nice and enjoyable game. Still think it takes too long sometimes and it kinds of repels newcomers unused to the genre and such long playtime.",
    "timestamp": 1693519200
  },
  {
    "username": "peterstruijf",
    "rating": 8.0,
    "comment": "An absolutely fantastic game.",
    "timestamp": 1753480800
  },
  {
    "username": "bluestem",
    "rating": 8.0,
    "comment": "Vastly improves original, fine classic game when you have a full day to play and enough people.",
    "timestamp": 1736895600
  },
  {
    "username": "Inkwan",
    "rating": 8.0,
    "comment": "a truly epic game if you have 8 - 12 hours. It's also one of the roughest games ever if you have a bad turn early...",
    "timestamp": 1735945200
  },
  {
    "username": "tiagoVIP",
    "rating": 8.0,
    "comment": "It indeed is a must-buy expansion. It makes the base game much better and consistent.",
    "timestamp": 1734390000
  },
  {
    "username": "MagisterLudo",
    "rating": 7.5,
    "comment": "Good game, but lengthy play time brings down the rating. Better than basic Civilization. Excellent multiplayer game with opportunities for trading making it a riotous affair.",
    "timestamp": 1727560800
  },
  {
    "username": "ygram",
    "rating": 8.6,
    "comment": "Many plays: Epic civilization game where you control one nation around the Mediterranean.\n\nThe central part of the game is a resource trading phase where you will trade resources (cards) trying to build series to gain points to buy advancements, income for more cards in the series grows exponentially. The kicker is that you will always trade 3 cards between two players where one is secret. This can be some resource that you didn't ask for or a disaster. In the end of the trading phase all disasters left in you hand will hit your nation.\n\nThere is also movement and battle on the map, but this is relatively unimportant, if someone gets a disaster they will be vulnerable on the map but it is very hard to attack someone without it. There are also population limits preventing someone from growing to large.\n\nThe advances you buy count towards victory points but some of them will also help you protect against disasters, this together with the fact that some disasters hit certain places (like coastlines) makes the game strategic.\n\nThe main downside is that it is impossible to get to the table, plays best with at least 7 players and it will take 8-9 hours. Otherwise it is one of the best games out there (or at least that was the case in 1999 when I managed to get it to the table last time).",
    "timestamp": 1760911200
  },
  {
    "username": "mlolcu",
    "rating": 9.0,
    "comment": "After Magic Realm, it is my favorite game.",
    "timestamp": 1746914400
  },
  {
    "username": "jofomo",
    "rating": 9.0,
    "comment": "An improvement over a fantastic game to start with.",
    "timestamp": 1742166000
  },
  {
    "username": "Evandeel",
    "rating": 8.5,
    "comment": "This game is monumental. Note that it takes a full day to play, but the length of time only adds to how grand and epic it feels as you watch civilizations build, crumble, and rebuild.",
    "timestamp": 1737068400
  },
  {
    "username": "Gershwyn",
    "rating": 9.0,
    "comment": "The mother of all civ games. Great game with good player interaction (trade phase) and one drawback imho - calamitites are quite hard to deal with and tend to destroy your strategy 50 % of the time.",
    "timestamp": 1736204400
  },
  {
    "username": "RaySwan",
    "rating": 10.0,
    "comment": "Old School AH game. Everyone should play this at least once.",
    "timestamp": 1760306400
  },
  {
    "username": "D_Choo",
    "rating": 9.5,
    "comment": "Played this (on DOS) and its successor Mega Empires. Fell in love pretty hard and quick. It’s unlike any other game I’ve played. The length is anywhere from 8-12 hours, but I felt engaged pretty much the entire time. The game experience is epic in scope which leaves lasting memories for all the players involved.\n\nI’m trying to find a way to get 5-6 other players to spend a day with me on this. Finding people is really the only obstacle, more so with this game. On a grim and morbid note, I wonder what will happen to games like this when the current generation of players whom I image to be an older bunch are no longer with us. I don’t see many young people playing these great games due to an increasing emphasis in video games and the cult-of-the-new kickstarter board games releases. I strongly believe a resurgence is desperately needed for a new generation of players to experience this timeless classic. And just to be clear, I define “classic” as perfect and awesome, not old and outdated.",
    "timestamp": 1758146400
  },
  {
    "username": "theCartoonMrOats",
    "rating": 10.0,
    "comment": "terrific game. would love to play it if anybody's out there.",
    "timestamp": 1754690400
  },
  {
    "username": "crazyyog",
    "rating": 10.0,
    "comment": "This is not just another boardgame expansion! This is almost a complete redo turning an excellent game into truly one of the greatest boardgames of all time. It kind of feels like a dishonor to call it an \"expansion\".\n\nThis is my favorite game. I just wish I had the time to play and was able to get others that could do so too. It is so rare to get a chance to play. I used to play this so much in college after it came out.",
    "timestamp": 1750975200
  },
  {
    "username": "Danbking",
    "rating": 10.0,
    "comment": "This is my favorite board game of all time. If you are planning on playing this game, please actually plan to take a whole day, if you want to actually finish.",
    "timestamp": 1745532000
  }
]