[
  {
    "username": "joebelanger",
    "rating": 1.0,
    "comment": "This game needs a hammer. For my skull.",
    "timestamp": 1475445600
  },
  {
    "username": "LilyGirl",
    "rating": 1.0,
    "comment": "I think that actually the game isn`t so bad (it is just bad), but I can`t play aggressive games like it is, where I need to be so greedy and be the best and to do everything the most... I`m just feeling uncomfortable when I`m playing this game... And that is why I don`t like it all!",
    "timestamp": 1261695600
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "Played 6 times. One of very few abstract German games I actually like, but the abstractness is starting to affect my longterm enjoyment. Great artwork, plays in 60 minutes, challening decisions, and great action cards to shake things up. Not much fun 2 players though.\n\nUpdate December 2023: Lowering rating down from 6 to 2. It’s not a terrible design, but I would actively avoid resist playing it in the future. Every part of the game is done better in other games. Most especially, Santorini is shorter and better at the stacking and stepping, and other Kramer games do better things with the action points and movement - Mexica and Java come to mind.",
    "timestamp": 1704063600
  },
  {
    "username": "MystLgnd",
    "rating": 2.0,
    "comment": "Oh my, remember this one being really mind-numbing and wasting 30 minutes of my time.",
    "timestamp": 1674687600
  },
  {
    "username": "Bagherra",
    "rating": 3.0,
    "comment": "nice mechanism but the game just lacks feeling. Much too abstract.",
    "timestamp": 1745272800
  },
  {
    "username": "aronske417",
    "rating": 3.0,
    "comment": "A truly awful game.",
    "timestamp": 1738191600
  },
  {
    "username": "PurzelchenQuak",
    "rating": 4.0,
    "comment": "Husband's Shelf",
    "timestamp": 1759528800
  },
  {
    "username": "sutrebuh",
    "rating": 4.0,
    "comment": "Calculation-heavy tower building! Torres plays quite tactically until the cards come into play and make things possible that are otherwise not allowed. This makes the actually abstract mental game unpredictable. Without the cards, however, the game threatens to become somewhat static.",
    "timestamp": 1756504800
  },
  {
    "username": "silenceisgolder",
    "rating": 5.0,
    "comment": "For me, this one wears its abstract soul on its sleeve a bit too much.",
    "timestamp": 1745704800
  },
  {
    "username": "Nicolas Weiss",
    "rating": 5.0,
    "comment": "I didn't like Arkadia much, outside of the cute stackable building pieces, and was hoping that I'd fall in love with the game they originally came from. That... didn't happen.\n\nTorres comes frustratingly close to greatness. A proto-Santorini of sorts with more German sensibilities, which I'm all for; but also I now want a cleaner combinatorial version of its core ideas. Because while I recognise that the action cards are necessary to prevent horrible lockdowns in the current game as is, they are simultaneously unsatisfying to play with and against, because the scope of the swing of board states nukes mid-term planning in favour of opportunistic play, and goes a bit too far from my Platonic ideal of the genre.",
    "timestamp": 1745532000
  },
  {
    "username": "Laslow",
    "rating": 5.0,
    "comment": "Ez valahogy nekem túl absztrakt, túl számolgatós. Nem éreztem rá az ízére, pedig \"papíron\" egész jó.",
    "timestamp": 1741906800
  },
  {
    "username": "Beastly_Venturer",
    "rating": 5.0,
    "comment": "4 plays. This one never clicked with me.",
    "timestamp": 1736982000
  },
  {
    "username": "Ephorus",
    "rating": 6.0,
    "comment": "What I like:\n- Shared board with lots of interaction. One is constantly reacting to what others build, trying to squeeze into tight spaces or block key moves. That tension is fun.\n- Scoring is clear and rewards smart positioning. Build high, place knights well, and one will do fine. It’s satisfying when a plan comes together.\n- The action economy is tight. One only gets a few moves each turn, so every decision matters. That kind of constraint makes for a good puzzle.\n\nWhat I dislike:\n- Action cards lead to big swings of the board state.\n- A bit too dry.",
    "timestamp": 1757455200
  },
  {
    "username": "jcoopersd",
    "rating": 6.0,
    "comment": "Didn't feel like it reached its potential at two players in the base game. I suspect it's much better with more, and in the master mode. I honestly just wasn't super impressed with the nature of its abstract gameplay though, it wasn't particularly mind bendy or tense, strategy felt sorta obvious. It was just fine.",
    "timestamp": 1753394400
  },
  {
    "username": "smaug007",
    "rating": 6.4,
    "comment": "When I play this game, I appreciate its strategic aspects. Yet the more I play it, the more I wonder at whether there is enough here for me for frequent multiple plays. Additionally, I could understand those who might find the game a bit dry.",
    "timestamp": 1751666400
  },
  {
    "username": "CotB",
    "rating": 6.0,
    "comment": "Rankings\n176th Best Game 2022",
    "timestamp": 1750888800
  },
  {
    "username": "AMERICANBOYBAND",
    "rating": 7.0,
    "comment": "Comments\nI love being a freerider.",
    "timestamp": 1760133600
  },
  {
    "username": "AlPacino11",
    "rating": 7.4,
    "comment": "Great abstract game by Mr Kramer!",
    "timestamp": 1757800800
  },
  {
    "username": "uwe_sauerland",
    "rating": 8.0,
    "comment": "SdJ 2000",
    "timestamp": 1760047200
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "I liked this game a lot. It was simple in its rules, but allowed for a lot of (sometimes too much) thinking for each turn. Games where you lay down things always amaze me, since I look at them at the end and think, \"wow, this suddenly looks cool...\"",
    "timestamp": 1759356000
  },
  {
    "username": "SammySnijbonen",
    "rating": 9.0,
    "comment": "I have yet to play a Kramer & Kiesling title that disappoints me.\n\n Interesting combination of vying for control in a spatial puzzle (building and scoring the castles in an optimal way) and action economy (you’re limited by the action points you can spend each turn).\n\n It’s a recurring theme in my game comments: the components are beautiful (this goes for both the older and more recent editions).",
    "timestamp": 1759701600
  },
  {
    "username": "Laingy",
    "rating": 9.0,
    "comment": "Torres is a brilliant blend of strategy and spatial planning. I love how it rewards tactical thinking and efficient use of action points. The 3D castle-building adds a satisfying visual element, and the competition for height and space makes every move meaningful. It’s easy to learn but offers deep replayability. A true gem for fans of abstract strategy games.",
    "timestamp": 1751320800
  },
  {
    "username": "chessbestboardgame",
    "rating": 10.0,
    "comment": "Outstanding game defined by its intricate and deeply satisfying gameplay. It features multi-layered strategies, long and short-term planning while engaging in continuous negotiation and mind games around the table. With a lot of variants to explore and beautiful, chunky components, the game maintains high replayability. Crucially, the system is designed to make draws impossible. As a game that uses this clever type of abstract construction blocks, alongside others like Santorini, Torres is a true masterpiece of three-dimensional strategy.",
    "timestamp": 1759442400
  },
  {
    "username": "Diyan",
    "rating": 10.0,
    "comment": "Way better than expected.",
    "timestamp": 1752530400
  }
]