[
  {
    "username": "steven42",
    "rating": 1.0,
    "comment": "The biggest problem is the length of the game - something so simplistic shouldn't take so long. It doesn't hold your attention and I found myself so bored. The game can also be cruel, I've seen people with a stretch of bad luck be completely wiped out the game and effectively be just moving from square to square for the sake of it. I detest any game where a run of bad luck can rule you out a game which will last another two hours!",
    "timestamp": 1126562400
  },
  {
    "username": "phoenixy",
    "rating": 2.0,
    "comment": "\"Monopoly with a liquidity crisis.\" This game is tedious and takes FOREVER to play because nobody ever has enough money to buy shares [the game can't end until all the shares are bought]. The \"show on the road\" segment constantly sends you backward, takes your money, etc. and is frustrating beyond words. Pro tip: play time can be shortened substantially by giving all players more money to start.",
    "timestamp": 1295478000
  },
  {
    "username": "mrraow",
    "rating": 3.0,
    "comment": "Over-long monopoly clone. Someone trade this off me before I play it again. Please!",
    "timestamp": 1222812000
  },
  {
    "username": "shuffler",
    "rating": 4.0,
    "comment": "Great premise, but unfortunately the game does not work well. After a luck-ridden opening and on the road outer track for productions, a money crunch occurs in midgame. As this eases later in the game, the rich tend to get richer much faster. Game's end is often a foregone conclusion, though the Tony Awards can create a lucky bonus in an interesting mechanism as shows are eliminated and players have to decide which shows to commit their resources to go all the way. Home rule tweakers may be able to make this playable, perhaps just by increasing the money in the game at startup, but not enough interesting decisions here to make the playtesting investment worthwhile.",
    "timestamp": 1117404000
  },
  {
    "username": "Eric Brosius",
    "rating": 5.0,
    "comment": "This game has some interesting ideas, but it doesn't provide enough decisions per minute (even though we played it fast enough to finish a 3-player game in less than an hour.)",
    "timestamp": 1386630000
  },
  {
    "username": "cube",
    "rating": 5.0,
    "comment": "Good roll and move game but too long for the fun it delivers.",
    "timestamp": 1335304800
  },
  {
    "username": "Fairygodfather",
    "rating": 6.0,
    "comment": "I’ve enjoyed this one for over 30 years since I first discovered it on a clearance rack in 1988.",
    "timestamp": 1597615200
  },
  {
    "username": "abnormallyramsey",
    "rating": 6.0,
    "comment": "Monopoly the Musical.",
    "timestamp": 1352934000
  },
  {
    "username": "mandelweb",
    "rating": 7.0,
    "comment": "Monopoly-style game themed in the theater world that adds some fun elements with awards votes and choosing whether to keep a show open or not. A bit on the longish side, but still enjoyable.",
    "timestamp": 1452985200
  },
  {
    "username": "Scorsese Fan",
    "rating": 8.0,
    "comment": "A favorite when I was growing up that I will still play anytime, as long as I have 2-3 hours.",
    "timestamp": 1537048800
  },
  {
    "username": "gamer-geek",
    "rating": 10.0,
    "comment": "Back before Euro games became popular in the USA (or at least before I knew of them), this was my preferred boardgame.",
    "timestamp": 1250460000
  }
]