[
  {
    "username": "Revelade",
    "rating": 1.0,
    "comment": "It's interesting that you could make a game from some plastic pyramids, but in the end it's just a novelty. I'd rather play a fuller game.",
    "timestamp": 1411509600
  },
  {
    "username": "CortexBomb",
    "rating": 2.0,
    "comment": "I just don't see the point, we played the basic game once, and it seemed like a rather pointless exercise to me. Call me a sucker for structure...",
    "timestamp": 1288216800
  },
  {
    "username": "Rygel",
    "rating": 3.0,
    "comment": "Just minimally better then Treehouse.",
    "timestamp": 1731366000
  },
  {
    "username": "LurkingMeeple",
    "rating": 4.0,
    "comment": "Judging from the comments, most ratings are for the system, not the game. My rating is for the game.\n\nLight Speed, apparently inspired by this game, is an improvement. Some of Icehouse's rules seem out-of-place in a frantic realtime game, like distance limitations (for attacks) and pieces counts (for calling \"Icehouse\").",
    "timestamp": 1480633200
  },
  {
    "username": "jeffwolfe",
    "rating": 5.0,
    "comment": "There's a steep learning curve for this game. Two learning curves, actually: one to learn how to play and another to learn how to play well. It's nothing at all like Chess, but it reminds me of Chess in that it seems to be more work than it's worth. But it is the granddaddy of all pyramid games, so worth knowing for all that.",
    "timestamp": 1579906800
  },
  {
    "username": "amodman",
    "rating": 5.0,
    "comment": "How do you rate a set of pieces? By the average quality of all the games you can typically play with them?\n\nI suppose.\n\nI like the pieces, but my experience with Icehouse games is largely meh.",
    "timestamp": 1493416800
  },
  {
    "username": "ALGO",
    "rating": 5.5,
    "comment": "OK, I've got\n\n6x Treehouse Rainbow\n5x Treehouse Xeno\n1x Treehouse Pink\nWorld War 5 Board\n3House\nMartian Coasters\n\nI have played (RATING)\n\nMartian Chess (5)\nIcetowers (7)\nVolcano (7)\nIcehouse (7)\nCracked Ice (5)\nMartian Coasters (6)\n\nAnd have barely scratched the surface.\nRating is the fairest I could give it since I don't want to clutter ny collection screen up!",
    "timestamp": 1612047600
  },
  {
    "username": "ianwiles",
    "rating": 6.0,
    "comment": "07-04-16: 6",
    "timestamp": 1468188000
  },
  {
    "username": "Silver Avocado",
    "rating": 7.0,
    "comment": "Lovely pieces, but possibly not quite as lovely as the Looneys think they are. Most of the games I've tried very much show they were written by programmers and super-geeks",
    "timestamp": 1606345200
  },
  {
    "username": "zeder",
    "rating": 8.0,
    "comment": "on about late 1992 I was a junior in high school and prone to sneak out of My parents' home to attend local DC area punk shows. while waiting outside of these shows people would walk around handing out flyers of various sizes, shapes, and colors. from flyers for other shows, flyers for other clubs, political flyers, alternative lifestyle screeds, and zines I'd collect them all and paste them on My bedroom wall. one humid summer night whilst standing outside of the peace center in DC (waiting for a Nation of Ulysses show -- one of their last) I was handed a flyer that was unlike any that I had ever received; a little purple flyer for a game called Icehouse. the game was shrouded in mysterious trappings, but it was as a Chess player the idea of a new strategic game that grabbed My imagination. however, there was only an address to \"learn more\" and so I didn't take the effort to follow through on it and instead just pasted it to My wall. however, a Friend of mine got the same flyer at the same show and did follow through by writing in for more information and eventually orderied a set.\n\nnow at the time My friends and I would spend weekend nights skating at glen burnie high school and then eventually wind up at denny's to drink Coffee and play Card Games (mostly to drink Coffee). one night My Friend pulled out a lovely little felt bag containing a whole mess of poorly stained wooden Icehouse pyramids. We noodled our way through the rules and started playing. of course we had no idea what we were doing, but the game \"felt\" fun. after a few more nights of this we were hooked and played for many months after that until Hearts eventually loosened Icehouse's grip on our hearts. from what I remember, we didn't really understand all of the rules so we just adjusted a few of the gnarly parts to suit our needs. for example, i'm pretty sure we didn't play with \"walls\" and we also played partnerships almost always. I remember that as the temperature got colder the wooden pieces were harder to hold with dry hands and so there were frequent \"crashes\" making the game somewhat frustrating. those were good times regardless, and I remember having an utter blast talking trash with friends late into the night while drunks and the lonely at the other tables looked at us in wonder (and would occasionally come over to see what was what) as we giggled our nights away.",
    "timestamp": 1757023200
  },
  {
    "username": "Artman",
    "rating": 9.0,
    "comment": "Almost full set of pyramids:\nTransparent Red, Pink, Orange, Yellow, Green, Light Blue, Dark Blue, Purple, Clear (but not Chartreuse or Magenta)\nOpaque Black, White, Grey",
    "timestamp": 1417474800
  },
  {
    "username": "darhol",
    "rating": 10.0,
    "comment": "SHELBY",
    "timestamp": 1694728800
  }
]