[
  {
    "username": "atomiczap",
    "rating": 1.0,
    "comment": "Played (Game Knights 10-24-18)",
    "timestamp": 1709506800
  },
  {
    "username": "jtrleone",
    "rating": 1.0,
    "comment": "Rich get richer. Red cards completely destroy a player's options.",
    "timestamp": 1262818800
  },
  {
    "username": "Ben_Bos",
    "rating": 2.0,
    "comment": "I remember I wrote a letter to the General magazine (of Avalon Hill) and had an answer in one of their editorials.\nI was mad that Avalon Hill published and sold such crap as a wargame.\nHow could I know that a few years later AH was sold to Hasbro. Killing the wargame industry completely.\nThis game should have been a warning of things to come.",
    "timestamp": 1598911200
  },
  {
    "username": "wkover",
    "rating": 2.0,
    "comment": "\"Pants up, riggings down!\"\n\n-- Sean Batiste, head of the portside boarding party\n\n\nIf you enjoy Enemy in Sight, here's a list of similar hobbies that you might look into:\n\n- Watching TV without turning it on\n\n- Eating with your friend's mouth\n\n- Waking up with no arms\n\n- Sexual relations with the New York Times (rolled or unrolled, your call)",
    "timestamp": 1437602400
  },
  {
    "username": "asfhgwt",
    "rating": 3.0,
    "comment": "Played this once with four players when first released; it was cheaply produced and seemed \"blah.\" Played recently two-player, and it seems somewhat better (especially if the other player has bad luck).",
    "timestamp": 1657144800
  },
  {
    "username": "SeanXor",
    "rating": 3.0,
    "comment": "This game was a big disappointment. It is slow, horribly random, and terribly boring.",
    "timestamp": 1480460400
  },
  {
    "username": "Khexhu",
    "rating": 4.0,
    "comment": "Loved this game as a kid. Bought the original Lost Battalion Games reprint and didn't have nearly as much fun with it.",
    "timestamp": 1587679200
  },
  {
    "username": "rickbill",
    "rating": 4.0,
    "comment": "multiplayer card game filler",
    "timestamp": 1487545200
  },
  {
    "username": "pjimeno",
    "rating": 5.0,
    "comment": "Old easy, fun game for several players.",
    "timestamp": 1754949600
  },
  {
    "username": "TimAllen",
    "rating": 5.0,
    "comment": "A good game for non-wargamers, but pretty abstract and \"light\" for grognards.",
    "timestamp": 1632693600
  },
  {
    "username": "Sgt Steiner",
    "rating": 5.0,
    "comment": "Light and abstract Naval fun.",
    "timestamp": 1588629600
  },
  {
    "username": "Capeguy",
    "rating": 5.0,
    "comment": "Light and unrealistic. Can be fun at times but better naval filler games out there now.",
    "timestamp": 1464645600
  },
  {
    "username": "nyhotep",
    "rating": 6.0,
    "comment": "Much more enjoyable than Naval War.",
    "timestamp": 1701817200
  },
  {
    "username": "heli",
    "rating": 6.0,
    "comment": "http://spotlightongames.com/military/mnights/e.html#enemy",
    "timestamp": 1593468000
  },
  {
    "username": "DolfoDylan",
    "rating": 5.5,
    "comment": "Played once or twice. Not really my kind of game.",
    "timestamp": 1574463600
  },
  {
    "username": "alexst",
    "rating": 6.0,
    "comment": "Nice little sailing ship game.",
    "timestamp": 1546556400
  },
  {
    "username": "NWilliamson",
    "rating": 7.0,
    "comment": "Take it for what it is. A fun, card game sinking and boarding other players ships. It is not historical or a realistic reenactment of naval warfare.\nThe artwork and information on the ships is good and reasonably accurate.\nThe cards are functional but an odd design for holding cards and viewing the information.",
    "timestamp": 1753826400
  },
  {
    "username": "chimpalvaro",
    "rating": 7.0,
    "comment": "A game I don´t mind playing.",
    "timestamp": 1740092400
  },
  {
    "username": "yangtze2000",
    "rating": 8.0,
    "comment": "Fast, fun, and a couple of General articles allow a greater historical leaning.",
    "timestamp": 1760047200
  },
  {
    "username": "mtgjudge",
    "rating": 8.0,
    "comment": "Nautical themed light wargame with a healthy dose of \"take that!\" Best with at least 4.",
    "timestamp": 1758405600
  },
  {
    "username": "Eisenkreuz",
    "rating": 8.5,
    "comment": "It's not completely historic, but it's fun and has enough chrome to cover the era. It's also more depth then just pounding each other back and forth, but some times wind, weather gauge and port cards (and calamities) go against you and your fleet either can't or gets stuck in port. Great fun though, though cutting the line rules are a little tricky.",
    "timestamp": 1714773600
  },
  {
    "username": "montsegur",
    "rating": 9.0,
    "comment": "Really have to play this in the near future once again with 3 players. I only found the boarding rules a little bit too complicated but anything else is fun to play. Great small AH game",
    "timestamp": 1703026800
  },
  {
    "username": "njesse99",
    "rating": 10.0,
    "comment": "A very fun, multi-player game. Nothing more fun than blasting holes in the enemy's rigging and then sending in a boarding party! And of course, you have to sing \"Breaking the Line\" as if it was Judas Priest's \"Breaking the Law\"",
    "timestamp": 1474840800
  },
  {
    "username": "Mister Panzer",
    "rating": 10.0,
    "comment": "Game is complete and I have ship cards for all ships at Trafalgar and other battles. Also have american 1st Rates!",
    "timestamp": 1127512800
  }
]