[
  {
    "username": "horrido",
    "rating": 1.0,
    "comment": "This is like a kid's game compared to the original bookcase masterpiece. What a major disappointment.",
    "timestamp": 1700521200
  },
  {
    "username": "michaelsabd",
    "rating": 1.0,
    "comment": "Owned the game, wish I hadn't. Gave it away.",
    "timestamp": 1059084000
  },
  {
    "username": "jens_hoppe",
    "rating": 2.0,
    "comment": "Simple two-player wargame based on the movie. Definitely not vorth playing.",
    "timestamp": 1257807600
  },
  {
    "username": "Matthew_Eklund",
    "rating": 2.0,
    "comment": "Boring and bad",
    "timestamp": 1226790000
  },
  {
    "username": "paddyodoors",
    "rating": 3.0,
    "comment": "I actually was surprised at how much I enjoy this game (not much, but definitely not zero). Games based on movies generally make me ill.",
    "timestamp": 1322521200
  },
  {
    "username": "Rick Smith",
    "rating": 3.0,
    "comment": "Too simple, lacks replay value. Does a terrible job of simulating the book - but then the MOVIE did a terrible job of adapting the book.\nNote that this game is not at all like the Avalon Hill game by the same name that came out 30 years ago. It is obvious to me by the comments, that some of the people giving this game high ratings are confusing it with the origional game from '76.",
    "timestamp": 1298674800
  },
  {
    "username": "alexfile",
    "rating": 4.0,
    "comment": "Never buy movie tie-in games. You've been warned.",
    "timestamp": 1475100000
  },
  {
    "username": "neko_cam",
    "rating": 5.0,
    "comment": "A simple two-player hex-and-counter wargame where the Terran mobile infantry fights a ground war against alien Arachnids.",
    "timestamp": 1548198000
  },
  {
    "username": "alexisW",
    "rating": 4.5,
    "comment": "Flimsy plastic standee. Basic game play. Plus points are bigger hexes than the original SST game from AH.",
    "timestamp": 1417388400
  },
  {
    "username": "dacoutts",
    "rating": 5.0,
    "comment": "Based on the movie (which is loosely based on the book).",
    "timestamp": 1276639200
  },
  {
    "username": "roberious",
    "rating": 5.0,
    "comment": "Played it a number of times when it first came out and thought it was ok.",
    "timestamp": 1260313200
  },
  {
    "username": "jormungandr",
    "rating": 6.0,
    "comment": "A good game to set up and knock out with new gamers. Some scenarios work better than others in encouraging maneuver and planning - my personal favorite is the one where the marines must eliminate the plasma bugs so they can escape (the marines start divided so there's a lot of movement required from both players). Very easy to teach and a fair amount of fun. The components are somewhat unsatisfying - game would definitely have benefited from cooler toys.",
    "timestamp": 1628632800
  },
  {
    "username": "tgunner91",
    "rating": 6.0,
    "comment": "It's a nice little intro game. There isn't too much here but a fun, little game.",
    "timestamp": 1510441200
  },
  {
    "username": "Comrade_Sarayev",
    "rating": 6.0,
    "comment": "Brain candy, but the first game I taught my son so I guess it has some merit!",
    "timestamp": 1458342000
  },
  {
    "username": "Junkfoot",
    "rating": 6.3,
    "comment": "That rating is only for the first battle which is very basic to say the least - not sure it'll get better, though.",
    "timestamp": 1427238000
  },
  {
    "username": "Franz64",
    "rating": 7.0,
    "comment": "Fast and easy! Good to play with my sons.",
    "timestamp": 1725832800
  },
  {
    "username": "moonglum01",
    "rating": 7.0,
    "comment": "A skirmish game that really feels like you are reliving scenes from the movie. Combat is simple, rules are fairly intuitive and the game has a programmed learning curve (learn a few rules then play a scenario, learn a few more play next scenario...) The 5.8 on BGG rating reflects the old way of rating games - if it had been released today I think it would rate in the 7+ range. Rules have held up well.",
    "timestamp": 1685311200
  },
  {
    "username": "dagc",
    "rating": 8.0,
    "comment": "Fun game, bt i wish the game had supplied plastic miniatures.",
    "timestamp": 1733785200
  },
  {
    "username": "fortyfiverevolutions",
    "rating": 8.0,
    "comment": "Not bad, but gets repetitive.",
    "timestamp": 1657922400
  },
  {
    "username": "Charles Vasey",
    "rating": 9.0,
    "comment": "Solid design by the master of solid design.",
    "timestamp": 1224280800
  },
  {
    "username": "michaelwmcfall",
    "rating": 10.0,
    "comment": "I like it. I'm not referring to the Bookcase Game version, I'm referring to the 1997 version.",
    "timestamp": 1629583200
  },
  {
    "username": "Hms_indefatigable",
    "rating": 9.5,
    "comment": "I purchased this title at Kaybee's Toys just before they went under. I played the entire campaign with my step brother in one afternoon on the front porch, good memories. This is a fun game not hard at all and plays well, give it a try if you see it.",
    "timestamp": 1505944800
  }
]