[
  {
    "username": "jboy666",
    "rating": 1.0,
    "comment": "pnp",
    "timestamp": 1654207200
  },
  {
    "username": "tarkvara",
    "rating": 1.0,
    "comment": "Yet another moronic auction game.",
    "timestamp": 1125180000
  },
  {
    "username": "papafish",
    "rating": 2.0,
    "comment": "good game",
    "timestamp": 1698012000
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Licytacje",
    "timestamp": 1623189600
  },
  {
    "username": "kenh1967",
    "rating": 3.0,
    "comment": "Meh. We've played a few times. Just not enough to grab us.",
    "timestamp": 1755208800
  },
  {
    "username": "zerkalo",
    "rating": 3.3,
    "comment": "Broken for players who know how to optimize: never bid more in total than the player who won the first auction bid; this way probability to win goes from 25% to 33% after the first turn on a four player game.",
    "timestamp": 1747778400
  },
  {
    "username": "neiglib",
    "rating": 4.0,
    "comment": "+ 잔금을 남겨주지 않는다는 규칙 하나로 평범한 경매 게임을 탈피\n+ 다양한 버전이 나왔지만 오픈앤플레이 버전 아트웍은 인정\n- 많은 돈을 쓰면 탈락이라는 규칙으로 중간만 가자는 플레이어 발생 시 급격히 텐션이 떨어짐\n- 비슷한 이유로 소극적 경매 위주로 진행되어 경매 게임 본연의 재미가 없어짐\n- 가뜩이나 돈을 많이 쓰면 안 되는 상황에 마이너스 경매 같은 특수 경매는 스트레스 요소로 작용함",
    "timestamp": 1733094000
  },
  {
    "username": "Shazinga186",
    "rating": 4.0,
    "comment": "Not my style of game. Just bidding and nothing else really. The group I played with loved it. My response- yawn.",
    "timestamp": 1732057200
  },
  {
    "username": "shawnmackay1593",
    "rating": 5.0,
    "comment": "Not a fan of auction games to begin with so I found this okay at best.",
    "timestamp": 1758578400
  },
  {
    "username": "adamolanna",
    "rating": 5.0,
    "comment": "su iPad",
    "timestamp": 1756159200
  },
  {
    "username": "kikaytete",
    "rating": 5.0,
    "comment": "1-0",
    "timestamp": 1755381600
  },
  {
    "username": "MiCrab",
    "rating": 5.0,
    "comment": "Community Rating: 7.2",
    "timestamp": 1755036000
  },
  {
    "username": "Neala",
    "rating": 6.0,
    "comment": "Perfectly pleasant bidding game. The rule of whoever has the least money is out is great and adds an extra layer.",
    "timestamp": 1760220000
  },
  {
    "username": "MorelliBuendia",
    "rating": 6.0,
    "comment": "Pretty cool filler. Knizia really knows how to make an interesting game with two rules. There's HTI, but honestly, I haven't played with anyone who would bother calculating how much everyone has spent.\n\nMogul Scale: 1/B",
    "timestamp": 1759528800
  },
  {
    "username": "rongbeo93",
    "rating": 6.0,
    "comment": "A fun and simple bidding/hand management card game with an interesting twist: if you end with the least money, you can’t score. I enjoyed my first few plays, but I’m not a fan of this particular bidding system. Still, it’s a generally good entry-level bidding game for teaching new players, even if it isn’t one of my favorites.",
    "timestamp": 1757109600
  },
  {
    "username": "BeansForTrade",
    "rating": 6.0,
    "comment": "Nice little auction filler. Becomes much less interesting when the players are counting bidding cards, which is fairly easy to do.",
    "timestamp": 1755727200
  },
  {
    "username": "rigacu",
    "rating": 7.0,
    "comment": "Preko",
    "timestamp": 1760392800
  },
  {
    "username": "javitowildchild",
    "rating": 7.0,
    "comment": "2019\nJuego de subastas, con la vueltecita de tuerca de Knizia\nPROS:\n+Puntuación curiosa, el jugador con menos dinero pierde\n+Final variable, lo que te hace adaptarte mientras juegas\n+Partiendo del mismo dinero cada jugador se organiza\nCONTRAS:\n-Las primera partidas pueden ser dificiles porque no sabes hasta dónde gastar\n*******************************************************\n2025\nMe sigue pareciendo una genialidad hacer un juego tan tenso con tan poco. El final de la partida variable hace que no tengas muy claro cuando apretar y te obliga a seguir la cuenta mental de cuánto han gastado el resto. Ahora es un juego de subastas y no se esconde, si no es tu género aquí no hay nada que pueda atraerte. En mi caso, una opción rápida y divertida que te mantiene entretenido lo 20-30 minutos que dura. Decente.",
    "timestamp": 1759874400
  },
  {
    "username": "TyDeL",
    "rating": 8.0,
    "comment": "Can't imagine many better games within that brisk time frame. The scoring twist really makes it interesting. There is more gameyness than I would have thought in just how you use your limited money cards, and tracking who has played what. Also the push your luck aspect to what comes out. A lot of stuff going on in a deck of cards, so much tension in 20 minutes, a great filler!",
    "timestamp": 1761082980
  },
  {
    "username": "Mannyx200",
    "rating": 7.5,
    "comment": "A clever bidding game where you are trying to win the most valuable cards, and avoid the negative cards, but also not be the player to have bid the most throughout the game.",
    "timestamp": 1760652000
  },
  {
    "username": "Drb89_",
    "rating": 9.0,
    "comment": "Auction\nSet collection\n++ Simple rules\n+ Art\n+ Quick",
    "timestamp": 1760911200
  },
  {
    "username": "darkk_",
    "rating": 9.0,
    "comment": "As long as you don't go for broke, become the envy of your friends with your lavish lifestyle!\n\nCaptivating ✅\nEngaging ✅\nReplayability ✅\nRules ✅\nQuality ✅\n\nMy BGG Perfect 10?\nAcquired 2+ ❌",
    "timestamp": 1760824800
  },
  {
    "username": "cenealon",
    "rating": 10.0,
    "comment": "2023 Top Games\n2024 Top Games\n2025 Top Games",
    "timestamp": 1757023200
  },
  {
    "username": "Food_Please",
    "rating": 10.0,
    "comment": "What a tense, quick auction game! Incredibly tight at 5 or 4 players, still very good at 3.\n\n+ Works well with non-gamers\n+ Intense, cutthroat bidding\n+ Easy to teach\n+ Quick setup and play\n+ Language independent\n+ Fun!\n\n- New players may need a few rounds to understand they shouldn't spend all their money in the first few auctions\n- Artwork is beautiful but thematically the illustrations would make more sense as actual items/property ect, not people (Osprey Games edition, don't know about other editions)\n\nFazit: Highly recommend this for playing with family or non-gamer friends! 9/10 [11 plays]\n\nUpdate: Upping this to a 10/10 after finally playing it with proper gamers rather than family. This game is perfection! [13 plays]",
    "timestamp": 1756332000
  }
]