[
  {
    "username": "ShiannLin",
    "rating": 1.0,
    "comment": "1999 Spiel des Jahres Recommended",
    "timestamp": 1734390000
  },
  {
    "username": "gmilitaru",
    "rating": 1.0,
    "comment": "Imperfect memory game",
    "timestamp": 1610924400
  },
  {
    "username": "crazycatlady",
    "rating": 1.0,
    "comment": "The only thing this game was good for was making me hungry for pizza (which isn't hard to do).",
    "timestamp": 1374530400
  },
  {
    "username": "KaneII",
    "rating": 1.0,
    "comment": "arghhh!",
    "timestamp": 1131231600
  },
  {
    "username": "darkk_",
    "rating": 2.0,
    "comment": "Remembering how many resources everyone plays --yikes!\n\nCaptivating ❌\nEngaging ❌\nReplayability ✅\nRules ❌\nQuality ❌",
    "timestamp": 1757368800
  },
  {
    "username": "kataclysm",
    "rating": 2.0,
    "comment": "A Uwe Rosenberg game I don't mind as much as his others. But I still never request it.\n\nEdit: After a 7th play, I have to say I really do mind playing this game. Each card you have to complete requires more than one type of ingredient, but you're only allowed to play one type. Your opponent can put his pizza order down and basically steal everything you've been planning. You can't ever really get anything done except by chance. I feel like I have no sense of control over my own destiny when I play this game. Even when I win, I do not enjoy it at all.",
    "timestamp": 1737241200
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not my theme",
    "timestamp": 1628200800
  },
  {
    "username": "Spilljeger",
    "rating": 2.0,
    "comment": "Cull\nFeb 21 - Math Trade\nFinn",
    "timestamp": 1619733600
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "There’s a non-zero amount of people I generally respect the opinions of who will assert that Mamma Mia isn’t a memory game, on the grounds that even if information was perfectly tracked, you still wouldn’t be able to account for the small amount of cards left in player hands and messing with the topping/order conveyor belt. That is missing the point, though: games may have more than one mechanic, and if the argument is that a game that’s only 90-95% memory doesn’t qualify for the label \"memory game\", I won’t dispute your right to define words however your want, but that doesn’t make the definition very useful.\n\nAbsolutely nobody would want to play a perfectly tracked version of Mamma Mia, because it would be utterly boring. Similarly, nobody would have a realistic chance at winning (against people playing normally) if they outright mentally skipped their opponents’ turns, because there is about no board state to observe. Ergo, this is by my account a sodding memory game - call it \"fuzzy\" or whatever diplomatic middle ground you will - with all my utter disinterest for the genre.",
    "timestamp": 1741129200
  },
  {
    "username": "kesulin",
    "rating": 3.0,
    "comment": "propiedad aula d'estudis. Juego muy simple y con una mecanica que no me gusto nada.\nEs mas un juego de memoria.",
    "timestamp": 1710198000
  },
  {
    "username": "MamaGoat",
    "rating": 3.0,
    "comment": "It's all about memory. Too quick and easy with little strategy.",
    "timestamp": 1703113200
  },
  {
    "username": "ReptilianSamurai",
    "rating": 3.0,
    "comment": "Too much of a memory game, and chaotic. Quick though and decent filler",
    "timestamp": 1685224800
  },
  {
    "username": "pauloantunes",
    "rating": 4.2,
    "comment": "(in the Kids collection.)",
    "timestamp": 1685397600
  },
  {
    "username": "Rolan Snyder",
    "rating": 4.0,
    "comment": "Too light for my taste. Generally dislike pure memory games.",
    "timestamp": 1668898800
  },
  {
    "username": "cbazler",
    "rating": 4.0,
    "comment": "I really hate memory games, so I don't know what I was thinking taking a chance on this one. I think I was blinded by my love for all-things-Uwe... scratch that, most-things-Uwe.\n\nPersonal tastes notwithstanding, the game is still not un-fun to play. It's just not my thing.",
    "timestamp": 1611270000
  },
  {
    "username": "Mestremuten",
    "rating": 4.0,
    "comment": "Rating:\n2/5\nProduction value:\n2/4\nIs the game in my collection/Love to have?:\n0/1",
    "timestamp": 1594418400
  },
  {
    "username": "Ephorus",
    "rating": 5.0,
    "comment": "What I like:\n- Clever memory and push-your-luck game with a fun pizza-making theme. Players play ingredient cards to a communal pile and can declare they're making one of their pizzas. The trick is remembering what's already in the pile from previous turns to know if you have enough ingredients to complete your order.\n- Creates great tension when deciding whether to declare a pizza. Do I have all the ingredients I need, or am I missing something? Did other players contribute the cards I'm lacking?\n- The evaluation phases are satisfying moments where everyone finds out which pizzas succeed and which fail. Successfully completing a pizza after tracking ingredients through multiple rounds feels rewarding.\n- Plays quickly and works well as a lighter game that still requires attention and strategy.\n\nWhat I dislike:\n- Heavy reliance on memory can be frustrating if you lose track of what's been played. Especially bad if players are pretty tired (as it was the case with me).\n- The randomness of card draws can sometimes leave you stuck with recipes you can't realistically complete based on the ingredients you're holding.",
    "timestamp": 1760824800
  },
  {
    "username": "dakarp",
    "rating": 5.0,
    "comment": "A fun little filler, especially good for kids. While I think I still own this, I can't find it, so I may want to find another copy somewhere.",
    "timestamp": 1757023200
  },
  {
    "username": "petersson8",
    "rating": 5.0,
    "comment": "2-5\nsum",
    "timestamp": 1743458400
  },
  {
    "username": "dosxtres",
    "rating": 5.0,
    "comment": "*",
    "timestamp": 1741906800
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "Nope",
    "timestamp": 1738191600
  },
  {
    "username": "Mijjy",
    "rating": 5.0,
    "comment": "It works well enough, but more for the giggles as your orders fail",
    "timestamp": 1732402800
  },
  {
    "username": "tommynomad",
    "rating": 5.0,
    "comment": "I don't usually like memory games, but this one has a take that! element that keeps it fresh.",
    "timestamp": 1717711200
  },
  {
    "username": "BogusKoszalka",
    "rating": 5.0,
    "comment": "w pudełku 9x12",
    "timestamp": 1714946400
  },
  {
    "username": "david_os",
    "rating": 6.0,
    "comment": "Fun game - and a lot more to it than meets the eye. Obviously not much fun with serious card counters though.",
    "timestamp": 1760306400
  },
  {
    "username": "badassbr",
    "rating": 6.0,
    "comment": "Meio jogo de carta, meio jogo da memória, funciona melhor com mais jogadores, acho que ele é bem simples por quase toda carta ser de apenas valor 1.",
    "timestamp": 1760306400
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 4011898089882\ncd rek 9",
    "timestamp": 1756504800
  },
  {
    "username": "bonster20",
    "rating": 6.0,
    "comment": "[A friend gave me his copy.]\n[Stopped playing it and left it in a box of free stuff outside my house.]\nGood little filler. Works with any number.",
    "timestamp": 1755813600
  },
  {
    "username": "ggruetze",
    "rating": 5.5,
    "comment": "Okay....",
    "timestamp": 1754604000
  },
  {
    "username": "Jabbergeist",
    "rating": 6.0,
    "comment": "I dunno, teeters on the line for me between clever and sloppy boredom.",
    "timestamp": 1753048800
  },
  {
    "username": "JohnGrimes",
    "rating": 6.0,
    "comment": "Wackelkandidat",
    "timestamp": 1750716000
  },
  {
    "username": "ts0ng",
    "rating": 6.0,
    "comment": "This might have been higher, but my memory is garbage and I am so so bad at this. Sorry to knock the game for my own faults, but it isn't a mechanic I enjoy.",
    "timestamp": 1747951200
  },
  {
    "username": "jaceycole",
    "rating": 7.0,
    "comment": "7.0 - 1 play, 5 players - A fun and unique game that almost feels like a slower moving version of Knizia's Swat!. If you're not working to remember the cards then it becomes a push your luck game instead of a memory game. But it's also a play the table game. I think it would be better at less than 5 players, as with 5 it was difficult to get orders in with so many players claiming them. Interested to see how it works with gamers.\n\n7.0 - 2nd play, 4 players - Better at 4. Somehow was able to complete all 8 pizzas! A very unique game, which might have a chance at staying in the collection for primarily that reason. The pizza building rounds are a little fiddly and slow.",
    "timestamp": 1759096800
  },
  {
    "username": "whosearmy",
    "rating": 7.0,
    "comment": "I've only played it once but it was a lot of fun.",
    "timestamp": 1757541600
  },
  {
    "username": "Jordan_Varbev",
    "rating": 7.0,
    "comment": "Cards, Memory, Light, +M, =T,\n#3**, #4***, #5**",
    "timestamp": 1756332000
  },
  {
    "username": "hiimjosh",
    "rating": 7.0,
    "comment": "I'm not sure if it's just the pizza that I really like, but this is a fun little memory game that is like no other. You won't play it all the time, though it's tricky and a good filler. I keep it around because it's different and people get a kick out of it.",
    "timestamp": 1755554400
  },
  {
    "username": "mawilson4",
    "rating": 7.5,
    "comment": "Amusing, swingy quest fulfillment game that also doubles as a pseudo-memory game. It's only somewhat memory-based, because you can't know what's in others' hands, and this informs the fulfillment along with the game's public knowledge. Which is great, because decisions are still informed, but it becomes more gut-based than strictly calculative.\n\nIt's ultimately a bit too random for some, too memory-dependent for others, and you can know you're just playing for pride with a third (or more) of the game left to go. So it hasn't been universally successful with those I've played with. But it consistently amuses me, and that's enough.",
    "timestamp": 1757973600
  },
  {
    "username": "rharn",
    "rating": 8.0,
    "comment": "Probably my favorite memory-based game. A ton of fun watching people steal toppings or make hail mary plays with certain orders near the end of a round. I wish Uwe did more of these quick and fun designs!",
    "timestamp": 1754863200
  },
  {
    "username": "Gvconkel",
    "rating": 8.0,
    "comment": "Mamma mia was one of my favorite card games in my early gamer days ... and still a great game with gamer and nongamers",
    "timestamp": 1754258400
  },
  {
    "username": "geoffder",
    "rating": 8.0,
    "comment": "Fun and funny memory game with great opportunities for trash talk as you tell eachother there is no way their pizza gets made as you slap dow your similar recipe right on top of theirs with a couple extra ingredients. BUT maybe they play a couple ingredients out of their hand later to finish it or you just straight up remembered wrong. Either way it should be good for laughs.",
    "timestamp": 1752530400
  },
  {
    "username": "GeorgW",
    "rating": 9.0,
    "comment": "A firecracker of a game!\n\nPros:\nThe rules are dead-simple and produce a lot of laughs. It's a game that anyone can play and it's fast, it should be a staple game in many collections.\n\nI love how it uses memory, in the beginning of a round it's quite easy to keep track of things and by the end people are pretty much just guessing, hoping someone else got something wrong earlier. I also like that you can compensate for mistakes by using ingredients from hand, sometimes even on purpose.\n\nI like the hand management, it's good to dump a bunch of ingredients as you get the first chance to play a pizza on them and get to redraw a lot, but to get that opportunity you need to get lucky, have few pizzas in hand, and/or spend time slowly dumping singles. You also sometimes want to save some ingredients for the end of the round, and you have to consider when to draw pizzas to increase you options at the cost of your hand limit.\n\nI love how ingredients stay on the table until they're used. It makes subsequent rounds different and benefits players that push the end of a round, while also adding an element of chaos to the memory aspect.\n\nCons:\nI think the symbology for the special pizzas could have been a lot better. Why J and ? instead of something like = and < ? Also, a reminder that the big pizza uses all ingredients wouldn't hurt.\n\nThere's a slight runaway leader problem in that if someone has very few pizzas left to make they can keep all their options available without sacrificing too much of their hand size, and they can more easily focus on playing ingredients that fit the pizzas they have left. This is very minor though, and the game probably shouldn't be played at a level where this is relevant.\n\nPlaying this with someone with perfect memory would break the game, but the same is true for any memory game.\n\nI don't much care for the art, the peppers look unappetizing and the pineapple looks like cheese.",
    "timestamp": 1754172000
  },
  {
    "username": "Pandante",
    "rating": 9.0,
    "comment": "One of my favourite card games, that is always a hit. My 5 and 7 year old kids love it too - it's easy enough for them to play (although I sometimes give an ingredient or two to let the 5 finish her pizzas). A hard one to teach, though - its best just explaining the recipes and just playing a practice round.",
    "timestamp": 1753394400
  },
  {
    "username": "trodat123",
    "rating": 9.0,
    "comment": "once the first recipe is played it's pretty difficult to not lose track",
    "timestamp": 1752357600
  },
  {
    "username": "millsyboy",
    "rating": 9.0,
    "comment": "A delightful game in which you pay careful attention to what everyone is playing, but it’s still plenty light enough to avoid over-analysis.\n\nIt’s not just about trying to remember what has been played- you can play an order hoping you’ll be able to get the extra required ingredient or 2 into your hand before the end of the round. Whether you can do it or not will have an impact on future orders played…\n\nThe need to balance drawing ingredients and order cards (and only being able to do one or the other) is another tricky tactical decision. Chef’s kiss!",
    "timestamp": 1732143600
  },
  {
    "username": "Sandman1973",
    "rating": 10.0,
    "comment": "Great memory game. I've put this back at 10. Love it.\nGone! Replaced with special version.",
    "timestamp": 1760392800
  },
  {
    "username": "hazered",
    "rating": 10.0,
    "comment": "A strange unique game combining memory and bluffing. Kind of like Nana in a way, but I can't think of much else. What makes this one special is how it seems so simple and logical at the start, then a few players make errors/bluffs, and nobody can keep track of what's available. Everythng just collapses, and everyone scrambles for scraps. For that reason it feels like the total opposite of Nana's arc despite very similar building blocks (in Nana things get easier to narrow down, but the stakes go up, so players bluff to confuse those who are ahead. hence it's more focused on mindgames than memory). So while I love this too, it seems more tuned for children laughing as order falls apart... pretentious adults have trouble with that concept.",
    "timestamp": 1757800800
  },
  {
    "username": "TrevorJr26",
    "rating": 10.0,
    "comment": "See my comment for Mamma Mia! Plus",
    "timestamp": 1746482400
  },
  {
    "username": "vejrum",
    "rating": 10.0,
    "comment": "Great, fun, unusual, memory game - also for people with poor memory as intuition and tactics can go a long way.",
    "timestamp": 1724450400
  }
]