[
  {
    "username": "Bagherra",
    "rating": 1.0,
    "comment": "A one trick pony. The game is pretty but the mechanics are very bland and unimaginative. Definitely not worth the price of admission.",
    "timestamp": 1742857200
  },
  {
    "username": "Vormwald1",
    "rating": 1.0,
    "comment": "Rating due to distaste of designer, although the game isn't really that great either.",
    "timestamp": 1481842800
  },
  {
    "username": "corkysru",
    "rating": 1.0,
    "comment": "The only reason this should be up for a mensa award is if they were trying to find the best way to destroy it. The rules leave a lot to be desired and the movement mechanics leave even more.",
    "timestamp": 1443477600
  },
  {
    "username": "greggor",
    "rating": 1.0,
    "comment": "This is not a game. This is T-E-R-R-I-B-L-E. I would rather flip a coin with my friends for 15 minutes and record the results than play this pile of manure for the same length of time.",
    "timestamp": 1384902000
  },
  {
    "username": "Galghamon",
    "rating": 1.0,
    "comment": "The beautiful box and its nice artwork are the only good things I can mention about this \"game\".",
    "timestamp": 1324508400
  },
  {
    "username": "wgiammona47",
    "rating": 1.0,
    "comment": "This game improves if you just flick the ship markers around the board, applying more of a Carabande/Cairo feel to the game.",
    "timestamp": 1257202800
  },
  {
    "username": "quietcorn",
    "rating": 2.0,
    "comment": "One of the better roll and move games I guess but it's still a roll and move game.",
    "timestamp": 1721685600
  },
  {
    "username": "OGRussHood",
    "rating": 2.0,
    "comment": "Parcheesi with a theme. NOT better than Catan. Not even in the same league.",
    "timestamp": 1607468400
  },
  {
    "username": "cbazler",
    "rating": 1.5,
    "comment": "A truly terrible game, ameliorated only by the fact that we ended up being somewhat amused by how bad it was. The two-player variant where each player controls two colors made for a slightly better game, but your choices are still pretty limited on your turn. Goodwill.",
    "timestamp": 1548111600
  },
  {
    "username": "Checkallday",
    "rating": 2.0,
    "comment": "Walk the plank you shitty game.",
    "timestamp": 1479596400
  },
  {
    "username": "gstevens31",
    "rating": 2.0,
    "comment": "Kinda like checkers, but with a cool gold piece.",
    "timestamp": 1359586800
  },
  {
    "username": "Ultimario",
    "rating": 2.0,
    "comment": "There is nothing good to be said about this other than, luckily I didn't pay much for it.",
    "timestamp": 1355180400
  },
  {
    "username": "CannonFodderTed",
    "rating": 2.5,
    "comment": "Ok light little filler. Only seconds to get set up and teach. Unfortunately, it's really random roll and move. Extremely light on strategy involved and bad dice rolls could get you stuck in your base the whole game making it not fun. Has lots of flaws, but if you don't take it too seriously or you're piss drunk, this could keep you occupied while waiting for more pretzels. Maybe decent for kids although I have not tried it on kids. Worth picking up if you see it with the nice playmat in the tin for a few bucks at a thrift store but I wouldn't recommend paying full price.",
    "timestamp": 1722549600
  },
  {
    "username": "Yokiboy",
    "rating": 3.0,
    "comment": "I just didn't like this. It looks great, I've sold a lot of copies when I was managing a toy store, but after playing it myself I never restocked it again. Tossed it in a move.",
    "timestamp": 1677970800
  },
  {
    "username": "mikesanerd",
    "rating": 3.2,
    "comment": "It's just a simple roll to move game of tactically moving your units around, almost like roll to move checkers. Not exactly a mind-blowing game, but reasonably fun for what it is. It reminds me of a less complicated version of Black Fleet.",
    "timestamp": 1644534000
  },
  {
    "username": "Gatekeeper3000",
    "rating": 3.0,
    "comment": "Bought it at some bargain store years ago for $5 or something. Played it once, it seemed \"ok\", but I have yet to try it again.",
    "timestamp": 1635112800
  },
  {
    "username": "Jandoruss",
    "rating": 3.0,
    "comment": "Fine for what it is. I had some good times with this before I discovered better games.",
    "timestamp": 1590962400
  },
  {
    "username": "Red Eye",
    "rating": 3.0,
    "comment": "This is just a very weak abstract game. Still too much is dependent on luck. Pirate vs pirate is much the same but more fun than this.",
    "timestamp": 1590098400
  },
  {
    "username": "Tenebyss225",
    "rating": 4.0,
    "comment": "Backgammon crossed with chess; some interesting movement restrictions where you are forced to use both dice if possible, but ultimately it's roll and move and sometimes you can never even leave your cove!",
    "timestamp": 1735340400
  },
  {
    "username": "Rygel",
    "rating": 4.0,
    "comment": "A roll and move abstract strategy game. Not bad, but not great. Really needs all four players.",
    "timestamp": 1731366000
  },
  {
    "username": "rynelf",
    "rating": 4.0,
    "comment": "--Dec2003-- Rating is mean of 6 for playing with my (young) children and 4 for adult play.\n--08Aug2004-- In the face of superior competition, the children aren't as interested in this anymore.\n\n++ ~25 unlogged plays. ++",
    "timestamp": 1680559200
  },
  {
    "username": "Staban Tuek",
    "rating": 4.0,
    "comment": "THRIFT",
    "timestamp": 1666476000
  },
  {
    "username": "noisycrow",
    "rating": 4.0,
    "comment": "Roll & move, roll & move. Good for the kiddies, or when people dont wish to think.",
    "timestamp": 1576191600
  },
  {
    "username": "galen",
    "rating": 4.0,
    "comment": "5",
    "timestamp": 1524434400
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A action selection game where players are taking turns and moving based on the 2 dice rolled, in original direction or along the current to move faster. Players can land on each other, eliminating that piece from the game. Players are trying to either eliminate all other players or get the treasure box from the middle of the map and bring it back to their home base.",
    "timestamp": 1756159200
  },
  {
    "username": "veoviscool12",
    "rating": 5.0,
    "comment": "It's a fun, light pirate game for the family with wonderfully evocative art, but is completely dependent on dice rolls. You roll two dice, and assign them to one or two ships. This results in a very minimal veneer of strategy, but it's still fundamentally a roll and move game. Consequently, the end game is almost always a race to see who can roll the right numbers to enter their harbor first.\n\nThis one holds a special place in my heart due to playing it a lot with my family; at the time it was certainly the best roll and move game we had, and I'd much rather play it than Sorry! or something of that nature. For young kids especially I think this can still be a fun choice given the theme. That said, after a while we did get tired of waiting for the clear winner to officially win by moving back to the harbor, and we started playing it less and less.\n\nYour tolerance for roll-and-move will greatly influence how much you like this game. I wonder if there's a way to update these mechanics to reduce the randomness and increase strategy; perhaps via a deck of movement cards?",
    "timestamp": 1727128800
  },
  {
    "username": "jkenney23",
    "rating": 5.0,
    "comment": "Okay roll-and-move. Better with more players, but not especially deep.",
    "timestamp": 1724104800
  },
  {
    "username": "bdmiller",
    "rating": 5.0,
    "comment": "For Sale",
    "timestamp": 1707606000
  },
  {
    "username": "ptm_junk",
    "rating": 5.0,
    "comment": "simple role a move game... fun ... ish",
    "timestamp": 1658700000
  },
  {
    "username": "larcthor",
    "rating": 5.0,
    "comment": "MENSA SELECT",
    "timestamp": 1641596400
  },
  {
    "username": "MeepleMaven",
    "rating": 5.0,
    "comment": "They player tokens are weighty and excellent.",
    "timestamp": 1617400800
  },
  {
    "username": "Twel001",
    "rating": 5.4,
    "comment": "Not a bad filler. Sure it's dice rolling but you are still able to strategize. It's quick enough to enjoy the player elimination. I also enjoy the temporary alliances that form. I'd say give it a go. Kinda need 4 players though. Two could work also.",
    "timestamp": 1597528800
  },
  {
    "username": "soulyogurt",
    "rating": 4.5,
    "comment": "Located in Game night library",
    "timestamp": 1580943600
  },
  {
    "username": "djnesq",
    "rating": 5.0,
    "comment": "Luck overwhelms any strategy. If one of your ships carries the treasure, protect the ship with a convoy and hope you out-roll your opponents. That's nearly impossible with more than two players, all of whom will be gunning for you.",
    "timestamp": 1578697200
  },
  {
    "username": "realityfoible",
    "rating": 5.0,
    "comment": "It's a nice game with interesting varients, but an old game. Movement is dictated by dice rolls and if you can't move the full distance of the die, your turn gets skipped. Very luck heavy.",
    "timestamp": 1546815600
  },
  {
    "username": "YggazTheFool",
    "rating": 5.0,
    "comment": "Childhood game",
    "timestamp": 1544655600
  },
  {
    "username": "David68",
    "rating": 6.0,
    "comment": "Dirk",
    "timestamp": 1680300000
  },
  {
    "username": "ChrisLaning",
    "rating": 6.0,
    "comment": "This was my favourite game as a child, and I think still holds up relatively well for what it is.",
    "timestamp": 1659132000
  },
  {
    "username": "Jubii2",
    "rating": 6.0,
    "comment": "Pretty good game to play with grandkids. Put on some pirate music and talk like a pirate. Arrrrr!",
    "timestamp": 1625608800
  },
  {
    "username": "SVan",
    "rating": 6.0,
    "comment": "A decent backgammon-like game, which is very short and has enough decisions to make it interesting. Good for the younger players.",
    "timestamp": 1616454000
  },
  {
    "username": "Pahn",
    "rating": 6.0,
    "comment": "Quick and easy, though we made a house rule letting people get their first ship out of port more easily. I've had games end with people stuck with all their ships in port. Not a gamer's game, but more like an activity that can pass the time between games or while waiting for others to show up.",
    "timestamp": 1590616800
  },
  {
    "username": "DerekW1968",
    "rating": 6.0,
    "comment": "Miriam has",
    "timestamp": 1578610800
  },
  {
    "username": "britomarte",
    "rating": 6.0,
    "comment": "Spouse's childhood classic.",
    "timestamp": 1557612000
  },
  {
    "username": "robtyrka",
    "rating": 6.0,
    "comment": "light",
    "timestamp": 1552863600
  },
  {
    "username": "Scavinger",
    "rating": 6.0,
    "comment": "Almost like pirate backgammon.",
    "timestamp": 1537567200
  },
  {
    "username": "DeadFrog",
    "rating": 6.0,
    "comment": "Nice little game to break people into games with a little more strategy",
    "timestamp": 1535839200
  },
  {
    "username": "moss_icon",
    "rating": 6.0,
    "comment": "You can tell this is an old game but it's a right old laugh even if the mechanics are p bad.",
    "timestamp": 1517612400
  },
  {
    "username": "Red Dress",
    "rating": 6.0,
    "comment": "Yo ho, a charming game about navigating the seas to claim treasure for your own. The mechanics are simple and objective is clear.\n\nWhat it lacks in complexity is made up by an enjoyable time.",
    "timestamp": 1505599200
  },
  {
    "username": "Mountaingardner",
    "rating": 7.0,
    "comment": "2-4 Player",
    "timestamp": 1735426800
  },
  {
    "username": "Jokeerus",
    "rating": 6.7,
    "comment": "verify\nIt's ok. Good for younger kids learning basic math. Too much depends on good dice rolls.",
    "timestamp": 1732575600
  },
  {
    "username": "latindog",
    "rating": 7.0,
    "comment": "Clever little abstract feeling dice game with nice pieces.",
    "timestamp": 1695852000
  },
  {
    "username": "Snork",
    "rating": 7.1,
    "comment": "Very good casual game. roll and move, so a lot of luck. But you can use subtraction, which some people forget, (treasure 1 away, you roll a 3 and a 4, just move 3 out, then 4 back, and you have it!) ...and after a few plays you learn that if you grab the treasure too soon everyone will gang up on you. So a little thinking will improve your odds a bit.\n\nTypically the treasure will change hands several times, super fun!",
    "timestamp": 1629324000
  },
  {
    "username": "Dychotimer",
    "rating": 7.0,
    "comment": "Fun little game that has dice to give an element of luck. It is a good game to play with your kids as the dice give them a chance to win as much as you do.",
    "timestamp": 1590530400
  },
  {
    "username": "Bartman1000",
    "rating": 7.0,
    "comment": "While just a dice roll and move, there is some fun nuance here and the end is always exciting as you try to bring the treasure home. I've always found this a quick and easy play, especially with non-gamers.",
    "timestamp": 1587679200
  },
  {
    "username": "Greytrek",
    "rating": 8.0,
    "comment": "Yes, this is mostly luck-driven; yes, there's potential elimination; and yes, it's possible (without a simple house rule) to get stuck too long in your own harbor. But it's quick, simple, addictive, and unpredictable fun that doesn't demand much time or energy. With most sessions taking all of 10-15 minutes, even an unlucky run is no real penalty. Additional scenarios also add replay if you need it. I always bring it to my game group, and it gets disproportionate table time because it fills the quick and casual niche so nicely.",
    "timestamp": 1733266800
  },
  {
    "username": "mik3cap",
    "rating": 8.0,
    "comment": "metal tube",
    "timestamp": 1664143200
  },
  {
    "username": "Ranwiz",
    "rating": 8.0,
    "comment": "Very good short strategy board game (never saw the electronic version). Simple to learn, good for teaching the 7-14 yr olds how to strategize die rolls, and calculate the safest (or most aggressive) board positions. Well recommended. We play some variations in the rule book, and have made a few of our own.",
    "timestamp": 1657749600
  },
  {
    "username": "alextvalencic",
    "rating": 8.0,
    "comment": "Roll/Draw and Move",
    "timestamp": 1609887600
  },
  {
    "username": "cyrinoduke",
    "rating": 8.0,
    "comment": "Fun and easy to play. Purchased this game in 1981 when it was being sold by the creator at gaming conventions. Still a favorite!",
    "timestamp": 1595196000
  },
  {
    "username": "miriam_w_09",
    "rating": 8.0,
    "comment": "Very fun to play. My husband loves this fame. Similar to checkers but vamped up. Many variant rules to choose from as well.",
    "timestamp": 1578783600
  },
  {
    "username": "orodreth",
    "rating": 9.0,
    "comment": "[4] Best with 4 players\nHave played with 2,3,4 players",
    "timestamp": 1723672800
  },
  {
    "username": "kiltedcalgarian",
    "rating": 9.0,
    "comment": "Great party game and for families as the rules are easily explained. Having the coin is fun, and it changes possession often, Plus eliminating your family member is always fun!",
    "timestamp": 1459033200
  },
  {
    "username": "trench726",
    "rating": 9.0,
    "comment": "This was a game I started teaching my boys when they were 4. It got them into games, and I think helped them in life. Two games can be linked together if you desire, it is quick to play, some games taking less than five minutes. And we still play it today when we want a quick batch of games and memories. The 20th anniversary edition is a really cool set, the biggest differences are the map is cloth and the box is a tin.",
    "timestamp": 1450220400
  },
  {
    "username": "omnicollective",
    "rating": 9.0,
    "comment": "Pro: Simple, quick and fun. Lots of room for variants.\n\nCon: It just makes me wish there was more to it.",
    "timestamp": 1306792800
  },
  {
    "username": "jfuture",
    "rating": 9.0,
    "comment": "Quite a polarizing game, this. Regardless, I find the game is most enjoyable when we \"stack\" rules variations; combine the Diplomacy variation (2-players, two fleets each on opposing sides of the board), the Hurricane variation (three dice are used, rolling 3-of-a-kind sinks the ship/fleet furthest from the respective home port), and the Flotilla variation (ships start in stacks of three, are moved simultaneously, or deployed at the player's whim). Some very interesting games result; strategic aspects come into play because of the three dice Hurricane variant. Having two \"fleets\" at your disposal (Dimplomacy and Flotilla variants) means one fleet can focus on capturing the treasure, and the other can be used as a defensive or offensive \"battle group.\" The treasure can also be transferred to other ships, which enables you to cut off any pursuit, leading to some heated chases and battles.",
    "timestamp": 1240437600
  },
  {
    "username": "zoobio",
    "rating": 9.0,
    "comment": "My ten year old daughter and I have loved playing this game for the past 3 years. It's a good game for 2, but even better with 3 or 4. It's a great family game, a game to play with kids. My all over 25 years old brothers and I will also play this game with ruthlessness a few times after playing the kids. The ratings for this game are lower than they should be - this website is for more hard-core gamers with higher expectations who like more sophisticated games such as Puerto Rico (a great game).",
    "timestamp": 1212962400
  },
  {
    "username": "smittyredcard",
    "rating": 10.0,
    "comment": "Signed edition",
    "timestamp": 1750888800
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "used",
    "timestamp": 1749506400
  },
  {
    "username": "FlavioSousa",
    "rating": 10.0,
    "comment": "Skull island, hidden treasures, secret harbours, naval warfare and plundering, this wonderful board game has it all!",
    "timestamp": 1516489200
  },
  {
    "username": "laughingtadpole",
    "rating": 10.0,
    "comment": "I have never not had fun playing this game. It's simple, it's fast, it sparks the imagination, and it is almost endlessly customizable with new rules and modifications.",
    "timestamp": 1462226400
  },
  {
    "username": "fainaent",
    "rating": 10.0,
    "comment": "Surprisingly fun. It's so quick and light, yet still has strategy. I can easily play 5 or 6 rounds before I notice what's happened.",
    "timestamp": 1209333600
  },
  {
    "username": "cheese monster",
    "rating": 10.0,
    "comment": "Because it's fun, and it's a very good game. And I won!",
    "timestamp": 1197154800
  }
]