[
  {
    "username": "Janasik",
    "rating": 1.0,
    "comment": "Long, mean, and player elimination. Just a bad combination overall. We usually enjoy negotiation games, but this one had a surprising lack of things to talk about. In a game of six players, zero of us enjoyed the experience.",
    "timestamp": 1664661600
  },
  {
    "username": "skalapunk",
    "rating": 1.0,
    "comment": "No. Just no.",
    "timestamp": 1332799200
  },
  {
    "username": "mknzm",
    "rating": 2.0,
    "comment": "What an absolute shipwreck of a game! Any attempt at strategy or clever play is quickly scuttled by the game’s overwhelming kingmaking mechanics. My group and I were left dumbfounded by how meaningless most decisions felt, and most of us disengaged emotionally by the halfway mark.\n\nFurthermore, the game components are so tacky and devoid of any charm that it’s as if were deliberatly designed to offend both the eyes and the touch. All in all, Lifeboats sinks under its own weight, a pointless catastrophe from bow to stern.",
    "timestamp": 1747432800
  },
  {
    "username": "zymil",
    "rating": 2.0,
    "comment": "Sold after 1 game.\n\nFirst game brings a lot of laughter. But felt very draggy.",
    "timestamp": 1663970400
  },
  {
    "username": "ThingsThing",
    "rating": 3.0,
    "comment": "1.78 Complexity\nI was not paying attention when deciding games and didn't hear the part where my friend said I would dislike this game.\nIt was so painful getting through this I do not like negotiation games!",
    "timestamp": 1751666400
  },
  {
    "username": "Shortbeard",
    "rating": 3.0,
    "comment": "This is a game with nice chunky wooden pieces. It also has chunky wooden gameplay with a low amount of choices. The game plays you. Not something I am looking to play again.",
    "timestamp": 1747260000
  },
  {
    "username": "Katabrok",
    "rating": 4.0,
    "comment": "Although it wasn't that long, the game felt extremely lengthy. This is due to the bureaucratic and unintuitive flow. Arriving with all ships is a poor endgame condition. The best part of the game is to use the captain at the right time.",
    "timestamp": 1756504800
  },
  {
    "username": "jammasterjake",
    "rating": 4.0,
    "comment": "I felt so out of control of what was happening.",
    "timestamp": 1743890400
  },
  {
    "username": "adel9591",
    "rating": 5.0,
    "comment": "Thematically weird. The switching lifeboats especially and the fact that sailors can jump into any lifeboat makes no sense. Very unique, very mean so it stays in the collection but overall the weird features bring this way down.",
    "timestamp": 1760220000
  },
  {
    "username": "Diet_of_Worms",
    "rating": 5.0,
    "comment": "I am not a fan of negotiation games",
    "timestamp": 1742079600
  },
  {
    "username": "Nijoth",
    "rating": 5.0,
    "comment": "Fun mean negotiations but too long.",
    "timestamp": 1731106800
  },
  {
    "username": "Jittery Jester",
    "rating": 5.0,
    "comment": "Played once with the cousins and it was like playing Survivor the TV show in a board game. You need the absolute right people to play this with. No sensitive people allowed!",
    "timestamp": 1708383600
  },
  {
    "username": "adi_venturer",
    "rating": 6.0,
    "comment": "As much as I enjoy cut-throat games with high interaction and king-making, I am not the biggest fan of Lifeboats for a few reasons. First, the decisions in this game feel a bit meaningless and not rooted in strategy. The game devolves quickly into a shouting match between players and the final standings feel less about how well you negotiated yourself into a strong position and more about who got king-made by the most people. The game also goes on for a bit too long for what it is. This is a 90 minute game that should have been a 45 minute game.\n\nIt is still much better than Chinatown though because it is at least not racist.\n\n(Plays: 1)",
    "timestamp": 1748901600
  },
  {
    "username": "verandi",
    "rating": 6.0,
    "comment": "Not something I'd play all the time, but an interesting concept and unique experience.",
    "timestamp": 1743289200
  },
  {
    "username": "ToreDenmark",
    "rating": 6.0,
    "comment": "Historic gem in the board game hobby.",
    "timestamp": 1736636400
  },
  {
    "username": "LastPlace",
    "rating": 6.0,
    "comment": "Enjoyed the negotiation and backstabbing. Deeper than I thought.",
    "timestamp": 1722895200
  },
  {
    "username": "yanndan",
    "rating": 7.0,
    "comment": "Kids",
    "timestamp": 1759269600
  },
  {
    "username": "sthompson022",
    "rating": 7.0,
    "comment": "6/28/2025: Purchased from Geek Market for $75 + $13 shipping.",
    "timestamp": 1751752800
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Raw negotiation game. Each round has four actions, and three of the four are determined by votes. Cutthroat, random, and brutal, this game works pretty well for being so simple.",
    "timestamp": 1759356000
  },
  {
    "username": "guimel",
    "rating": 7.5,
    "comment": "aka Lifeboats (1993) Not for trade.\n\n3 players minimum. 90 mins. Very light game. We love this game even if for more players. German edition. Great fun. We will keep this one. It's always a crowd pleaser.",
    "timestamp": 1759269600
  },
  {
    "username": "montag66",
    "rating": 8.5,
    "comment": "Low trade interest",
    "timestamp": 1756936800
  },
  {
    "username": "zabriskie_point",
    "rating": 8.5,
    "comment": "¡Cuánto me arrepiento de haberlo vendido!",
    "timestamp": 1755900000
  },
  {
    "username": "RikHavok",
    "rating": 10.0,
    "comment": "2/25",
    "timestamp": 1740351600
  },
  {
    "username": "robstalobsta",
    "rating": 10.0,
    "comment": "This game got me engaged.",
    "timestamp": 1738278000
  }
]