[
  {
    "username": "ndanger666",
    "rating": 1.0,
    "comment": "One of my nominees for \"Worst Game Ever\". Any game where you can spend an hour watching everyone else play repeated turns while you just sit there simply sucks.",
    "timestamp": 1676934000
  },
  {
    "username": "bruticus",
    "rating": 1.0,
    "comment": "I wanted to quit. So boring.",
    "timestamp": 1621980000
  },
  {
    "username": "pyroraptor70",
    "rating": 1.2,
    "comment": "Met the creator at a convention. This game is bad, but him as his \"fan club\" made it so much worse.\n\nNever want to play one of his games again.",
    "timestamp": 1604962800
  },
  {
    "username": "giltleaf",
    "rating": 1.0,
    "comment": "Like a better version of Munchkin, which isn't saying much...",
    "timestamp": 1555624800
  },
  {
    "username": "BuckShot Bill",
    "rating": 1.0,
    "comment": "So tedious.",
    "timestamp": 1364684400
  },
  {
    "username": "gixmo",
    "rating": 1.0,
    "comment": "Funnt and chaotic, but i'll try not to play tto much it, and not with many people",
    "timestamp": 1345500000
  },
  {
    "username": "magnoguido",
    "rating": 1.0,
    "comment": "Like playing with a wet tomatoe seed, but without the tactical feedback of your finger dictating where the seed will go, but rather someone slapping your hand around when your trying to pin the seed down.\nThat's about the same amount of fun I'd have playing this game again.",
    "timestamp": 1322521200
  },
  {
    "username": "rorshaq",
    "rating": 1.0,
    "comment": "rating after 1 play (7pl) - 4\n\nrandom boring downtime nonsense",
    "timestamp": 1315087200
  },
  {
    "username": "jarviskj3",
    "rating": 1.0,
    "comment": "The only source of fun we had in my only play of this game was laughing about how bad this game is.",
    "timestamp": 1310940000
  },
  {
    "username": "Yugblad",
    "rating": 1.0,
    "comment": "NEVERENDING SNOOZEFEST.\n\nWith added crappy paper components.\n\nSimply one of my worst game evenings ever was spent playing this. Rare are games that have me wishing that somebody, ANYBODY, would win and end my waking nightmare.\n\nThey say \"worse things happen at sea\" but since I know a fisherman and a submariner - neither of which has reported an evening as bad as the one I had playing Kill Doctor Lucky - I can say, with some anecdotal authority, that sea-based mishaps cannot trump this boring creation.",
    "timestamp": 1298847600
  },
  {
    "username": "minordemon",
    "rating": 1.0,
    "comment": "Nobody ever played a 'Fail' card, so the game lasted maybe 10 minutes.",
    "timestamp": 1287093600
  },
  {
    "username": "no_where_dense",
    "rating": 1.0,
    "comment": "I have never played kill doctor lucky. I played save doctor lucky and they are the same game....",
    "timestamp": 1245535200
  },
  {
    "username": "larryjrice",
    "rating": 1.0,
    "comment": "I despise this game. Run around the house chasing Dr. Lucky and draw cards. Get alone with Dr. Lucky where no one can see you and you can try and kill him except everyone will then play their fail cards on you. Rinse, lather, repeat. Boooooooooring! We were starting to threaten people with their life if they would play fail cards!",
    "timestamp": 1233874800
  },
  {
    "username": "hymie",
    "rating": 1.0,
    "comment": "This was fun for a while, but dwindled quickly when the \"Failure\" cards were gone and the \"Spite\" tokens were flying around. Too many sight lines, player turn order changing, and everybody expected everybody else to prevent the murder. After an hour and a half, we were just glad to have somebody end it.",
    "timestamp": 1170025200
  },
  {
    "username": "Matt Kimball",
    "rating": 1.0,
    "comment": "Let's all go around the table and play \"you fail\" cards for an hour. Or not.",
    "timestamp": 1101682800
  },
  {
    "username": "fowerscoco",
    "rating": 2.0,
    "comment": "Felt like tic tac toe in which no one could successfully ride the lucky train to be able to kill lucky without having someone else successfully viewing/blocking them. Feels like it would always be a tied situation to the point that we would just call it a tie or purposefully move in a manor that would end the game to just play something else.",
    "timestamp": 1682805600
  },
  {
    "username": "BillNC",
    "rating": 2.0,
    "comment": "A novel game idea, but not really one I want to play more than once.",
    "timestamp": 1672786800
  },
  {
    "username": "lebleuceleste",
    "rating": 2.0,
    "comment": "6-Player dragged on even after lights went out. Wasn't very interactive for a pub game. No reason to play again with other better games out there.",
    "timestamp": 1672700400
  },
  {
    "username": "Pandorzecza",
    "rating": 1.5,
    "comment": "Slow and boring",
    "timestamp": 1628114400
  },
  {
    "username": "Cone Defense",
    "rating": 2.0,
    "comment": "I loved the idea/theme of this game coupled with the larger player count capability. The game itself though, simply put, felt dumb.",
    "timestamp": 1603753200
  },
  {
    "username": "tempar",
    "rating": 2.0,
    "comment": "Too random, too much cards in your hand.",
    "timestamp": 1573599600
  },
  {
    "username": "seleucus",
    "rating": 2.0,
    "comment": "Really bad and boring game!",
    "timestamp": 1546642800
  },
  {
    "username": "Agyar",
    "rating": 2.0,
    "comment": "Munchkin meets Cluedo. In a bad way.",
    "timestamp": 1543705200
  },
  {
    "username": "Ohmygato",
    "rating": 2.0,
    "comment": "This game is so boring I would rename it \"Kill Myself\".",
    "timestamp": 1533160800
  },
  {
    "username": "Davefave",
    "rating": 2.0,
    "comment": "This game was shockingly boring. It seemed the game was all about just moving in circles around the board and getting lucky with drawing the right cards.",
    "timestamp": 1525039200
  },
  {
    "username": "kittykat27",
    "rating": 2.0,
    "comment": "Would much rather play Clue or Thirteen Dead End Drive with children over this. Theme sounded neat. But mechanics felt boring. Played a few games with only adults. This game drags on for what it is, and it all comes down to the lucky draw.",
    "timestamp": 1519254000
  },
  {
    "username": "Psythe",
    "rating": 2.0,
    "comment": "Excellent condition, no missing components, only been played twice.",
    "timestamp": 1509922800
  },
  {
    "username": "dobbie",
    "rating": 2.0,
    "comment": "Got the original Cheapass Games version",
    "timestamp": 1507068000
  },
  {
    "username": "thomasdean007",
    "rating": 2.0,
    "comment": "One of the better Cheapass titles. Pretty fun for an every once in a while stab.",
    "timestamp": 1505426400
  },
  {
    "username": "lordnine",
    "rating": 2.0,
    "comment": "Boring randomness that managed to drag on long after everyone stopped caring.",
    "timestamp": 1488322800
  },
  {
    "username": "NorArro",
    "rating": 3.0,
    "comment": "I thought this game was kinda boring, but when I have played it with beginners they seemed to like it.",
    "timestamp": 1749333600
  },
  {
    "username": "Ideology",
    "rating": 3.0,
    "comment": "Played much before registering games",
    "timestamp": 1724277600
  },
  {
    "username": "Silver Avocado",
    "rating": 3.0,
    "comment": "Extremely amusing theme, a prequel or reverse version of Cluedo, where players are falling over each other to do the murder. But there just isn't much game here, it has the flavour of a plodding roll and move, and powering yourself up to do the deed is a stodgy process.",
    "timestamp": 1717884000
  },
  {
    "username": "grasa_total",
    "rating": 3.0,
    "comment": "Game flow:\n\nPlayer A makes a murder attempt.\n\nIf nobody blocks it, player A will win. But blocking it uses up the resources I need to win myself. So I would rather someone else did it.\n\nTherefore, the best way for me to win is to convince you that I hate playing the game and don't care if I lose as long as it ends. Luckily, this is true.\n\nRedeeming factor: Killing Dr. Lucky with an ill-fitting hat was funny that one time.",
    "timestamp": 1677452400
  },
  {
    "username": "KapteinMaake",
    "rating": 3.0,
    "comment": "The kids enjoy this, I really don't.",
    "timestamp": 1658527200
  },
  {
    "username": "thebogdan",
    "rating": 3.0,
    "comment": "Too long for what its worth",
    "timestamp": 1656194400
  },
  {
    "username": "jaffawahha",
    "rating": 3.0,
    "comment": "Boring",
    "timestamp": 1652565600
  },
  {
    "username": "Eddy Vickery",
    "rating": 3.0,
    "comment": "The main skill seems to be in convincing other people to through out their block cards rather than have to use your own, which I don't find to be very fun. Other than that it is largely just if you happen to be the person who made the attempt when the block cards run out. Too much time and effort for too little fun.",
    "timestamp": 1640905200
  },
  {
    "username": "iadena",
    "rating": 3.0,
    "comment": "Silly game about trying to kill Doctor Lucky. The card draw is random so it is hard to plan. Your success will depend if your opponents drew cards to give Doctor Lucky luck to avoid your manslaughter. If you failed, the weapon card becomes a +1 for future kills so eventually someone will be able to kill him. The winner is the one who either strikes when all players have very few cards in hand in hopes that they cannot play lucky cards for Doctor Lucky or one who has built up a lot of +1. The game is boring because your choices are (1) move to a place so that you can draw cards, (2) do nothing, or (3) try to kill Doctor Lucky. No need to own.",
    "timestamp": 1631743200
  },
  {
    "username": "VonZonk",
    "rating": 3.0,
    "comment": "Can someone please kill the damn Doctor Lucky? Pleeeeease?! Like seriously! Kill that damn dodging Doctor! \"Yes, We Can\" - this historical and electrifying motto is completely negated in this game! The whole group is working as a team to finally kill the damn Doctor instead of trying to be the one who kills him...it seems impossible!",
    "timestamp": 1605826800
  },
  {
    "username": "Waylander1",
    "rating": 3.0,
    "comment": "The game ends terribly. First you have to go through the whole deck and exhaust all of the failure cards. Then, someone has to get lucky enough to be able to attempt a kill twice in a row so that they control the tokens and can actually win. Otherwise, the game ends once everyone runs out of cards and tokens.",
    "timestamp": 1599516000
  },
  {
    "username": "Born-of-Ashes",
    "rating": 3.0,
    "comment": "Monotonous game of attrition. Who will be the lucky enough to strike when everyone has finally run out of fucks to give? Let’s spend the next 90 minutes to find out!",
    "timestamp": 1593986400
  },
  {
    "username": "Eoin Corrigan",
    "rating": 3.0,
    "comment": "Not my kind of game - turns frequently skipped, a little too chaotic. Took about 90 minutes for 6 of us - 20 minutes would be fine but 90 is the time for a good, tight Eurogame.",
    "timestamp": 1576710000
  },
  {
    "username": "apaneto28",
    "rating": 3.0,
    "comment": "For a party game it was bland and uneventful. The gameplay is lacking in excitement. I would likely not play it again if offered.",
    "timestamp": 1562018400
  },
  {
    "username": "photomuse",
    "rating": 3.0,
    "comment": "(Review is for the Island of Dr Lucky, which seems like much the same game) . Played with 5. Did not have much fun and couldn't wait for the game to end. Clearly, it is not a game meant for my tastes.\n\nThis is a game about going through the motions until someone wins because everyone else is out of cards. Yes, you need to do some minor thinking to get in a position to win, but getting in the position to win only happens once around the loop, and everything you do leading up to the win feels rather inconsequential. It is bad when you are in a game that repeatedly skips your turn but you don't care so much because it is not like you needed those turns to put yourself in a position to win anyway.\n\nThe whole collective \"who is going to give up cards to stop the attacker mechanic this time?\" is the worst sort of bluffing/take that. Until you realize that you don't even really need the cards to win, although giving up an attacking card does hurt.\n\nTo me, it feels like a game for families with younger children that also requires reading, so therefore also doesn't work that well for them. I would love to see this redone with no text, and then I would think about it in that context as perhaps rating higher.",
    "timestamp": 1554760800
  },
  {
    "username": "yaenz",
    "rating": 4.0,
    "comment": "Kill me instead if we have to play this again.",
    "timestamp": 1759269600
  },
  {
    "username": "Zoozolissimo",
    "rating": 4.0,
    "comment": "The waste time between one turn and another, there isn't mutch variation and gets boring quickly",
    "timestamp": 1756332000
  },
  {
    "username": "kytheguy",
    "rating": 4.0,
    "comment": "This game lasts so so long. It is so hard to get Doctor Lucky alone and when you do all the other players stop you with Luck cards until eventually after 5 tries no one has enough Luck and someone finally wins.\n\nOr even worse, one player passes (doesn't play Luck) and the remaining player doesn't have any Luck to stop the assassination attempt and the game is over in 10 minutes... actually that might be the best case scenario for this game.",
    "timestamp": 1742857200
  },
  {
    "username": "SteveTremendous",
    "rating": 4.0,
    "comment": "Suffers from three major flaws:\n\n1. Too long for what it is\n2. Luck of the cards too much\n3. By far most importantly, the element that allows everyone to screw the last player who has to play cards and the bad feelings and occasional early game endings that that engenders.",
    "timestamp": 1731193200
  },
  {
    "username": "snoozefest",
    "rating": 4.0,
    "comment": "Fun game we played early in our gaming “career” but it has too much chaos and randomness for our tastes. Even worse, it depends on always stopping the next player for winning … until someone happens to luck into being able to win when the last player happened to run out of the right take-that cards.",
    "timestamp": 1730934000
  },
  {
    "username": "Lost_Marble",
    "rating": 4.0,
    "comment": "PNP",
    "timestamp": 1728856800
  },
  {
    "username": "jodokast4",
    "rating": 4.0,
    "comment": "This is like reverse Clue! Get all the suspects into the house until one of them finds a way to kill the rich guy. Very clever mechanics too! This is the one game that I like more in theory than in practice. It looks so fun, but ends up being less fun than promised.",
    "timestamp": 1728079200
  },
  {
    "username": "whistleblower",
    "rating": 4.0,
    "comment": "Maybe",
    "timestamp": 1724364000
  },
  {
    "username": "DSmitty",
    "rating": 4.0,
    "comment": "Disappointing.",
    "timestamp": 1718834400
  },
  {
    "username": "Jackieh9",
    "rating": 4.0,
    "comment": "Probably better as a family game. Stan taught us. Like munchkin but easier and I enjoy it more. A little less competitive than munchkin",
    "timestamp": 1692914400
  },
  {
    "username": "Mannyx200",
    "rating": 3.5,
    "comment": "Didn't really enjoy this game. It was merely ok.",
    "timestamp": 1676242800
  },
  {
    "username": "jkgrence",
    "rating": 4.0,
    "comment": "I only play it every year or two to remind myself why I only play it every year or two. I’d get rid of it, but my collection feels incomplete without it.",
    "timestamp": 1670540400
  },
  {
    "username": "breakgeek",
    "rating": 4.0,
    "comment": "Check out my review and quick start guide here, I also have some house-rules suggestions!\n\nhttps://www.breakgeek.com/2022/01/14/kill-doctor-lucky-quick...",
    "timestamp": 1642114800
  },
  {
    "username": "Cinful",
    "rating": 4.0,
    "comment": "Trade",
    "timestamp": 1641164400
  },
  {
    "username": "Frillycakes",
    "rating": 4.0,
    "comment": "It was alright. Won at a convention",
    "timestamp": 1634853600
  },
  {
    "username": "LogantheBard",
    "rating": 5.0,
    "comment": "OK family weight game that won't see play over other options.",
    "timestamp": 1759874400
  },
  {
    "username": "ggruetze",
    "rating": 5.0,
    "comment": "Would not play again with anything other than a 4-5 player count, probably not even then",
    "timestamp": 1756072800
  },
  {
    "username": "Generalkhun",
    "rating": 5.0,
    "comment": "One time only as 6p.\nA strange position blocking kind of thing. This game has a good idea about the movement and card usage but as 6p its feels dragging forever and almost nothing we can do. The line of sight is strange and need to be familairized before having fun with it. Needs mpre play to bump up the score probably not at 6p",
    "timestamp": 1753912800
  },
  {
    "username": "threeofsix",
    "rating": 5.0,
    "comment": "It's a funny game, but with poor strategic options. Turn order and luck factor in far more than making good choices, and for most turns the decision space is quite small. Fun to play with kids for the humor.",
    "timestamp": 1750629600
  },
  {
    "username": "Astronica",
    "rating": 5.0,
    "comment": "It's quite an old game so there's that, but we were laughing while playing it, the absurd theme really does carry it. It's a bit similar to Munchkin that I don't like, that everybody keeps playing negative cards until they run out and a player succeeds. The spite variant is a must to not have the game drag. Would really like a second version of this.",
    "timestamp": 1749333600
  },
  {
    "username": "Karic123",
    "rating": 5.0,
    "comment": "Not good with 8 players.",
    "timestamp": 1747260000
  },
  {
    "username": "RikHavok",
    "rating": 5.0,
    "comment": "2/25\n\nSleeved w Mayday 59x92",
    "timestamp": 1740265200
  },
  {
    "username": "Joccalor",
    "rating": 5.0,
    "comment": "Good for some chaotic fun. There are a few interesting choices you can make, but ultimately it comes down to what cards you happen to have in your hand. It has the Munchkin dynamic where one person is going to win so everyone gangs up on them and then the next person is about to win so everyone gangs up on them. The winner of the game is not the person who played the best, but rather the person who attempts to win when everyone else has run out of cards to stop them.",
    "timestamp": 1740092400
  },
  {
    "username": "Phelonius",
    "rating": 5.0,
    "comment": "never played",
    "timestamp": 1739574000
  },
  {
    "username": "fromeea",
    "rating": 5.0,
    "comment": "In Box #0120\n\nKara Pratt-Frome: 9\nJohn Jansma: 6\nMelissa Jansma: 7\nJustin Heimer: 6\nRosalie Phillips: 5 - not a fan of that type of game\nAmy Peschong: 7\nBrady Jensen: 8\nDawn Raymond: 7",
    "timestamp": 1736722800
  },
  {
    "username": "Dayfall",
    "rating": 5.0,
    "comment": "The original rules can have the game go on for too long. Had to remove some failure cards otherwise the first half of the game is fairly pointless.\n\nMost of the fun comes from trying to set up a good murder.",
    "timestamp": 1707087600
  },
  {
    "username": "AmazeingGames",
    "rating": 5.0,
    "comment": "Rules are confusing.",
    "timestamp": 1695592800
  },
  {
    "username": "hexpixy",
    "rating": 5.0,
    "comment": "Love that it's reverse Clue but I just couldn't get it to the table often enough",
    "timestamp": 1692828000
  },
  {
    "username": "vp7turtle",
    "rating": 5.0,
    "comment": "2-6, Competitive, Resource Management - Anti-Clue",
    "timestamp": 1678575600
  },
  {
    "username": "shawnnotsean",
    "rating": 5.0,
    "comment": "We messed up the rule a little bit",
    "timestamp": 1672009200
  },
  {
    "username": "Urtho",
    "rating": 5.0,
    "comment": "I always have fun playing this, but it is not really a great game. It has a bit of Munchkinitis to it where everyone picks on the leader. Also like Munchkin it goes on a bit long. I do not know if I could get people to play it with me at this point.",
    "timestamp": 1661724000
  },
  {
    "username": "Capntallon",
    "rating": 5.0,
    "comment": "Michael is this game's biggest fan. I should give it to him.\n\nEDIT: I DID!",
    "timestamp": 1661378400
  },
  {
    "username": "alexlauth",
    "rating": 5.0,
    "comment": "Great topic if you like black humor. also the rules are easy to understand. However, the fun of playing is very lost, especially in large rounds. Tactics or strategy are destroyed by the rule that Dr. Lucky determines the order of play. So it's kind of chaos and gamble. Sometimes the downtime is extremely increased and you just watch what is happening on the board. Frustrating.",
    "timestamp": 1642978800
  },
  {
    "username": "AnthemOfTheSun",
    "rating": 5.0,
    "comment": "The end of this game is very climactic, but it is a bit of a slog to get everything lined up for that climactic ending.",
    "timestamp": 1642201200
  },
  {
    "username": "vor_lord",
    "rating": 5.0,
    "comment": "Fun family game. Do not play with too many players as time between turns might end up too long.\n\nDo not play with poor sports as they can choose to end the game.",
    "timestamp": 1605049200
  },
  {
    "username": "Edward_Oakley",
    "rating": 5.0,
    "comment": "Can sometimes live up to the expectation of \"reverse clue\" but other times it can be drawn out and slow- I feel that Card Draw is excessively high in the core rules and leads to failure card after failure card, and while the failure token mechanic is meant to ensure the game ends -- I feel that more often the winner is the one who doesn't attack until everyone else has exhausted their cards blocking other people's murders.",
    "timestamp": 1598392800
  },
  {
    "username": "quiltymom",
    "rating": 5.0,
    "comment": "Sold to BLADE Gaming",
    "timestamp": 1595023200
  },
  {
    "username": "SirPork",
    "rating": 5.0,
    "comment": "NEVER BUY THIS FOR ME EVER AGAIN!!!",
    "timestamp": 1582930800
  },
  {
    "username": "ChelseaSquare",
    "rating": 5.0,
    "comment": "Very nice components in the Titanic Games edition. This game is fun with the right people. I feel immersed in it's theme and game play but, people who are competitive and care about who wins will not enjoy this game because, the end is very unsatisying.\n\nPeople who play to have fun with the story of the game and want some interaction with some thought and a few laughs with each other will greatly enjoy this game.",
    "timestamp": 1579820400
  },
  {
    "username": "Banannaball",
    "rating": 5.0,
    "comment": "I've had fun the times I've played this game - a prequel to Clue in which you must kill the doctor without anyone else seeing as he hobbles through his mansion. A little too simple for my tastes.",
    "timestamp": 1579561200
  },
  {
    "username": "mogadon",
    "rating": 5.0,
    "comment": "A few laughs the first time through, but not a good enough game. About as good as Clue (Cluedo).",
    "timestamp": 1571954400
  },
  {
    "username": "visno",
    "rating": 5.0,
    "comment": "great premise, but lacking in gameplay and complexity. low replayability. frustration builds quickly as your turn can be skipped repeatedly. lack of movement means you will spend a lot of time simply waiting for dr. lucky to come to whatever is near you rather than trying to find ideal positioning to kill the doctor.\n\nthe game is rich in characters, each with their own back stories but no defining characteristics that separate them from each other outside of the artwork.\n\nthe game does not contain enough cards, and the inclusion of luck on the movement and weapon cards sort of makes failure cards completely irrelevant. failure cards should simply be removed from the game in favor of more movement cards since non-failure cards can do the same thing. game needs refinement to go from a mediocre game to a great game.",
    "timestamp": 1568498400
  },
  {
    "username": "richpizor",
    "rating": 5.0,
    "comment": "Printed and played once, largely as an exercise to make sure it wasn't similar to a friend's game. Like most CheapAss games, fine for what it is but there's just not much there.",
    "timestamp": 1567375200
  },
  {
    "username": "brumcg",
    "rating": 5.0,
    "comment": "I have the original (cheap) version. Somewhat clever, somewhat humorous.",
    "timestamp": 1565301600
  },
  {
    "username": "gecouc",
    "rating": 5.0,
    "comment": "Gimmick",
    "timestamp": 1563314400
  },
  {
    "username": "elucidarian",
    "rating": 5.8,
    "comment": "Irreverently themed and lightly ruled, this Clue send-up requires more tactical than strategic processing. I recommend 3-5 players.\n\nPlaying with 6 people was not an optimal number. Too many characters on the board prolongs the game to the point where chance (and holding onto the right move card) snares you the win condition.",
    "timestamp": 1759442400
  },
  {
    "username": "logopolys",
    "rating": 6.0,
    "comment": "Cheap-ass cost, expensive game play. This game had great mechanics and story. The biggest problem is downtime can kill you sometimes; I played a game once where my buddy's first turn was fifteen minutes in.\n\nCheap-ass: The Director's Cut",
    "timestamp": 1759356000
  },
  {
    "username": "Valecalab",
    "rating": 5.5,
    "comment": "regalato",
    "timestamp": 1753999200
  },
  {
    "username": "winchesterkaveman",
    "rating": 6.0,
    "comment": "Flips Cluedo on it's head and now you are competing to kill the master of the house, who is alarmingly agile and speedy in his never ending journey around and around the mansion.\nBut you can't be witnessed doing the deed, and your opponents will go out of their way to foil your plots so they get the joy of offing the old man themselves.\n\nFun, but suffers from the same issue so many games like this do with no one ever wanting to be the first to try, as everyone will spend their saved foils to ruin your chances, and sure as anything 2nd or 3rd attempt will get it, once the good cards have been used up. Entertain for a game or two.",
    "timestamp": 1753653600
  },
  {
    "username": "mighty_scoop",
    "rating": 6.0,
    "comment": "u",
    "timestamp": 1752357600
  },
  {
    "username": "Scowiii",
    "rating": 6.0,
    "comment": "Ok.",
    "timestamp": 1743717600
  },
  {
    "username": "hakuus",
    "rating": 6.0,
    "comment": "Run out of cards race. C",
    "timestamp": 1742684400
  },
  {
    "username": "hyenahero99",
    "rating": 5.5,
    "comment": "incl alternate board.",
    "timestamp": 1732575600
  },
  {
    "username": "xmorridin",
    "rating": 6.0,
    "comment": "Played with 3 people",
    "timestamp": 1726610400
  },
  {
    "username": "Bishopsuey",
    "rating": 6.0,
    "comment": "v.2022",
    "timestamp": 1726524000
  },
  {
    "username": "Leffots",
    "rating": 6.0,
    "comment": "2-8",
    "timestamp": 1724536800
  },
  {
    "username": "adamphipps11",
    "rating": 6.0,
    "comment": "3-8 Players\nBest: 5",
    "timestamp": 1723068000
  },
  {
    "username": "Thrift Thopter",
    "rating": 6.0,
    "comment": "Purchased from yolandavi",
    "timestamp": 1720994400
  },
  {
    "username": "GomJabbar",
    "rating": 5.6,
    "comment": "Have the PnP edition for backcountry camping trips",
    "timestamp": 1712786400
  },
  {
    "username": "Levydrogo",
    "rating": 6.0,
    "comment": "Light hearted entertainment. Need to plan ahead to be successful and win. Good family/party game.",
    "timestamp": 1708383600
  },
  {
    "username": "Undertaker_true",
    "rating": 5.5,
    "comment": "An average party game",
    "timestamp": 1708383600
  },
  {
    "username": "bobpazjr",
    "rating": 5.5,
    "comment": "Little romp that flips the script on Clue. The art is fitting, the components are simple. Easy to learn. Easy to teach others. The flavor text on the cards is fantastic. It is a bonus that you can get 8 people around the table for this one. Drags on a bit.",
    "timestamp": 1703372400
  },
  {
    "username": "Milka",
    "rating": 6.0,
    "comment": "rating after 1 play",
    "timestamp": 1702162800
  },
  {
    "username": "Shadow17",
    "rating": 6.0,
    "comment": "Gave away.",
    "timestamp": 1698879600
  },
  {
    "username": "Znirk",
    "rating": 6.0,
    "comment": "Not terrible, can drag.",
    "timestamp": 1698706800
  },
  {
    "username": "Filometri",
    "rating": 6.0,
    "comment": "I had fun playing it the first two times, overall is not a bad design, but its problem is replayability. However my first daughter Sofia chose it at our first Lucca Games together, so it will stay in my collection.",
    "timestamp": 1698012000
  },
  {
    "username": "iNano78",
    "rating": 6.0,
    "comment": "A game of backstabbing. Can be really fun, but can also run too long when spite tokens keep getting passed around.\n\nPurchased from BGGer (Tom Vasel), December 2011.",
    "timestamp": 1697580000
  },
  {
    "username": "fanofuna",
    "rating": 6.0,
    "comment": "Finally got to play it 3 times with 3 players total. I have the Paizo (2010) version that comes with the dog variant (we didn't play the dog though).\n\nGame was extremely fun and we had some memorable moments. Everyone loved it. The board it comes with is GORGEOUS. Not sure if I could play the free to print version after playing with the board.",
    "timestamp": 1696802400
  },
  {
    "username": "ccjnwl",
    "rating": 6.0,
    "comment": "#NWG",
    "timestamp": 1688940000
  },
  {
    "username": "Drake33",
    "rating": 6.4,
    "comment": "Has some gameplay issues.",
    "timestamp": 1682892000
  },
  {
    "username": "b0ardgamer",
    "rating": 6.0,
    "comment": "Eh, not bad, but not great either.",
    "timestamp": 1679180400
  },
  {
    "username": "pedrofreitas",
    "rating": 6.0,
    "comment": "Ofertado ao V",
    "timestamp": 1678230000
  },
  {
    "username": "exppointsg",
    "rating": 6.2,
    "comment": "Recommended at 3, 4 and 6",
    "timestamp": 1675810800
  },
  {
    "username": "tanik",
    "rating": 6.0,
    "comment": "It's a light and easy to learn game with a fair bit of randomness due to the role of the cards. The cards are used to move, attack Dr. Lucky or prevent another's attack, and you can end up with a good or bad draw that can suddenly put you in a very strong position or a very weak one. This makes a great family game, but a little less interesting for those who aren't s crazy about the lack of control inflicted by the randomness of a card draw.",
    "timestamp": 1672268400
  },
  {
    "username": "manwitchjoe",
    "rating": 6.0,
    "comment": "Great fast pace game that is enjoyable and easily taught to novice gamers.",
    "timestamp": 1671750000
  },
  {
    "username": "WaldoJeffers",
    "rating": 7.0,
    "comment": "5 Players",
    "timestamp": 1760652000
  },
  {
    "username": "Zagreus9",
    "rating": 7.0,
    "comment": "A flawed gem. There are times where you just sit waiting as the doctor lucky train is unkind to you, but it's so bright and fun when it lets you",
    "timestamp": 1754690400
  },
  {
    "username": "Dayto",
    "rating": 6.6,
    "comment": "A neat take on the classic Clue style of mystery, but a bit too random",
    "timestamp": 1753826400
  },
  {
    "username": "JohnGrimes",
    "rating": 7.0,
    "comment": "Viel zu lange nicht gespielt! Wackelkandidat",
    "timestamp": 1750716000
  },
  {
    "username": "dietel",
    "rating": 7.0,
    "comment": "This game hits a sweet spot for me. Maybe it’s not a masterpiece mechanically (I have no idea) but the theme is so delightful and comedic that it will always have a place in my collection.",
    "timestamp": 1747778400
  },
  {
    "username": "MatroidX",
    "rating": 7.0,
    "comment": "This was a pleasant surprise. It was a free win at a convention and I thought I'd play it a couple times and then sell it, but it earned a spot in my collection. A couple observations on why this is:\n\n1) The theme is quite amusing, and gets everyone chuckling and involved early on, even non-gamers.\n2) The rules are light / easy to learn. Again, great for intro / party games.\n3) Tension builds nicely over time, with people gaining in rage / strength while luck is running out.\n\nIt's also surprisingly less random than I thought. My first five 4-player games, I won the first 4, and the last one I only fell short by one step (I made the second-last kill attempt with >10 damage and consumed 100% of my rivals' clovers, so just fell short by one).\n\nThere are a couple shortcomings:\n1) Because of riding the \"Lucky-train\" and Doctor Lucky altering player order, a player may not have a turn for quite some time.\n2) The non-gamers in my group were peeved I kept winning, so maybe more luck/randomness is needed for an intro / party game..?\n\nI also haven't tried enough player counts to see how it scales.\n\nUpdate: Tried at 8 players, and the lucky-train downtime just got worse. Especially if multiple players were in the same room waiting for Doctor Lucky. I felt this dragged the game a bit much, especially for kids, so lowered the score.",
    "timestamp": 1746136800
  },
  {
    "username": "TuesdayFortnite",
    "rating": 7.0,
    "comment": "love this clue/cluedo prequel. To solve a murder mystery you have to have a murder right? This game is based in the clue house - but you are trying to knock off the owner, who is surprisingly lucky!",
    "timestamp": 1742338800
  },
  {
    "username": "bentleythekid",
    "rating": 7.0,
    "comment": "3-8 players (best with 5)\n[45 min]",
    "timestamp": 1736118000
  },
  {
    "username": "gachzorge",
    "rating": 7.0,
    "comment": "I ended up gifting this away. I think it would be fun to play with gamers, but it's more for a casual crowd. It is very difficult to read the board and know what a good placement is and get Dr. Lucky at the right spot. It felt like it dragged on.",
    "timestamp": 1732662000
  },
  {
    "username": "CerberusPidza",
    "rating": 7.0,
    "comment": "Un ottima reinterpretazione e modernizzazione di Cluedo, per renderlo più dinamico e interattivo. La possibilità di giocare fino ad 8 giocatori gli ritaglia uno spazio importante in determinate serate giochi.",
    "timestamp": 1731711600
  },
  {
    "username": "tphon",
    "rating": 7.0,
    "comment": "Sleeved - Standard",
    "timestamp": 1729029600
  },
  {
    "username": "Posco",
    "rating": 7.0,
    "comment": "Z",
    "timestamp": 1726005600
  },
  {
    "username": "matzeHRO",
    "rating": 7.0,
    "comment": "Keller",
    "timestamp": 1723672800
  },
  {
    "username": "Jubbly",
    "rating": 7.0,
    "comment": "Played with pieces from a child's Winnie the Pooh game, with hilarious results.",
    "timestamp": 1717624800
  },
  {
    "username": "FuetterMeinEgo",
    "rating": 7.0,
    "comment": "WTF, die neuen Regeln sind eine Verschlechterung.",
    "timestamp": 1713391200
  },
  {
    "username": "jimmyhuha",
    "rating": 8.0,
    "comment": "Keep: F",
    "timestamp": 1756677600
  },
  {
    "username": "MeepleCompiler",
    "rating": 7.7,
    "comment": "F.\n\nAnleitung:\nhttps://www.youtube.com/watch?v=w4wZzQ1zAeE",
    "timestamp": 1755381600
  },
  {
    "username": "Nadialove",
    "rating": 7.5,
    "comment": "3-8",
    "timestamp": 1752012000
  },
  {
    "username": "Old Svedala",
    "rating": 7.5,
    "comment": "Solid classic that creates the right level of planning and chaos in the group.",
    "timestamp": 1747173600
  },
  {
    "username": "CountVowl",
    "rating": 8.0,
    "comment": "Once we figured out the instructions, this is a really fun game. Lots of steps to remember, but entertaining.",
    "timestamp": 1739228400
  },
  {
    "username": "Madviking12",
    "rating": 8.0,
    "comment": "#Cheapass",
    "timestamp": 1737068400
  },
  {
    "username": "ToveJanina",
    "rating": 7.5,
    "comment": "A fun, easy-to-learn, dark-humor reverse Clue.",
    "timestamp": 1736204400
  },
  {
    "username": "CormorantLighthouse",
    "rating": 8.0,
    "comment": "Macht super Spaß und ist sowohl als Zwei-Spieler als auch als Mehrspieler-Spiel überraschend strategisch",
    "timestamp": 1729375200
  },
  {
    "username": "jwilhm",
    "rating": 8.0,
    "comment": "Save",
    "timestamp": 1725832800
  },
  {
    "username": "Vexpac",
    "rating": 7.5,
    "comment": "Beer and pretzels game. Morbid and easy to teach and play.",
    "timestamp": 1723672800
  },
  {
    "username": "ToBakai",
    "rating": 7.5,
    "comment": "Das Spielmaterial wurde durch die Jubiliäumsausgabe deutlich verbessert. Funktioniert in großen Gruppen gut, kann aber zu Downtime kommen, falls eine Personen mit dem Movement Regeln nicht klar kommt.\nAnsonsten nen solides Spiel für größere Gruppen.",
    "timestamp": 1715637600
  },
  {
    "username": "DiceOnTheFloorAgain",
    "rating": 8.0,
    "comment": "Good fun \"reverse Cluedo\". However we did need to introduce an in-house rule to limit the number of times a player could \"ride the Dr Lucky Train\", otherwise some players can get an unfair advantage of the number of cards they hold.",
    "timestamp": 1715119200
  },
  {
    "username": "Jwat18",
    "rating": 8.0,
    "comment": "£12 - EBAY",
    "timestamp": 1714341600
  },
  {
    "username": "beemanberlin",
    "rating": 8.0,
    "comment": "I own the 24 3/4 edition with adjusted rules (better in my view), thematic, coloured artwork and meeples.\nThis is such an improvement over the original b&w version.",
    "timestamp": 1713132000
  },
  {
    "username": "Abyss_Raider",
    "rating": 8.0,
    "comment": "I love this game a lot! The people I played with didn't seem as enthused on the first playthrough, but after we beat it they seemed to warm up to it. I really enjoyed it, it feels like an \"inverse Clue\", and being a huge fan of Clue, it's really fun seeing it from the other side.\nThe competitive aspect is light, which I always enjoy, being a fairly non-competitive person, and the game itself feels very quality with great art. I really enjoy this one.",
    "timestamp": 1709420400
  },
  {
    "username": "FuetterMeinEgo",
    "rating": 8.5,
    "comment": "Besseres Regelwerk als in der überarbeiteten Anniversary-Edition. Durch die Möglichkeit, Dr. Lucky ebenfalls mittels Karten zu bewegen hat man ungleich mehr taktische Möglichkeiten, Kettenzüge auszuführen.",
    "timestamp": 1752098400
  },
  {
    "username": "FuetterMeinEgo",
    "rating": 9.0,
    "comment": "Love it!\nthe titanic edition looks great",
    "timestamp": 1743717600
  },
  {
    "username": "robertos_br",
    "rating": 9.0,
    "comment": "*",
    "timestamp": 1632348000
  },
  {
    "username": "OutlookGrim",
    "rating": 9.0,
    "comment": "This is always one of our go-to games. It's kind of like Clue, but instead of solving a murder, you're trying to cause one. It's a great game for people less experienced in board games while still being enjoyable for those who have played a ton.\nA fun little party game and one of my wife's favorite games period!",
    "timestamp": 1632088800
  },
  {
    "username": "Pevans",
    "rating": 9.0,
    "comment": "It's a classic",
    "timestamp": 1609714800
  },
  {
    "username": "OneLiveBadger",
    "rating": 9.0,
    "comment": "Great fun, guaranteed to generate much laughter",
    "timestamp": 1588975200
  },
  {
    "username": "gamerdoge",
    "rating": 9.0,
    "comment": "what can I say? a simple game that bring so much joy. the true spirit of Cheapass Games.",
    "timestamp": 1573340400
  },
  {
    "username": "ErikGuttman",
    "rating": 9.0,
    "comment": "I have often play this game at parties. With several players it can be too slow for some people. The task is almost collaborative as the great coup approaches.",
    "timestamp": 1571954400
  },
  {
    "username": "Jukke",
    "rating": 9.0,
    "comment": "This game can get quite interesting, very quickly.\nLove the mechanic where you can deceide to leave the problem to the next in line to solve.\nWe even had games where people were forced to pay because they where the last in line. But that person just said, screw it, you're not deciding for me, so he choose to do nothing. So he'd loose and al the others before him to.\nThat are the moments this game really shines.",
    "timestamp": 1557093600
  },
  {
    "username": "GoryKnight",
    "rating": 9.0,
    "comment": "Kill Doctor Lucky is quick and easy to learn while still providing strategy for experienced players. This is a game that I typically use to introduce new people to the world of board games. The only real draw back to this game is that it can get repetitive if played too frequently.",
    "timestamp": 1555884000
  },
  {
    "username": "RingelTree",
    "rating": 9.0,
    "comment": "A favorite among casual gamer friends and family. It is still fun to bring out from time to time. \"It is like Clue in reverse: You want to murder the guy\" makes it easy to draw in new players.\n\n19.5 Edition: This was a big disappointment. The rules changes really bogged the game down as everyone scattered to different parts of the board and waited to draw a card or make a murder attempt. I like some of the changes including the variety of cards but overall I will go back to the original. I might try and figure out some house rule to unclog this edition.\n\nMy \"9\" refers to the original edition. I would rate the new one a 4.",
    "timestamp": 1533592800
  },
  {
    "username": "whitecaddy",
    "rating": 9.0,
    "comment": "I own an Cheap Ass Games version and it is always a good time when played, both with new and seasoned players.",
    "timestamp": 1502402400
  },
  {
    "username": "snowytodd",
    "rating": 9.0,
    "comment": "Easy.fun.gorgeous.",
    "timestamp": 1493416800
  },
  {
    "username": "gaZeboman",
    "rating": 9.0,
    "comment": "5x die 19.5th Edition gespielt.",
    "timestamp": 1483743600
  },
  {
    "username": "Greg 50",
    "rating": 9.0,
    "comment": "So far the rule improvements appear to be fantastic!",
    "timestamp": 1469743200
  },
  {
    "username": "matrishka",
    "rating": 10.0,
    "comment": "Played this with one of our friends and had never heard of it before. We absolutely loved it, got it for one of our other friends who loves board games and they loved it too! This is now one of our go-to games! The different variations are great so gameplay doesn’t get too repetitive.",
    "timestamp": 1754172000
  },
  {
    "username": "DestinyCutie",
    "rating": 10.0,
    "comment": "A great little game from cheapass, we love it at 2 players.",
    "timestamp": 1748383200
  },
  {
    "username": "Punchiiez",
    "rating": 10.0,
    "comment": "Weight: 1.5\nPlayer: 3-8\nGreat for party",
    "timestamp": 1719784800
  },
  {
    "username": "PotatoKing620",
    "rating": 10.0,
    "comment": "B5",
    "timestamp": 1692136800
  },
  {
    "username": "toomanyminis",
    "rating": 10.0,
    "comment": "PURGE 05/2023",
    "timestamp": 1684274400
  },
  {
    "username": "KidaMatilda",
    "rating": 10.0,
    "comment": "3-7p (4-7)",
    "timestamp": 1661551200
  },
  {
    "username": "robertjlee",
    "rating": 10.0,
    "comment": "Paizo edition: the one with cardboard cutouts and plastic stands for characters",
    "timestamp": 1660946400
  },
  {
    "username": "jmegner",
    "rating": 10.0,
    "comment": "Aside from gameplay, what you get in the box is good quality and the art is good.\n\nFor casual play, it does a lot of things very well. The rules are simple. The turns are short so that other people's turns are still interesting. The line-of-sight, movement, and changing-turn-order mechanics are fun and interesting. For more than two players, there's a bit of a problem that you want to hold back your attacks and let the other players do the hard work.\n\nFor two-player games with the strangers, all the problems are gone. Also, the game mechanics really shine. There are really rich tactics and strategy that are possible in this game and I think it's a shame that most people seem to think it is a shallow game. The strangers and the doctor activating people outside of the normal turn order really opens up interesting possibilities.\n\nIt might be my favorite traditional board game of all time for two-player games. I doubt that my words have done justice to how much I like the mechanics in this game, some of them fairly unique.",
    "timestamp": 1651442400
  },
  {
    "username": "VanillaCokeMule",
    "rating": 10.0,
    "comment": "Great mechanics, beautiful components and wicked sense of humor.",
    "timestamp": 1466719200
  },
  {
    "username": "wolf9545",
    "rating": 10.0,
    "comment": "Boxed",
    "timestamp": 1458169200
  },
  {
    "username": "lordleachim",
    "rating": 10.0,
    "comment": "great game, lots of fun. i've introduced a few people to the game and at first they kinda think it's dumb or easy, but the second or third time they attempt to kill the good doctor, they really start to enjoy themselves.",
    "timestamp": 1345500000
  },
  {
    "username": "drnlmza",
    "rating": 10.0,
    "comment": "Classic cheapass game. Highly recommended.",
    "timestamp": 1333576800
  },
  {
    "username": "Lohael",
    "rating": 10.0,
    "comment": "Awesome party game! Great for non hardcore gamers",
    "timestamp": 1332712800
  },
  {
    "username": "SuperKlaus",
    "rating": 10.0,
    "comment": "Outstanding. Always want to play and suspect this will never change.",
    "timestamp": 1326150000
  },
  {
    "username": "Phantom",
    "rating": 10.0,
    "comment": "Somehow, having the pieces and everything like a \"traditional\" game makes it even more fun.",
    "timestamp": 1288738800
  }
]