[
  {
    "username": "gimodude",
    "rating": 1.0,
    "comment": "Inventory - Collectible",
    "timestamp": 1637535600
  },
  {
    "username": "Boltana",
    "rating": 1.0,
    "comment": "All day game that fell short for me. After the 90 minute mark the game felt like it overstayed its welcome.",
    "timestamp": 1412719200
  },
  {
    "username": "rabid_schnauzer",
    "rating": 1.0,
    "comment": "Relive the glory that was humainty's ascent out of the late stone age through the bronze age and into the early iron age in just slightly faster than the actual history took.\n\n\nDespite what the entry says, you will not be done in a mere \"360 minutes\". Heck, you will be lucky if a small group of focused, veteran players who are totally focused and disallow all non-game related table talk are even halfway through the game in a mere 6 hours.",
    "timestamp": 1384297200
  },
  {
    "username": "hertin",
    "rating": 1.0,
    "comment": "And on the seventh day God said 'let there be Civilization' and the Euro-game was created. Lo, it was fair to look upon and seductive but God saw that it was bad because it took an eternity to play and victory was so scripted that it was devoid of skill and substance. Weary, He rested for the remainder of the seventh day, intending to return it to the void on the morrow. But verily the Beast escaped and spread its seed across the land and slew The Avalon Hill Game Company. And the world was cursed with Euro-games thereafter.",
    "timestamp": 1273528800
  },
  {
    "username": "MaxSteiner",
    "rating": 1.0,
    "comment": "I hate his one too",
    "timestamp": 1252706400
  },
  {
    "username": "James DeBenedetti",
    "rating": 2.0,
    "comment": "Pretty boring. Felt like a game of Othello being played by random AI (including my own position).",
    "timestamp": 1724450400
  },
  {
    "username": "AKHawkster",
    "rating": 2.0,
    "comment": "Obsoleted by Advanced Civ and now Western Empires.\n\nA great implementation of the original concept, but I'll only play Western Empires now",
    "timestamp": 1619906400
  },
  {
    "username": "dLyonBW",
    "rating": 2.0,
    "comment": "Not the most exciting game I've played. It is very abstract and is a lightweight game, in my opinion. I prefer slightly more complex games.\n\nThis is like all the other civ games I've played. It's full of promise, but dumbed down to a level that makes it no fun to play.",
    "timestamp": 1599688800
  },
  {
    "username": "kfbunny",
    "rating": 2.0,
    "comment": "Loooon, boring, long, not pretty, long, mathematic, long, the deplacement phase never ends because everyone tries to optimize the moves, so it's a bit long. After the second hour of play, I realized really not much had happened, yet the game only started",
    "timestamp": 1581634800
  },
  {
    "username": "jellynut",
    "rating": 2.0,
    "comment": "I bought a copy of this in the late 1990s when I thought I'd like to begin playing proper boardgames as a hobby - I tried to play it ...gave up ...sold it.\nIt took me six years to begin again.",
    "timestamp": 1541718000
  },
  {
    "username": "kyhre",
    "rating": 3.0,
    "comment": "Played once. It’s a fascinating event style game. I’d rather not revisit it.",
    "timestamp": 1718229600
  },
  {
    "username": "RandaPrince",
    "rating": 3.0,
    "comment": "This. Game. Takes. Forever. Seriously. 360 minutes is optimistic. I once had a game of Civilization take -- I AM NOT MAKING THIS UP -- 10 hours.",
    "timestamp": 1687125600
  },
  {
    "username": "James_Briggs",
    "rating": 3.0,
    "comment": "I used to love this game but now hate it.",
    "timestamp": 1625263200
  },
  {
    "username": "CDurfeeTroy21",
    "rating": 3.0,
    "comment": "Civilization is a decent game because it is a world conquering game. You can conquer your enemies through diplomacy and warfare. I rated Civilization lower since the videogame version out does the board game greatly",
    "timestamp": 1612479600
  },
  {
    "username": "Kamaitatchi",
    "rating": 3.0,
    "comment": "So many better options out there by now. I got it due to the excellent reputation but wasn't my jam. Outdated design and I have no nostalgia for it.",
    "timestamp": 1589148000
  },
  {
    "username": "Deathproof",
    "rating": 4.0,
    "comment": "Lainassa",
    "timestamp": 1716328800
  },
  {
    "username": "Entropology",
    "rating": 4.0,
    "comment": "This would be a 2-3 for me if not for the trading disasters. That alone takes it up several notches. Rest of it, pretty meh and god it is slow. I think there is a hybrid of this and Antike that is only 90-120 min that would be divine. As it is, this feels its age. Also, I hate ripping on older games for looking bland, but, well, it's bland.",
    "timestamp": 1693692000
  },
  {
    "username": "Surya",
    "rating": 4.0,
    "comment": "I was pleasantly surprised with the (relative) simplicity of the rules. We where totally ready for a long game, but with explanation and a break to eat, it took over 8 hours, and we didn't play all that short (that's with 3 players, by the way). That was a bit too long for all of us. Through the Ages: A Story of Civilization can be almost as long, but it just feels more dynamic, while Civilization kind of stagnated a bit halfway through. Also, one player got ahead with the number of cities and overall map dominance, and with the high cost of destroying cities, it didn't seem like a good option to start combat, so the 2 other players focused on simply building their own new cities. With success, if not for the horrible event cards.\nIt was those cards that ruined the game for me. In 5 rounds, I got 2 civil wars, a volcano and a flood. And there was nothing I could do. I could see the red cards laying on top, but due to the previous cards, there was no way I could avoid taking cards first, so I could do nothing but simply sit through it and see my empire decimated for ready to build a 7th city to 3 cities and 6 ground forces. Not what I call fun, certainly not in a game this long.\n\nInitial rating: 4",
    "timestamp": 1678834800
  },
  {
    "username": "HiTracey",
    "rating": 4.0,
    "comment": "Very clever design from someone who is clearly a very clever designer. This game builds from relative simplicity to mild complexity in a very satisfying and thought provoking manner. Uncompromisingly long, unless you compromise on the length.\n\nComplexity - 3/10",
    "timestamp": 1675033200
  },
  {
    "username": "OsideP",
    "rating": 4.0,
    "comment": "It must be a genetic flaw I have but I never warmed up to this one. Sadly, much like GMT’s Napoleonic Wars”, the more I played it, the less I liked it. It is unfortunate because I know people who love it but, for whatever reason, I have zero interest in playing it again.",
    "timestamp": 1659650400
  },
  {
    "username": "kimmo_juhani_makinen",
    "rating": 5.0,
    "comment": "A massive (yes MASSIVE) investment in time and dedication is needed from all the participating players and one should not even try it without at least five players. The game design, graphics and components were top notch in it's time (1980) but of course are less so in today's standards. The convoluted turns tend to take pretty long and as there aren't that many chances to interact with other players the game is one of the uncrowned kings of the \"Waiting for Your Turn\" category. But the game is essentially THE game invented the 4X genre of table-top games so every games enthusiast should at least try to take a peek at the origins of the genre. Be prepared ... a game will likely run for 8 hours.",
    "timestamp": 1757196000
  },
  {
    "username": "Maximaler",
    "rating": 5.0,
    "comment": "So in die Länge gezogen",
    "timestamp": 1756936800
  },
  {
    "username": "Ormek",
    "rating": 5.0,
    "comment": "Die Spielanleitung ist ein graus",
    "timestamp": 1748642400
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "Was fun playing 30 minutes at a time (solo) as a kid.\n\nNow I'd rather eat my feet. Yoga FTW!",
    "timestamp": 1741302000
  },
  {
    "username": "DONALD65",
    "rating": 5.0,
    "comment": "Never understood why many view this game as a masterpiece. Have played many times and even received the game as a gift. Never fully understood the appeal. Certainly not a go to game for me.",
    "timestamp": 1736118000
  },
  {
    "username": "Forgeforgeforge",
    "rating": 5.0,
    "comment": "With our player count and map / civ choice it didn't really go, but there is bones in this meat.\n\n\nArguably too long for what it is. The beginning is procedural, the middle you're primarily being buffeted by uneven calamities, and the last several hours half the table knows they've already lost.\n\nThe base mechanic of your population doubling and being forced to expand, of your population chits shifting between your stock and your treasury mirroring the rise and fall of cities, urban vs rural population etc, is all fantastic. The way population moves like amoeba, with porous borders, a chunk of thracians squeezed out into gall will breed like rabbits.\n\nNothing you do on the map matters on its own, its only good for its resource cards. That every single decision you make in this game, must be transmuted through the lens of a successful trade, severely undermines the map stakes. Being forced to trade over and over again and put on your pretty trading face and grin and make nice at people for 8 hours is exhausting. There's a trickle of treasure to spend directly or buy gold, but I wish you could accomplish more on your own. In every game my favorite moment is revealing myself as the evil emperor that the whole table has to try to stop. Though giving more individual agency would create more issues with how powerful going last in move order is.\n\nThe AST track should either be rebalanced on every player count and map, or it should be symmetric between civs. Player balancing can easily dominate any minor imbalances in start. Tech powers are not quite strong enough that an early lead is decisive, but the later differences in AST hurdles are huge.\n\nShips feel a little silly, they should maybe be increasingly more expensive to build a large fleet, so that you're incentivized to keep them around rather than constantly scrapping them to teleport them to where you need them for the meager cost of a coin.\n\nI don't know where to begin on the calamities. They're not balanced for player count. They're not fun dramatic table moments, just misery. They're easily trackable which ruins trading. They arrive somewhat arbitrarily. They should maybe all be secret-backed and the decks shuffled. A late civil war can be game ending where most others can be shrugged off (there should be more civil war mitigation sprinkled into the early civics if it's going to be left as is). I managed to dump a Civil war on someone and it eliminated them from the game. It wasn't an interesting moment, it was just sad as I watched them kick themselves and deflate. I don't know how to fix this.\n\nThe base game is strong, I think it needs less complication and faster play, not more chrome, to fix it.",
    "timestamp": 1733612400
  },
  {
    "username": "Ursus Corvus Lapis",
    "rating": 5.0,
    "comment": "Played before BGG.",
    "timestamp": 1709161200
  },
  {
    "username": "B41939",
    "rating": 5.0,
    "comment": "Okay; the game's been sold. Too often, too many people are trading just to get ahead and ignore the one person who's really ahead of everybody.",
    "timestamp": 1689717600
  },
  {
    "username": "John2310",
    "rating": 5.0,
    "comment": "It's a classic. But for the long play time, there are better games out there I'd prefer to play/",
    "timestamp": 1684620000
  },
  {
    "username": "Flyboy Connor",
    "rating": 5.0,
    "comment": "Too complex for its own good.",
    "timestamp": 1680904800
  },
  {
    "username": "timeodanaos",
    "rating": 6.0,
    "comment": "This has long been one of my favourite games but it's difficult to find half a dozen people who are willing to commit to the 6-8 hours required to play it. The mechanics are simple but lead to critical tradeoffs between money and expansion - knowing when to build and when to sacrifice units is essential. The trading rounds can get quite heated and eat up a lot of time if not limited (I recommend 10 minutes max). The Advanced version makes it so much better.",
    "timestamp": 1756245600
  },
  {
    "username": "Sorp222",
    "rating": 6.0,
    "comment": "Remember playing many times in the early eighties and being bowled over by the game. Purchased on ebay for nostalgia value.",
    "timestamp": 1754085600
  },
  {
    "username": "chrisgledhill",
    "rating": 6.0,
    "comment": "\"Veni, vidi, vendi\"\n\nBut I bought it again... Fond memories of hours played with Stuart, Sarah, Tim and friends in Bearwood.\n\nĜenro: Tipo-specio por la familio de ludoj \"Civilizacio\"\n\n\"What is sold, will buy again\"",
    "timestamp": 1752444000
  },
  {
    "username": "quietcorn",
    "rating": 6.0,
    "comment": "I love how smooth this plays, and how elegant combat works. I love the trading phase which keeps players engaged with each other even from across the table. I hate the length of the game. The game clicks along well enough until you hit this wall in the last 4th of the advancement track, where the requirement to proceed and advance the timer of the game becomes a massive amount of different tech cards. I would adore a more modern sped up version of this same system, but then, hasn't nearly every modern euro civ tried to live up to the promise of this game and fallen short?\n\nI would have kept it, but honestly my tolerance for games of this length are just gone. I cap out at about 6 hours of time in a single game.",
    "timestamp": 1742166000
  },
  {
    "username": "Egamer",
    "rating": 6.0,
    "comment": "Civilización. El juego de las culturas mediterraneas",
    "timestamp": 1737500400
  },
  {
    "username": "Karmasmuggler",
    "rating": 6.0,
    "comment": "I find the disaster cards make the game too swingy. I'd rate it lower, but the base idea for the game is classic",
    "timestamp": 1736031600
  },
  {
    "username": "Tyson2015",
    "rating": 6.0,
    "comment": "Many fine features but overall I simply could not find enough time or players to fully explore this games potential. I could for other far more complex and detailed games so I can only rate this as average. Have attempted many times since first played in mid 1980s and same thing each time.",
    "timestamp": 1734130800
  },
  {
    "username": "syphon",
    "rating": 6.0,
    "comment": "Really needs Advanced Civ. That makes it a much better game.\n\nPartial copy. There is enough in here to actually play, but it's missing a few components.",
    "timestamp": 1720648800
  },
  {
    "username": "eerodek",
    "rating": 6.0,
    "comment": "1981 edition\nBest with 7 players\ngood",
    "timestamp": 1696888800
  },
  {
    "username": "Druivenclub",
    "rating": 5.5,
    "comment": "Hans",
    "timestamp": 1694556000
  },
  {
    "username": "CharlieMnemonic",
    "rating": 7.0,
    "comment": "The one that started it all!",
    "timestamp": 1760652000
  },
  {
    "username": "adamolanna",
    "rating": 7.0,
    "comment": "Fu il primo grande gioco che ho posseduto. Comprato usato a metà degli anni '90, in realtà era in condizioni perfette. Per me già solo leggere le regole e sistemare il tabellone era magnifico... ci ho giocato poche volte per mancanza di giocatori.",
    "timestamp": 1756159200
  },
  {
    "username": "nyhotep",
    "rating": 7.0,
    "comment": "Still the best Civ game.\n\nIf only it didn't take so long.",
    "timestamp": 1748124000
  },
  {
    "username": "Spada_",
    "rating": 7.0,
    "comment": "12+. Strategy. 4-7 players - Best: 7",
    "timestamp": 1747605600
  },
  {
    "username": "krogmonster",
    "rating": 7.0,
    "comment": "Good game, but really needs Advanced Civilization to make it playable.",
    "timestamp": 1743030000
  },
  {
    "username": "louisj2016",
    "rating": 8.0,
    "comment": "Expert++",
    "timestamp": 1760824800
  },
  {
    "username": "Lendengold",
    "rating": 8.0,
    "comment": "Gereon\n(gekauft)",
    "timestamp": 1759356000
  },
  {
    "username": "bburen",
    "rating": 8.0,
    "comment": "A classic",
    "timestamp": 1758146400
  },
  {
    "username": "Nodens",
    "rating": 8.0,
    "comment": "I have played this game for 10+ hours several times without being bored. It's magical.",
    "timestamp": 1756418400
  },
  {
    "username": "Damien_H",
    "rating": 8.0,
    "comment": "Tried it with the simplified rules, with 4 players, we all enjoyed it a lot.\nVery good moments during the trading phase, and a lot of tension with the expansion and conflict phase. Looking forward to play with the complete rules!",
    "timestamp": 1753567200
  },
  {
    "username": "Forta",
    "rating": 9.0,
    "comment": "SO",
    "timestamp": 1757973600
  },
  {
    "username": "mtfunhog",
    "rating": 8.5,
    "comment": "Played a lot of this in high school. Now that I have Western/Eastern Empires this is redundant. A classic!",
    "timestamp": 1753048800
  },
  {
    "username": "WonderCinz",
    "rating": 9.0,
    "comment": "This would be a 8 if it took less than 5 hours rather than the 10 that it does take. I probably still haven't recovered from the 14 hour game we played at my 3-day long bachelor party retreat back in '94. Still had fun with it though.\n\nUpdate - Well, I finally bit the bullet and played Civ again--14 years after the last time. We played with 5 and got the game done in 8.5 hours (including two players who are on the slow side). All of us had fun, and I look forward to playing the game again. I think playing with 5 and using good player aids makes the game playable and fun. Bumped rating back up to 8.\n\nUpdate - 17 years after that last full game, we played it with seven again (there had been a partial game or two in the interim). It was an epic, amazing, 14-hour romp. Rating goes back to 9. There is nothing like this game.",
    "timestamp": 1752357600
  },
  {
    "username": "zeotter",
    "rating": 9.0,
    "comment": "Traded to Noble Knight",
    "timestamp": 1741042800
  },
  {
    "username": "MinistryofPeace",
    "rating": 9.0,
    "comment": "One of the best boardgames ever! The mechanics are smooth and simple. Although it is rather \"serious\" (and prone to optimal strategies, long discussed in The General magazine !), it is one of the few \"hard core\" boardgames i managed to play with my brother and sister ! A few years later, with \"simplified\" disasters and trading phase, it became one of the favorites of my daughters !!!",
    "timestamp": 1738018800
  },
  {
    "username": "HerbertML",
    "rating": 9.7,
    "comment": "Classical game for a long sunday in a group of 6. Newbees can be integrated very easy. although it is a complex game.\n/*#V3*//*stay*/",
    "timestamp": 1759356000
  },
  {
    "username": "theCartoonMrOats",
    "rating": 10.0,
    "comment": "love this game, think it's really cool. can't wait to play it again.",
    "timestamp": 1752962400
  },
  {
    "username": "chatelainsamuel",
    "rating": 10.0,
    "comment": "An epic classic where trade, tech, and negotiation reign. Despite its age, few games match its historical scope and strategic vision.",
    "timestamp": 1750629600
  },
  {
    "username": "nanobastaddo",
    "rating": 10.0,
    "comment": "Classic old. Rules are easier than one can imagine expecially for combat that is not your first goal. For the ones that love giant maps.\nFor sure very long time play, but is obvious when you are playing one of those games which mechanics finished later in the first strategic videogames (introducing the saving possibility)\n\nSt",
    "timestamp": 1747000800
  },
  {
    "username": "AmGenBill",
    "rating": 10.0,
    "comment": "Lots of fun to play.",
    "timestamp": 1735772400
  }
]