[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "It's not bad, and very inviting to get into. The problem is that so many players means turns take forever to resolve. The idea to make counting ahead illegal is a good idea, though if it's just to speed up the game maybe that's pointing at other problems in the design. In practice everyone's too worn out before the end of the FIRST LAP to go on, and it's over there. When the average Mario Kart race course is 3 laps and feels like the perfect length, maybe this game has problems with its pacing.\n\nStill more exciting than Heat, though. Yeah yeah, it runs for 2 laps just fine, but it's just a game of boring optimization.",
    "timestamp": 1731279600
  },
  {
    "username": "ratbulogg",
    "rating": 1.0,
    "comment": "When pitting actually puts you ahead of cars that don't pit, you know your game is broken!",
    "timestamp": 1525212000
  },
  {
    "username": "blockhead",
    "rating": 1.0,
    "comment": "Choose a gear (which one is painfully obvious), roll the dice, move the car. Seriously, a roll and move game.... Try Championship Formula Racing instead. If you can't get a copy of CFR, then Speed Circuit is the forerunner, but CFR is better.",
    "timestamp": 1491343200
  },
  {
    "username": "corkysru",
    "rating": 1.0,
    "comment": "Boring game. And the user Spleen made me rate it this low.",
    "timestamp": 1384815600
  },
  {
    "username": "JohnHBiedenkapp",
    "rating": 1.0,
    "comment": "OK if you're into cooperative race games",
    "timestamp": 1265238000
  },
  {
    "username": "pjotrs",
    "rating": 1.0,
    "comment": "This must be the worst game ever.",
    "timestamp": 1254780000
  },
  {
    "username": "Bathory",
    "rating": 1.0,
    "comment": "4 hours without strategy but only luck.\nIncredibly boring.\nI hate this game.",
    "timestamp": 1097618400
  },
  {
    "username": "thomasdean007",
    "rating": 1.0,
    "comment": "Only slightly preferable to major dental surgery. All strategy in the game is absorbed within the first five minutes of your first playing. But wait, that still leaves hours of waiting to roll one die, rolling one die, waiting to roll one die, rolling one die...AAARGH! Suggestion: fake food poisoning when the game is brought out and run.",
    "timestamp": 1085954400
  },
  {
    "username": "DanKill",
    "rating": 2.0,
    "comment": "Hate it, refuse to play.",
    "timestamp": 1577833200
  },
  {
    "username": "Wolfram",
    "rating": 2.0,
    "comment": "No good car racing game sofar found.",
    "timestamp": 1551222000
  },
  {
    "username": "MULRAH",
    "rating": 2.0,
    "comment": "If I want a racing game, I'd probably prefer Snow Tails, but that's a big \"if.\" You can dress it up with a little resource management and dice selection, but this is still basically a good old roll-and-move dice fest in which I have little interest. There are some counting skills required too. I almost spun out on purpose to exit myself from the game.",
    "timestamp": 1388876400
  },
  {
    "username": "webvira",
    "rating": 2.0,
    "comment": "I don't like this game. Seemed really clunky and more complicated than necessary.",
    "timestamp": 1374184800
  },
  {
    "username": "rocketkiwi",
    "rating": 2.0,
    "comment": "I'm on the highway to Hell. I don't have anything against rolling a die (I love Magical Athlete) but this takes way too long.",
    "timestamp": 1328396400
  },
  {
    "username": "pastabatman",
    "rating": 2.0,
    "comment": "Rating based on one 2+ hour six-player game. I came in 3rd. It was mildly amusing for the first hour, but the slow rate of interesting decisions killed it for me. I'd much rather play Snow Tails.",
    "timestamp": 1327359600
  },
  {
    "username": "dzevin",
    "rating": 2.0,
    "comment": "I don't understand why people who love this game get upset when I rightly compare it to Candy land. Substitute candy canes for gear shifts and the game might actually break some copyright laws.",
    "timestamp": 1325286000
  },
  {
    "username": "chrisbrandt",
    "rating": 2.0,
    "comment": "See comment for Formula D",
    "timestamp": 1321138800
  },
  {
    "username": "Inconmon",
    "rating": 3.0,
    "comment": "Roll to move",
    "timestamp": 1687816800
  },
  {
    "username": "PaulGrogan",
    "rating": 3.0,
    "comment": "Too long, too random",
    "timestamp": 1673132400
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Formula 1",
    "timestamp": 1624485600
  },
  {
    "username": "jgoyes",
    "rating": 2.5,
    "comment": "2016-03-14\n\nInitial Rating: 4.5 (August 2010)\n\nI hate racing games. The only reason I played Formula Dé was because my friends made me  (and I play anything twice).\n\nI know Formula Dé can be a good game with the right crowd. My friends seem to enjoy it a lot, but I find the game to be boring, tedious, way too long for what if offers and full of luck (die rolls seem to determine the winner). I know there are rules for a more strategic game, but I really don’t want to play the game again, so I won’t ever find out about the changes. On the basic level, the decisions are pretty easy and obvious.\n\nWith more than 5 players, the downtime is excessive for me.\n\nThe game´s components are very nice.\n\nBottom line, I won’t ever play this game again, however I know I’m an anomaly as every friend who has played the game has enjoyed it, so it must be a good game, it is just not a game for me.\n\nCurrent Rating: 2.5",
    "timestamp": 1494799200
  },
  {
    "username": "Doomalinator",
    "rating": 3.0,
    "comment": "Not much of a fan of race games and this is the quintessential race game.",
    "timestamp": 1489446000
  },
  {
    "username": "exparrot",
    "rating": 3.0,
    "comment": "This is a nice little game and the gear mechanic is nice, higher gear= bigger dice, however I always find the game goes on far too long and after about 5 turns there is a player or players so far in the lead that the rest of the pack have no way to catch up.\n\nThere is also always one player who isn’t interested in winning the race just crashing into other cars and causing damage.\n\nGiven to university game society (2011).",
    "timestamp": 1475100000
  },
  {
    "username": "kamixx",
    "rating": 3.0,
    "comment": "Random and long. I would prefer Bolide to Formula Dé everyday.",
    "timestamp": 1425855600
  },
  {
    "username": "oceano",
    "rating": 3.0,
    "comment": "Very boring.",
    "timestamp": 1417993200
  },
  {
    "username": "lexen",
    "rating": 4.0,
    "comment": "great racing game, fun for beginners and more advanced players alike.",
    "timestamp": 1749420000
  },
  {
    "username": "enavico",
    "rating": 4.0,
    "comment": "- See: Formula D, but even longer",
    "timestamp": 1741993200
  },
  {
    "username": "heli",
    "rating": 4.0,
    "comment": "https://spotlightongames.com/list/nights/f.html#formula",
    "timestamp": 1737586800
  },
  {
    "username": "Kodeir",
    "rating": 4.0,
    "comment": "A short way of describing this one is as \"A game of goose on steroids\". Basically, it's a themed roll & move game with some additional elements that add complexity.\n\nDespite having a certain degree of control over the dice rolls, the more I've played the game the less I've enjoyed it. Having played other racing games has only made matters worse, as I can't but notice all of its flaws.\n\nIt was one of the very first games I played, and back then I enjoyed it quite a lot, so I guess it's a good game to play with non-gamers who dig the theme. Its sole values as an introductory game are its cool theme, along with the fact that it's a roll and move, something everyone is familiar with.\n\nRating: \nOptimal number of players:\n2~4\n7~10\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "tilouboy",
    "rating": 4.0,
    "comment": "And Formula D.",
    "timestamp": 1681250400
  },
  {
    "username": "OGNOG",
    "rating": 4.2,
    "comment": "OGness undecided. (Rating non-indicative of game quality.)",
    "timestamp": 1649109600
  },
  {
    "username": "FranklinTV",
    "rating": 4.0,
    "comment": "Only a single one lap game with two players - it would seem dice games can be fun, possibly even more with more players and vehicles, although probably limited to racing gamer types, and hits only near the spot to stop making it a suggested game (14/12/08). UPDATE: I have tried to like this game for many years, but, I just do not enjoy it - at all. Rating reduced from 6 to 3 (6/1/12). UPDATE: Gone (3.482, Jan 17) UPDATE: A game with the new edition at Bordercon might have renewed my interest. Play it for the concept of racing and not to win and its good fun (6.293, June 17). UPDATE: Pub Meeple Ranking Engine Dec 2020 (Rating: 3.972).",
    "timestamp": 1615330800
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "pushing luck\n roll and move",
    "timestamp": 1584313200
  },
  {
    "username": "MrFixxiT",
    "rating": 5.0,
    "comment": "No need for this game anymore. Lots of racing games have come out and surpassed it.\nDidn't get to the table too.",
    "timestamp": 1743976800
  },
  {
    "username": "JohnnyDgame",
    "rating": 4.7,
    "comment": "kind old for today, better choises outhtere",
    "timestamp": 1713391200
  },
  {
    "username": "Garlance_",
    "rating": 5.0,
    "comment": "Archivé",
    "timestamp": 1708297200
  },
  {
    "username": "rynelf",
    "rating": 5.0,
    "comment": "--Aug2004-- First play; with a couple youngsters. Probably missed half the rules. More plays needed to form a significant opinion, but early results imply it might be a 6.",
    "timestamp": 1680559200
  },
  {
    "username": "dextermoe",
    "rating": 5.0,
    "comment": "Sell",
    "timestamp": 1677279600
  },
  {
    "username": "Scholle",
    "rating": 5.0,
    "comment": "Lots of counting. Forget track debris, there are slow players counting and recounting. More fun with the right group who pre-count their moves and lots of cars blocking and causing chaos. It's not hard working out the optimal way to play, but how is your dice rolling? There should be a better F1 board game around, surely?",
    "timestamp": 1668034800
  },
  {
    "username": "hollybells",
    "rating": 5.0,
    "comment": "It's an interesting racing game but the lack of a real catch-up mechanism plus player elimination (which is rare, thankfully) makes it feel like there can be races which are just the worst for one player sometimes. I do like the way the corners and gears work though.",
    "timestamp": 1649541600
  },
  {
    "username": "duckworp",
    "rating": 4.5,
    "comment": "It's OK and was once very popular (1990s) but I prefer the simpler Speed Circuit.",
    "timestamp": 1622498400
  },
  {
    "username": "Belisarius88",
    "rating": 5.0,
    "comment": "I've played a few racing games, none have impressed me as much as Formula De! The game is exciting and tense as we raced around those corners, taking chances when appropiate, smacking into each other or spinning out. I won my first despite being behind most of it by being a bit more conservative. I can't wait to try the advanced rules, this game is a winner!\n\nUpdate: Played it two players with the slip streaming rules. Although I would like to play with all the advanced rules for more thematic satisfaction, I'm beginning to think that this is not a serious game, as the skill required to do well is not sufficiently challenging and luck seems to play a mayor role. It is still my favorite of all the racing games I have played, it is certainly the most thematic, and for that it gets my high marks.",
    "timestamp": 1601071200
  },
  {
    "username": "Thies",
    "rating": 5.0,
    "comment": "OK, but not really my thing. Not enough strategy/too much luck for my tastes. Can't hold a candle to Das Motorsportspiel.",
    "timestamp": 1600293600
  },
  {
    "username": "Marky_marc",
    "rating": 5.0,
    "comment": "I like the feel of the game, I actually feel like I'm zooming around the corners and gunning it on the straights.",
    "timestamp": 1591912800
  },
  {
    "username": "Boerni72",
    "rating": 5.0,
    "comment": "Therapy Buy",
    "timestamp": 1591308000
  },
  {
    "username": "jens_hoppe",
    "rating": 5.0,
    "comment": "Brilliant good fun. Some tracks are pretty luck-based, some are less so.",
    "timestamp": 1551049200
  },
  {
    "username": "LesPatatas",
    "rating": 5.0,
    "comment": "2-5 players: 20+ Games",
    "timestamp": 1545951600
  },
  {
    "username": "Rodigee",
    "rating": 5.0,
    "comment": "sell?",
    "timestamp": 1535061600
  },
  {
    "username": "midasiam",
    "rating": 5.0,
    "comment": "Roll and move and yell.",
    "timestamp": 1534370400
  },
  {
    "username": "Deliverator",
    "rating": 6.0,
    "comment": "Is Formula De great? Not really. Is it a good time? For the most part, yes, although races can certainly take awhile if you are doing multiple laps and there's no real good way to catch up easily. The dice are fun and there's a lot of joy in landing the perfect racing line through a chichane but there are other racing games I'd prefer at this point. That said my kids love to table it up from time to time.",
    "timestamp": 1754517600
  },
  {
    "username": "snoozefest",
    "rating": 5.5,
    "comment": "A roll-and-move car racing game with a bazillion expansion tracks.\n\nTracks have variable numbers of lanes and turns. Cars can take hits on their tires, brakes, fuel, engines, or body. There are 6 gears, each associated with a different modified (i.e., not usual distribution) die (d4 --> d30). Players start in 1st gear and can shift up or down 1 gear each turn for free. Each turn requires 1-3 stops; may skip 1 of these and take damage to tires (skipping >1 --> car explodes). Brakes are used to slow down and to downshift quickly, gas to downshift quickly, engines to downshift very quickly. If you take maximum damage in any of these, your car explodes. You can take 1 pitstop (typical 2 or 3 lap race), where tires are replaced.\n\nThere are a lot of extra rules about passing, lane changes, slipstreaming ... and even weather. Lots of complexity, but a LOT of dice: rolloff for pole position; roll every turn for movement; if you end up next to someone, roll to see if anyone takes body damage; if any player is in 5th or 6th and rolls max speed, ALL players in 5th or 6th gear roll to see if they take engine damage; when you pit, roll to see how quickly you come out of the pit. The game is definitely more than just a dicefest -- you need to know how to handle the turns, when to move in and out, when to use up your car, etc. -- but to me it doesn't feel like there's much more! Lots of dice rolling in a game that takes WAY too long to play. I much prefer Formula Dé Mini, which simplified the game considerably (but it's still a dicefest!)",
    "timestamp": 1747951200
  },
  {
    "username": "trawlerman",
    "rating": 6.0,
    "comment": "take it or leave it.",
    "timestamp": 1747346400
  },
  {
    "username": "jandrifix",
    "rating": 6.0,
    "comment": "Both the gears-as-dice and the concept of a set amount of stops needed in each road turn make this game a true racing classic. Counting movement and dice odds can slow down the game quite a bit, though.",
    "timestamp": 1735513200
  },
  {
    "username": "jatang",
    "rating": 6.0,
    "comment": "An excellent race game if people pre-plan their moves. Can bog down if there are a lot of players & they don't plan out their moves. I don't like race games in general.",
    "timestamp": 1735254000
  },
  {
    "username": "Schuk",
    "rating": 6.0,
    "comment": "My favourite roll&move game. Awesome theme !\n\nUpdate: I think everything this game is trying to do, Heat does it better...",
    "timestamp": 1731798000
  },
  {
    "username": "LordBalder",
    "rating": 6.0,
    "comment": "I am really into Formula 1, so this one should be right up my alley. And it is quite fine, but I prefer Heat. Heat has that awesome automa system for bot players that I can play it solo and enjoy the game. Formula De on the other hand can be significantly more complex and I guess it's great with more players (like 6 or more).",
    "timestamp": 1729029600
  },
  {
    "username": "collezionista",
    "rating": 6.0,
    "comment": "50",
    "timestamp": 1728424800
  },
  {
    "username": "James DeBenedetti",
    "rating": 6.0,
    "comment": "Seemed fun, but would be better with combat.",
    "timestamp": 1724450400
  },
  {
    "username": "agoodall",
    "rating": 6.0,
    "comment": "I used to absolutely love this game back in the day. Friends and I had a monthly league game, even getting to the point of using the timed qualifying rules. I just played it recently, though, and it's age is certainly showing. It's far, far too long. A solo game with 10 cars and three took me hours to play (and a face-to-face game wouldn't have been much faster). One lap is about the right time, but it's not very satisfying. I need a different F1 game.",
    "timestamp": 1722808800
  },
  {
    "username": "Mrmago",
    "rating": 6.0,
    "comment": "The single lap game is not so enjoyable, it's much better with 2 or 3 laps!",
    "timestamp": 1698444000
  },
  {
    "username": "PaoloAza",
    "rating": 6.0,
    "comment": "Two boxes",
    "timestamp": 1697580000
  },
  {
    "username": "oBroithe",
    "rating": 6.2,
    "comment": "An outdated racing game that I've had forever, but there are so many better racing games now that don't rely on such harsh RNG.",
    "timestamp": 1695333600
  },
  {
    "username": "tnargmot",
    "rating": 6.0,
    "comment": "Standup shouting fun with large group, too rare an event",
    "timestamp": 1684447200
  },
  {
    "username": "Eric Brosius",
    "rating": 6.0,
    "comment": "Enjoyable, but not my favorite race game, so it hasn't been one I've played very often.",
    "timestamp": 1682546400
  },
  {
    "username": "Robert Osvalds",
    "rating": 6.0,
    "comment": "Fun dice game for a lighter game choice. Not too much heavy strategy here, but worth playing.",
    "timestamp": 1681423200
  },
  {
    "username": "yorinaga_k",
    "rating": 7.0,
    "comment": "Formula 1 y juego de tablero... Gran combinacion. Un juego que me encanta y al que he jugado cientos de carreras. Una carrera es una experiencia emocionante pero si consigues jugar algun campeonato a varias carreras.... hummmm",
    "timestamp": 1754776800
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "I've surveyed a lot of different race games. I have to say that Formula De has done much right. Inevitably every group tweaks the rules (us included). But the core system is vibrant enough to have fun, and resilient enought to stand up to the tweak du jour. I've played more Formula De than any other modern eurogame. I still look forward to more plays, and especially like it as a linked series. I recommend you play teams of 2 cars with up to 5 players. A season of events adds a lot of drama.\n\nI own all of the Descartes expansion tracks for this game. I think to really enjoy this game you need at least 6-8 tracks to compete upon. The variety really extends the enjoyment of the game.\n\nPurge candidate",
    "timestamp": 1754690400
  },
  {
    "username": "JHristomilo",
    "rating": 6.9,
    "comment": "A este juego le han pasado los años por encima. No es que esté mal, pero se ha quedado anticuado en su concepción. No es que el azar domine tanto, al fin y al cabo, puedes modular ese azar. Pero el conjunto es un juego en el que dar dos vueltas al circuito se antoja pesado.\nAl final es demasiado largo.\nCon el mismo concepto, Heat es mucho más dinámico y más corto.",
    "timestamp": 1746914400
  },
  {
    "username": "jdoubleux",
    "rating": 7.0,
    "comment": "A racing game for everyone. Selecting the right gear for the turns is key, but there is still some luck involved. You can block the way for cars behind you, which gives the leader an advantage. When you push your car to the limits, it feels like a real racing game.",
    "timestamp": 1746568800
  },
  {
    "username": "Theryn",
    "rating": 7.0,
    "comment": "Opened. VG condition except plastic insert has some cracks.",
    "timestamp": 1745964000
  },
  {
    "username": "bclayj",
    "rating": 7.0,
    "comment": "Still a great racing game, but it takes forever and is more fun with at least 5-6 players.\n\nThis has been completely replaced by Heat for me - just due to the lower downtime and much faster overall play time, although I still love the look of all the actual F1 tracks",
    "timestamp": 1745445600
  },
  {
    "username": "thierrydms",
    "rating": 7.0,
    "comment": "SPA-III lente 2025 (Piet, Luc, Peter, Franky, ikke). (Francorchamps)",
    "timestamp": 1742511600
  },
  {
    "username": "DomD",
    "rating": 7.3,
    "comment": "Uneven game: some games are great some seem a bit long",
    "timestamp": 1736809200
  },
  {
    "username": "Indy500sr",
    "rating": 8.0,
    "comment": ".compleet\nEAN 3289880002299\nGL8",
    "timestamp": 1758578400
  },
  {
    "username": "rebelhr",
    "rating": 8.0,
    "comment": "Formula Dado - Estoril",
    "timestamp": 1756764000
  },
  {
    "username": "PikaPomelo",
    "rating": 8.0,
    "comment": "The Fantasy Flight edition has nice player boards with a little gear shifter and wear pegs.\n\nI mostly like the look of the initial editions boards since they are a little sillier.\n\nHave not played with the street racing rules.\n\nThe basic F1 rules are pretty fun and the car customization can be quite fun if you play 2 or 3 laps. With 8 or more players there are quite a lot of jams and crashes.",
    "timestamp": 1754085600
  },
  {
    "username": "Slotracer",
    "rating": 8.0,
    "comment": "At first: One of the best Formula One games!\nAfter playing it for four years: don't ever suggest me to play it again!\nThis is all about rolling a dice and get as high a number as possible. No strategy or tactic! Once you miss a corner, you can't catch up unless the guys in front of you mess up too.\n\nI highly recommend Race! Formula 90, Thunder Alley or HEAT instead!",
    "timestamp": 1744754400
  },
  {
    "username": "Duckhunter_NL",
    "rating": 7.6,
    "comment": "Location unknown.",
    "timestamp": 1742166000
  },
  {
    "username": "Vaken",
    "rating": 8.0,
    "comment": "With the additional Spa (+ Zandvoort 2) circuit, of course \n(and half a dozen others)",
    "timestamp": 1735772400
  },
  {
    "username": "pigasuspig",
    "rating": 8.0,
    "comment": "Hartwell\n\nA bit dry and mathy, but I'm a math major, so I love it. It is push-your-luck gaming at its finest. Beautiful components.",
    "timestamp": 1730761200
  },
  {
    "username": "guntherb0",
    "rating": 8.0,
    "comment": "€20",
    "timestamp": 1730156400
  },
  {
    "username": "Rygel",
    "rating": 9.0,
    "comment": "Unique Component - Different sided dice as car gears\n\n\nUnique Mechanic - Each increasingly sided dice represents the increasing gears of your race car. Lower gears have fewer sided dice which equals slower movement of your car. High gears have higher sided dice which equals faster movement. Players can choose their dice/gear but then must move the rolled number of spaces.\n\n\nQuick Thoughts - This is one of the best racing games ever created. It allows for 10 players. The rules are extremely easy and play is simple. Yet it still offers excellent racing strategy. It had full Formula 1 licensing so all the real tracks were represented.\n\n\n\n\nOne of my favorites. Easily my favorite racing game. I am trying to get all the tracks. Better to be played as a full season to truly enjoy. And with as many cars on the track as possible.\n\nGot in 2004",
    "timestamp": 1731279600
  },
  {
    "username": "Hellionus",
    "rating": 8.7,
    "comment": "with Circuits 1 thru 35, Formula D: Dice (2010), Formule Dé Circuit № 9: GRAND PRIX DU CANADA – Circuit Gilles Villeneuve (1994), Formule Dé Circuit № 11: JAPAN GRAND PRIX – Suzuka Circuit (1995), Formule Dé Circuit № 5: GRAND PRIX DE BELGIQUE – Circuit de Spa – Francorchamps (1993)",
    "timestamp": 1726956000
  },
  {
    "username": "mothertruckin",
    "rating": 9.0,
    "comment": "Easy to learn with a great gear mechanic. Cool oversized board.\n\nI could rate this higher but the 3 lap races take a bit too long. The two-lap race with some advanced rules is a happy medium, but three laps feels the best.",
    "timestamp": 1724796000
  },
  {
    "username": "JakubofBohemia34",
    "rating": 9.0,
    "comment": "Excelent formula racing game with innovative mechanics that very neatly represent actual drivers decisions (racing line, gears, agressivness etc) and racing situations (overtaking, pitting blocking others etc). The game overall gives the players very good racing experience. It is very calculated risk heavy and drivers (players) need to think strategicaly about their actions. Overall the randomness of a die is a big part of the play but drivers still can make meaningful decisions. Race can be 1 to 3 laps long with one lap being about 1 hour of playtime for experienced players. There are some nice advanced mechanics for introduction of more realistic gameplay.",
    "timestamp": 1720562400
  },
  {
    "username": "RandaPrince",
    "rating": 8.5,
    "comment": "My husband really likes car-racing games, for some reason. I'll play this one, though I prefer Automobiles (a bag-building car-racing game). Edited to add: I, too, have caught the car racing bug. I like this one a lot more than I used to.",
    "timestamp": 1703890800
  },
  {
    "username": "DinOfBattle2",
    "rating": 9.0,
    "comment": "No longer own this, but this is an absolute blast to play. We loved to create \"campaigns\" where we had two drivers and drove a series of races. We go X amount of VPs for finishing in 1st, 2nd or 3rd in the race. Our last campaign had 8 players.",
    "timestamp": 1668034800
  },
  {
    "username": "ratpfink",
    "rating": 9.0,
    "comment": "Raised my rating a point after some added house rules. Having a 30 second time limit to move and not allowing people to sit and count out spaces seems like it's a must and makes this game really fun and engaging.\n\n2011 Update: Played in a league this past summer. Fantastic, except when I wreck 1/4 of the way in the first lap. We cranked out a time trial and two 3-lap races in under 3 hours. With 7-8 players. This game does not drag at all if people are there to play.\n\nHaving played in both a league, and now several one-off games, I think this game is a 11 when played in a league format and probably a 6 elsewise.",
    "timestamp": 1657317600
  },
  {
    "username": "chris 34",
    "rating": 9.0,
    "comment": "20 ευρω",
    "timestamp": 1647471600
  },
  {
    "username": "OGRussHood",
    "rating": 9.8,
    "comment": "My 2025 Top 250: #152\nMy 2024 Top 250: #143\nMy 2023 Top 250: #141\nMy 2022 Top 250: #177\nMy 2021 Top 250: #163\nMy 2020 Top 250: #163\nMy 2019 Top 200: #172\nMy 2018 Top 100: #98",
    "timestamp": 1758492000
  },
  {
    "username": "vDaniel",
    "rating": 10.0,
    "comment": "Played all the tracks and it's always great fun! But we usually play with two round sheets for the three rounder. More excitement that way ☺️",
    "timestamp": 1755036000
  },
  {
    "username": "I4mSucc3s",
    "rating": 10.0,
    "comment": "My 2 brothers like so much the game that have the game too.",
    "timestamp": 1751752800
  },
  {
    "username": "Marcus the Red",
    "rating": 10.0,
    "comment": "Perfect blend of Push Your Luck and Strategy. Better than Heat, though there is more luck.",
    "timestamp": 1708210800
  },
  {
    "username": "GeeJay7591",
    "rating": 10.0,
    "comment": "2 3 4 *5* (6 7 8 9 10)",
    "timestamp": 1707174000
  },
  {
    "username": "Sky Captain",
    "rating": 10.0,
    "comment": "The favorite boardgame of my Boy Scout Troop",
    "timestamp": 1706223600
  },
  {
    "username": "Hells_Kitchen",
    "rating": 10.0,
    "comment": "Keller",
    "timestamp": 1700780400
  },
  {
    "username": "CorgiRacing",
    "rating": 10.0,
    "comment": "You'll come for the interesting different die for each gear and fun stick shift movement of play (in the 3rd edition) but you'll get hooked by the chance to play multiple tracks and mentally conquer the tracks you watch week-in, week-out in F1. The community makes this game a 10/10 with custom made tracks and fan-made 3D cars. At the very least, it is a dice fest!",
    "timestamp": 1685484000
  }
]