[
  {
    "username": "ultraj1004",
    "rating": 1.0,
    "comment": "There are only two games I've played that I can say I hate. Trumpet is one of them. The other is SORRY!.",
    "timestamp": 1722549600
  },
  {
    "username": "puzzleme",
    "rating": 2.0,
    "comment": "-\n\nThey should have name this game \"Random! Extreme Edition\". This game has so much randomness to it that you will be wasting your time trying to come up with any winning strategy or tactics. Winning or losing this game has little to do with your play. It doesn't even have an element of fun. A total waste of time.\nUpdate 03/23/05: This game just lost the title of \"Random! Extreme Edition\" to Wiz-War.\n\n-",
    "timestamp": 1516748400
  },
  {
    "username": "RaffertyA",
    "rating": 3.0,
    "comment": "Two 6-player games. Simple and fast. Nothing special, just another trump taking game that has added 2 more suits and 3 uber-trump cards with a jump the line and trump rearranging board thrown in.\n\nToo much luck and easily too long. Too many cards are in play with 5 or more players, making luck totally dominant.",
    "timestamp": 1721253600
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "strategically shallow",
    "timestamp": 1572390000
  },
  {
    "username": "akinfantryman",
    "rating": 5.0,
    "comment": "Decent game, suitable for lots of players. I made a custom map with some suggested changes.\nQuite a bit of luck.",
    "timestamp": 1758578400
  },
  {
    "username": "guacamolen",
    "rating": 5.2,
    "comment": "Fun enough as a trick-taking game, but there are others I'd rather play instead of this if given the chance.",
    "timestamp": 1719007200
  },
  {
    "username": "djnesq",
    "rating": 6.0,
    "comment": "This is an early foray into combining trick-taking with a board. The game shows its age. There seems to be a rich-get-richer problem: Those players in or near the lead will be able to change trump more often, which will in turn allow them to take more tricks, putting them further ahead, and so on.",
    "timestamp": 1752962400
  },
  {
    "username": "oldgoat3769967",
    "rating": 6.0,
    "comment": "A great card game with trick taking and trumping mechanisms in the play.",
    "timestamp": 1741042800
  },
  {
    "username": "halohogg",
    "rating": 7.0,
    "comment": "A fam favourite.\n(a long time ago)",
    "timestamp": 1675378800
  },
  {
    "username": "kwalzl",
    "rating": 8.1,
    "comment": "7B",
    "timestamp": 1758664800
  },
  {
    "username": "overcommunikate",
    "rating": 9.0,
    "comment": "Really like this a lot and wish it was still in print!",
    "timestamp": 1700521200
  },
  {
    "username": "gamesgrandpa",
    "rating": 10.0,
    "comment": "[Original comment] With two house rule changes {see: http://www.boardgamegeek.com/filepage/7441}, this is one of the best card/board games I have played. In our group, a 6-year-old and an 8-year-old have won several seven-player games, and the adults enjoy it even more than the kids.\n\n(December 2006) We have played this with as many as 9 players, and it works well, no matter the number. Still one of our favorite games.\n\nMay 2009 -- This continues to be one of my favorite games, although we don't play it as often these days as we used to. There are just too many good games in our collection, and this one simply doesn't get selected very often.\n\nDec 2010 - This is still a favorite game for the family, although we don't play it as often, because we have so many other fun games and limited time to play.\n\nOctober 2011 -- We have played this game for many years, and I think we will enjoy playing it for many more. That is a high compliment for any game. We have begun playing it fairly often again.\n\nNovember 2012 -- After all these years, this is still a family favorite.\n\n2013-November: I suspect we will play this game forever, as we still enjoy it very much.",
    "timestamp": 1384815600
  }
]