[
  {
    "username": "charlie four zero",
    "rating": 1.0,
    "comment": "great concept, awful rules.",
    "timestamp": 1348005600
  },
  {
    "username": "DerTroof",
    "rating": 2.0,
    "comment": "Even the designer admits the rules are a complete mess and an actual hindrance to learning the game. Much of the components and rules are written in a kind of shorthand which the new player must also decipher. Is it worth the effort? Even taking into consideration that I snagged a shrinkwrapped copy off eBay for ten bucks some years ago, after several fruitless hours I must conclude, “No.”",
    "timestamp": 1655848800
  },
  {
    "username": "B_Scheuert",
    "rating": 3.0,
    "comment": "(2 plays) This is not a game, it's more like an experience or a simulation. Not much decisions here and the game pretty much plays itself. The board is boring to look at and slightly ugly, the rules are a mess, dispersed among 2 different rulebooks, one \"historical guide\" and the map, the counters are as exciting to look at as your local phone book, the card are made from thin card stock which will split at the edges at the first time being shuffled.\n\nI've only tried it as a solitaire game (and in fact I don't expect it to be much different when played with more players, as there doesn't seem to be much opportunity for player interaction.) Not recommended.",
    "timestamp": 1224885600
  },
  {
    "username": "bkasten",
    "rating": 4.0,
    "comment": "As a wargamer of the 70s and 80s, I have seen some hilariously poor rule sets from the likes of Gamescience, Excalibur, 3W and Decision and others long and mercifully forgotten...but these take the top prize for the worst \"rules\" I have ever seen. It's almost like a designer spec or outline that skipped over being developed and edited into anything resembling a coherent set of rules.\n\nThe card material is also really odd, and I find it very difficult to handle the cards.\n\nOtherwise, the game generates an interesting and amusing narrative. And despite the lack of rules, It's a coherent design by an always excellent designer. But, it is most certainly NOT (by a long shot) a replacement for SPI/AH Conquistador.",
    "timestamp": 1760306400
  },
  {
    "username": "kazu",
    "rating": 5.0,
    "comment": "つまらないということはないけど、ちょっと好みでない。",
    "timestamp": 1491688800
  },
  {
    "username": "Garfink",
    "rating": 5.0,
    "comment": "No really solitaire friendly, the multiplayer game is not what I call elegant. It doesn't fit with the wargamer crowd nor will it fit well with Eurogamers either. This game is only for those that love the theme and don't mind the old fashion slightly non-friendly rule set.\n\nHaving said all that, if you are one of those that love the Age of Exploration, this is playable.",
    "timestamp": 1308175200
  },
  {
    "username": "ajwargame",
    "rating": 6.0,
    "comment": "Juego divertido sobre la época de las exploraciones y conquista del Nuevo Mundo.\nTe hace sentir en la piel de los Descubridores y Conquistadores con las dificultades que tenían.\nTiene peores críticas de la que merece en la BGG; si bien sus reglas son un poco caóticas, son breves y con dos lecturas se recuerdan bien.\nMuy interesante el escenario inicial de exploración y emocionante a varios jugadores.\nEl Escenario en Solitario es divertido también y es rápido de jugar sin complicaciones. He inventado un método para poder jugar con 2 rivales automáticos.",
    "timestamp": 1751148000
  },
  {
    "username": "PaulGrogan",
    "rating": 6.0,
    "comment": "Very unclear rules, not much player interaction, very random, not really a \"game\", more of a simulation. It would be fun if I could only understand the rules.",
    "timestamp": 1720476000
  },
  {
    "username": "nyhotep",
    "rating": 7.0,
    "comment": "Much better than Conquistador.",
    "timestamp": 1654812000
  },
  {
    "username": "Rauxa",
    "rating": 7.5,
    "comment": "A GOOD game, combining fun and learning...",
    "timestamp": 1669071600
  },
  {
    "username": "GaryP",
    "rating": 9.0,
    "comment": "A true adventure game. There is a lot of dice rolling, as expected, but there are still many meaningful decisions to be made. It plays well solo. Another player or two adds some needed competition and urgency, making the decision to press onward or to claim your findings even more difficult. That said, I can't imagine playing with 5 or 6. The downtime would be horrid unless people played VERY quickly.\n\nEdit: Rating raised after finally playing both a 2P and a 3P game and finding myself immediately wanting to play again both times.",
    "timestamp": 1400450400
  },
  {
    "username": "jazer",
    "rating": 10.0,
    "comment": "Great game. Lots of randomness but that adds to the fun.",
    "timestamp": 1749160800
  }
]