[
  {
    "username": "Sotislosky",
    "rating": 1.0,
    "comment": "burraco ma brutto",
    "timestamp": 1755381600
  },
  {
    "username": "taksw222",
    "rating": 1.0,
    "comment": "I don't like trick tracking, and team game.\nThis game has both one.\nMoreover, I can spoil my teammate. that hurts.",
    "timestamp": 1745272800
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "The scoring is kind of a mess. Score this and that but drop this unless blahblahblah. Why not just simplify it? Oh wait, I guess that's the different games this one is based on, they're either all about shedding or all about capturing! And they work pretty well, much easier to explain. This is a weird hybrid of the two styles that has to be navigated, but doesn't add much. Except extra cards so you can't play it with a default deck!!!",
    "timestamp": 1719439200
  },
  {
    "username": "amazingmrme",
    "rating": 1.0,
    "comment": "Terrible game with nonsense rules.",
    "timestamp": 1666908000
  },
  {
    "username": "cRuEllY",
    "rating": 1.1,
    "comment": "Everything I hate about trick taking games",
    "timestamp": 1606258800
  },
  {
    "username": "KRWoods1",
    "rating": 1.0,
    "comment": "The bane of many a game night...this game made me think I hated trick-taking games and partnership games. Fortunately, I have given others in both genres a try, but I really still dislike Tichu quite a lot.",
    "timestamp": 1596664800
  },
  {
    "username": "rayzg",
    "rating": 1.0,
    "comment": "Feb 2011: Because I was obliged to play Asshole during my lunch break while in high school despite my repeated attempts to introduce my friends to other card games, I can never rate *any* climbing game like Tichu highly.\n\nTichu does add interesting strategic choices in the game, like the four special cards, bombs, and scoring (as opposed to the upsetting and irritating richer-get-richer mechanism of Asshole). However, it's still a climbing game, and all those games categorically get a maximum rating of 2.\n\nBy the way, the art of Tichu is awful.",
    "timestamp": 1553295600
  },
  {
    "username": "DrRacket",
    "rating": 1.0,
    "comment": "This game is a crude mashup of a handful of actual Chinese card games, which require only a regular deck of cards to play. (What versatility!) The despicable thing about this game is that the cards in this game are depictions of racist caricatures and yellowface stereotypes. It seems like the game developers don't realize or don't care how stupid and rude their product design is, from the nonsensical \"Chinese\" writing to the slogan that claims hundreds of millions of Chinese people play this excuse of a game.",
    "timestamp": 1483484400
  },
  {
    "username": "Cyankali",
    "rating": 1.0,
    "comment": "terrible art work, low quality cards and barely a game at all...",
    "timestamp": 1470175200
  },
  {
    "username": "Hadrian",
    "rating": 1.0,
    "comment": "BSW",
    "timestamp": 1439762400
  },
  {
    "username": "Schmusetiger",
    "rating": 1.0,
    "comment": "Just not my cup of tea.",
    "timestamp": 1396735200
  },
  {
    "username": "thed0n100",
    "rating": 1.0,
    "comment": "By far the most over rated game I have ever played. There are some games I don't like, but I can understand their popularity. However, I can't understand the hype behind Tichu. It should be flushed down the toilet with the people who play it.",
    "timestamp": 1392764400
  },
  {
    "username": "Faray",
    "rating": 1.0,
    "comment": "I feel like an outcast because everyone loves this game, but I can't stand it.",
    "timestamp": 1392505200
  },
  {
    "username": "Tom Wright",
    "rating": 1.0,
    "comment": "I'm done with trick taking games. Take spades. You got dealt 7 spades, I got dealt 3. Bidding is the most important aspect of the game then, which is fine, except the game-play is so bad when it's predetermined like that.",
    "timestamp": 1390690800
  },
  {
    "username": "NateStraight",
    "rating": 1.0,
    "comment": "The 1 rating is for the false provenance and actively harmful rule that you can play bombs whenever you like.\n\nI think the essence of the game merits a higher rating, however. See my rating for Zheng Fen on that regard.\n\nI play Zheng Fen [see pagat.com] with the addition of [ONLY] the partnerships, passing, special cards, straight-flush bomb, and bidding aspects of Tichu. No slapjack bombs.\n\nUPDATE: The more I read the Rules forum threads concerning the bomb rules, the more I dislike the Tichu I never learned. Honestly, they break everything that is the game.",
    "timestamp": 1358463600
  },
  {
    "username": "aLe3ouLa_mp",
    "rating": 1.0,
    "comment": "Because i hate it. This game is horrible. After, making this as a java program, i promise to myself that i never will touch tichu in my hands never again.",
    "timestamp": 1358031600
  },
  {
    "username": "Darkmot",
    "rating": 1.0,
    "comment": "I play boardgame to steer away from any game with poker cards. Go. Away!",
    "timestamp": 1231542000
  },
  {
    "username": "Septik",
    "rating": 1.0,
    "comment": "Bomba bomba allepårad gameover",
    "timestamp": 1226185200
  },
  {
    "username": "metelo",
    "rating": 1.0,
    "comment": "I really hate cards game that rip off a standard deck and then add cards to force you to buy it.",
    "timestamp": 1221516000
  },
  {
    "username": "Conrado",
    "rating": 1.0,
    "comment": "I played twice. Never call me to play this game again",
    "timestamp": 1219356000
  },
  {
    "username": "rules_heretic",
    "rating": 1.0,
    "comment": "I still feel nauseous when I think about the fact that I actually played this.",
    "timestamp": 1190325600
  },
  {
    "username": "MamaRat",
    "rating": 1.0,
    "comment": "I love card games, but I HATE this game. The special cards are pictorially meaningless and therefore impossible to keep straight, I never have any idea what they do. The scoring is nonsensical. I look at my hand and have no idea whether it's good or bad or what to do with it. Pure frustration.",
    "timestamp": 1170802800
  },
  {
    "username": "alfonzo54",
    "rating": 2.0,
    "comment": "I played Asshole relentlessly at lunch in high school and was immediately attracted to this, but after a while I discovered that the strategic space is actually quite limited. Many hands pass while you have no synergy with your partner and play only once during the hand. Regardless of whether you win or lose that hand, it is quite boring to do nothing. I generally enjoy doing things when I'm playing games.\n\nAlso, the artwork is racist.",
    "timestamp": 1755813600
  },
  {
    "username": "darkfinale",
    "rating": 2.0,
    "comment": "Tichu Trick taking game for 2 teams.\nCan feel long and draggy after a while.",
    "timestamp": 1744495200
  },
  {
    "username": "Qumpelblase",
    "rating": 2.0,
    "comment": "Uff... wie verpacke ich das diplomatisch. Vielleicht waren wir zu blöd für das Spielkonzept... vielleicht waren wir zu blöd für die Anleitung... vielleicht ist unsere Spielgruppe auch einfach verwöhnt von anderen guten Stichspielen, die uns besser gefallen haben... vielleicht war Tichu aber auch einfach unser langweiligstes Spielerlebnis im Jahr 2023 und hat spontan Krankheiten hervorgerufen.",
    "timestamp": 1692568800
  },
  {
    "username": "qrayx",
    "rating": 2.0,
    "comment": "Rummy with extra steps. Trick-taking is already an interesting enough decision. Complicating it with melds is unnecessary.",
    "timestamp": 1668034800
  },
  {
    "username": "DT76",
    "rating": 1.8,
    "comment": "I despise Tichu.\nDon't tend to like traditional card games most of the time anyway, but there are plenty of decent ones I've found something to appreciate in. This is not one of them.\nTichu is a ladder-style trick-taking game. Nothing wrong so far. It opens with a phase where you pass cards to other players, so you have to think carefully about trying not to break up your sets, but also try not to give your opponents something they might really want. That's ok, but already we're getting into the part of traditional card games I don't like. This is the card-counting, predicting, move-reading, deduction-y part. The part where you have to look at your hand and say \"OK, I see cards A, B, and D, which means the others have C, E, and F, and this means I have to play like so.\" The part where someone else plays a card and you have to deduce \"Ah, he led the Hippo. That must mean he's protecting his crowns.\" This sort of strategy completely escapes me for some reason. I don't think it's bad, but not to my tastes.\n\nBut then it gets worse. Oh, so much worse. Because there are special cards. And each one has a special function, and you have to remember what they do. Ok, so it's some memorization, that's not so bad. But using them correctly is vital. And more than special cards, there are special sequences of cards. These 'bombs' break all the normal rules about what can be played on what and even about when you can play cards. That's right, this 'simple' trick-taking game has instant-speed nukes! So then you have to track not only which of your cards are in your normal runs, but which ones are part of a bomb (and there are multiple possible sequences for those).\nAnd then you try to figure out the scoring, and feel the capillaries in your brain swell. For you see, you want to take tricks, because they're worth points. But only certain cards are worth points. So you can win a ton of tricks, but if the cards in them are worthless, you haven't gained anything. So you want to look out for these cards and collect them. Except during games played indoors and days ending in 'y'. Because what you're really trying to do is exhaust your hand first. Those points you get from the cards? Those are piddly, dirty points; you don't want those. No, the real points are in calling Tichu! (or if you're really gutsy, Grand Tichu). So you want to look at your hand and see if you can win tricks in such a sequence that you can be the first to go out and reap the big point reward.\n\nAnd then, just as I'm about to declare it a hopeless mess, the game goes and commits one more, truly unforgivable sin. Because Tichu is a partnership game, so you have a teammate. Now, you've got to pay attention to what your partner is doing, and try and do things like give them good cards, or pass them the lead, and so forth. But if they make a mistake, you can't do anything about it. And in a game like this, mistakes are all I can make.\nSo that's why I will never again play Tichu. Most games, even if I hate them, I'll play if that's what everyone else wants to do. But with this one, I'm not only sitting here having a miserable experience, I'm actively harming someone else's enjoyment, and that's unconscionable.\n\nI'm at a loss to explain why this particular title got so popular, and why it's maintained that popularity for so long.\n\nPlays: about 2",
    "timestamp": 1587074400
  },
  {
    "username": "Niewodnik",
    "rating": 2.0,
    "comment": "No idea what people see in this game.",
    "timestamp": 1515452400
  },
  {
    "username": "Prinzessin",
    "rating": 2.0,
    "comment": "Kooperatives Stichspiel",
    "timestamp": 1510873200
  },
  {
    "username": "n2NZnXG",
    "rating": 2.0,
    "comment": "This is my most hated game. I will never play it again.",
    "timestamp": 1464904800
  },
  {
    "username": "muzfish4",
    "rating": 2.0,
    "comment": "Long, drawn out and tedious. Reminds me of playing rummy with my semi-senile grandmother.\n\nThat said, I'm not a huge card gamer, but would require serious persuasion to play again.",
    "timestamp": 1440540000
  },
  {
    "username": "heikman",
    "rating": 2.0,
    "comment": "It's probably a good trick-taking game, unfortunately i hate trick-taking games.",
    "timestamp": 1427666400
  },
  {
    "username": "sophiebelle",
    "rating": 2.0,
    "comment": "definitely not my style game",
    "timestamp": 1427238000
  },
  {
    "username": "losthorizons",
    "rating": 2.0,
    "comment": "Only played on iOS so far but that was very useful for clarifying the rules which are basically president with some extra cards. Its OK but hearts/canasta are more my thing.\n\nPlayed some real games and I just do not see the attraction. The set collection seems to random and is not fun. I really do not like the prediction mechanic. I don't like it in bridge or in any other game and I don't like it here.",
    "timestamp": 1422918000
  },
  {
    "username": "Spazzfist",
    "rating": 2.0,
    "comment": "I was fooled into playing this game by being told it was only \"kinda like euchre\". It's euchre! It's just euchre with a Chinese flavouring. I HATE EUCHRE!",
    "timestamp": 1417474800
  },
  {
    "username": "halbower",
    "rating": 2.0,
    "comment": "Quite long for a card game. Not fun for a card game. Thus, it's long and not fun. And it's a card game.",
    "timestamp": 1388962800
  },
  {
    "username": "djc1",
    "rating": 2.0,
    "comment": "The instructions that came with my version of this game were so terrible that I simply could not figure out how to play it. My rating is mostly based on the fact that the rules were so flawed (it must be the translations) that we never had a chance to play it appropriately.",
    "timestamp": 1387234800
  },
  {
    "username": "nefelia",
    "rating": 2.0,
    "comment": "i hate this kind of card games",
    "timestamp": 1363388400
  },
  {
    "username": "The Illustrator",
    "rating": 2.0,
    "comment": "People love this, but it's not my cup of tea.",
    "timestamp": 1358809200
  },
  {
    "username": "davestephens",
    "rating": 2.0,
    "comment": "TICHU\nSome folks play it like championship chess instead of like the piece of crap that it is. I refer to it as \"Toilet Tichu\".",
    "timestamp": 1340143200
  },
  {
    "username": "cymric",
    "rating": 2.0,
    "comment": "Given to me as a gift; unfortunately, upon opening I found it is a weird mix of various trick taking games, poker, and additional complexity of pairing up with another player. All elements on their own I can appreciate to more or lesser extents; combined I draw the line. I'm sure it is a good cardgame, but it's just not my cup of tea. I won't play this game unless forced, and will therefore keep the game unrated.\n\nUpdate Games have a way of working themselves onto the table. Tichu proved no exception. I recall my previous statement about it being a good cardgame: it is in fact boring and unpredictable as hell, deriving more enjoyment from the weird non-regular gameplay than it does from clever tricks and stunts. Control is limited, so is guesstimating what others hold, there is no clear way to inform your partner what you are up to or are capable of, and the rules contain really weird and counter-intuitive things. My girlfriend, who has lots of experience with traditional partnership cardgames, proclaimed this game silly and irritating. ’Nuff said, really, I shan’t be playing again.\n\nOh yeah, before I forget: before writing this comment I searched high and low across the Internets to find out if someone was capable of explaining what is so appealing about this game. Appealing in the sense that it provides an explanation why some people would play it more than 10.000 times. I read reviews, I read strategy guides, I read comments, and did so in multiple languages. Discounting self-referential answers like ‘Because it’s so addictive!’ and general remarks like ‘Because every game is different!’ (well, duh!) none of these sources could provide me with a straightforward answer. The game either gets to you, or it doesn’t. In my case, it doesn’t.",
    "timestamp": 1332543600
  },
  {
    "username": "Ceryon",
    "rating": 1.9,
    "comment": "The game don't like me.",
    "timestamp": 1331679600
  },
  {
    "username": "Big Bad Lex",
    "rating": 2.0,
    "comment": "A card game based on a standard deck with 4 extra 'special' cards. Those wishing to avoid paying £10 for a £1.00 ordinary pack should just adapt the two jokers and bridge score cards.\n\nIt's a card game, like any well established card game, whist, solo, chase the lady etc etc. It's OK but its just a standard card game. I really do question whether it deserves its own BGG slot above and beyond anything else in the Readers Digest compendium of card games.\n\nSecond Play: I can only endorce my previous sentiments and reduce the rating from 5.5 to 4. This is just a twist on a trick taking card game. There is nothing here to make it any different from a standard deck of cards. This does not warrant its own slot on BGG. What is all the fuss about?\n\nYet another unwilling participant in a agme and this experiemce just gets worse. Yes you can play well or badly but you can only work with the cards you are dealt. There are hands that are unsalvagable and as such this is a game controlled 95% by what you are dealt.\n\nRating reduced to 2, I really will object to ever playing this again.",
    "timestamp": 1318888800
  },
  {
    "username": "Smoo",
    "rating": 2.0,
    "comment": "Asshole with partners. Why pay money for this?",
    "timestamp": 1244584800
  },
  {
    "username": "Quizmese",
    "rating": 3.0,
    "comment": "More of the same. At least this game Is old, it's not his fault.",
    "timestamp": 1760220000
  },
  {
    "username": "WillBePlayin",
    "rating": 3.0,
    "comment": "Play 4p Slovenian Tarock instead. My group is really, really high on this game but I just don't see the appeal at all, there are so many better cards game out there. It kinda sucks being the only player who doesn't like it in our group but hey, it happens. For everyone else, this rates between 8/10 to 10/10.\n\nIf you get a bad hand, there seems to be nothing you can really do about it and amazing hands just instantly win. I also don't like how it's always 2vs2 and how the bombs work.",
    "timestamp": 1729202400
  },
  {
    "username": "GiorgosPaok",
    "rating": 3.0,
    "comment": "+ compines poker and trick taking\n\n- I don't like either of those with a teammate\n- There is a lot of player meta\n- Anger inducing",
    "timestamp": 1706914800
  },
  {
    "username": "leonkonsta",
    "rating": 3.0,
    "comment": "δεν κατάλαβα",
    "timestamp": 1697234400
  },
  {
    "username": "Ryan Keane",
    "rating": 3.0,
    "comment": "I don't understand why this game is so popular - it's ok, but it's not really worth spending money on a game that is basically just a traditional card game. And it really has nothing on its progenitor, Big Two, which is a lighter but much more fun game. While I understand Tichu is a ladder game, not trick-taking, if you want partnerships, play Bridge. If you want scoring, play Hearts, where the scoring is intrinsic to the game, as opposed to the pasted-on scoring in Tichu (why do only 5/10/K score - because it's easier to count, although some traditional card games and Dominoes use this scoring as well). And if you want a ladder game, play Big Two. No scoring, but you're always striving to be King of the Hill each game, works at several player counts, and players can drop in and out.",
    "timestamp": 1616540400
  },
  {
    "username": "Born-of-Ashes",
    "rating": 3.0,
    "comment": "Like most team ladder climbing games you need to learn this one with flexible players who won’t bite your head off for making suboptimal plays. That said, once you do gain a little skill the interest bubble pops as there isn’t any wiggle room to actually play within the design because you are beholden to the optimal move.",
    "timestamp": 1606345200
  },
  {
    "username": "thrasymedes",
    "rating": 3.0,
    "comment": "Not my style of game.",
    "timestamp": 1592949600
  },
  {
    "username": "WilcoxDave",
    "rating": 3.0,
    "comment": "Seems like 2/3 of the games are very lopsided. 1/3 of the game are fairly close.",
    "timestamp": 1586988000
  },
  {
    "username": "jmoody",
    "rating": 3.0,
    "comment": "Not sure why I rated this a 5 to start with, since I have been actively avoiding it ever since.",
    "timestamp": 1568325600
  },
  {
    "username": "patricechiniara",
    "rating": 3.0,
    "comment": "Oh what a bad experience. Played it twice, regretted it twice. Feels random and too long.",
    "timestamp": 1522447200
  },
  {
    "username": "Sage Atenza",
    "rating": 3.0,
    "comment": "Don't care for card games",
    "timestamp": 1513292400
  },
  {
    "username": "Trekker02",
    "rating": 3.0,
    "comment": "It's just not a game for me, tbh.",
    "timestamp": 1470434400
  },
  {
    "username": "Dice Driven Gamer",
    "rating": 3.0,
    "comment": "I never liked Tichu and even more I never liked the lifestyle Tichu players, the ones who will look to you as a monster if you say you don't like their game. Not the worst game ever designed, but I quickly got rid of it since I enjoy ther trick taking games more",
    "timestamp": 1466114400
  },
  {
    "username": "Teppolainen",
    "rating": 3.0,
    "comment": "In my book, themeless trick-taking games should be simple, fast, fun and entertaining.",
    "timestamp": 1448838000
  },
  {
    "username": "Apparos Achaparos",
    "rating": 3.0,
    "comment": "Belote for imbeciles.",
    "timestamp": 1432332000
  },
  {
    "username": "saccenti",
    "rating": 3.0,
    "comment": "A traditional card game.",
    "timestamp": 1410732000
  },
  {
    "username": "alexisW",
    "rating": 3.0,
    "comment": "Card game that has some basic strategy in play. Prefer poker.",
    "timestamp": 1402696800
  },
  {
    "username": "sag0016",
    "rating": 3.0,
    "comment": "Wow, I do not get the appeal. This seems like a game that I would play with my older relatives. I do not want to play bridge at a gaming convention, so why would I play this?",
    "timestamp": 1401314400
  },
  {
    "username": "pethulhu",
    "rating": 3.0,
    "comment": "another trick taking game. yawn.",
    "timestamp": 1383433200
  },
  {
    "username": "TangerinePT",
    "rating": 3.0,
    "comment": "Don't understand this one",
    "timestamp": 1357686000
  },
  {
    "username": "SCOBYBryant",
    "rating": 3.0,
    "comment": "Typical deal and draw - all luck. After you play a ton of games of Tichu you figure out the several strategic decisions to make and numerous missteps to avoid in order to better you and your partner's position ... and you also realize none of them mean squat because the outcome of the game always hinges upon one central flaw: if you don't draw anything, you can't do anything. 95% of the time a round/game of Tichu is simply a contest of drawing high cards because without them a player can never have a legitimate shot of going out first, barring god-hands. Get dealt Aces. Get dealt special cards. Get dealt high pairs and long straights. Get dealt bombs. Get lucky, and don't screw up after you've gotten lucky.",
    "timestamp": 1325804400
  },
  {
    "username": "bogas_9",
    "rating": 3.0,
    "comment": "Do odstrzału",
    "timestamp": 1325631600
  },
  {
    "username": "NotThatSalem",
    "rating": 4.0,
    "comment": "I hate people who love Tichu. You know who you are and what you're like.",
    "timestamp": 1749592800
  },
  {
    "username": "GoingTopShelf",
    "rating": 4.0,
    "comment": "This is going to seem like blasphemy, but I don't really like shedding games in general, I prefer trick takers. But a team based shedding game where every player has to have the same level of experience? No thank you. I floundered in my only play and I kinda never want to revisit it again.",
    "timestamp": 1748037600
  },
  {
    "username": "SkyGlad",
    "rating": 4.0,
    "comment": "I generally prefer trick-taking to ladder climbing, and this isn’t a ladder climber I particularly care for even compared to others. More plays might improve this one for me, but after a few it still feels overly random and lucky.",
    "timestamp": 1734908400
  },
  {
    "username": "ShiannLin",
    "rating": 4.0,
    "comment": "2006 Nederlandse Spellenprijs Nominee\n1999 Fairplay À la carte Runner-up\n1998 Meeples Choice Award Nominee\n1992 Fairplay À la carte Runner-up",
    "timestamp": 1733698800
  },
  {
    "username": "Kaffedrake",
    "rating": 4.0,
    "comment": "Takes a combination of climbing game and trick-taking game that already existed, then adds partnerships and special cards in order to sell custom decks. Could very well be no worse than many other climbing games, but being able to play out of turn doesn't feel like a serious rule for a serious game.",
    "timestamp": 1720908000
  },
  {
    "username": "Vorpa",
    "rating": 4.0,
    "comment": "You can play this with a traditional deck of cards. Might be fun.",
    "timestamp": 1705100400
  },
  {
    "username": "rcyo88",
    "rating": 4.0,
    "comment": "Double Date, Game Night.\n\nOne of the best partner card games.\n\n.:Best 4 Only:.",
    "timestamp": 1680213600
  },
  {
    "username": "Andrew96",
    "rating": 4.0,
    "comment": "Családban megvan",
    "timestamp": 1671750000
  },
  {
    "username": "eadred",
    "rating": 4.0,
    "comment": "I like this partnership shedding game, but I find it hard to get it to the table.\n\n3 plays: It has lots of wrinkly rules that are hard to grok. More of a lifestyle game?",
    "timestamp": 1669849200
  },
  {
    "username": "ILoseAtLife",
    "rating": 4.0,
    "comment": "I am quite surprised how much I dislike Tichu. I really do not enjoy it. I enjoy trick-taking games, but I found Tichu's rules and special cards to be very annoying and not intuitive. Also, if players' skills are not similar, it's a rather miserable experience for the lower skilled player(s).",
    "timestamp": 1659736800
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "communal cards\n strategically shallow\n tediously tactical\n\nThis game bombed with me.",
    "timestamp": 1657663200
  },
  {
    "username": "juasri",
    "rating": 4.0,
    "comment": "//(mudanza)",
    "timestamp": 1639090800
  },
  {
    "username": "dgstone",
    "rating": 4.0,
    "comment": "You can play something nearly equivalent with a standard deck of cards including jokers, and I greatly prefer the public-domain version",
    "timestamp": 1632780000
  },
  {
    "username": "loukas753",
    "rating": 4.0,
    "comment": "it is not a boardgame",
    "timestamp": 1630792800
  },
  {
    "username": "Earlybath",
    "rating": 4.0,
    "comment": "Someone explain to me why this is so popular?",
    "timestamp": 1614380400
  },
  {
    "username": "Triple T",
    "rating": 4.0,
    "comment": "Too convoluted for a trick taking game.",
    "timestamp": 1609369200
  },
  {
    "username": "mazzyfred",
    "rating": 4.0,
    "comment": "Honnestly, who needs such a game nowadays.",
    "timestamp": 1607468400
  },
  {
    "username": "ElkeM1",
    "rating": 4.0,
    "comment": "Pretty difficult card game",
    "timestamp": 1603839600
  },
  {
    "username": "PermaFrost88",
    "rating": 4.0,
    "comment": "This game reminds me of Zhao Pengyou. A good partnership game at 4 players.\n\nI wish there was more mechanics to facilitate the partnership. It leaves more to be desired.\n\nThe special cards add some spice, but not enough.",
    "timestamp": 1574895600
  },
  {
    "username": "spectre3988",
    "rating": 4.0,
    "comment": "A traditional game, highly overrated.",
    "timestamp": 1569880800
  },
  {
    "username": "Vysetron",
    "rating": 4.0,
    "comment": "This game just isn't very good, is it?\n\nMost card games have a release valve. Bidding, folding, shooting the moon, something. Tichu doesn't. Tichu just has you play hands according to reasonable heuristics until it mercifully ends.\n\nCompare to Chimera, which introduces great bidding systems and ways to make points on bad hands. It's no contest.",
    "timestamp": 1568239200
  },
  {
    "username": "jens_hoppe",
    "rating": 4.0,
    "comment": "Traditional card games like this are normally not my cup of tea. At all. :-)\n\nBut I must say that for a traditional card game I found Tichu quite enjoyable and I suspect that the special cards and the exotic flair they represent are a big factor in this. It's too long for my tastes, however, and I would prefer it to be playable in an hour or less.\n\nNot a game I will clamor to play, but I suspect that if in the right mood, I might enjoy an occasional game of Tichu.",
    "timestamp": 1551049200
  },
  {
    "username": "ueyinnafesh",
    "rating": 5.0,
    "comment": "무슨 느낌인진 알겠다. 왜 중독성이 있는지도. 다만, 굳이 빠지고 싶지 않다.",
    "timestamp": 1752789600
  },
  {
    "username": "Whas",
    "rating": 5.0,
    "comment": "just play skat",
    "timestamp": 1752444000
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A card shedding game that mimics Vietnamese big 2 but with 4 bonus cards, bidding (after the 8th card and before you play your first card), and exchanging a card to all players before the tricks are played.",
    "timestamp": 1742338800
  },
  {
    "username": "Arthona",
    "rating": 5.0,
    "comment": "Oroora version",
    "timestamp": 1736290800
  },
  {
    "username": "icheyne",
    "rating": 5.0,
    "comment": "Lots of strategy, but too many rules wrinkles. I prefer my games more regular and with smoother learning curves.",
    "timestamp": 1736031600
  },
  {
    "username": "Bal_505",
    "rating": 5.0,
    "comment": "I like it fine, but the scoring is a little fussy",
    "timestamp": 1735945200
  },
  {
    "username": "rhamsterren",
    "rating": 5.0,
    "comment": "A trick taking game with four cards with special abilities. Tricks are ade os certain poker sets. You have to follow in the set with a higher value or pass. When all players have passed, the trick is ended.\n\nNot all cards will score points. Some tricks you can pass on.",
    "timestamp": 1735772400
  },
  {
    "username": "adamscott",
    "rating": 5.0,
    "comment": "Feels very similar to the Janitor card game I played a lot as a kid, but this has more strategy. More convoluted as well.",
    "timestamp": 1719093600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 5.0,
    "comment": "I will play. But it doesn't pull me in.",
    "timestamp": 1717365600
  },
  {
    "username": "RConsonni",
    "rating": 5.0,
    "comment": "Very fidgety rules, many exceptions, maybe if you play 100 times... I don't want to play this 100 times.",
    "timestamp": 1715983200
  },
  {
    "username": "data00",
    "rating": 5.0,
    "comment": "────────────────────────────────────────────────────\n저는 아직도 무슨 재미인지 모르겠는데 이 게임은 당연하다는 듯 아무렇지 않게 강요하는 사람들이 너무 많습니다.\n2 대 2 팀전이라는 게 독특하다시는 분들도 계시던데, 플레잉카드로 하는 게임 중에는 2 대 2 게임이 많습니다.",
    "timestamp": 1708988400
  },
  {
    "username": "Ellogeyen",
    "rating": 5.0,
    "comment": "5-20 plays (2017)",
    "timestamp": 1696802400
  },
  {
    "username": "Swimmaster",
    "rating": 5.0,
    "comment": "Fun evergreen with the right people, an argument in a box with others.",
    "timestamp": 1696629600
  },
  {
    "username": "PotatoKing_",
    "rating": 5.0,
    "comment": "티츄고?",
    "timestamp": 1694556000
  },
  {
    "username": "Sportomax",
    "rating": 5.0,
    "comment": "Ladder Climbing",
    "timestamp": 1681855200
  },
  {
    "username": "authentic",
    "rating": 5.0,
    "comment": "A clever Swiss partner card game. The strategy is murky and since it's not as well known as Euchre or Hearts, you will be needing to learn it and trying to plunge into that depth.",
    "timestamp": 1679526000
  },
  {
    "username": "dukane",
    "rating": 5.0,
    "comment": "I'm not a huge fan of trick taking games, and have even less experience with shedding games, and this didn't do much to change my opinion. Better than Frank's Zoo, not as good as Scout (which I do love).\n\nControlling the hand seems hugely important and you can just be dealt terrible or great hands.\n\nI know they average out over many hands, but that never makes me feel better.\n\nAlso, I'm just terrible at them.",
    "timestamp": 1679266800
  },
  {
    "username": "jodokast4",
    "rating": 5.0,
    "comment": "This is a fun game, especially if you have a group that is used to trick-taking card games such as Rook or Spades. Definitely worth picking up.",
    "timestamp": 1677538800
  },
  {
    "username": "TraderJack",
    "rating": 5.0,
    "comment": "Replacement",
    "timestamp": 1674514800
  },
  {
    "username": "Blacksad",
    "rating": 5.0,
    "comment": "Primera partida (5/10)\nTichu es un juego de cartas que tranquilamente podría ser un juego clásico de baraja española o francesa.\n\nEl objetivo es ser el primero en deshacerte de tu mano y obtener los máximos puntos mediante bazas ganadoras en los diferentes lances de juego.\n\nSe juega por parejas. Llevar la iniciativa de la partida, gestionar bien las 4 cartas especiales (bueno tres, ya que una designa al jugador inicial), saber cuándo y cómo debemos bajar combinaciones, hacen de Tichu un juego simple en el planteamiento pero de alta difícultad en el dominio.\n\nDe dificultosa explicación, solo jugando un par de rondas, en plan tutorial, se nota el sentir del funcionamiento del juego. Como conclusión decir que, como el mus o dominó, hay que jugar mucho para concluir si se le odia o se le venera, sin términos medios.",
    "timestamp": 1670886000
  },
  {
    "username": "Victoria_hermit",
    "rating": 5.0,
    "comment": "Chinese bridge/trick taking.",
    "timestamp": 1667689200
  },
  {
    "username": "fake",
    "rating": 5.0,
    "comment": "n",
    "timestamp": 1662933600
  },
  {
    "username": "matthulgan",
    "rating": 5.0,
    "comment": "I generally hate partnership games. I don't mind loosing all by myself but making someone else loose causes me to have a lot of anxiety and stress. That being said, I feel like one day the scales will fall from my eyes and I'll get what all the fuss is about. My game group plays it and loves it. I currently loathe it.",
    "timestamp": 1653948000
  },
  {
    "username": "shamizzu",
    "rating": 5.0,
    "comment": "I want to stop now. Tichu...",
    "timestamp": 1653343200
  },
  {
    "username": "Quadenstein",
    "rating": 5.0,
    "comment": "Funny game. My wife and I never win this game against our adult kids.",
    "timestamp": 1650060000
  },
  {
    "username": "Nactra",
    "rating": 5.0,
    "comment": "For that specific player count i would rather have a Riichi session, but sure, why not",
    "timestamp": 1636844400
  },
  {
    "username": "zautman",
    "rating": 5.0,
    "comment": "The points in the trick game seem arbitrary. I don’t enjoy this one.",
    "timestamp": 1634940000
  },
  {
    "username": "mactvdp",
    "rating": 5.0,
    "comment": "een extra",
    "timestamp": 1632348000
  },
  {
    "username": "Shampoo4you",
    "rating": 5.0,
    "comment": "Decent late night game if you have exactly four people. Far random than people like to let on, though.",
    "timestamp": 1632002400
  },
  {
    "username": "pedrofreitas",
    "rating": 5.0,
    "comment": "P",
    "timestamp": 1631916000
  },
  {
    "username": "Sternenfahrer-MUC",
    "rating": 5.0,
    "comment": "Metalldose",
    "timestamp": 1629410400
  },
  {
    "username": "sfoozy",
    "rating": 5.0,
    "comment": "BGA",
    "timestamp": 1628287200
  },
  {
    "username": "Dracilic",
    "rating": 5.0,
    "comment": "Decent trick taking games. There are just a lot of trick taking games and I prefer other ones.",
    "timestamp": 1624744800
  },
  {
    "username": "Pandorzecza",
    "rating": 5.0,
    "comment": "Taka karcianka - w ogóle mi się nie podoba",
    "timestamp": 1620511200
  },
  {
    "username": "raptorrent",
    "rating": 5.0,
    "comment": "Nem semmi ez a játék. Nem állt össze, de olyan kombinációkat és stratégiákat lehet benne véghezvinni, hogy csak na....DE ehhez kell játszani vagy 20 partit meglátásom szerint. Sokat gondolkodtam mit hogy lehet csinálni benne, ez is mutatja a játék erényeit. Hátránya ugye a fix 4 fő, meg, tapasztal-kezdő nem jó kombó, de ezt kiküszöböltük, hogy full kezdő volt mindenki.  Még kell játszani, hogy értékeljem komolyabban.",
    "timestamp": 1618178400
  },
  {
    "username": "baddice",
    "rating": 5.0,
    "comment": "Bought to take on a family holiday, played a couple of games, no one has wanted to play it since.",
    "timestamp": 1607727600
  },
  {
    "username": "galchri",
    "rating": 5.0,
    "comment": "This is probably better than the rating, but I just don't get trick taking games",
    "timestamp": 1606345200
  },
  {
    "username": "ajie426",
    "rating": 5.0,
    "comment": "斗地主和拖拉机的结合，有些规则还怪怪的，和约定俗成的扑克规则不一样，比如出了龙牌还能自己把自己炸了，真奇葩\n我觉得还不如单纯的玩那两个游戏",
    "timestamp": 1595282400
  },
  {
    "username": "Ange_Berlin",
    "rating": 5.0,
    "comment": "I know that it's not the game's fault, but everyone I've played it with was just so serious about it that it tells unwelcome for new, unseasoned players",
    "timestamp": 1579388400
  },
  {
    "username": "brentont",
    "rating": 5.0,
    "comment": "I nocked this down a point since I played Gang of Four which I would prefer to play. Also Diamonds had something to do with it too\n\nedit: and ladder 29",
    "timestamp": 1567288800
  },
  {
    "username": "candoo",
    "rating": 5.0,
    "comment": "Not sure what all the rave is about. A regular deck of cards playing Cho Dai Di (\"Big Two\") is just as good.",
    "timestamp": 1565042400
  },
  {
    "username": "Unitoch",
    "rating": 5.0,
    "comment": "After avoiding this for many years, I finally took the time to play it, and confirmed my suspicion that it really is just another card game. The gimmick here is in the climbing mechanism, similar to Presidents and Assholes. Take that mechanic, add the bidding aspect from trick-taking games. I play games to play interesting games, not riffs on public domain card games.",
    "timestamp": 1554156000
  },
  {
    "username": "DeePee",
    "rating": 5.0,
    "comment": "One game. Can't say I hated it, but I guess it's one of those games you'd have to play a lot more to understand and really enjoy.",
    "timestamp": 1551135600
  },
  {
    "username": "chaddyboy_2000",
    "rating": 5.0,
    "comment": "Wasn't expecting to like it a whole bunch, but thought it was pretty good. That's saying quite a bit since I'm usually not a big fan of card or partnership games!\n\nAs with many trick-taking games, a lot is going to depend on whether you're able to get some good hands to play with, but it's always challenging when to risk calling Tichu and how to best play the hand you're dealt.\n\nThe partnership aspect is always a bit tricky, as you really have to get to know your partner's tendencies. Not being in synch on a hand can really blow things up in a bad way!\n\nThe more I play this, the more the game seems highly dependent on simply being dealt a good hand, so it's fallen out of favor for me.",
    "timestamp": 1544569200
  },
  {
    "username": "happyjosiah",
    "rating": 6.0,
    "comment": "Only one play, so it's possible I just haven't seen the light yet. It's awfully long for how much is going on here. You make the decision about whether to call tichu or not and that is the primary source of points. However, this is an all or nothing decision. Compared to something like Bridge or 500 Euchre, this seems simplistic. Then, you have to play out the hand. The decisions now revolve around whether or not to split up groups of cards and in what way. It feels a bit like Rummikub or something. My more favorite card games generally revolve around deciding whether to top what is on the table already, which is much more interesting to me. Granted, there is a bit of this, but I spent more time shuffling cards around in my hand and seeing what my options were. It's not bad, and I'd like to play again, but I don't see this unseating the true trick-taking games as my card games of choice.\n\nUPDATE: I still think this is a bit too long for what it is. Yet I also think that there is some intention to that design choice. Certainly you could make it shorter by just playing to fewer points, but the issue then becomes that the variance is overriding. Which is honestly still a concern either way. Just played a game where the team that won got three bombs to the other team's none. Was this a deciding factor? Hard to say for sure. There are a lot of decisions to make, more than it might seem at first glance, and some subtleties to learn. I think people like that the \"cards don't play you\" as much as some comparable games. Still though, \"bad hands\" are a very real thing.",
    "timestamp": 1759442400
  },
  {
    "username": "destro",
    "rating": 6.0,
    "comment": "Ph",
    "timestamp": 1757800800
  },
  {
    "username": "Spidermau",
    "rating": 6.0,
    "comment": "40\n4 players",
    "timestamp": 1754949600
  },
  {
    "username": "PikaPomelo",
    "rating": 6.0,
    "comment": "Too many rules to teach to new players.\n\nThe special cards are quite fun: High card, wild, pass the lead to partner, first player. That's really the game's highlight.\n\nBombs seem quite rare, but are fun when they happen.\n\nAll the mechanics (points scoring, bid to go out first, bonus for first and second, special cards, passing cards) are all focusing this game on the team aspect. I think I just like team games OK. :shrug:\n\nI really don't like the standard edition art. Would much rather play with a deck of normal suited cards and 4 nicely illustrated special cards.\n\nI get why the point scoring and the bidding that you go out first are both needed, but it just sort of feels like too much when first learning.",
    "timestamp": 1754085600
  },
  {
    "username": "airguitarbandit",
    "rating": 6.0,
    "comment": "I didn't get my head around the hands but want to try again.",
    "timestamp": 1745618400
  },
  {
    "username": "ciceroni",
    "rating": 6.0,
    "comment": "Wonderful card game that rewards a lot of plays. I have just played it too many times in my childhood to get excited about it any more.",
    "timestamp": 1744149600
  },
  {
    "username": "secax",
    "rating": 6.0,
    "comment": "enfundado mayday premium",
    "timestamp": 1741042800
  },
  {
    "username": "capnwaffer",
    "rating": 6.0,
    "comment": "A fine ladder climbing/trick taking game. The ladder is based on initial cards played, which makes it feel more trick taking.",
    "timestamp": 1734130800
  },
  {
    "username": "imaginaryforce",
    "rating": 6.0,
    "comment": "Interesting card game for sure. Will need more plays to determine how much of the game is luck of the draw based and how much is actual decision-making.",
    "timestamp": 1734044400
  },
  {
    "username": "FranklinTV",
    "rating": 5.7,
    "comment": "So I bought a Chinese card game in Australia to find the instructions are only in German - yet to be seriously played (10/1/10). UPDATE: It would be unlikely I would play this in the flesh (cannot see how I might find three other interested people), but playing this on the iPad / iPhone has shown me what a great card game it is. Rating (7) is not higher purely is because I have not actual confirmed if the real world is as good as the electronic! (21/5/12). UPDATE: I'm resigned to the fact I will never play this in real world (15/9/12). UPDATE Still kept for some reason (Rating 6.684 Jan 17) UPDATE: Essentially a 4 player partnership game played with a standard deck of cards plus 4 special cards. To be honest, I have only played it on an App, as the chances of getting people to play this in my group seems low, but I live in hope, as it’s a fun game once you get your head around it. (Oct 2022). UPDATE: The Great Xmas 2024 Cull. I will clearly never play the physical version, so gone (Rating 5.684, Dec 2024)",
    "timestamp": 1733439600
  },
  {
    "username": "realityfoible",
    "rating": 6.0,
    "comment": "I haven't gotten to a place where I understand the underlying strategy. I just can't get past feeling like the game is dictated more by the cards you're dealt than how you play!\n...and then I loose every single match back to back.\n\nThis is going to take me time to wrap my head around.",
    "timestamp": 1726610400
  },
  {
    "username": "Klausi300",
    "rating": 6.0,
    "comment": "6",
    "timestamp": 1724709600
  },
  {
    "username": "shaveandahaircut",
    "rating": 6.0,
    "comment": "[3 plays] Convoluted rules with many exceptions is slightly off-putting at first (and I come from a card playing family background), but this seems to be a very fun game once you start to catch onto the strategies. I can see my rating possibly rising if I should get the chance to play on a semi-regular basis.\n\nMost recent plays 3-10-06 with James, Berna, and Alex.",
    "timestamp": 1722549600
  },
  {
    "username": "HardCore",
    "rating": 6.0,
    "comment": "It is very much like Asshole/President, but with four special cards.",
    "timestamp": 1721685600
  },
  {
    "username": "xionc",
    "rating": 6.0,
    "comment": "Quite nice, simple card game, a bit similar to Great Dalmuti",
    "timestamp": 1719612000
  },
  {
    "username": "kastel",
    "rating": 6.0,
    "comment": "Dj",
    "timestamp": 1717797600
  },
  {
    "username": "mixmixmix",
    "rating": 6.0,
    "comment": "Worth learning if a group of 4 is willing to play a dozen games. Until then, this game is weak at best. Then again, I usually dislike simple card games, I like this hobby for the artwork & components!",
    "timestamp": 1716933600
  },
  {
    "username": "tibbles",
    "rating": 6.3,
    "comment": "A partnered trick taking game. I appreciate that unlike say Bridge you don't need to learn a complex series of bidding signals, but I'd probably still take Spades over this.\n\nWhile I appreciated the form system where you can create all sorts of hands deliberately harder to follow, it kind of made me sad that it was a trick taking game where you rarely get to play a card in a trick as no one can match.",
    "timestamp": 1716933600
  },
  {
    "username": "anim8r",
    "rating": 6.0,
    "comment": "Glad to have finally tried it. I could identify ideas here that have evolved & found their way into more modern games like Scout & numerous trick-taking games coming out every day! Happy to have played, but I prefer the more streamlined and modern-looking trick-takers!\n\nMore, on my ⟣⧗First Pass⧗⟢ Blog:\nhttps://boardgamegeek.com/blogpost/159767/new-to-me-in-march...",
    "timestamp": 1712008800
  },
  {
    "username": "Stas",
    "rating": 6.0,
    "comment": "Last played : May 2008",
    "timestamp": 1710630000
  },
  {
    "username": "Urbanwatts",
    "rating": 6.0,
    "comment": "I wish I had more time for games like these but has it is, 1h+ for a card game isn't manageable.",
    "timestamp": 1702249200
  },
  {
    "username": "iNano78",
    "rating": 6.0,
    "comment": "Home-made by modifying some jokers to represent Mahjong, Dog, Pheonix and Dragon.",
    "timestamp": 1697580000
  },
  {
    "username": "cdevos",
    "rating": 6.0,
    "comment": "Filosofia FR edition 2014",
    "timestamp": 1693346400
  },
  {
    "username": "Lecaro",
    "rating": 6.0,
    "comment": "Ein Stichspiel, aber nicht unbedingt MEIN Stichspiel .\nEs funktioniert zwingend nur mit vier Spielern.\n\nIn jeder Runde werden alle Karten unter allen Spielern ausgeteilt. Die Spieler, die sich gegenüber sitzen, spielen in einem Team zusammen. Bevor die erste Karte ausgespielt wird, geben alle Spieler je eine Karte nach links, eine nach rechts und eine zum Partner gegenüber. Ebenfalls bevor ein Spieler die erste Karte ausspielt, darf dieser einen \"Tichu\" aussprechen, was bedeutet, dass er als erster alle seine Handkarten loswerden möchte. Schafft er dies, gibt es 100 Bonuspunkte fürs Team. Wenn auch nur ein anderer zuerst Schluss macht, werden 100 Punkte abgezogen!\nAnders als bei anderen Kartenspielen werden hier Kartensets ausgespielt. Paare, Drillinge und Vierlinge, aber auch Straßen sind gültige Auslagen. Um diese zu stechen, muss die gleiche Art in einer höheren Wertung ausgespielt werden.\nPunkte gibt es für 10er und Könige, sowie für die Sonderkarten Phönix und Drache in den eigenen Stichen. Apropos Sonderkarten. Davon gibt es drei Stück. Der 'Phönix' nimmt eine beliebige Karte in einer Auslage an, ist aber 25 Minuspunkte wert. Der 'Drache' hat als Einzelkarte die höchste Wertigkeit und schlägt alles, abgesehen von einem Vierling, der gesondert ausgespielt wiederum alles schlagen kann. Er ist 25 Pluspunkte wert und wandert grundsätzlich auf den gegnerischen Stichpunktestapel. Die dritte Sonderkarte ist der 'Hund', der als erste und einzelne Karte ausgespielt werden muss und das Ausspielrecht an den Teampartner übergibt.\nGespielt wird, bis ein Team eine bestimmte Punktesumme erreicht oder überschreitet. Dieses Team gewinnt.\n\n\"Tichu\" ist ein gut designtes Stichspiel, hat aber eine ganze Menge Sonderregeln, die es erstmal zu lernen gilt. Sind die Regeln verstanden, welche Auslage erlaubt ist, geht es darum, die Mitspieler, aber vor allem die eigene Kartenhand einzuschätzen. Das klappt nach einigen Partien sicher besser und besser, aber dafür kann mir \"Tichu\" nicht genügend Spaß bereiten.\nDanke für die Regelerklärung und die spannende Partie. Ich bin beim nächsten Mal sicher wieder mit dabei, brauche dann aber erneut eine Regelerklärung",
    "timestamp": 1690236000
  },
  {
    "username": "timinycricket",
    "rating": 6.0,
    "comment": "Players: -; Best: -\nTime: -m; Difficulty:\nCategory:",
    "timestamp": 1685829600
  },
  {
    "username": "Cous09",
    "rating": 6.0,
    "comment": "Fine, but long and a bit hard to teach.",
    "timestamp": 1678316400
  },
  {
    "username": "Ranior",
    "rating": 6.0,
    "comment": "I enjoyed my play of this, and think it's reasonably good. It seems like there is quite a bit of depth that could be discussed and analyzed, but it's a bit tricky to grasp anything without playing quite a bit.\n\nIf I ever were to get a committed group that would play dozens of times and level up somewhat equally, perhaps this would really shine and I would give it a high rating.\n\nAs is, I think I'd rather just play Scout or Sheepshead for climbing games, or parternship trick takers.\n\nTichu feels like a classic card game in that there is sill in the aggregate, but many individual hands just come down to who got better cards. That's mostly fine by me, as the skill comes in maximizing good hands and minimizing losses in bad ones, but Tichu is a bit tough in that regard since you also are trying to make things happen with a partner that you can't much communicate with.\n\nThe other kind of issue is that this leads to some rounds where one team will just win and the other team can't do a ton...yes you play fast enough and move on to the next hand, but the instance of these seems perhaps a bit too high for my taste vs the more interesting kind of close rounds where skill is determining which team gets the win.\n\nFinally, from what I've read and my instincts, while climbing and learning the Tichu mountain it would seem like there is plenty to learn, it sounds like once you get to a certain point you can quibble over finer points, but it mostly comes down to not making dumb plays/mistakes and getting good cards.",
    "timestamp": 1678230000
  },
  {
    "username": "danchi",
    "rating": 6.0,
    "comment": "There are much more trick-taking game on the market these days, than never before. Some of them are more thematic, some are more complex, some are much more easier. Pick you favorite - one or two. Tichu is classic. Ok classic, but you don't feel theme in here. And it's not easy as well for newbie. It's dedicated for veteran players and players who like old original classis games - nothing fancy, nothing \"not boring\". It's OK, don't get me wrong, but there is competition out there and it's strong, and better. Fall from 8 to 6 for me, after playing several new reimplementations of this trick-taking game.",
    "timestamp": 1676934000
  },
  {
    "username": "rainyl",
    "rating": 6.1,
    "comment": "玩法大概9成以上和扑克游戏「5-10-K」相同。不过「5-10-K」本身好像不算太流行，大致理解成用「争上游」的牌型和打牌流程来「吃墩」，最后用「升级」的计分方式算分的一种打法。\n然后，tichu里还掺杂了一点「斗地主」的牌型和叫牌，以及「升级」中的对家组队的玩法。可以说是一个扑克玩法大缝合怪了。\n但缝得还不错，4张特殊牌的能力设计也很有趣。策略性比大部分「升级」及其衍生玩法都强。不过好像也没必要为了这强出一点点的策略性而单独备一套游戏。扑克本身就已经足够好了。\n\nPS：我猜设计师是在中国玩过「5-10-K」，并以之作为基础设计了Tichu并将其带到欧洲。但尴尬的是，可能是语言障碍的问题，他使用了另一种扑克玩法来命名新的这款游戏。",
    "timestamp": 1676415600
  },
  {
    "username": "Seschet",
    "rating": 6.0,
    "comment": "It's a fine team-based card game.",
    "timestamp": 1675465200
  },
  {
    "username": "isR34L",
    "rating": 6.0,
    "comment": "Still trying to find a group willing to play this.",
    "timestamp": 1674946800
  },
  {
    "username": "okram",
    "rating": 6.0,
    "comment": "Rating based on 5 online plays. The first couple of games were not that exciting, but that might have been because I was still trying to learn the ropes (and because I'm usually not a fan of trick-taking games). Since then I've started to see glimpses of why this one has become a classic of the industry.",
    "timestamp": 1673996400
  },
  {
    "username": "AndySzy",
    "rating": 6.0,
    "comment": "Sort of a rough teach. I get ladder climbing games, but then this has some interesting scoring and unique cards with special rules. I didn't hate it, but it really feels like a game you definitely need to play more than once and with people who know how to play.",
    "timestamp": 1673910000
  },
  {
    "username": "stumpf",
    "rating": 6.0,
    "comment": "I don't enjoy poker like games (too much bluff and fixed partnership - if you play badly, your partner is in trouble). I'd rather play Mü or Last Panther (bundled rule in the 'Mü and more' box).",
    "timestamp": 1671836400
  },
  {
    "username": "Crocosniff",
    "rating": 6.0,
    "comment": "The team play aspect of this game is pretty cool, and I like how this plays out for the most part. I guess I find the bonus cards (Dragon, Phoenix, Hound, Mah Jongg) a bit too extraneous for what the game is trying to deliver. I also feel like I don't need to know the life story and sense of Chinese mysticism the rulebook writer feels about this game when I'm just trying to look up a rule in the rulebook. It's just annoying and confusing. Otherwise, it is fun if you're not playing with players who don't call Tichu all the time and lose.",
    "timestamp": 1671145200
  },
  {
    "username": "RomanRoadie",
    "rating": 6.0,
    "comment": "App version only",
    "timestamp": 1668553200
  },
  {
    "username": "GarfieldKlon",
    "rating": 6.0,
    "comment": "#9\n\nIt's funny, but I wouldn't play it very often. It's based too much on luck and it can last for 2 hours!",
    "timestamp": 1668466800
  },
  {
    "username": "Santosolkt",
    "rating": 6.0,
    "comment": "Felt similar to the local dai di game with additional rules and some strange joker cards for increased fun factor, I suppose. Quite fun and had a good laugh playing this oddball. But nothing much to comment about the design.",
    "timestamp": 1667516400
  },
  {
    "username": "RhodesN7",
    "rating": 6.0,
    "comment": "nice simple trick taking game.",
    "timestamp": 1667430000
  },
  {
    "username": "propane train",
    "rating": 6.0,
    "comment": "A classic trick-taking game that I can see why got a lot of traction over the years",
    "timestamp": 1667257200
  },
  {
    "username": "SeanC",
    "rating": 6.0,
    "comment": "Rating based on vague recollection. There are cards and you play as partners and there may be some bridge like elements as well.",
    "timestamp": 1652911200
  },
  {
    "username": "selfthinker",
    "rating": 6.0,
    "comment": "I've played a very similar game a lot when I was a child. I like Tichu but I don't understand the hype around it. It's a good enough game but nothing special.",
    "timestamp": 1649282400
  },
  {
    "username": "JustinRRizzo",
    "rating": 6.0,
    "comment": "2019\nInfuriating game. I've played hundreds of hands and the luck is too swingy for my tastes. No agency. No clever playing. Extreme risk/reward with no mitigation.\n\nThe very last game I played had TRIPLE double victories. Hand 1 had a bomb and high straights from partners . Hand 2 had a straight of 12 cards and high singles left over. Hand 3 had a bomb and two straights. Three hands in and the score was 460 to 40.\n\nMuch rather play Chimera.",
    "timestamp": 1643929200
  },
  {
    "username": "pkufahl",
    "rating": 6.0,
    "comment": "Interesting 4-player climbing game with some truly confounding special cards. You need a dedicated group to really dig into this game to appreciate it.",
    "timestamp": 1643929200
  },
  {
    "username": "R0nky",
    "rating": 7.0,
    "comment": "Coop/competitive at the same time. I can see the potential here. I am not a fan of these classic/derived basic card games.",
    "timestamp": 1760911200
  },
  {
    "username": "btasam",
    "rating": 7.0,
    "comment": "I grew up more on trick-taking so I don't have a lot of shredding/climbing experience, but Tichu has always been enjoyable. Wish it got played more.",
    "timestamp": 1760652000
  },
  {
    "username": "rigacu",
    "rating": 7.0,
    "comment": "Vienna",
    "timestamp": 1760392800
  },
  {
    "username": "wangwei726",
    "rating": 7.0,
    "comment": "最佳4人 备用",
    "timestamp": 1759269600
  },
  {
    "username": "ultimoratio",
    "rating": 7.0,
    "comment": "Long Live Tichu!",
    "timestamp": 1759183200
  },
  {
    "username": "TheKilljoy",
    "rating": 7.0,
    "comment": "Let me take a cynical swing at games (for a change?).\n\nMost of the trick takers I’ve played during their resurgence feel like they were brewed in a lab by designers with too much access to Kickstarter backers and not enough exposure to actual balance. There’s a guilty few in my own collection.\n\nMeanwhile, classics like Mu and Tichu are sitting in the corner in exile. The former is elegant chaos, letting you build alliances with the same reliability as a Cold War treaty, and the latter is a mean-spirited ballet; every card you play a bluff, a betrayal, a bold move. There’s drama, not just because the game tells you there is, but because it emerges organically. You don’t need a player board, a bunch of tokens, and a deck of narrative events to feel something.\n\nI don’t want to experience a trick-taking game; I want to ???? one. No bloat; just tight design, cutthroat gameplay, and trying to find out if your partner is a genius or an idiot. Just give me some suits, some clean mechanics, a solid lead, and a reason to glare at my friend across the table.",
    "timestamp": 1758751200
  },
  {
    "username": "Avid_Equinox",
    "rating": 7.0,
    "comment": "Enjoyable enough. I can see the depth of strategy but don't really have the desire to attain it",
    "timestamp": 1757887200
  },
  {
    "username": "rutherford82",
    "rating": 6.9,
    "comment": "I like spades and I like Tichu.",
    "timestamp": 1756936800
  },
  {
    "username": "Traquan",
    "rating": 6.5,
    "comment": "Trick-taking game that has a lot of similarities with various other trick-taking games such as Bridge, Klaverjassen, Presidenten, Hartenjagen. Rules are a bit confusing, lots of little rules and exceptions. As with those other games, this game would greatly benefit from repeated plays to really master it. Unfortunately, I don't see myself finding a regular group that would want to invest the time needed for mastering it.",
    "timestamp": 1756072800
  },
  {
    "username": "enavico",
    "rating": 7.0,
    "comment": "+ Trick tacking classic\n\n= Only for 4 players\n\n- Maybe a bit too long for what it offers",
    "timestamp": 1754085600
  },
  {
    "username": "ZargonDDG",
    "rating": 7.0,
    "comment": "Traded Jambo, Pillage & Plunder, Reef Encounter and Tichu for Battlestations, Caylus, Facts in Five and NHL Ice Breaker.",
    "timestamp": 1751925600
  },
  {
    "username": "islander",
    "rating": 7.0,
    "comment": "Q W2smG | 4p. Also available on iPhone.",
    "timestamp": 1751839200
  },
  {
    "username": "royaljayhawk",
    "rating": 6.9,
    "comment": "Tichu is a game I’ve played over 30 times, and while I respect its pedigree and tight team mechanics, I’d still categorize it as a take-it-or-leave-it experience for me. There’s a lot to admire: clever hand management, layered strategy, and some genuinely tense moments. However, it’s also a game that asks for a lot of investment in group dynamic and rhythm to really shine.\n\nThe core gameplay is a fusion of trick-taking and ladder climbing, and once the conventions are internalized, it moves at a good pace. I do appreciate the thoughtful decisions it offers, especially around calling Tichu or manipulating your hand’s order for maximum tempo. However, I'm not someone who calls Tichu or Grand Tichu very often, and still generally win more than I lose. The risk/reward for it isn't there in lower experienced groups, and I find it's often better to let the opponent call Tichu and then beat them than to call Tichu and risk it. That may change with more experienced players, but I am not someone who plays religiously enough (or play opponents who do) to get to the level where calling Tichu smartly makes a difference.\n\nThere’s also a bit of a learning cliff with the scoring and etiquette, which can make early plays feel more opaque than they should.\n\nOverall, I don’t mind playing it. There’s solid design under the hood, but I’m rarely the one to suggest it. A good game, but for me, not a go-to.",
    "timestamp": 1751148000
  },
  {
    "username": "Steezish",
    "rating": 7.3,
    "comment": "6/13/25: Not sure where I feel on this yet. It hits the same vibe as spades, hearts, etc. I think there is plenty of strategy to learn and repeat plays with the same group could create some fun meta strategies. These are not necessarily my favorite type of game but I usually won't turn them down.",
    "timestamp": 1749852000
  },
  {
    "username": "Lobotnik",
    "rating": 7.0,
    "comment": "2013 birthday present. Tentative rating of 7. We played for an evening recently with another couple (all newbies). I enjoyed it, but felt like I was scratching the surface and am looking forward to seeing what this has to offer, now we have the rules down. We did not really have time to get into this lifestyle game, so sold it at the UK Game Expo 2025.",
    "timestamp": 1748988000
  },
  {
    "username": "Moneycopy",
    "rating": 7.0,
    "comment": "보드게임 입문자 4명 모이면 하기 좋은 게임. 데블스플랜에 나와도 좋을 듯",
    "timestamp": 1748815200
  },
  {
    "username": "HughCross",
    "rating": 7.0,
    "comment": "I prefer climbing shedding games h2h instead of team based. Being a team game it's skill and (too much) luck dependent. The special cards dragon and phoenix, make it for easy tichu and grand tichu calls, they are way too unbalancing. Scoring negative can drag the game forever. I need to play it IRL with even skilled people to see how it goes, but it's too intricate to teach with its many wrinkles and odd rules like off turn bombing, wishing, phoenix being 1/2 of the previous card, dragon and dog restrictions, scoring conditions, etc. I'm pretty sure that would shine with a dedicated group, but i don't have one to play it.",
    "timestamp": 1748296800
  },
  {
    "username": "wispwalker",
    "rating": 7.0,
    "comment": "Good trick taking game.",
    "timestamp": 1747519200
  },
  {
    "username": "speter22",
    "rating": 7.0,
    "comment": "I love this game, but it's super hard to get to the table. You need exactly 4 people who are down for a traditional-ish card game, but are down for something more involved than that. It's also got more than a couple wacky rules to internalize. The people I usually play quick card games with find it too difficult and strange, and the people who are down with its difficulty & strangeness usually would rather play something other than a traditional card game.\n\nIt's right up my alley, though. Quick, tricky, simple (kinda), deep, small, cheap, and clever. About as good as trick-taking games get.",
    "timestamp": 1746655200
  },
  {
    "username": "cubntin",
    "rating": 7.0,
    "comment": "4 players",
    "timestamp": 1743458400
  },
  {
    "username": "Mutiemoe",
    "rating": 7.0,
    "comment": "Entertaining card game.",
    "timestamp": 1741993200
  },
  {
    "username": "Be_Ka",
    "rating": 7.0,
    "comment": "vk 3",
    "timestamp": 1741474800
  },
  {
    "username": "antonkartashov",
    "rating": 8.0,
    "comment": "4p! (2×2)\n\nComplexity: ●●○ (medium)\nDuration: 60 mins\n\nTichu (地主, i.e. “Landlord”) is a mix of the Chinese traditional card games “Big Two” (大老2 or 鋤大D) and “Zheng Fen” (整份).",
    "timestamp": 1761053040
  },
  {
    "username": "shmonkey",
    "rating": 8.0,
    "comment": "Im sure this will increase with more play. SO tichu is a mashup between Asshole (President), Poker, and Spades. You are trying to shed your hand first by laddering single cards, pairs, sets of pairs, triplets, 5 cards straights, and full houses.\n\nYou have a partner and are working with them to accomplish your goals. You can call out tichu, which means you are betting large points that you will be the first to shed your hand. Players can \"bomb\" out of turn order by playing 4 of a kind or a straight flush.\n\nThere are also 4 special cards which affect the point gain and scoring.\n\nOverall, it felt familiar. My friends love this. This is the amalgamation of the card games I played in college: poker, asshole, and spades.\n\nI've played a few matches where even the full 1000 point game was too randomly stacked against one team. Most of the time the random evens out, but occasionally it can just bite hard.",
    "timestamp": 1759874400
  },
  {
    "username": "MorelliBuendia",
    "rating": 8.0,
    "comment": "One of my favorite card games. It combines trick-taking and shedding. Most tricktakers nowadays just try to offer a little gimmick by giving a twist to the genre, but in a few plays the novelty wears off and you find that there's not a lot of game left. This one, however, is a classic for a reason. The rules can seem a bit difficult for beginners, but every one of them adds an extra layer of decisions and things to consider, as well as ways to mitigate your luck. The four special cards play a big role in this, and they are part of the reason why I prefer this over Haggis.\n\nMogul Scale: 2/C. Pretty crazy to say that a card game is a C, but that's Tichu for you. Most card games are a 1. Tichu gives an extra layer of rules, but each one of them adds meaty decisions to an otherwise simple core.",
    "timestamp": 1759528800
  },
  {
    "username": "Sherpherd",
    "rating": 8.0,
    "comment": "C10 (taipan)(foreign)",
    "timestamp": 1758924000
  },
  {
    "username": "kahei0208",
    "rating": 8.2,
    "comment": "2025第十隻",
    "timestamp": 1758664800
  },
  {
    "username": "captain_hat",
    "rating": 8.0,
    "comment": "A great little game that I would love to own a less racist version of. Delightful trick-taking with satisfying variance and a smattering of poker energy.",
    "timestamp": 1757973600
  },
  {
    "username": "Billuminati",
    "rating": 8.0,
    "comment": "Fantastic card game for 4 players(2 teams) .\nEasy to learn but hard to master. Tactics come from playing a lot and understanding the flow of the game, risking and predicting the opponent.",
    "timestamp": 1757973600
  },
  {
    "username": "parzi42",
    "rating": 8.0,
    "comment": "Great, just great.",
    "timestamp": 1756159200
  },
  {
    "username": "Timstikkers",
    "rating": 8.0,
    "comment": "Taking Tricks with Teams. Terrific.",
    "timestamp": 1755986400
  },
  {
    "username": "Zenfire",
    "rating": 8.0,
    "comment": "Good team-based trick-taking game that needs exactly 4 players. It has quite fiddly scoring mechanisms and it's a pain to teach for new players. I'm not the biggest fan of these type of team games, too many times your \"team mate\" ends up whining about your decisions, which is not fun at all. It's still a very good trick-taking game, but got culled from the collection for those negative experiences. Sold, but there is a high possibility that I will buy it again at some point.\n\nPros:\n- Solid trick-taking game with its own twists.\n\nCons:\n- Pain to teach the rules\n- 4-players only\n- Team-based only\n- No limit how many cards you can play from the hand, so sometimes you get super fast lucky wins.\n\n\nPlayed: 10+ times.",
    "timestamp": 1755727200
  },
  {
    "username": "kefyras",
    "rating": 8.0,
    "comment": "Did not expect it to be this good, it's awesome !\nalthough 1000 points can take quite while (i prefer 500)",
    "timestamp": 1755208800
  },
  {
    "username": "ale2525",
    "rating": 8.0,
    "comment": "Ale",
    "timestamp": 1755208800
  },
  {
    "username": "Qhorin",
    "rating": 8.0,
    "comment": "Many plays 4 player - this game really shines. Strategies become slowly apparent over several plays. Great trick taking game.\n\n2 player variant by Asdo. Nice adds to a basic card deck. Good tradeoff between taking points and going out first.",
    "timestamp": 1753740000
  },
  {
    "username": "icesphere",
    "rating": 8.4,
    "comment": "This has a lot of strategy for a trick taking game.",
    "timestamp": 1753394400
  },
  {
    "username": "80sGirl",
    "rating": 7.5,
    "comment": "Own 5 copies (Rio Grande x 2, Portuguese Edition, German Pocket Edition, and Tiki (French) Edition) plus player mat.\n\nBGG Artist Series print in game room.",
    "timestamp": 1753135200
  },
  {
    "username": "BeansForTrade",
    "rating": 8.0,
    "comment": "I have a knockoff oroora deck, I can't understand why this is still being printed with racist caricatures. I imagine many people are turned away before getting a chance to try the game which is highly regarded for good reason.\n\nThe game is held back by being difficult to teach and having some strange rules, so I play with bombs in turn order only. Also considering house ruling the mahjong wish and grand tichu calls, but need more plays to decide.\n\nAlso used to proxy: Haggis 2p, Schadenfreude 3-5p, Of What's Left 3-4p.",
    "timestamp": 1752530400
  },
  {
    "username": "BGMarc",
    "rating": 7.5,
    "comment": "Played my first game today. I understand the rules, but not yet the game ?",
    "timestamp": 1750888800
  },
  {
    "username": "glsonn",
    "rating": 8.0,
    "comment": "Received for Christmas 12/25/08.\n\nIt has become a favorite of #2 son's.\n\nTraded 1/17/22 for Stick 'em!\n\nH - 24",
    "timestamp": 1750024800
  },
  {
    "username": "opks22",
    "rating": 8.0,
    "comment": "I received this as a gift from Terry. I just want to say Terry, you are the man. Thank you, I had been eying this for quite some time and was going to be an eventual purchase.",
    "timestamp": 1749247200
  },
  {
    "username": "Osh kosh 7",
    "rating": 8.0,
    "comment": "Best partner type card game you can buy. I will still play this any time its brought to the table.",
    "timestamp": 1749074400
  },
  {
    "username": "gusnboobs",
    "rating": 8.0,
    "comment": "***",
    "timestamp": 1748037600
  },
  {
    "username": "Guydeloimbard",
    "rating": 8.0,
    "comment": "Mix whist, poker and add power cards. Requires quite a few plays to start doing meaningful openings. Lots of indirect communication is achieved with your partner through the card you give, and your trick openings.\nMaldito's edition is rendering justice to this modern classic.",
    "timestamp": 1747519200
  },
  {
    "username": "hiimjosh",
    "rating": 9.0,
    "comment": "The canonical standard for a 4-player partnership shedding game. There's a reason it is so beloved\n\n+ High skillcap particularly around knowing when to bet\n+ Playing support is super satisfying\n+ Gameplay is exciting and edge-of-your-seat\n\n- Some hands are unwinnable, and you need to go into it realizing that you're playing for the long game\n- Scoring rules are overly complex and take a bit to learn\n- A table which doesn't bet will feel really weird\n- It can be difficult to get into if everyone you know is very experienced with it\n\nOne of my most played games thanks to digital implementations. I've never had a bad game of Tichu. Never. My favorite game of all time? Probably\n\nEDIT: After hundreds of games I still love it, however it's not without faults. Dragon + Phoenix is an \"I win\" combo and will be dealt to the same player about 1/8th of the time and to the same team about 1/4th of the time. The Dragon in particular feels too strong to me. On top of that, the Mahjong and Dog are both too weak, and getting stuck with them when the other team has the other power cards is often a 200 for the other team. It all evens out over the course of a game, but the fact that no-play games occur so frequently can leave you salty",
    "timestamp": 1760133600
  },
  {
    "username": "Seb123123",
    "rating": 9.0,
    "comment": "Only 4-player but really good!",
    "timestamp": 1760133600
  },
  {
    "username": "Sketcherrrr",
    "rating": 9.0,
    "comment": "I played a bunch of Whist with my Grandpa growing up, the ocassion game of Wizard, and oodles of Hearts on the computer. Yet, for some reason, I lost interest in card games and didn't play a single trick taking game for years.\n\nI saw a random thread on Reddit about trick taking games and decided to give this one a try (I know that it's a climbing/shedding game lol).\n\nFast forward to today and I've played over 100 games on BGA and have imported 50+ trick taking and climbing/shedding games from Japan.\n\nI would play it more, but partnership games have a higher barrier to entry and you typically need people around the same skill level to enjoy the game to the fullest.",
    "timestamp": 1759960800
  },
  {
    "username": "Ephorus",
    "rating": 9.0,
    "comment": "What I like:\n- One of my favorite climbing/shedding card games next to Haggis.\n- Enjoy the partnership feature which leads to some complex thoughts about your own but also your partner's hand. Is my hand strong enough for declaring Tichu? Will I play to support my partner? What is the other team doing? Constant monitoring of the game state is a must.\n- I like the decision which cards I will give my partner and the other two players.\n- One of the games that can become quite emotion driven, since one is not only responsible for ones own fate, but also the partner's fate.\n\nWhat I dislike:\n- A game of Tichu can sometimes feel quite one-sided. Dragon and Phoenix hand combination is ungodly strong.\n- The game can go short, but more often than not, it runs rather long. Record: 2 1/2 hours for a game to 1000 points. Hence, I usually prefer a game with 500 points.",
    "timestamp": 1757714400
  },
  {
    "username": "ChineseRestaurant",
    "rating": 9.0,
    "comment": "smallbox",
    "timestamp": 1756591200
  },
  {
    "username": "Jordan_Varbev",
    "rating": 9.0,
    "comment": "TT, Teams, +I\n#4**",
    "timestamp": 1756591200
  },
  {
    "username": "aadepizol",
    "rating": 9.0,
    "comment": "Best card game for foir people.",
    "timestamp": 1755986400
  },
  {
    "username": "adel9591",
    "rating": 9.0,
    "comment": "Seems like there is a lot to parse out with this one, as expected. But after one or two hands I already discovered a few revelations while still feeling like I was just scratching the surface, an indicator of a potentially great game.\n\nMoving up to a 9, after 30 more plays. Though this may be my first 10 in a long time.\n\nEdit: Yup, it's a 10. Best card game since 500/Bridge\n\nEdit: Back down to a 9. As much as skill highly influences this game, good hands beat bad hands most of the time so a lot has to do with how the cards are dealt.",
    "timestamp": 1755295200
  },
  {
    "username": "anthientran",
    "rating": 9.0,
    "comment": "Played a bunch of times with the nieces and nephews. It's such a great implementation of a team-based game. I've witnessed it all: dramatic bets, upset teammates, crying, etc, all from a deck of cards with an off-putting graphic design.",
    "timestamp": 1755036000
  },
  {
    "username": "Arnar146",
    "rating": 9.0,
    "comment": "bga",
    "timestamp": 1754517600
  },
  {
    "username": "VibroChimp",
    "rating": 9.0,
    "comment": "This seems to be the climbing/shedding game that all others are measured against, and it is indeed wonderful. The main drawback is the steep learning curve, which pretty much limits this to groups dedicated to playing it repeatedly.",
    "timestamp": 1754431200
  },
  {
    "username": "pezpimp",
    "rating": 9.0,
    "comment": "One of the best card games out there. This is one of those trick ticking games or if you prefer climbing games, where you constantly just play cards of higher and higher value until no one can play.\nIt is played in teams and the goal is usually just to get rid of your whole hand, but there are also points on the cards and the ability to make bets on whether or not you will be out first. It is a fairly classic card mechanic, but it is a lot of fun when you play a full game of several rounds.\nA must for those who like trick taking games.",
    "timestamp": 1753048800
  },
  {
    "username": "Redward",
    "rating": 9.0,
    "comment": "My favorite game on my phone and one of the best games I have ever played. So much depth in the decisions...",
    "timestamp": 1751580000
  },
  {
    "username": "Happymrdave",
    "rating": 8.5,
    "comment": "Fun game but the partner setup drags it down some as you need to make sure everyone understands the different 'meanings' of the things you pass. Has a huge amount of depth after that but the hump of getting everyone familiar with the passing makes it rough to introduce. Can't really skip that or else the game is very unbalanced if the other pair even marginally knows what they're doing.",
    "timestamp": 1751148000
  },
  {
    "username": "sorcretic",
    "rating": 9.0,
    "comment": "Feb. 2025 #47: Tichu does not follow far behind Chimera. Though I love the extra dimension that Chimera's shifting partnerships adds to Tichu, Tichu has more of a classic card game feel with partnerships and a relatively long playtime. It reminds me of the hours I spent playing Euchre and Spades back in high school and college, but with a denser and more fascinating decision space. One of my favorite gaming memories is from a long, late night Tichu session. There aren't a lot of card games that can be a \"main event\" on a game night, but Tichu is one of them.\n\nJul. 2024 #37\n\nJan. 2024 #44: Chimera was higher on the list, but Tichu is still great! I grew up with partnership trick-takers (Euchre, Spades) and Tichu hits all of those feels but provides more depth and more opportunities for clever plays. We played this late into the night at a recent game weekend and it was an absolute blast.",
    "timestamp": 1750802400
  },
  {
    "username": "jaceycole",
    "rating": 9.0,
    "comment": "9.0 - 1 play, 4 players - This game hit just like I hoped it would. Amazing. Played over 8 hands which felt about right, scores 505 for JD+DD to 45 for JD+CD after missing a few small Tichus. After playing and loving Haggis, this hits many of the same feels, but is more random in a sense, so more dynamic, unexpected and exciting. Bombs are rare so feel special, getting any one particular of the special cards is also somewhat uncommon and feels special. It's fun trying to work with your partner. The betting creates lots of tension. Every hand plays out so differently. I really want to play again ASAP!",
    "timestamp": 1749679200
  },
  {
    "username": "Herakleitos",
    "rating": 9.0,
    "comment": "Hilarious. I want to play it again.",
    "timestamp": 1749247200
  },
  {
    "username": "snakeboy80",
    "rating": 9.0,
    "comment": "This card game pretty much has it all. Trick taking with extra rules and combo’s that keep it interesting every round. Few games are better at 4.",
    "timestamp": 1749074400
  },
  {
    "username": "madboy1904",
    "rating": 9.0,
    "comment": "Hi bae, em có khoẻ không",
    "timestamp": 1748556000
  },
  {
    "username": "Aevin",
    "rating": 9.0,
    "comment": "4 players",
    "timestamp": 1746568800
  },
  {
    "username": "Von Falkenheyn",
    "rating": 9.0,
    "comment": "Super card game and a must have filler for any collection. Plays very well with 4 people in two teams. WARNING! Highly addictive!",
    "timestamp": 1745272800
  },
  {
    "username": "llkkmm",
    "rating": 9.0,
    "comment": "The best card game that we are aware of.",
    "timestamp": 1744322400
  },
  {
    "username": "williamdmp",
    "rating": 9.5,
    "comment": "Takes everything addictive about climbing and shedding tricktakers, and enhances it with layers of strategy. There are strategic decisions around every corner in this game. No other game handles \"Double edged swords\" in the game design remotely as well as this does",
    "timestamp": 1761141240
  },
  {
    "username": "iansc",
    "rating": 10.0,
    "comment": "My favourite card game. It has it all: thought, fun, tension and the more you play it, the better it gets. There are wild swings of fortune and astonishing comebacks. Don't be put off by the rather tacky proprietary cards that you have to buy in order to play, this really is a good game. Sequences and Steps don't have to be same-suit, so multi-card powerplays are common and hard to follow, with little actual 'climbing' going on. Much of the rest of the game then consists of burning off your single cards with the Dragon and the Phoenix cleverly added to the deck to determine the winners.\nUltimately, though, all the interest lies in betting as there isn't enough information about the location of the cards for skillful card play to be much of a factor. Beginners tend to be very tentative about betting, so this can be a tough game to introduce to others, even those who like card games. Get over that barrier and this is the very best climbing game, with tight scoring and genuinely thrilling play.",
    "timestamp": 1760047200
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "Trick-taking Game\n Cooperative Game / Team Game\n\nA weird blend of bridge, poker, and cribbage, with four crazy wilds and the opportunity to bomb any trick into submission. I think I'd play this more to pass the time than when I'm in a gaming mood, but Tichu is great at either.",
    "timestamp": 1759442400
  },
  {
    "username": "elqueaprende",
    "rating": 9.9,
    "comment": "--------------------------------\nI have played more than 500 times...",
    "timestamp": 1759356000
  },
  {
    "username": "LilyPlaysGames",
    "rating": 10.0,
    "comment": "I own 5 copies:\nTichu abacusspiele edition\nTaipan\nTichu tiki edition\nTichu filosofia edition\nTichu play.it edition",
    "timestamp": 1758924000
  },
  {
    "username": "Justnow86",
    "rating": 10.0,
    "comment": "My favourite trick-taking game. We played countless games.",
    "timestamp": 1758146400
  },
  {
    "username": "StevenStewart",
    "rating": 10.0,
    "comment": "Absolute banger.",
    "timestamp": 1756850400
  },
  {
    "username": "Pamponiros",
    "rating": 10.0,
    "comment": "Lots and lots of games of it during 2006-2009. Deserves a 10. Would still play it with 3 other people who know how to play it.",
    "timestamp": 1756591200
  },
  {
    "username": "KoolerAidMan",
    "rating": 10.0,
    "comment": "4 players.\n\nCard game. Tiny game.\n\nSleeved.",
    "timestamp": 1756504800
  },
  {
    "username": "deactivision",
    "rating": 9.5,
    "comment": "Great 2 v 2 card game. Sort of like 'bridge' and 'Pick Two' mixed together.",
    "timestamp": 1756418400
  },
  {
    "username": "couchlife",
    "rating": 10.0,
    "comment": "08/14/25 - It's always funny to me that a rather ornery card game from 1991, based on even older and obscure (in the West) Chinese card game(s), so immediately and viscerally took over our playgroup. Whenever four of us are looking around, the first question is \"Tichu?\"\n\nOroora brand deck",
    "timestamp": 1755122400
  },
  {
    "username": "merkusio",
    "rating": 10.0,
    "comment": "Best Card Game for 4 Players.",
    "timestamp": 1754776800
  },
  {
    "username": "CharlieNZ",
    "rating": 10.0,
    "comment": "Played",
    "timestamp": 1754431200
  },
  {
    "username": "CortexBomb",
    "rating": 10.0,
    "comment": "The bottom line: this is a really good partnership game and miles beyond the only other climbing game that I've played: Gang of Four. In Tichu the combinations you can play are more rigid (as you have to follow the exact same combination with 5 card plays rather than anything that involves 5 cards), and the deck standard. This makes bombs much less prevalent in this game, but I like the overall system much better in this, particularly because one can make long straights or double/triple pair plays that are almost impossible to follow. The removal of flushes (which are annoyingly common in Gang of Four because of the 3 suited deck) is huge and makes the game much better as well.\n\nThe joy in climbing games to me is being able to see the best path to take with your hand, and then following through with it. Tichu also gains points for awarding points to people based on gutsy bidding (calling Tichu) and by helping their partner out when they call it (or hindering the opponent who tries it).\n\nI really like this, and I quickly raised this from an 8 to a 9. This is easily up there with my other favourite card games (Spades, Cosmic Eidex, Doppelkopf) and is among my favourite games period now. It's presently a default game to end sessions with in one of my groups and it has fervent devotees in the other as well. Fantastic stuff.\n\nI was, at one point, holding this at 9 because I wanted to have only 1% of my games reach a 10, but it was unfair to hold Tichu back, this is really the partnership game for me, and one that I always want to play when we have the right players for it. Really amazing, one of the best 4 player card games out there and definitely the one I have the easiest time convincing other people to play with me. The only thing that I don't care for in this is the lack of true bidding, there is a limited form of pushing it with the Tichu declarations, but I do tend to like more direct bidding ala Spades or more frequent in-game interactions with the bidding like Doppelkopf. Still a great game though, still one of my absolute favourites.\n\nAside: Tichu is a 4 player, partnership based game. Though the box says it can scale and rules are included for that no one I know is willing to play the game that way. There are too many games out there that are specifically good for each scale to justify trying to force this one onto the table with anything other than 4.\n\nAside 2: This is a great cross-over game for people who play stuff like Spades. The rules take a game or two to get a handle on, but this game seems to have legs with almost every card player I know who has tried it. Great potential family and/or game to play while having a few with the guys/girls.\n\nAside 3: Dog Bomb!",
    "timestamp": 1753653600
  },
  {
    "username": "Tamburlain",
    "rating": 9.8,
    "comment": "Played today, and for the first time I had a flash of the wonderful experience that is so often reported by Tichu nuts. (Consequently, may bump up rating in the near future.)\n\nHas become one of my favorite card games.",
    "timestamp": 1751666400
  },
  {
    "username": "MAKOKI",
    "rating": 9.5,
    "comment": "My favorite card game for 4 players. Born from the ashes of other standard deck games and rises as the Phoenix perfecting them all.\n\nMaybe is the best card game ever created and I think you must give it a try.\n\n(and it also has a dragon and a puppy dog)",
    "timestamp": 1750111200
  },
  {
    "username": "capt_neb",
    "rating": 10.0,
    "comment": "All-timer!",
    "timestamp": 1748988000
  },
  {
    "username": "KingD7W",
    "rating": 10.0,
    "comment": "It was my favorite card game for a long time and introduced me to shedding card games that are my favorite style card game. Still holds a special place in my heart as I learned it on a trip after my brother passed. Inspired my first published game design.",
    "timestamp": 1748988000
  },
  {
    "username": "tbrofromspace",
    "rating": 10.0,
    "comment": "There are fewer more satisfying things in gaming than dropping a bomb or masterfully calling your shot and pulling a Tichu.\n\nWith the right crowd, this is just about as perfect a goofy fun time that exists",
    "timestamp": 1747346400
  },
  {
    "username": "Undecent",
    "rating": 10.0,
    "comment": "Tichu est un excellent jeu de plis et de défausse, même s’il est très exigent. Ses mécaniques inhabituelles demanderont plusieurs parties pour être appréhendées, mais une fois ceci fait, Tichu se révèle hyper stratégique et demande une coordination d’équipe parfaite. Pour qui veut s’y investir, Tichu promet de belles soirées à taper le carton. J’imagine bien des tournois pour ce petit jeu de cartes venu de l’Empire du Milieu.\n\nhttps://undecent.fr/2021/09/03/tichu/",
    "timestamp": 1746655200
  },
  {
    "username": "codewizpt",
    "rating": 9.7,
    "comment": "Kallax: C2\nKallax BR2: B1\nGarage Console",
    "timestamp": 1744927200
  },
  {
    "username": "juanjo1990",
    "rating": 10.0,
    "comment": "Para mí es mi top 1 de juegos. Cuántos años tirados a la basura que estuvo en la estantería de mi casa sin salir por feo. Pero una vez te adentras en él (y lo entiendes, que no es fácil), pura droga de la buena.\n\nMúltiples estrategias y jugadas épicas. Remontadas y partidas tiradas a la basura. Debería ser un juego obligatorio de jugar con asiduidad en las universidades e institutos.",
    "timestamp": 1742857200
  }
]