[
  {
    "username": "rroodri",
    "rating": 1.0,
    "comment": "Le pongo un 1 porque no deja poner 0",
    "timestamp": 1633903200
  },
  {
    "username": "AJBrandon",
    "rating": 1.0,
    "comment": "This is just not for me. I'm sure many people will love it but personally I think this is a headache in a box.",
    "timestamp": 1565992800
  },
  {
    "username": "soupline",
    "rating": 1.0,
    "comment": "Plays : 3\n\nRandom, random and random !\nWhat a disapointment for a Knizia game !",
    "timestamp": 1266706800
  },
  {
    "username": "andrebr",
    "rating": 2.0,
    "comment": "20 Min 2 Players p2 Weight: 1.73 / 5",
    "timestamp": 1632002400
  },
  {
    "username": "timbovelander",
    "rating": 2.0,
    "comment": "Too much luck to enjoy this, I'd rather play Hanamikoji",
    "timestamp": 1630274400
  },
  {
    "username": "evlkeith",
    "rating": 2.0,
    "comment": "2019",
    "timestamp": 1575759600
  },
  {
    "username": "Andural69",
    "rating": 3.0,
    "comment": "neat concept, but it's more luck of the draw compared to what cards you already played. It's like WAR, but here's 9 lanes to put your card in, good luck",
    "timestamp": 1760652000
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Fun game, though I do have to wonder about its longevity, mostly in relation to the game's two distinct halves. The first half is wonderful—plenty of tension, doling out your first several cards, making moves and carefully deciding when to commit to a specific column while deducing what cards your opponent might play (or not). But at some point, once a lot of cards are out on the table, you'll be forced to start making suboptimal moves whether you want to or not, and at that point the game turns into a Hail Mary, just hoping and praying you get the cards you need to complete your Flush or Run, otherwise you're dead in the water. It's never good when a game grows less and less interesting over its run time. But this one's short enough that it can \\almost\\ be forgiven, and the first-half is so good in its relative simplicity that the underwhelming back-end is both excusable \\and\\ frustrating.",
    "timestamp": 1760479200
  },
  {
    "username": "ajhutt",
    "rating": 3.0,
    "comment": "The art is not for the family.",
    "timestamp": 1640300400
  },
  {
    "username": "Korwin",
    "rating": 4.0,
    "comment": "I know this is a classic, but that's exactly why you should seek better implementation of this kind of games. I recommend \"Air, Land and Sea\"",
    "timestamp": 1722636000
  },
  {
    "username": "bneffer",
    "rating": 4.0,
    "comment": "Re-skin of battle line - I had fun playing, but I don't prefer this one over the original.",
    "timestamp": 1704150000
  },
  {
    "username": "churchb3",
    "rating": 4.0,
    "comment": "A bit too simple and luck of the draw for me, but quick and light enough to keep around. Interested to see what happens with the new edition.",
    "timestamp": 1701385200
  },
  {
    "username": "ValerianofEternia",
    "rating": 5.0,
    "comment": "Pros :\n• Clever and well-thought-out design\n• Still quite easy to learn\n• The tactic cards add some nice strategic options\n\nCons :\n• Not a fan of the Scottish Highlands theme\n• There is no tension like in Lost Cities\n• The three-card poker hands just don’t feel as rewarding as building long like in Lost Cities\n\nConclusion :\nA smart game but I prefer Lost Cities.",
    "timestamp": 1759096800
  },
  {
    "username": "fredderer",
    "rating": 5.0,
    "comment": "2 only",
    "timestamp": 1746309600
  },
  {
    "username": "BeniH89",
    "rating": 5.0,
    "comment": "Rating: 4",
    "timestamp": 1741993200
  },
  {
    "username": "PolarDad",
    "rating": 5.0,
    "comment": "Meh.\n\nLast played 2025",
    "timestamp": 1740092400
  },
  {
    "username": "SirMarmight",
    "rating": 5.0,
    "comment": "Perhaps choosing an ex Poker pro as an opponent for my first three games was a misstep for a balanced initial impression. I know I owe these cards more salt & shakes against differing on par clientele.\n\nStill, striking IELLO tartan lifted, I'm not entirely sure leisurely & mathematical is the head to head oomph I crave beneath.",
    "timestamp": 1722722400
  },
  {
    "username": "HighlanderPL",
    "rating": 5.0,
    "comment": "To play with small kids.",
    "timestamp": 1720908000
  },
  {
    "username": "FlurkyTurkey",
    "rating": 6.0,
    "comment": "It's okay, feels like two player solitaire or something.",
    "timestamp": 1760565600
  },
  {
    "username": "TyDeL",
    "rating": 6.0,
    "comment": "As a big Knizia fan, I feel strange for not loving this one. It's very clever and tense and I can see the layers to it, but it lacks the temp considerations that I enjoy in Lost Cities. For two games that play very similarly, it's a very different 2 player puzzle. Essentially managing 9 hands of Texas Hold 'Em at once it's a LOT of hoping you draw one specific card and don't throw away too many lanes.",
    "timestamp": 1759960800
  },
  {
    "username": "MissP1ggy",
    "rating": 6.0,
    "comment": "Fun, fast, enjoyable. Playing 9 mini battles, trying to get the best poker hands. Also known as battle line.\n*Familiecollectie*",
    "timestamp": 1759442400
  },
  {
    "username": "dhable",
    "rating": 6.0,
    "comment": "The core game loop is tense and requires a bit of thinking. The tactics cards do add more variety and strategy but make it a bit more random. After 30 plays, I feel like there are some standard moves and strategies to follow.\n\n\nRating History:\n02 Oct 2025 - 6 (30 plays)\n22 Jan 2020 - 7 (23 plays)\n30 Oct 2019 - 8 (23 plays)\n29 Apr 2019 - 7 (22 plays)\n15 Feb 2017 - 7.5 (3 plays)",
    "timestamp": 1759356000
  },
  {
    "username": "latschediwes",
    "rating": 6.0,
    "comment": "I do like the playing cards in contest over locations thing and I especially like the chaotic elements. It seems like there are a ton of games in this style and it seems like Schotten Totten is the origin and does it best.",
    "timestamp": 1759269600
  },
  {
    "username": "rexchow2015",
    "rating": 5.7,
    "comment": "2p card placement game similar to battle line",
    "timestamp": 1757368800
  },
  {
    "username": "Brett_Matze",
    "rating": 6.5,
    "comment": "2 Spieler",
    "timestamp": 1760911200
  },
  {
    "username": "Anne_Claire",
    "rating": 7.0,
    "comment": "rules heaviness: low\n2 players strategic card game",
    "timestamp": 1760392800
  },
  {
    "username": "Figaro123",
    "rating": 7.0,
    "comment": "Battle line, with the tactics cards, is better",
    "timestamp": 1760220000
  },
  {
    "username": "kataclysm",
    "rating": 8.3,
    "comment": "Good game. It's as thinky as you want it to be but also quick.",
    "timestamp": 1761090120
  },
  {
    "username": "rigacu",
    "rating": 8.0,
    "comment": "Preko",
    "timestamp": 1760565600
  },
  {
    "username": "nielsvanoch",
    "rating": 8.0,
    "comment": "Best with 2",
    "timestamp": 1760565600
  },
  {
    "username": "pfctsqr",
    "rating": 9.0,
    "comment": "This is one of those games that is fun at first, but reveals so much more as you play it. After hundreds of plays on the app and now online at BGA, it’s really starting to cement itself as perhaps the best 2 player suits and numbers game. The bluffing and subtle use of decoys is not obvious at first, but can become powerful weapons.\n\nI played a lot with the tactics cards at first, but now I’m a bit hesitant. Some of them just seem to take away from the bluffing and diversions the base game offers. They are nice to mix things up a bit and the restrictions on how many you can play is rather genius. But the game certainly didn’t need them.\n\nThe only downside is that the game can be a bit of a table hog for such a small game. But that’s relative; I’ve seen worse.",
    "timestamp": 1760306400
  },
  {
    "username": "jemana",
    "rating": 9.0,
    "comment": "A brilliant use of Poker hand scoring without the horrid bluffing of Poker. Play is tense and tactical, equal parts out-thinking your opponent and strategic card play. Lovely.",
    "timestamp": 1760220000
  },
  {
    "username": "Hovien",
    "rating": 9.0,
    "comment": "Library",
    "timestamp": 1759874400
  },
  {
    "username": "AerynSpaceMuseum",
    "rating": 10.0,
    "comment": "Excellent, funny, intuitive, interesting, elegant set collection dueling game. Beautiful & silly art with hilarious theme. Easy to teach & learn. Quick play & easy to replay. A classic forever game for us. For 2p.",
    "timestamp": 1759442400
  },
  {
    "username": "Redbloke",
    "rating": 10.0,
    "comment": "Great game. Love the two win options. Play a deep thinky game, or a fast blast through the deck. A masterpiece in a small box of cards.",
    "timestamp": 1758578400
  },
  {
    "username": "rafaelpaz",
    "rating": 10.0,
    "comment": "Perhaps my top1 card game, with a lot of strategy involved. Tactical cards increase strategic possibilities, but the normal game is already very well-rounded and complete. Very addictive and exciting, like every Knizia game.",
    "timestamp": 1758232800
  }
]