[
  {
    "username": "joelee",
    "rating": 1.0,
    "comment": "Another co-operative game that really isn't co-operative when it comes to the end game. Characters vary wildly in abilities and if you have a lousy one you're best off getting killed in hopes that you get a better replacement. No desire to play this again.",
    "timestamp": 1212876000
  },
  {
    "username": "oceano",
    "rating": 1.0,
    "comment": "Probably the worst game I have ever played.",
    "timestamp": 1072825200
  },
  {
    "username": "SorenK23",
    "rating": 2.0,
    "comment": "Biggest disappointment of a game I've ever purchased. Rules are poorly worded, take far longer to figure out than they should. Game mechanics are poor as well. Some of the components are nice, except for one sub-standard deck.",
    "timestamp": 1307224800
  },
  {
    "username": "Stargazer1x",
    "rating": 2.0,
    "comment": "Characters too weak to get through game. Game mechanics such that players must cooperate, but at the same time are against one another. This mechanic does not work well. Game rules also confusing. Components are of good quality.",
    "timestamp": 1293490800
  },
  {
    "username": "enzo622",
    "rating": 3.0,
    "comment": "Another choice of my friend who likes old school Avalon Hill games. I played with 2P and fully expected it to suck horribly, but it was merely mediocre. In theory, I’d like to see how this plays with 4P and see if it’s chaotically fun or chaotically annoying, but based on its reputation, I think I know the answer.",
    "timestamp": 1356562800
  },
  {
    "username": "larryjrice",
    "rating": 3.0,
    "comment": "Just one play so perhaps it would get better with more play. Of course, I don't really want to give the game another chance. I liked the concept, but the actual gameplay was tedious and frustrating as there seemed to be no way for half of us to ever be the top marine who then would get a chance to deduct where the princess was located. The game shows its age.",
    "timestamp": 1234306800
  },
  {
    "username": "Denist",
    "rating": 4.0,
    "comment": "1-6\n1 play prior to May 2018",
    "timestamp": 1575932400
  },
  {
    "username": "Unitoch",
    "rating": 4.0,
    "comment": "A strange title. It's most reminiscent of a mediocre Fantasy Flight game with lots of cards, a ton of art of varying quality, and mechanics that are simply not that interesting, all slathered with a generic space theme. There are some minimal decisions, but the whole is quite uninspiring. If you set aside the theme, the whole feels rather generic, though there's so much theme that you kind of have to squint to see past it.\n\nI wouldn't really recommend this, but there are worse ways to while away an evening. It's a little long, a little too complex, and not really inspired, but if you're looking for a corny throwback sci-fi game, this'll hit the spot.",
    "timestamp": 1447023600
  },
  {
    "username": "RaffertyA",
    "rating": 5.0,
    "comment": "(5.31) P\n\nCo-operative/competitive (essentially a) card game. Playable but not really engaging. Maybe needs another try.\n\nWith another try; just too fussy and there are too many instances where the rules are either unclear or just not easily located. Sad for AH (and us).",
    "timestamp": 1668812400
  },
  {
    "username": "Dexter42",
    "rating": 5.0,
    "comment": "SOLO",
    "timestamp": 1621807200
  },
  {
    "username": "DroppEcho",
    "rating": 5.0,
    "comment": "Seems a little too complicated for what should be a more adventure-oriented game. The theme could be stronger also. Boils down to a semi-co-op deduction game, but in order to get any clues, you have to win battles. If you have weak marines or weak weapons, there is little opportunity to influence many aspects of the game. That might be more acceptable if the theming or narrative elements were a little stronger.",
    "timestamp": 1450652400
  },
  {
    "username": "jcarvin",
    "rating": 5.1,
    "comment": "Doesn't do much for me as this is just too simplistic for my tastes.",
    "timestamp": 1418770800
  },
  {
    "username": "louza",
    "rating": 6.0,
    "comment": "Really strange game containing lot of opposites. Bunch of an interesting (not necessarily good) ideas which does not work together. Very simple game play using complex rule system makes game really wide, but without depth. Two completely inconsistent types of artworks - well known artist Elmore vs unknown digital renders. Opulent production but missing time counters. This game is still controversial. It has exactly the same strange feeling even after 25 years from the release. Maybe it means something...",
    "timestamp": 1645311600
  },
  {
    "username": "MagisterLudo",
    "rating": 6.0,
    "comment": "On the table Feb 2021 to see if it’s worth playing and keeping.",
    "timestamp": 1612911600
  },
  {
    "username": "mtngrown",
    "rating": 6.0,
    "comment": "One solo play, but I like it! I think it will be fun to play at least a few times, and definitely fun to play opposed.",
    "timestamp": 1543014000
  },
  {
    "username": "jvk1127",
    "rating": 6.0,
    "comment": "Fought my way through the terribly written rules and found myself liking this game despite it's shortfalls.",
    "timestamp": 1500847200
  },
  {
    "username": "pwillows",
    "rating": 7.0,
    "comment": "Bought a copy because my son's girlfriends wants to learn more about gaming.",
    "timestamp": 1525298400
  },
  {
    "username": "wkusau",
    "rating": 7.0,
    "comment": "A cooperative game from 1997. I always liked this one. One player plays the bad guys and everyone else play the Marines sent to rescue Princess Ryan. Each player controls 3 marines and has 6 weapons to start. There is a race against time as well as the fight against the bad guys. I don't like playing 5 players against the bad guys because there are to many special skills that the players get to use. It also has the problem of one piece of wrong information (given to the players by the bad guy or the player misunderstanding) can ruin the final guess for where the princess is.",
    "timestamp": 1359154800
  },
  {
    "username": "mtgjudge",
    "rating": 7.8,
    "comment": "Lots of theme but unfortunately very little decision-making in this one. It also does not scale very well with few players. My gaming group quit this one mid-session out of frustration. The low card count on guards in a three-player game coupled with the overuse of \"hide\" and \"reinforcement\" features make it easy for the guard player to cycle through to the special cards frequently. The \"doomsday bomb\" card is totally broken, and I recommend it be removed entirely. The others should be limited to a \"once per game\" use to attempt to balance the game. The benefit of being the CO was also lost on us.\n\nCompletely different experience on our second play. Very close game and decided at the very end!",
    "timestamp": 1753567200
  },
  {
    "username": "robmderrick",
    "rating": 8.0,
    "comment": "Rowan",
    "timestamp": 1560722400
  },
  {
    "username": "RVeenenberg",
    "rating": 10.0,
    "comment": "Superb game, brilliant cards",
    "timestamp": 1681336800
  },
  {
    "username": "Jammer",
    "rating": 10.0,
    "comment": "24 Marines, each with a unique special ability, 50 weapons (all different!), a massive and ever-changing board, creative game mechanics for combat / movement and no two games ever play the same. This game has it all (IMHO)!",
    "timestamp": 1043449200
  }
]