[
  {
    "username": "jrsquee",
    "rating": 1.0,
    "comment": "2022/05: a tiny, distilled stockholding game. better than it should be! sorta like startups, by Oink.",
    "timestamp": 1653343200
  },
  {
    "username": "Pandorzecza",
    "rating": 1.0,
    "comment": "Nic nadzwyczajnego",
    "timestamp": 1629669600
  },
  {
    "username": "familygaming",
    "rating": 2.0,
    "comment": "Played 10+ times. I rated the \"Thor\" version a \"5\" because of ridiculous theme and overpriced. I didn't have any expectations coming into playing this game. It feels like one of Knizia's old card games: one mechanism, dry and abstract, like it or loathe it type game. Never having been a big fan of numbered, abstract card games, I don't care for this one either. Feels a bit like Caesar & Cleopatra for some reason, but no special actions in the game. // Played the \"Loco\" version and liked it quite a bit better, mostly because now it looked like the type of game it is: simple fun. Loco is colorful, inexpensive, and easy to teach to non-gamers. Up from a 4 because this verion is a good one for non-gamers. (F; traded for Saboteur)\n\nRate: 4,7...,6,5",
    "timestamp": 1557784800
  },
  {
    "username": "The Eye",
    "rating": 2.0,
    "comment": "I am uniquely terrible at games where you build something up and try to guess its eventual value. This game is like stock speculation in its purest form, and I am terrible at it. But outside of that, it's not a really great game. Nothing I want to play for any real reason.",
    "timestamp": 1440453600
  },
  {
    "username": "alfonzo54",
    "rating": 3.0,
    "comment": "Played with a Rage deck and some poker chips. The random cards removed from the deck plus the immediate game end when the sixth card is played feel a little too random in combination.",
    "timestamp": 1716847200
  },
  {
    "username": "Victoria_hermit",
    "rating": 3.0,
    "comment": "extremely simple kid game with little plastic safari animals from the dollar store. Adults will fall asleep to it.",
    "timestamp": 1667602800
  },
  {
    "username": "warlock000",
    "rating": 4.0,
    "comment": "I don't feel much control in this game. And the new Polish edition is very hard to read. A lackluster experience.\n\n+ promo cards",
    "timestamp": 1714082400
  },
  {
    "username": "xylantrax",
    "rating": 4.0,
    "comment": "This game has only 1 pro: it plays fast.\nPlay SCOUT or Maskmen instead.",
    "timestamp": 1680472800
  },
  {
    "username": "neatbender",
    "rating": 5.0,
    "comment": "Pretty solid filler. Predestined, yet still interesting and exciting.",
    "timestamp": 1754690400
  },
  {
    "username": "CotB",
    "rating": 5.0,
    "comment": "Rankings\n153rd Best Game 2022",
    "timestamp": 1750888800
  },
  {
    "username": "smurfodeth",
    "rating": 5.0,
    "comment": "A very on-brand Knizia card game, with nearly no rules, yet still some interesting decisions to be made within its (too) simple framework. As seems to almost universally be the case, as much as I love many of his designs, this, like most of the rest of good doctor’s card games, just don’t hook me.",
    "timestamp": 1727647200
  },
  {
    "username": "marudnygbur",
    "rating": 5.0,
    "comment": "dzieci",
    "timestamp": 1692914400
  },
  {
    "username": "Euroman",
    "rating": 6.0,
    "comment": "Quick and easy filler with some agonizing decisions.",
    "timestamp": 1760824800
  },
  {
    "username": "Ephorus",
    "rating": 6.0,
    "comment": "What I like:\n- Dead simple shared incentive game. Still, lots of fun and great filler.\n\nWhat I dislike:\n- A bit too silent for a filler at times when players are calculating which color they should take and what color they should play.",
    "timestamp": 1759528800
  },
  {
    "username": "Subaru77",
    "rating": 6.0,
    "comment": "Rég játszottam vele, már nem sok mindenre emlékszem, ezért részemről ez a játék a felejthető kategória, tehát 6-os.",
    "timestamp": 1759269600
  },
  {
    "username": "stofke",
    "rating": 6.0,
    "comment": "R023",
    "timestamp": 1758492000
  },
  {
    "username": "soul2197",
    "rating": 7.0,
    "comment": "Players: 3-4 (best 4)\nPlaying time: 20-30 min",
    "timestamp": 1760047200
  },
  {
    "username": "TheSlushySnake",
    "rating": 6.5,
    "comment": "Safari-Themed, Hand Management + Stock Manipulation Game.\n3-5 Players. (Best With 4 Players).",
    "timestamp": 1759960800
  },
  {
    "username": "Drb89_",
    "rating": 8.0,
    "comment": "Hand management\nInvestment\nGreat art and components\nInteresting manipulation of token value",
    "timestamp": 1761096600
  },
  {
    "username": "Dasoogle",
    "rating": 8.0,
    "comment": "Preliminary rating",
    "timestamp": 1760824800
  },
  {
    "username": "Lordstrategos777",
    "rating": 8.6,
    "comment": "Fast. Easy. Strategic.\n\nLike a lighter version of Medici or Lost Cities.\n\nIt's got a lot more depth than first glance would lesexyou to believe.\n\nGorgeous artwork. Every card has different art.",
    "timestamp": 1760392800
  },
  {
    "username": "AerynSpaceMuseum",
    "rating": 8.5,
    "comment": "Excellent game! Easy to learn & table. Small box so we can take it places, the art is beautiful. The chunky animal pieces are also tactilely excellent & the paint is really nice. ! It’s really fun to play with another person (we have only tried it at 2P so far, but are excited to try more). There’s a very pleasant push-pull between the amount on the card, the number of cards played, and the number of animals you can take— Reiner Knizia is so good at making scoring super interesting! We love this game!",
    "timestamp": 1759874400
  },
  {
    "username": "btasam",
    "rating": 9.5,
    "comment": "Commodity speculative investing disguised as a children's game. What's not to love!",
    "timestamp": 1759183200
  },
  {
    "username": "vkottas",
    "rating": 9.5,
    "comment": "Fantastic, elegant auction card game you can teach to anyone with great swings and dynamics, especially at 4-5. My favorite part is that it incorporates fixed 'auctioning' (you don't have to price the animals, just pick from your hand), and perfect information on played cards and animals taken - no card counting/animal tracking required.\n\nJapanese version from Surya was not that expensive to buy/ship during free shipping deal (this was pre-tarriffs): https://www.suruga-ya.com/en/product/607635642",
    "timestamp": 1756764000
  }
]