[
  {
    "username": "brothervm",
    "rating": 1.0,
    "comment": "Got at a garage sale for $0.25. Borrrrring. Has nifty metal wrenches to restock Clue.",
    "timestamp": 1540854000
  },
  {
    "username": "camisdad",
    "rating": 1.0,
    "comment": "Not much to redeem this horrible game. It's mostly luck, Cameron does not like it, the art work I find mediocre, the player interactions are totally negative (that's not automatically bad but somehow in this game they are not funny). The mechanism is very similar to Mille Bornes.",
    "timestamp": 1157580000
  },
  {
    "username": "bnordeng",
    "rating": 2.0,
    "comment": "I've seen this game for as long as I can remember at our cottage. I probably played it in some wrong way when I was very young. I played it with my son at our cottage in 2025 and it's not good. Just draw and play cards do build your pipes or destroy your opponent's pipes. Players try to get water from their valve to their faucet passing through a minimum number of pipes. They can also try to sabotage their opponent's with leaky pipes and caps. It's 99.9% get the right cards and win with one redeeming quality being the mini-monkey wrenches used to repair leaking pipes.",
    "timestamp": 1756159200
  },
  {
    "username": "mjhake",
    "rating": 2.0,
    "comment": "Card game, pipe laying, stop leaks, boring and confusing",
    "timestamp": 1622066400
  },
  {
    "username": "steinsucherin",
    "rating": 3.0,
    "comment": "Legespiel, 2-5 Personen",
    "timestamp": 1749592800
  },
  {
    "username": "purplecow55",
    "rating": 3.0,
    "comment": "A card based game where players are playing a card, either on their own tableau, other player's tableau, or discarding it, then drawing a new card. Players can optionally repair leaky pipes with wrenches or playing over with non leaky pipe card. Whomever completes x non-leaky cards (player dependent) into their tableau wins the game.",
    "timestamp": 1744840800
  },
  {
    "username": "Vain_Melody",
    "rating": 3.5,
    "comment": "So many better tile laying games out there …",
    "timestamp": 1723413600
  },
  {
    "username": "Sedd",
    "rating": 4.0,
    "comment": "Rohr verlegen das Spiel, ohne den 2-deutigen Charackter. ^^\n\"Da spiel ich lieber das semi-kooperative 'Saboteur'. \"\nDenn im Grunde macht man das selbe, jedoch macht es \"Saboteur\" viel besser. Hier, bei \"Leg das Rohr\", spielt jeder gegen jeden und hofft die richtigen Karten zu ziehen.\nGrundsätzlich ist es gar nicht so schlecht. Denn es sorgt für Interaktion und einen gewissen Ärgerfaktor (der sich aber nicht so negativ anfühlt). Schnell gespielt ist es auch noch. Aber man merkt dem Spiel sein Alter schon stark an. Es gibt teilweise sehr sperrige Regeln. Man wird z.B. gezwungen, bestimmte Aktionen zu machen. Und ab einem bestimmten Punkt, sind alle Sabotage-Rohre verbaut.\nAbschließend zum Glücksfaktor: Es kommt schon vor, das man lange nichts machen kann, weil nicht die richtigen Karten kommen, aber mit 5 Handkarten, hat man meist noch Optionen. (Man will nur meist seine Möglichkeiten nicht kaputt machen)\n\nPS: Ersteindruck",
    "timestamp": 1710284400
  },
  {
    "username": "oldgoat3769967",
    "rating": 5.0,
    "comment": "A remembrance of my childhood. Found a copy in the thrift store and turn out to be a lesser of what I remember.",
    "timestamp": 1743372000
  },
  {
    "username": "camidon",
    "rating": 5.0,
    "comment": "Ok game. Nothing great. Kids enjoy it. Winding pipes around can be fun. Wouldn’t suggest it, but I’m ok with playing it. Will keep while the kids enjoy.\n\nTHRIFT STORE",
    "timestamp": 1734908400
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "Unique Component - Tiny pipe wrenches. They are even made of metal.\n\n\nUnique Mechanic - The game is fairly standard fair.\n\n\nQuick Thoughts - Fun filler and good with children.\n\n\n\nThis is a good game. Easily one of the best older Parker Bros. games.\n\nGot in 2007",
    "timestamp": 1731798000
  },
  {
    "username": "lippo",
    "rating": 5.0,
    "comment": "Bought this in London, in 1994, in a shop near the British Museum. I hadn't started my journey into \"German boardgames\" (as they used to be called) yet. Not a good game.",
    "timestamp": 1726783200
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".niet compleet, er mist 1 tang\nEAN nvt\ncd rek 9",
    "timestamp": 1756591200
  },
  {
    "username": "oneblessedmess",
    "rating": 6.0,
    "comment": "waterworks has been around for an age. we recently found and purchased a copy of the original set with metal wrenches and the fun drain plastic card holder. as we are not die-hard waterworks fans, our modern copy is leaving the house. it's not a game that is super engaging but is a game to bust out, to get kids engaged in playing board games.\n\nyou try to put a number of good pieces of pipe between your shutoff valve and spout and cause leaks on your opponents pieces. that's it. it's quick and simple enough and probably worthy of a better ranking that 23,000+ but i don't completely understand the bgg algorithm.\n\nplayable by kids around 5+.",
    "timestamp": 1743289200
  },
  {
    "username": "Independentfool",
    "rating": 6.0,
    "comment": "Plays like Mille Bornes but with the added construction. I like this better but my boy likes the cars!",
    "timestamp": 1741042800
  },
  {
    "username": "W1LDH0R53",
    "rating": 6.0,
    "comment": "1 Card Sleeves",
    "timestamp": 1740783600
  },
  {
    "username": "KatydidWonders",
    "rating": 7.0,
    "comment": "2-5 X2 copies",
    "timestamp": 1746136800
  },
  {
    "username": "rooninzen",
    "rating": 7.0,
    "comment": "Funciona a varios jugadores y que no se conozcan. Si hay conocidos puede hacerse repetitivo y engorroso. La calidad de los componentes es buena.",
    "timestamp": 1737500400
  },
  {
    "username": "tofutribe",
    "rating": 8.0,
    "comment": "Fun vintage card game.",
    "timestamp": 1674169200
  },
  {
    "username": "Caspman",
    "rating": 7.5,
    "comment": "uick game",
    "timestamp": 1662242400
  },
  {
    "username": "Clellybobus",
    "rating": 9.0,
    "comment": "So glad I picked this up - it’s a really tight, well thought-out game. Great at 2 or 3. It’s deceptively simple; offers lots of opportunity for strategizing and sabotaging.",
    "timestamp": 1550617200
  },
  {
    "username": "Arnaldo",
    "rating": 9.0,
    "comment": "I simply love this smart gamve of pipeline strategy!",
    "timestamp": 1364767200
  },
  {
    "username": "claidheamdanns",
    "rating": 10.0,
    "comment": "This had long been a favorite of mine. I can remember playing this at my grandma's house as a kid. Added to my own collection: 11-8-2024.",
    "timestamp": 1731020400
  },
  {
    "username": "averybills1227",
    "rating": 10.0,
    "comment": "One of the best games of all time",
    "timestamp": 1514588400
  }
]