[
  {
    "username": "Simon Mueller",
    "rating": 1.0,
    "comment": "Very similar to Tic-Tac-Toe, you're trying to \"outthink\" your opponent(s), which results in an utterly boring tile-laying practice.",
    "timestamp": 1197241200
  },
  {
    "username": "SCOBYBryant",
    "rating": 2.0,
    "comment": "{ P - 2 [3] [4] }\n\nReasonably short and engrossing tile-layer with one inexorable problem. People place in good locations while avoiding set-up plays, but sooner or later the game arrives at the point where everything is a set-up play. Boats can help negate this, and there is a balance to be discovered between avoiding set-up plays and avoiding inefficiently capturing too many cities by surrounding them yourself, but every game I've played between people of equivalent skill boils down to end-game uncertainty. (Or worse, who didn't get screwed over on the draw.) For what it's worth, probably the coolest and most seamless method of player scaling.",
    "timestamp": 1543186800
  },
  {
    "username": "hiimjosh",
    "rating": 3.0,
    "comment": "Samurai is a good game, but it's not a fun game. With both Babylonia and Caesar out now, I see no reason to go back to Samurai - although I might just for completion's sake at some point. I have only played at 2p and would like to try it at 3p. At 2p, I would rather play pretty much any no luck abstract over this as the randomness feels arbitrary and swingy. Overrated (at least at 2).",
    "timestamp": 1760911200
  },
  {
    "username": "tbrofromspace",
    "rating": 4.0,
    "comment": "Eh, this one doesn't tickle me as much as other Knizias do, I think because it's like obnoxiously head-scratchy and chin-strokey or something.",
    "timestamp": 1743804000
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A tactical tile laying game with area control where players take turns placing 1 tile onto the board (maybe more with special tiles). If the token spaces ever surround by user played tiles, for each icon (3 types), the player with the highest sum of like icon on surround tiles gains icon, where samurais and ships are wild. Once 4 pieces are out of the game or all of 1 type is off the game board, game ends. Winner is determined by the player with the most majorities of the 3 types, tie breaker is the most non majority pieces, followed by sum of most pieces.",
    "timestamp": 1757887200
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "House rule: Loser has to buy a copy of Seven Card Samurai. There is no worse punishment than that.",
    "timestamp": 1756072800
  },
  {
    "username": "CotB",
    "rating": 6.0,
    "comment": "Rankings\n67th Best Game 2022\n60th Best Game 2023\n61st Best Game 2024",
    "timestamp": 1757109600
  },
  {
    "username": "mac_s_1",
    "rating": 6.0,
    "comment": "I find it hard to explain why I don't like Samurai. It's well designed, but it just rubs me the wrong way I guess. It gives me a feeling of frustration: you can only react to one problem at a time, and when it's your turn again your opponents have created two new ones.\nNot being able to do everything is normal (and good) in a game, but here it just happens in a frustrating way.",
    "timestamp": 1757109600
  },
  {
    "username": "JustinRRizzo",
    "rating": 7.0,
    "comment": "Smushed corner, splitting seams, components excellent.",
    "timestamp": 1760824800
  },
  {
    "username": "nswoll",
    "rating": 7.5,
    "comment": "Good game, with great scoring. Just a little too chaotic for me. I think between expert players it often comes down to the order you draw your tiles.\n\n(I've played over 50 games online)",
    "timestamp": 1760652000
  },
  {
    "username": "themisterbutton",
    "rating": 9.0,
    "comment": "Top 3 juegos de Knizia. Maravilloso juego",
    "timestamp": 1759269600
  },
  {
    "username": "Cancelled",
    "rating": 10.0,
    "comment": "Recent plays of this have cemented this as perhaps my favourite Knizia game. It's just so so good. Now I've played it at all player counts, I might even prefer it at 4. Fast, with a strong arc, it has a gradually narrowing decision space where the decisions become more important and develop into moments of high drama. The game does so much with so little. It has an interesting focus to it where certain areas will be devastated by a strong play, but those tiles have such limited influence, that you can win fights for other resources nearly. This gives you the feeling of fighting small tight battles distinct from each other but tied together over a larger board. I can't think of other area control games that handle this so well. We can fight near each other, but not be in directly conflict, and there are times when a smart play can devastate an area that one play sees as being in their complete control. I could play this endlessly, and expect that it might begin to see more regular rotation. A bit dry, but still compelling enough that I don't think it will have as much trouble as Through the Desert getting played.\n\nEdit Sept 2025: Still a 10 out of 10. Not quite as much rampant enthusiam as when I discovered it and wrote the above comment. It's likely not my actual favorite Knizia - I've played El Dorado and Battle Line a lot more but - but for this style of game it's defiitely my favorite. I adore Through the Desert and Tigris and Euphrates, and Tigris is a better design perhaps? But at the moment this gets played way more often and hits hard for it's light rules.",
    "timestamp": 1758492000
  }
]