[
  {
    "username": "Tygrone",
    "rating": 1.0,
    "comment": "One of the two worst boardgames i ever played.",
    "timestamp": 1695247200
  },
  {
    "username": "Pandorzecza",
    "rating": 1.0,
    "comment": "Gra o niczym",
    "timestamp": 1628373600
  },
  {
    "username": "giltleaf",
    "rating": 1.0,
    "comment": "dump this soup out.",
    "timestamp": 1568239200
  },
  {
    "username": "benshever",
    "rating": 2.0,
    "comment": "Felt old because it is old. Mechanics were strange and game notably ugly. Ability cards were boring and nobody had fun",
    "timestamp": 1550098800
  },
  {
    "username": "yauyyb",
    "rating": 2.0,
    "comment": "too long of a game to be trying a few cards combo",
    "timestamp": 1518303600
  },
  {
    "username": "Grey Pilgrim",
    "rating": 2.0,
    "comment": "Primordial Soup is about managing amoeba as they travel across the board and eat, ensuring that food is always available. This spacial management is entertaining, trying to feed your characters each turn, but for purposes of scoring, is somewhat meaningless. The game scored by the amount of upgrade cards and amoebas on the field. These choices are uninteresting as everyone just wants the most cards and most amoebas. To score, it doesn't matter where they are, only that they are present and have card bonuses. Feeding is fun, but the game focuses on the \"unfun\" to the point where doing well is somewhat arbitrary and not engaging.",
    "timestamp": 1510095600
  },
  {
    "username": "Sonicwarhol",
    "rating": 3.0,
    "comment": "Saw this in the background on Zee Garcia's shelf, I like a lot of the games he likes but this one was uninteresting to me. There seems to be no interesting decisions at all, and I find it very boring. Maybe I am playing it wrong but I don't see how this is a top 1000 game unless it is for sentimental reasons.",
    "timestamp": 1547852400
  },
  {
    "username": "boxboyo",
    "rating": 3.0,
    "comment": "kind of long with a lot of down time. I think if i could play it a few more times i would rate it a lot better, now i just gotta find some people willing to play....",
    "timestamp": 1491170400
  },
  {
    "username": "snowzman",
    "rating": 3.0,
    "comment": "I only played once but it's not my thing. I've seen game pieces online for this game that look a lot cooler then what I got. Mine were dull. I like strategy games but the effort needed to learn all the cards available didn't produce enough fun for me to get into this one.",
    "timestamp": 1451689200
  },
  {
    "username": "Bagherra",
    "rating": 4.0,
    "comment": "a good example of a good game that takes too long to play",
    "timestamp": 1745272800
  },
  {
    "username": "jpbelang",
    "rating": 4.0,
    "comment": "Played once. Wasn't impressed.",
    "timestamp": 1711839600
  },
  {
    "username": "Enthousiaste",
    "rating": 4.0,
    "comment": "Nice ideas but there is too much randomness. You cannot plan much as there are so many changing elements.",
    "timestamp": 1685656800
  },
  {
    "username": "OMD56",
    "rating": 5.0,
    "comment": "Initial Score: 6",
    "timestamp": 1747519200
  },
  {
    "username": "Smeef",
    "rating": 4.5,
    "comment": "Fine, just a bit long",
    "timestamp": 1732575600
  },
  {
    "username": "yoosukchoi",
    "rating": 5.0,
    "comment": "Fun theme and light game play that makes it easy to play with non-gamers.\n\nThe amoeba pieces are nice and the size of the board itself makes it easy to see moves and keep everything from becoming a mess. However, there is simply a massive amount of cube \"accounting\" that goes on making the game feel sluggish.\n\nThat said, the game is light enough that you can chat and joke around between your moves and not get confused or forget your grand strategy.",
    "timestamp": 1699225200
  },
  {
    "username": "phantom16",
    "rating": 5.0,
    "comment": "This was all right. An abstract attempt at portraying amoebas in the primordial soup. It was fun moving around and buying upgrades. But it was a bit abstract for my taste.",
    "timestamp": 1693951200
  },
  {
    "username": "rynelf",
    "rating": 5.0,
    "comment": "--Apr2006-- Took me a year to find a play. It's pretty cool. A bit slow, but still somewhat amusing. Need more plays to fix a score: 6 or 7, I'd guess.\n--May2006-- I think it's a 6. On a technicality. If it was the only game I owned, I think I could be quite amused with it - so of itself, it's not bad at all.",
    "timestamp": 1680559200
  },
  {
    "username": "dherby",
    "rating": 5.0,
    "comment": "I tried to enjoy this one, but no one I play with wanted to hang out for the length of a whole game.",
    "timestamp": 1627941600
  },
  {
    "username": "mats-k",
    "rating": 6.0,
    "comment": "A fun, flexible game with a lovable theme. The interesting part is the selection and interaction of the genes. (Streamlining seems unbalanced, though.) A bit long. I like the contrast between the dark board and the colorful pieces.",
    "timestamp": 1753567200
  },
  {
    "username": "getareaction",
    "rating": 6.0,
    "comment": "Bought in November 2024. Rating based on two plays. Sold at LoBsterCon in May 2025.",
    "timestamp": 1746309600
  },
  {
    "username": "krit1789",
    "rating": 6.0,
    "comment": "Unusual theme. Takes longer than I thought.",
    "timestamp": 1743202800
  },
  {
    "username": "quietcorn",
    "rating": 6.0,
    "comment": "Fun game where your pieces need to eat cubes of other player's colors to survive, and upon doing so you drop cubes of your color. It's a fun game in concept and the art on the evolution cards is pretty cute.\n\nIt does suffer from a long time between turns, and since all cards are available for purchase at any time, you do tend towards analysis paralysis with so many different cards to pick from. Additionally, there is a small bit of randomness where you need to have a decent amount of money on hand for when the game randomly decides you can only have 6 points of upgrades instead of the average of 9-12. This determination is chosen by random event card, and you don't know what it will be ahead of time, which makes planning a challenge.\n\nAll that being said, I do enjoy this game a lot. It's a really fun and creative abstract that only suffers a little from it's age. There are many clever mechanisms here that are ahead of it's time, such as having turn order determined by who has the most points, and then when a player gains points they leapfrog over other player's scoring markers not counting those spaces, thereby acting as a catch-up mechanism.",
    "timestamp": 1742166000
  },
  {
    "username": "dosxtres",
    "rating": 5.5,
    "comment": "+",
    "timestamp": 1741906800
  },
  {
    "username": "ParalyzedAnalyst",
    "rating": 6.0,
    "comment": "I like the \"eating and excreting\" mechanics and how they naturally balance the game a little - the dominant species inherently produces more cubes of its own color and can run out of other colors to eat. Nonetheless, it seems like spamming out new amoebas with Division Rate to maximize score is kind of OP. The gene system is cool, although not necessarily balanced, and can lead to AP as players consider ALL the options. I might try some house rules to restrict the card pool to a river of available genes, and maybe even add in an auction element. I kind of wish the radiation limit was a bit higher too.",
    "timestamp": 1728597600
  },
  {
    "username": "mdiep",
    "rating": 7.0,
    "comment": "It's a bit fiddly because you're constantly eating and pooping, but very manageable. I can't think of any other games quite like this. I'm looking forward to exploring it more.",
    "timestamp": 1761139980
  },
  {
    "username": "Ddyraw",
    "rating": 7.0,
    "comment": "Was more fun than it really should have been. Cool powers and interesting game! Ultimately got rid of it in favor of games that could get tabled more.",
    "timestamp": 1759442400
  },
  {
    "username": "Nodens",
    "rating": 7.0,
    "comment": "Granny of Twilight Imperium and all the others. Takes a bit long but aged well.",
    "timestamp": 1757282400
  },
  {
    "username": "GypoNolan",
    "rating": 8.0,
    "comment": "More strategic and interesting than I expected. I really enjoyed it but it IS fiddly and long as advertised. You have to play and move through the procedures very briskly to have a smooth experience.",
    "timestamp": 1755727200
  },
  {
    "username": "JohnGrimes",
    "rating": 8.0,
    "comment": "Viel zu lange nicht gespielt!",
    "timestamp": 1750802400
  },
  {
    "username": "pjclinch",
    "rating": 7.5,
    "comment": "Not as accessible or smooth as Evo, but a bit meatier (or is that just more goop, at this stage in evolution?). Great art from Doris M. makes a good game even better.",
    "timestamp": 1741906800
  },
  {
    "username": "Spoonful",
    "rating": 9.0,
    "comment": "Fascinating theme well-executed, creates a living amoeba ecosystem that must be kept in balance, evolution makes for fun variable player powers, potential for some downtime and excessive strategizing/analyzing",
    "timestamp": 1681855200
  },
  {
    "username": "play2times",
    "rating": 8.5,
    "comment": "I love the humor in this game. I love the game play and I think it's highly underrated.",
    "timestamp": 1677798000
  },
  {
    "username": "Nalex222",
    "rating": 9.0,
    "comment": "A brilliant game with a truly unique theme. Great components and the overall look just draws players in. The gene cards (and their different combinations) add huge replayability. Should be played aggressively for maximum enjoyment. One of my all time favourites! There's no other game you could compare it to.",
    "timestamp": 1675810800
  },
  {
    "username": "Kodeir",
    "rating": 10.0,
    "comment": "The basic set of rules is pure chaos, but evolutions will allow you to harness control over the situation. Or, at least, try. Each evolution has the potential of creating a cascade effect, forcing other players to adapt to the situation at hand. Best evolution-themed board game I've played, hands down.\n\nRead more about it here:\nMini-review.\n\nRating: \nOptimal number of players:\n4\n3\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "sloehand",
    "rating": 10.0,
    "comment": "Holy Playtesting Batman! Someone must have sat around the table for days on end when testing this one. So many choices with the ability cards yet so well balanced. A little fiddly with the pooping dynamic but oozing fun. The strategies in this one seem limitless with the different combination of cards. Just wondering if PERSISTANCE isn't too powerful and perhaps should have an MP of 6 v. 4. Regardless, brilliant.",
    "timestamp": 1610146800
  },
  {
    "username": "fake",
    "rating": 10.0,
    "comment": "y",
    "timestamp": 1437688800
  }
]