[
  {
    "username": "Stevemould",
    "rating": 1.0,
    "comment": "You have to admire a design that takes risk and makes it much, much worse.",
    "timestamp": 1477000800
  },
  {
    "username": "Ninebreaker2",
    "rating": 1.0,
    "comment": "Your reward for well outnumbering your opponent in battle? Getting most-to-all of them wiped out 9 times out of 10. It's one thing when the die rolls are crappy, but when it's part of the combat system itself??? That's when you have an utterly broken \"game\".",
    "timestamp": 1236207600
  },
  {
    "username": "marconegrelli",
    "rating": 1.0,
    "comment": "Play few times... but I don't like it",
    "timestamp": 1213394400
  },
  {
    "username": "SgtAp0ne",
    "rating": 2.0,
    "comment": "",
    "timestamp": 1440021600
  },
  {
    "username": "mgreen02",
    "rating": 2.0,
    "comment": "I vividly remember the last game I played of this where tokens seemed to come and go from the board seemingly at the whim of the mechanics rather than any influence of the players.",
    "timestamp": 1434924000
  },
  {
    "username": "moujamou",
    "rating": 2.0,
    "comment": "I never want to play Wizard's Quest ever again.",
    "timestamp": 1426287600
  },
  {
    "username": "scottmoll",
    "rating": 3.0,
    "comment": "A pretty old game that I have not played for 20 years. I gave it this rating based on my lack of desire to relearn it.",
    "timestamp": 1572303600
  },
  {
    "username": "Reverend Pete",
    "rating": 3.0,
    "comment": "Decent, lots of upkeep and fiddling--but fun.",
    "timestamp": 1536789600
  },
  {
    "username": "Clockpunk",
    "rating": 3.0,
    "comment": "A solid and worthwhile introduction to the hobbies - both boardgaming and (very basic) roleplaying.",
    "timestamp": 1445032800
  },
  {
    "username": "TalesWithinWheels",
    "rating": 4.0,
    "comment": "A dull Risk analog with little to recommend it.",
    "timestamp": 1683583200
  },
  {
    "username": "rynelf",
    "rating": 3.5,
    "comment": "--Jan2006-- I used to own this. 24 years ago. Then I went off to grad school, and haven't played since. I have this vague recollection of it being slightly more random (and slightly more amusing) than Risk. Which is pretty bland praise in 2006.\n\n++ ~12 unlogged plays. ++",
    "timestamp": 1680559200
  },
  {
    "username": "Pandorzecza",
    "rating": 4.0,
    "comment": "Ok",
    "timestamp": 1639522800
  },
  {
    "username": "extrala",
    "rating": 4.5,
    "comment": "\"Childhood Classics\"",
    "timestamp": 1722895200
  },
  {
    "username": "uduhno",
    "rating": 5.0,
    "comment": "The game reminded me of risk but with a twist. The game was enjoyable, but would likely not play again, because there are better games.",
    "timestamp": 1681768800
  },
  {
    "username": "Jimzik",
    "rating": 5.0,
    "comment": "Orcs everywhere! Companion to AMOEBA WARS for easy, fun games from AH.\nSold: 1/28/23 with Titan",
    "timestamp": 1674946800
  },
  {
    "username": "Rjan55",
    "rating": 5.0,
    "comment": "AH",
    "timestamp": 1673564400
  },
  {
    "username": "billr257",
    "rating": 5.0,
    "comment": "nk",
    "timestamp": 1666821600
  },
  {
    "username": "Goldron",
    "rating": 5.0,
    "comment": "Got the \"Marnon\" version of this one. Felt a bit like\nan advanced Risk to me with some alternative options.",
    "timestamp": 1585951200
  },
  {
    "username": "Gaius",
    "rating": 6.0,
    "comment": "Like it advertises, Wizard's Quest is Risk with slightly different combat rules and objectives. Incorporates hidden treasure objectives for each faction, similar to Runewars. The neutral orcs, dragon, and peacekeeper sorcerer, as well as your own warrior and wizard, had twists to the game. It definitely shows it's age today with lengthy setup, imbalanced chance cards, and swingy combat dice mechanics. However, Wizard's Quest has its charm.",
    "timestamp": 1734822000
  },
  {
    "username": "artikid",
    "rating": 6.0,
    "comment": "I think this game needs a simple reimplementation that fixes some of its issues, it has the potential to be a huge success",
    "timestamp": 1730070000
  },
  {
    "username": "adrao",
    "rating": 6.0,
    "comment": "I have really fond memories of playing this as a kid. I wonder if it holds up? (still own a copy...)",
    "timestamp": 1717365600
  },
  {
    "username": "baradifi",
    "rating": 6.0,
    "comment": "A kind of beautiful mess",
    "timestamp": 1699657200
  },
  {
    "username": "Haueterb",
    "rating": 6.0,
    "comment": "Risk with orcs.",
    "timestamp": 1697580000
  },
  {
    "username": "Stephan Valkyser",
    "rating": 6.0,
    "comment": "2nd copy",
    "timestamp": 1689804000
  },
  {
    "username": "Nodens",
    "rating": 7.0,
    "comment": "Try to win while massive orc hordes sweep across the countryside. Let's hope they eat your opponent's troops, eh.",
    "timestamp": 1758578400
  },
  {
    "username": "Thrylos",
    "rating": 7.0,
    "comment": "I really like this game. An old favorite. It is fun, it is tense, it is a blast! Somehow I really like procedural games. It plays best with 4 or less players. One of the best old timers!",
    "timestamp": 1746223200
  },
  {
    "username": "rooninzen",
    "rating": 7.0,
    "comment": "Calidad de componentes baja. Funciona mejor con más de 3 jugadores.",
    "timestamp": 1737759600
  },
  {
    "username": "John Tenzer",
    "rating": 8.0,
    "comment": "This one will be my go to bridgehead strategy game for new and casual boardgame players (who previously got burnt by RISK).\n\nPlayers acts as warlords competing for the title of \"King\" by sending their warbands out on the hunt for their own hidden 3 insignias of power.\n\nComplicating the players quests are aggressive and very reproductive hordes of Orks, a land roaming wizard (who pacifies his host province and gives out boni and mali to players) and a restless dragon that likes to eat orks and men alike), all of which are controlled by a rudimentary, but tightly written behavioural algorithm.\n\nThe player, who obtained his or her 3 insignias of power before the other players, wins the ceremonial title of \"King (or Queen) of Marnon\" and hence the game.\n\nI buffed up the visual and haptic experience with lots of wooden meeples and tokens, making it much more appealing than the games original cardboard chits were.\n\nSince the German version has only a \"Petition Pool\" with 10 boni for each player to choose from, I decided to upgrade my German version of the game (MARNON) by translating and redesigning the original PETITION-card-deck and having it printed into a customized playing card deck, to be able to add this to the game, if there'd be a need to separate the rules into a \"Core\" and \"Advanced play\" version.\n\nNow - with its latest rules compilation added to it - it got all the goodies of its original english version, with the much more appealing haptic and visual feel of the new millenium.\n\nAnd still it is a good, engaging, thematicly sound, fun and classic family strategy game for the ages.",
    "timestamp": 1753740000
  },
  {
    "username": "mothertruckin",
    "rating": 8.0,
    "comment": "A success at what it attempts. Frenzy!",
    "timestamp": 1737154800
  },
  {
    "username": "mirsik",
    "rating": 8.0,
    "comment": "Even though it's an older design and a bit similar to Risk, the game is pretty fun for up to 4 players. The randomness of the Dragon and Wizard makes things interesting, plus it creates some wild swings of fortune.",
    "timestamp": 1714687200
  },
  {
    "username": "pirtrom",
    "rating": 9.0,
    "comment": "lovely game",
    "timestamp": 1759269600
  },
  {
    "username": "hogzilla",
    "rating": 8.5,
    "comment": "I recall playing this with my friends as a teen and had a chance to break it out about a year ago. Still love it!! We had a great time and played it quite a bit. It needs 4 or more players to get the most out of it. Randomness is certainly a factor but does not drive the game. Bad things happen when bad dice are rolled. I am not afraid of dice: I am not a wine snob, I'm not a hops snob, and I aint no dice snob! Bring on the raucous randomness! Dice rolling leads to lots of anticipation and strategy busting/booming. When the dragon attacks or orcs frenzy you or the enemy. This is a one of AH's more playable games for those who are not into full-on strategy games. Its a great mix up and these days I dare say a nice intro into the retro realm of little cardboard squares. It does take a long time to play so sit back and watch your opponents groan and grimace during Orc Frenzy phase.",
    "timestamp": 1661292000
  },
  {
    "username": "themitchells",
    "rating": 8.8,
    "comment": "on replaying this game again after so many years, I am amazed at it combining a fast wargame; a wonderfully illustrated compact map; orcs that frenzy as their numbers grow; a rampaging dragon; all wrapped up in a strategic bit of genius.\nThere are a few clunky rules and ideas, but it's fun!",
    "timestamp": 1632175200
  },
  {
    "username": "ButtMunch",
    "rating": 10.0,
    "comment": "Homemade game that is part Enchanted Forest, part Talisman, part Sorry!\n\nPlayers roam the board in a competitive search for lost artifacts, gaining powerful spells along the way.",
    "timestamp": 1687039200
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "used",
    "timestamp": 1634767200
  },
  {
    "username": "Limulus",
    "rating": 10.0,
    "comment": "This game is a classic! I just introduced it to my niece and nephew who are both gamers and my niece proclaimed it the \"best game I ever played.\"",
    "timestamp": 1470434400
  }
]