[
  {
    "username": "oetan",
    "rating": 1.0,
    "comment": "Stupid game. Cost me five euro's, the wooden blocks are excellent for different games.",
    "timestamp": 1146952800
  },
  {
    "username": "dr glaze et al",
    "rating": 2.0,
    "comment": "Yet another example of Moon appropriating El Grande and failing again. Lots of card-trading to build sets... which let you improve your odds at scoring with the \"Space Puck\". Vaguely interesting card-trading phase, but what it gains you on the board is lame and it is overly long for what it is. Felt like Slapshot's card-trading meets El Grande scoring.\n\nSoulless and unthematic in the extreme. Along with Capitol it is part of Alan Moon's famous \"Undead Soulless Cyborg Games\" series.",
    "timestamp": 1217196000
  },
  {
    "username": "mazzyfred",
    "rating": 3.0,
    "comment": "One person of my former game group used to like this game, and I played it probably too much to still have a friendly opinion on this.",
    "timestamp": 1608591600
  },
  {
    "username": "Sky Knight X",
    "rating": 4.0,
    "comment": "Darn, I thought that I would really like this game. Sci-fi mining and trading sounded good to me. It turned out to be dry and non-engaging.",
    "timestamp": 1638918000
  },
  {
    "username": "lexen",
    "rating": 5.0,
    "comment": "was a suprise to me, has a good fun factor, but not a game that says play it over and over again... I think this is one of alan moons best unfortunally only worth a 6 to me...",
    "timestamp": 1749506400
  },
  {
    "username": "jwilhm",
    "rating": 5.0,
    "comment": "Save",
    "timestamp": 1725832800
  },
  {
    "username": "getareaction",
    "rating": 6.0,
    "comment": "From the designer of Ticket to Ride, the only game that uses an ashtray - to great effect, I must say.\n\nI really enjoy this old-school space-themed game of horse trading and hand management, and I wonder why it doesn't have a higher profile. Begging to be modernised and re-released, I reckon.\n\n(The \"cosmic ashtray\" is used as a cube randomiser.)\n\nGot free from LoBsterCon in May 2022, and donated back in May 2024.",
    "timestamp": 1745964000
  },
  {
    "username": "Druivenclub",
    "rating": 6.0,
    "comment": "Hans",
    "timestamp": 1693864800
  },
  {
    "username": "JinkyJanky",
    "rating": 6.5,
    "comment": "We took forever to try this game. It's been in our library for 5 years. Glad we finally did play. For a 26-year old game, it's pretty solid. Clear play, simple but difficult choices to make, easy scoring. Keeping.",
    "timestamp": 1759096800
  },
  {
    "username": "xanalor",
    "rating": 8.0,
    "comment": "I feel like I always enjoy this game more than everyone else at the table. Very pleasing graphics treatment, and the \"ashtray\" is quite satisfying. Would like to play again with a new group, maybe lighter gamers.",
    "timestamp": 1742338800
  },
  {
    "username": "slinkyboy",
    "rating": 8.5,
    "comment": "Wonderful game. I can't get enough of that Cosmic Hockey Puck. I can see how the randomness might be a turn-off, but as an exercise in playing probabilities, I don't see how it's any worse than dice rolls or the dreaded CRT.",
    "timestamp": 1680645600
  },
  {
    "username": "maszek",
    "rating": 10.0,
    "comment": "Recently played. Excellent game. A must have...",
    "timestamp": 1198450800
  }
]