[
  {
    "username": "uduhno",
    "rating": 1.0,
    "comment": "Worst combat system I have ever seen and the randomness of cards takes away from the tactical value of the game.",
    "timestamp": 1684879200
  },
  {
    "username": "NickAnner",
    "rating": 1.0,
    "comment": "Love to fight out battles with another mini-card game, this is the last of the CDW's that plays that way. Great historical and ahistorical outcomes depending on how you strategize. It only suffers from a common deck where one card in particular (messenger intercepted) can be a game breaker if one side gets it more often. ***THIS RATING USED TO BE A 9.5, but VALLEY GAMES screwed me over so badly with my preorder I don't even want to play it anymore. I got the game 3 days short of 9 months after i was charged. Oh, and they never sent the generals! *** Updated: valley games has the nerve to spam me for their preorder of hamilcar expansion. Still don't have the generals.",
    "timestamp": 1305842400
  },
  {
    "username": "victorywt",
    "rating": 1.0,
    "comment": "I'm not wargamer, feel too borning",
    "timestamp": 1088460000
  },
  {
    "username": "Thatsnotme",
    "rating": 2.0,
    "comment": "2 til 4 timer",
    "timestamp": 1737846000
  },
  {
    "username": "parp",
    "rating": 2.0,
    "comment": "Ugh, horrible random mess - feel guilty for selling it, should have burned it O.o",
    "timestamp": 1365199200
  },
  {
    "username": "Jon Karlsson",
    "rating": 2.0,
    "comment": "Would have been an 8 if it had another combat system. The strategic game is fine, great even, but the combat using cards is uninteresting, too random and too time-consuming.",
    "timestamp": 1359846000
  },
  {
    "username": "Scifi66",
    "rating": 3.0,
    "comment": "See reprint.",
    "timestamp": 1724796000
  },
  {
    "username": "saslett",
    "rating": 3.0,
    "comment": "So tedious and dull and long.",
    "timestamp": 1636326000
  },
  {
    "username": "TheRealTroll",
    "rating": 3.0,
    "comment": "It's been a long time since I played this game. Back then I came to the conclusion that the game is pretty unbalanced, heavily favouring the Carthage. Hannibal seemed to be unbeatable even when facing Scipio and being outnumbered.",
    "timestamp": 1577401200
  },
  {
    "username": "apuleio",
    "rating": 4.0,
    "comment": "Rest of the game is not so bad but absurde and horrible combat system: too heavy luck factor. Map error: Boii and Mutina are inverted!",
    "timestamp": 1669330800
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "grognard game",
    "timestamp": 1576623600
  },
  {
    "username": "chg21012",
    "rating": 4.0,
    "comment": "I love the theme. What a shame this just seems a tad outdated. Better wargames out there.",
    "timestamp": 1575759600
  },
  {
    "username": "bentlarsen",
    "rating": 5.0,
    "comment": "The \"duck, duck, goose!\" combat resolution is the fatal flaw in anotherwise amazing design. And given the number of editions, it clearly demonstrates the continue popularity of the game: but something has to change before I play it again.\n\nSo, why offer it for trade? The Berg GMT games (a series that he did not finish, but hopefully someone will) are a pain with all the combat modifiers; but it seems a strong and authentic way to portray the combat.",
    "timestamp": 1724104800
  },
  {
    "username": "jtakagi",
    "rating": 5.0,
    "comment": "I appreciate the legacy left by this game, as I can see that this must have been a huge revolution in war games. I particularly like the use of the battle cards. I'm not necessarily opposed to dice to resolve combat, but the use of cards, even if it is kind of Old Maid-ish, was refreshing and surprisingly fun.\n\nThough I can tell that I will never become an expert in the game, I was grateful to be taught the game and would willingly play it again.",
    "timestamp": 1695074400
  },
  {
    "username": "_EGA_",
    "rating": 5.0,
    "comment": "Варгейм",
    "timestamp": 1692741600
  },
  {
    "username": "mcdeans",
    "rating": 5.0,
    "comment": "[12/13/2021]Reviewing my games this doesn't make the cut; sold\n[05/21/2008] Another game that's rated highly but that doesn't grab me too much. I'd have to play numerous times to get competent at it, and I'd rather play other games. [12/12/2008] Played a couple more times, and I like it more. I still suck mightily, however.",
    "timestamp": 1639350000
  },
  {
    "username": "Stephen Glenn",
    "rating": 5.0,
    "comment": "Played three times and never could figure out what all the fuss was about. But many respected players and critics adore it, so don't listen to me.\n\n(Mom's)",
    "timestamp": 1608764400
  },
  {
    "username": "tailz",
    "rating": 5.0,
    "comment": "A little too luck based for tastes, but certainly sets up and plays quickly. Content to play it, but no urge to own a copy.",
    "timestamp": 1573945200
  },
  {
    "username": "Rhuned",
    "rating": 6.0,
    "comment": "Valley games Ed.",
    "timestamp": 1756764000
  },
  {
    "username": "Mijjy",
    "rating": 6.0,
    "comment": "Too easy for the Romans to win, just keep throwing everything at Hannibal & more often than not, you will win by attrition, which is kind of what happened anyway, so maybe in 10% of the alternate universes, Hannibal wins.\n\nDon't quite understand the clamouring for a reprint, but it's fun to play from time to time though (& I think I've played it enough to say that)",
    "timestamp": 1732575600
  },
  {
    "username": "zurupeto",
    "rating": 6.0,
    "comment": "7/19/17 - I've had to come to terms with the fact that I just don't like this game very much. I recognize that it's good, so I have to chalk this up to my own personal tastes and sense of aesthetics. History aside, I don't like how the game takes place around the periphery of the board, with just gobs of empty, unplayable sea in the middle. Also, I feel like there is so little the players can count on--no refuge of any kind from the constant high stakes and tension. I don't know; it just doesn't work for me. In spite of its obvious inferiority of design, I much prefer We the People/Washington's War. [Edit: Caesar: Rome vs Gaul trumps Washington's War and IMO is easily the best of the three).\n\n4/4/08 - A recent go at Hannibal has knocked it up a pip. One day my opponent will learn to stop rolling 6's on the Carthaginian naval table, but otherwise an outstanding game.\n\n4/9/07 - I really suck the big one when playing this game. It's good, if a little long, but I couldn't win to save my life. If you ever want to feel good about yourself, challenge me to play against you in either this game or chess, and you're guaranteed to win (even if your brain has been surgically removed). I prefer We The People in terms of fun, but Hannibal is a huge improvement on the system (because battles last long enough to make the shuffling time worthwhile and because the events and OPS are not seperate).",
    "timestamp": 1725314400
  },
  {
    "username": "echelon",
    "rating": 6.0,
    "comment": "Convoluted rules coupled with a lenghthy gameplay presuppose a day-long session. Both my plays were incomplete after over four hours of gaming. Nevertheless, this is a good game, a masterpiece for period enthousiasts",
    "timestamp": 1713304800
  },
  {
    "username": "Hagrid",
    "rating": 6.0,
    "comment": "Good game, but biased towards Romans. My wife and I both struggle when playing the Cartheginians.",
    "timestamp": 1701730800
  },
  {
    "username": "Druivenclub",
    "rating": 6.3,
    "comment": "Hans",
    "timestamp": 1694556000
  },
  {
    "username": "CharlieNZ",
    "rating": 7.0,
    "comment": "Played",
    "timestamp": 1752357600
  },
  {
    "username": "MichaelaPat",
    "rating": 7.0,
    "comment": "2025",
    "timestamp": 1750888800
  },
  {
    "username": "Tatsu",
    "rating": 6.5,
    "comment": "After a couple of plays, the only thing I can compare it to is Twilight Struggle and its card driven tense-ness. Combat is random, but weighted and usually won by the better prepared army. It feels fun, but the event cards can really swing the game and in a long tight game, a player can lose in the last turn through no fault of their own if the other guy gets really good cards.",
    "timestamp": 1747778400
  },
  {
    "username": "JimM",
    "rating": 8.0,
    "comment": "Played once, but fun\n\nSOLD 06-25-2024",
    "timestamp": 1758837600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 8.0,
    "comment": "My most recent play of Hannibal in May 2025, was very pleasing to me. However, I don’t think my opponent shares my enthusiasm. I would love to find someone who shares my enthusiasm.",
    "timestamp": 1757973600
  },
  {
    "username": "SultanSevy",
    "rating": 8.0,
    "comment": "MINT - Unplayed. Read through the rules and ready to play because I really liked what I learned. The complexity limits its replayability factor and my ability to get it to the table.",
    "timestamp": 1753567200
  },
  {
    "username": "GuySamstag",
    "rating": 9.0,
    "comment": "Arguably the only two-player CDG you'll ever need.",
    "timestamp": 1759960800
  },
  {
    "username": "LordJesse",
    "rating": 8.5,
    "comment": "Punched and sleeved.",
    "timestamp": 1757541600
  },
  {
    "username": "selwyth",
    "rating": 9.0,
    "comment": "I suspect this will soon be a 10. Like Cosmic Encounter, a piece of alien technology that was ahead of its time in a bygone era. This influenced so many afterward. The cardplay isn't as intricate as in other CDGs (i.e. no need to disaster-manage mandatory events), but it more than makes up for it with dynamic boardplay and possibilities for wild maneuvers. Cut your opponents' supply/LOC off, and compete for majorities in provinces to get combat bonuses and zero-sum points. Combat is its own minigame and still original, and is welcome in a 2-player game (almost like those turn-based strategy games where we leave the global map and enter a tactical battlefield).\n\nThe only potential misgiving I have is the rich-get-richer snowball that severely punishes early missteps and gives the early loser no help at turning the tide besides just hoping for a better card draw. I'm not asking for a bludgeon to help the loser, like in Antike Duellum, but I like subtle ways of implementing a rubber band effect e.g. maybe the smaller my controlled area, the easier it is to manage and counter-attack. Wait-and-see on whether this holds it back from a 10.\n\n-----------\n\nFinally played a real game as Rome that went the distance and evoked the history. Attritional warfare at the start to slow Hannibal down and achieve a 'soft landing' until Scipio can arrive to turn the tide. A venerable classic. The only drawback is it is so, so unforgiving to new players, and punishes any mistake.\n\n5+4",
    "timestamp": 1754344800
  },
  {
    "username": "Doomfarer",
    "rating": 10.0,
    "comment": "Had it and sold it ages ago. Still the same great game!",
    "timestamp": 1759615200
  },
  {
    "username": "SFRR",
    "rating": 9.8,
    "comment": "One of the best 2p CDG's ever invented. Very balanced and possesses a variety of strategies available to each side to win. Truly a classic. This is one of the finest board game designs ever made. Along with \"We the People\" (the 1st CDG, the game that invented the genre), these two CDG board games define the highest bar of game design quality in the CDG genre.",
    "timestamp": 1759615200
  },
  {
    "username": "Alquerque",
    "rating": 9.5,
    "comment": "El primer CDG propiamente dicho, que cogió el innovador diseño de We The People y lo elevó en profundidad sin complicar demasiado las reglas. El hecho de que todas las cartas tengan puntos de operaciones y eventos crea ese dilema tan característico de este sistema, y apareció por primera vez aquí, de forma elegante. El juego es asimétrico pero al mismo tiempo equilibrado, reproduciendo las opciones y los dilemas estratégicos que tuvieron ambos bandos en la historia representada. El combate con cartas de batalla es un juego en sí mismo, aunque pueda alargar en exceso la partida.",
    "timestamp": 1751320800
  }
]