[
  {
    "username": "Invisible School",
    "rating": 1.0,
    "comment": "I almost died of boredom between moves. This game will kill you. For real.",
    "timestamp": 1363993200
  },
  {
    "username": "jtrleone",
    "rating": 1.0,
    "comment": "Learning Curve: 6/10\n\nStrategic Balance: 2/10\n\nPlayer Interaction: 3/10\n\nThematic Direction: 9/10\n\nReplay Addiction: 2/10\n\nAdditional Information\nMy brother and I tried this because we forgot why it was so bad. As soon as we first moved, we remembered. Some players NEVER move. In theory it should be equal, but EVERY TIME WE PLAY, one player gets all the moves and another gets NONE. Also, if a player controls a King's Commissioner, the pirate cannot run away no matter what. Pirates need more actions (Attack, Fix, D&R, Sell, etc.) whereas KC's only move and destroy. Doesn't help that their numbers are outrageous. So overall it's a sucky game. Cool theme, but game mechanics will bore you to tears.\n\nI'd probably rate it a 2 if there were female pirates, but no this game is sexist.",
    "timestamp": 1340834400
  },
  {
    "username": "Kenfeldman",
    "rating": 1.0,
    "comment": "It feels like multi-player solataire. One of the big problems is that you have to wait a random amount of time between turns. you might go back to back or you might just be watching for an hour or so.\n\nIn the 3 or 4 times I played this, I never saw anyone amass enough points to win.",
    "timestamp": 1315864800
  },
  {
    "username": "joe krow",
    "rating": 1.0,
    "comment": "Why are we playing this again?",
    "timestamp": 1106348400
  },
  {
    "username": "Nick Barker",
    "rating": 1.0,
    "comment": "Somehow this game takes a potentially interesting subject and turns it into an incredibly boring game. The fiddly mechanisms (typical for Berg) and \"amusing\" event tables do not compensate for the excessively long length and the downtime between player turns, which can be up to an hour depending on the play of the cards.",
    "timestamp": 1101078000
  },
  {
    "username": "Aroquesada",
    "rating": 2.0,
    "comment": "Un par de partidas no registradas.\n\nTuve la versión antigua de Avalon Hill y me pareció farragosa hasta el extremo.\n\nAunque en un primer acercamiento el juego parecía magnífico, en la práctica la microgestión, la multitud de excepciones y reglas poco intuitivas lo hacen muy poco ágil. Como consecuencia me resultó un suplicio desde el principio. Y eso que estoy hablando de una época en la que la oferta de juegos era mucho menor que la de ahora...\n\nTampoco acabo de comprender como GMT ha reeditado este juego que desde luego pertenece a otra época (las ventas además creo que no han estado a la altura, cosa que no me sorprende).",
    "timestamp": 1391209200
  },
  {
    "username": "oceano",
    "rating": 2.0,
    "comment": "A lot of rules. Almost no choices. This means very bad, for me.",
    "timestamp": 1364767200
  },
  {
    "username": "mats-k",
    "rating": 2.0,
    "comment": "A pox on this game. The random turn mechanic is truly awful, and it's an overly long luckfest when you actually get to do anything. I suppose it's rather educational, though.",
    "timestamp": 1134774000
  },
  {
    "username": "JackRandom",
    "rating": 2.0,
    "comment": "Overly complex game that hides the fact that - it is all about luck!!!\nAs some guy wrote in his comment, 'more like a simulation to be watched rather than played', I couldn't agree more.",
    "timestamp": 1124316000
  },
  {
    "username": "beaslera",
    "rating": 2.0,
    "comment": "Boring. The multiplayer game takes too long for the amount of fun...a crime for a game about pirates. I think it's the combination of randomness and game length that kills it for me.",
    "timestamp": 1090792800
  },
  {
    "username": "dashiva",
    "rating": 3.0,
    "comment": "Basically snakes and ladders with extra steps. Who wins will mostly be determined by a random storm, rather than any tactic or strategy. High degree of nostalgia though, as I played it as a kid",
    "timestamp": 1690668000
  },
  {
    "username": "mazzyfred",
    "rating": 3.0,
    "comment": "Convoluted mess.",
    "timestamp": 1608678000
  },
  {
    "username": "plysbjorn",
    "rating": 3.0,
    "comment": "Haven't played. Seems fiddly though(Hey it's AH!).\nSold it.",
    "timestamp": 1585004400
  },
  {
    "username": "sammysamurai",
    "rating": 3.0,
    "comment": "Just a chaos simulator.",
    "timestamp": 1569794400
  },
  {
    "username": "Inmarg",
    "rating": 3.0,
    "comment": "You'll grow a pretty large beard by the time this game finishes.",
    "timestamp": 1386543600
  },
  {
    "username": "BartholomewPots",
    "rating": 4.0,
    "comment": "Interesting concept around being a pirate in the Caribbean but visually unexciting and the rules are dreadful. Sounds much better than it is.",
    "timestamp": 1658354400
  },
  {
    "username": "Matthew_Eklund",
    "rating": 4.0,
    "comment": "Just not enough player to player interaction. Nice map though.",
    "timestamp": 1590789600
  },
  {
    "username": "Yttrenolv",
    "rating": 4.0,
    "comment": "Simulation game, but way too ambitious. One of these games trying to cover everything. Takes way too much time to finish a game. Game pace is very slow, what you can do as a player is not very fun.",
    "timestamp": 1585263600
  },
  {
    "username": "davegw78",
    "rating": 4.0,
    "comment": "Not sure which edition.",
    "timestamp": 1567893600
  },
  {
    "username": "JasonSaastad",
    "rating": 4.0,
    "comment": "prolonged playtime",
    "timestamp": 1543878000
  },
  {
    "username": "kaptain1",
    "rating": 5.0,
    "comment": "very fiddly but can be fun. Drags a bit.",
    "timestamp": 1751148000
  },
  {
    "username": "Navalgamer2",
    "rating": 5.0,
    "comment": "If you are a compete masochist, play this game. I cannot believe it got reimplemented. The random play sequence dooms what might have otherwise been a good game covering an interesting period.",
    "timestamp": 1736636400
  },
  {
    "username": "Yokiboy",
    "rating": 5.0,
    "comment": "Blackbeard is a good simulation of the golden era of piracy, but a bit clunky as a game.",
    "timestamp": 1728597600
  },
  {
    "username": "Paulis72",
    "rating": 5.0,
    "comment": "It's a great game, but the complexity level is high, as in most old Avalon Hill games.",
    "timestamp": 1701817200
  },
  {
    "username": "turntable",
    "rating": 5.0,
    "comment": "My childhood game group enjoyed this game when were kids in the 90s, but by comparison to modern games, the game has a lot of pointless complexity and fiddly bits and is extremely random.\n\nLike a lot of games from the era, it combines the complexity of a mid-heavy Euro, like Tzolkin or Agricola (with much more fiddliness and longer play time) with the tactical and strategic depth of something like Munchkin, Bang, or Flux.\n\nPersonally, I'd never play this game again other than out of nostalgia, but it wasn't a bad game for its time.",
    "timestamp": 1684620000
  },
  {
    "username": "williamhillis",
    "rating": 5.0,
    "comment": "I regard Blackbeard as a good introductory board game for preteens and others who may be interested in exploring more sophisticated wargames in a year or two. The pirate descriptions are entertaining and educational.",
    "timestamp": 1640646000
  },
  {
    "username": "usfbrown",
    "rating": 5.0,
    "comment": "Rules were too much of a mess. The gameplay didn't seem worth the slog.",
    "timestamp": 1595973600
  },
  {
    "username": "Llofwyr2",
    "rating": 5.0,
    "comment": "In terms of theme, it is great.\nIn terms of rules it is as clunky as most games from that era. When we didn't know how it could be better.",
    "timestamp": 1593122400
  },
  {
    "username": "jcarvin",
    "rating": 5.1,
    "comment": "I tried but this just isn't my style of game.",
    "timestamp": 1579129200
  },
  {
    "username": "atanakar",
    "rating": 5.0,
    "comment": "Hilarious & fun but the random activation killed the game for us.",
    "timestamp": 1569189600
  },
  {
    "username": "adamolanna",
    "rating": 6.0,
    "comment": "mi divertii molto quando ci giocai nel 1997 in un negozio di giochi a Napoli",
    "timestamp": 1755122400
  },
  {
    "username": "Tariff",
    "rating": 6.0,
    "comment": "Good fun old skool game. The rules are a bit impenetrable and there is a lot of options on a turn, but the game is enjoyable if you like \"ride\" type games. Components are of their time, perfectly serviceable.",
    "timestamp": 1749247200
  },
  {
    "username": "Kaiser116",
    "rating": 6.0,
    "comment": "AH",
    "timestamp": 1736290800
  },
  {
    "username": "ajpyyzajp",
    "rating": 6.0,
    "comment": "A lot die rolling and luck involved but very thematic and always an interesting story. Has some very interesting concepts and glad that actual historical pirates are portrayed and cartoonish versions of them. Wish they would have and actual abilities instead of just different dr modifiers. A decent game for its time but I think this one could have been much better if cut back on so much swingy randomness throughout.",
    "timestamp": 1732489200
  },
  {
    "username": "adamw",
    "rating": 6.0,
    "comment": "Old school in every respect: components, rulebook, randomness, odd systems and odd mechanisms. It makes for a nostalgic experience. Unfortunately, it does not know when to get off the table and feels very solo during play. It definitely has a pirate vibe going on.",
    "timestamp": 1720389600
  },
  {
    "username": "kastel",
    "rating": 6.0,
    "comment": "Dc0",
    "timestamp": 1717797600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 6.0,
    "comment": "I recall playing this game at a convention when it first came out. Don Greenwood taught the game.",
    "timestamp": 1717365600
  },
  {
    "username": "Han_Heinrich",
    "rating": 6.0,
    "comment": "Bring LOTS of time. The complexity and randomness is a little too high.\nBut you get an extraordinary game experience.",
    "timestamp": 1663452000
  },
  {
    "username": "echelon",
    "rating": 6.0,
    "comment": "Not a bad play idea, the implementation however is a whole different ball game. Total randomness in player turn order could severely elongate downtime. I distinctly remember a fellow player having had to wait over an hour for his turn, which made the game a miserable experience for him albeit hilarious, riotous even, for everyone else.\n\nSadly, there were not a whole lot of board gaming options back in the early 1990's",
    "timestamp": 1657836000
  },
  {
    "username": "collezionista",
    "rating": 6.0,
    "comment": "50",
    "timestamp": 1649714400
  },
  {
    "username": "Nodens",
    "rating": 7.0,
    "comment": "Berg should've gotten a PhD for his research.",
    "timestamp": 1756677600
  },
  {
    "username": "alcazar",
    "rating": 7.0,
    "comment": "OK-ish. Not quite as jolly as it might have been",
    "timestamp": 1755208800
  },
  {
    "username": "Jacko9627",
    "rating": 7.0,
    "comment": "Quite a complicated pirate game, but still one of the best.",
    "timestamp": 1737759600
  },
  {
    "username": "bluestem",
    "rating": 7.0,
    "comment": "Fine older game for 2.",
    "timestamp": 1736895600
  },
  {
    "username": "AMI_SOLGER",
    "rating": 7.0,
    "comment": "played a few times in the past\nEnjoy and exciting piracy game\nBurned on September 30, 2024",
    "timestamp": 1733698800
  },
  {
    "username": "fletch49er",
    "rating": 8.0,
    "comment": "Immerse yourself in 16th century piratey goings on. I've had this game for years and I still enjoy bringing it out and blowing off the cobwebs and Buckling my Swash for an hour or two.\nEvade Warships, King's Commissions and rival Pirates as you seek out those lavish but illusive prize merchants in the North Atlantic, Caribbean, Indian Ocean and The Ivory Coast. Hoarding your booty whilst gaining Notoriety.",
    "timestamp": 1758405600
  },
  {
    "username": "Zerosum",
    "rating": 8.0,
    "comment": "This is the only game about pirates I know of that really is about pirates, as opposed to fictional Hollywood film characters (Captain Blood excepted). Extremely random, very thematic. Sort of like DungeonQuest - go in expecting the worst. Fate and the developing narrative provide the thrill. It really only works well solo or 2-player - I do not recommend this game with 3 or 4.\n\nReview: http://boardgamegeek.com/thread/1358620/",
    "timestamp": 1738364400
  },
  {
    "username": "JohnnyDgame",
    "rating": 8.3,
    "comment": "2nd",
    "timestamp": 1730242800
  },
  {
    "username": "WBRP",
    "rating": 8.0,
    "comment": "Grand fun...even solo.\n\neBayed Sep 2024 for CDN$30",
    "timestamp": 1727128800
  },
  {
    "username": "chazoom2",
    "rating": 7.5,
    "comment": "$50.00USD",
    "timestamp": 1723759200
  },
  {
    "username": "AnyMouse",
    "rating": 9.0,
    "comment": "Haven't played this in years. I need to dust the rules off sometime soon.",
    "timestamp": 1749074400
  },
  {
    "username": "john2059",
    "rating": 9.0,
    "comment": "About to embark solo.",
    "timestamp": 1737241200
  },
  {
    "username": "firebird144",
    "rating": 9.0,
    "comment": "Rules could have been organized better.",
    "timestamp": 1727647200
  },
  {
    "username": "jshanks",
    "rating": 9.0,
    "comment": "More of a simulation than a game, and yet great fun if you can accept that (and especially if you enjoy a good challenge).",
    "timestamp": 1685484000
  },
  {
    "username": "Dick Dobbins",
    "rating": 9.0,
    "comment": "You have to use the index extensively at first to figure out the actions and nuances. Once you become accustomed to attacking ports and merchants, this is THE pirate game to own. especially if you like actual historical characters.",
    "timestamp": 1683756000
  },
  {
    "username": "Magnus Maximus",
    "rating": 10.0,
    "comment": "Holy crap this game is awesome. The detail and historical accuracy are achieved without making it fiddly or tedious to play, like many other hex and counter simulation style games of the era. The cards do the heavy lifting and the number of functions the single deck serves is impressive and a design triumph. Great game",
    "timestamp": 1745272800
  },
  {
    "username": "abraham blauvelt",
    "rating": 10.0,
    "comment": "Classic Avalon Hill game. Realistic, pirates often end up dead. On my top 10.",
    "timestamp": 1735858800
  },
  {
    "username": "DimitrisT",
    "rating": 10.0,
    "comment": "Έχω την μετάφραση στα ελληνικά από ΚΑΙΣΣΑ (σε φωτοτυπίες από το 1994) μένει να στήσω τους κανονισμούς σε μια πιο ευανάγνωστη σελιδοποίηση, κάποια στιγμή.",
    "timestamp": 1691877600
  },
  {
    "username": "Wodoom",
    "rating": 10.0,
    "comment": "Avalon hill at their best. For everyone who loves fiddlyness and real pirates. cannons pointing at streamlining....aaand sunk.",
    "timestamp": 1639954800
  },
  {
    "username": "ledzep571",
    "rating": 10.0,
    "comment": "own it.",
    "timestamp": 1478300400
  }
]