[
  {
    "username": "shannona",
    "rating": 1.0,
    "comment": "Gave it away rather than inflicting it on my friends.",
    "timestamp": 1292886000
  },
  {
    "username": "kimbo",
    "rating": 2.0,
    "comment": "Didn't like the party-game \"I dare you...\" feature of the game. This interjected \"real world\" silliness into the fantasy setting of the game. Could have been a good game if design stuck to the Darkover theme. Played pre-BGG.",
    "timestamp": 1310680800
  },
  {
    "username": "sirjolt",
    "rating": 3.0,
    "comment": "Hard to figure out what they were going for with this game. The game isn't hard but there's nothing to it without extensive modification; especially to combat.",
    "timestamp": 1551135600
  },
  {
    "username": "MitchellW",
    "rating": 4.0,
    "comment": "My desire to play this game is definitely influenced by mood. Several of the mechanics are weird, and as a result I rarely desire to play it. But when I do desire to play it, it's fun, area control, combat, and each player has special power kinda magic game.",
    "timestamp": 1357081200
  },
  {
    "username": "cbow54",
    "rating": 5.0,
    "comment": "Played in my youth bought on the strength it was from the creators of cosmic encounter. Just too out there for myself these days but quite original in 1979.",
    "timestamp": 1606950000
  },
  {
    "username": "garyj",
    "rating": 5.0,
    "comment": "Tried this once but didn't finish it. Not sure there is a complete game here",
    "timestamp": 1293663600
  },
  {
    "username": "leonhartsebastien",
    "rating": 6.0,
    "comment": "Un jeu très étrange, légèrement inclassable dans la mesure ou il se situ nulle part. Présenté comme un wargame classique, avec des prise de territoire et des combats. La résolution de certaines situations forcent les participants à sortir le jeu de la boîte pour les se présenter dans le présent en les forçant a effectuer une ou des actions dont le niveau de folie sera proportionnelle à la folie des joueurs autour de la table.\nUn jeu qui peut complètement déraper et qui pour cette raison n'est pas à mettre entre toutes les mains.",
    "timestamp": 1540245600
  },
  {
    "username": "Robin Hood",
    "rating": 6.0,
    "comment": "As everyone has already said this game is great when you are 16 as it has amusing practical resolution systems that mildly embarrass everyone over the age of 25.\nGiven that the books were based around the fact that the planet caused the development of psi powers and also routinely assaulted our heroes with the aphrodisiac and disinhibiting \"Ghost Wind\" I do suspect this may have been best played while under the influence of a 1970's hippy substance I once heard about.",
    "timestamp": 1477692000
  },
  {
    "username": "mi_de",
    "rating": 7.0,
    "comment": "Got it for $15- and it sat for more than a decade. Can't believe the terrible ratings. it was quite fun and good to loosen up a group and very innovative. Silly, to be sure, but fills a real missing gap in my collection. The dares preformed in our first game, including holding your ear by wrapping your arm around your head for fifteen minutes and eating a teaspoonful of cinnamon were quite memorable.",
    "timestamp": 1417820400
  },
  {
    "username": "Blazix",
    "rating": 8.0,
    "comment": "Great combination of strategy and hilarity!\nBest played only with friends however.",
    "timestamp": 1460930400
  },
  {
    "username": "ionas",
    "rating": 9.0,
    "comment": "A rare gem of interaction, strategy and psychic fun!",
    "timestamp": 1665698400
  },
  {
    "username": "jelsepa",
    "rating": 10.0,
    "comment": "This is probably the most eclectic, eccentric, unique and embarrassing game I've ever played. It tests your limits as to what you're ready to sacrifice in real life in order to win at a game. This game is not for the feint of heart or those who are looking for a blockbuster resource management. Darkover is only for those courageous and ambitious enough to try something so different who will enjoy its madness. Some say it is stupid, others will be able to understand how mind-twisting this game can be.\n\nOne of the best and memorable experiences I've had in boardgames for years to come. I'll play it anytime with anyone courageous enough to play it with me. Or against me. See you in a psychic conflict!",
    "timestamp": 1664920800
  }
]