[
  {
    "username": "chally",
    "rating": 1.0,
    "comment": "Imagine that you’re playing a Monopoly variant. The rule changes are these:\n(1) Every property begins with a hotel.\n(2) You get $2,000 for passing Go, and it provides the game’s only opportunity to purchase property (one of your choice).\n(3) Every time you roll, you can decide whether to go backward or forward.\n(4) Every time you land on a property, you can choose to instead land on any other property of the same color.\n(5) The dice are weighted so that the odds of landing on properties are wildly divergent.\n(6) Those odds are not reflected in the purchase price of the properties.\n(7) You win by collecting $30,000.\n\nThe resulting five-hour, dice-rolling, sandbagging, kingmaking mess of a game, full of meaningless decisions and wild swings of luck, would not be terribly different than playing a game of Rail Baron.\n\nIn Rail Baron, each player is...I don’t actually know. It’s a little confusing. But here’s how it works. You roll dice and consult a chart. That tells you your destination (say, Memphis). You roll dice each turn to move your piece (representing a train?) toward your destination. On the way, you choose whether to take rail lines owned by your opponents (paying them money for the privilege) or those owned by you or the bank (paying the bank considerably less money). Once you reach your destination, you get paid some money based on how far you traveled. Then you can buy an unowned rail line (and hope that others use it). Next turn, you roll for a new destination. That’s right: random goals, random movement, and the only choices are either to save money (obvious) or, if you can’t, to choose which other player you want to give money to. You do this for hours.\n\nDespite the fact that Rail Baron barely qualifies as a game, I actually had a good time playing it. Something about the experience was simply so over-the-top absurd that those of us who were desperately flailing around in last place with no hope of winning just kept laughing at the nonsense of it all. If nothing else, the sheer length of the game also gives it a sense of grandeur missing from today’s balanced 45-minute Euros. So the game gets a surprisingly higher rating than I would have expected from the mechanics. I actually had fun, and I hope to never play it again.",
    "timestamp": 1329174000
  },
  {
    "username": "Osiris Ra",
    "rating": 1.0,
    "comment": "Monopoly for train buffs. That the same people who pan Monopoly like this game makes as much sense as walking a pet lobster on a leash.",
    "timestamp": 1324249200
  },
  {
    "username": "enavico",
    "rating": 2.0,
    "comment": "- Horribly long and boring ancestor of the crayon rail games",
    "timestamp": 1751752800
  },
  {
    "username": "Pandorzecza",
    "rating": 1.5,
    "comment": "Old",
    "timestamp": 1636758000
  },
  {
    "username": "thisisnotatest",
    "rating": 3.0,
    "comment": "The 1977 Avalon Hill board game Rail Baron is nostalgic for me, but it does not hold up. The map is beautiful and historically accurate, but you make about six interesting decisions across a 4-hour game full of roll-and-move, bookkeeping and squinting at lookup tables. I'm not even exaggerating. It's actually worse than Monopoly.\n\nLuckily better board games have been designed since 1995.",
    "timestamp": 1719784800
  },
  {
    "username": "Carlos Palomino",
    "rating": 3.0,
    "comment": "Somewhat abstract simulation of railroad development across America. This title has aged; its mechanics are more roll-dice/check-chart intensive than more recent titles. Also, a typical game session turns on a number of fairly shallow decisions.\n\nAccordingly, I play a shortened variant; reducing the cost of each railroad by about half. Without this variant this title is not worth the time.",
    "timestamp": 1618264800
  },
  {
    "username": "nechrach",
    "rating": 4.0,
    "comment": "monopoly knock off",
    "timestamp": 1535407200
  },
  {
    "username": "Stephan Valkyser",
    "rating": 4.0,
    "comment": "Horribly confusing board where it is a total pain to check which line, that the current player is using, is belonging to which player. The game itself feels like an advanced version of Monopoly.",
    "timestamp": 1488495600
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "It might not be bad, but its a game from the 60s and when you compare its rules and components to todays games you can't even convince yourself to play it. Also the worst written rules I've ever seen in like 8 point text.",
    "timestamp": 1750888800
  },
  {
    "username": "CTWarlord",
    "rating": 5.0,
    "comment": "Previously rated 8. Recently replayed with my local club. The strategy portion is all at the beginning, followed by multiple hours of moving around the map waiting for someone (usually obvious who) to get the $200K and win.",
    "timestamp": 1743890400
  },
  {
    "username": "RaffertyA",
    "rating": 5.0,
    "comment": "Overall a pretty good game. Easy to get new gamers to play and is still a challenge for more experienced gamers. As with many (most/all) games involving strategy and risk-taking, knowledge of the game is a big advantage over novice players. The game length and the fussiness of rolling for Destinations and especially determining Payoffs lowers the rating one point.\n\nCrayon Rails are better games that take just as long and 18XX are FAR better games that can be as long (18AL or 18GA) but usually longer (and worth it).",
    "timestamp": 1690668000
  },
  {
    "username": "Zalasta",
    "rating": 5.0,
    "comment": "Glorified roll and move game with perhaps a bit more theme than the mass market titles of the same era. I will admit I played this over 10 years ago then promptly forgot about it, and in re-reading the rules to write this, I can see why Rail Baron was such an unmemorable experience. It may have been passable as a good game in the past, but with so many choices now, this has become outdated and easily replaceable.",
    "timestamp": 1647990000
  },
  {
    "username": "perfectcaptain",
    "rating": 6.0,
    "comment": "Amusing, but takes forever",
    "timestamp": 1752098400
  },
  {
    "username": "RogerDHyman",
    "rating": 6.0,
    "comment": "A nice game, nothing life-changing. Very nice components (especially for the time it was printed. I always wanted to design my own variants to reflect \"modern mergers\", etc.\nVery much a \"race game\"; good family game.",
    "timestamp": 1711753200
  },
  {
    "username": "Mattchsttick",
    "rating": 6.0,
    "comment": "Dreadful game, but I still like it, mostly from nostalgia.",
    "timestamp": 1675724400
  },
  {
    "username": "grognard72",
    "rating": 6.0,
    "comment": "Played this one around 10 times back in the day. Say from late 70's thru early '90's. Then played more of the other railroad games.\n\nStill, I'd play again, but only with 3, maybe 4. It doesn't work above that.\n\nThis is the 1st edition maps, in a box that matches the 2nd edition box images here on BGG.",
    "timestamp": 1675551600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "I played a lot of this years ago. Now many years have passed. I find that I want to play it again! I wonder if anyone will want to play it again? Sentiment keeps it on my shelf.\n\nNon-essential",
    "timestamp": 1757628000
  },
  {
    "username": "russellg",
    "rating": 7.0,
    "comment": "Played many times back in the day. Unplayable by modern standards.",
    "timestamp": 1753135200
  },
  {
    "username": "notalanah",
    "rating": 7.5,
    "comment": "Granted, a lot of the fun for me comes from nostalgia. I always played this with my dad and brother on snow days when we were young. Now we make an effort to play it on winter breaks. Only play once or twice a year, but I always have a good time.",
    "timestamp": 1737673200
  },
  {
    "username": "bluestem",
    "rating": 7.5,
    "comment": "One of our gaming group's favorites from the early days.",
    "timestamp": 1736895600
  },
  {
    "username": "ElectricKetchup",
    "rating": 9.0,
    "comment": "played this game so many times with extended family",
    "timestamp": 1741302000
  },
  {
    "username": "DonJunk",
    "rating": 9.0,
    "comment": "Last Verified\nFebruary 8, 2025\n\n~$35 - $70\n$100 for new",
    "timestamp": 1739055600
  },
  {
    "username": "WaywardWarlord",
    "rating": 10.0,
    "comment": "PUNCHED",
    "timestamp": 1737241200
  },
  {
    "username": "drtufte",
    "rating": 10.0,
    "comment": "Introduced my kids to this one, and my daughter is a fanatic. They actually argue about who gets the game when I die. Will need to buy one for each I guess.\n\nThis one definitely benefits from some of the optional rules that people have published online.",
    "timestamp": 1712613600
  }
]