[
  {
    "username": "dold_",
    "rating": 1.0,
    "comment": "I thought I would prefer crayon rails to all the tiles in Railways of the World, After playing about halfway through Iron Dragon though, I'm not sure. Most of the issues I had with Iron Dragon didn't have to do with the crayon rails.\n\nI didn't like the demand cards, as it is a very complex logistics puzzle to solve right at the start of the game, and I generally don't like having to do a ton of planning at the start of the game. In a game that really wants you to plan long term, the demand cards require you to react to them, unless you want to redraw cards. The turn structure also doesn't manage time very well - getting a demand card right before you build means you have to stop and think in the middle of your turn. I'd rather get the card at the end of my turn, so I could plan for it during my downtime, even if that means I don't build for a turn.\n\nI really disliked marching a pawn up and down the map. It takes up a lot of your dexterity and sometimes it is all you do, but it isn't interesting at all - it's literally roll and move minus the roll part.\n\nAnd the length of time it takes doesn't feel worth it, because it doesn't feel like you are getting more done, because you always have to spend a ton of time traveling back and forth.\n\nEDIT: Playing a 2nd time made the demand cards less difficult to figure out a plan around. However, much of the turn to turn gameplay is simply boring. Once you have routes down, you basically stop playing the game - you just have to run your train up and down what you built. But the game still takes a long time to wrap up, despite being more or less on auto-pilot.\n\nGood play involves counting out route lengths almost constantly, which is the definition of tedious.\n\nEdit 1/2024: I respect my friends like Iron Dragon, and they have a good time, which I deduce because they didn't quit it early today. I wish they did though, because the game absolutely vaporizes time. I wasn't even playing Iron Dragon today, and it still almost managed to ruin part of game day today because of so much uncertainty around how long the game was going to take. How much longer they had to play was up to the random draws, and I have no respect for a game that disrespects the players' time like that.\n\nWelcome to the 1/10s, Iron Draging.",
    "timestamp": 1704150000
  },
  {
    "username": "suekuku",
    "rating": 1.0,
    "comment": "See my review on Eurorails. Ugh.",
    "timestamp": 1581807600
  },
  {
    "username": "sbailey",
    "rating": 1.0,
    "comment": "Why???",
    "timestamp": 1075158000
  },
  {
    "username": "Arnott",
    "rating": 1.0,
    "comment": "I know, giving this a \"1\" is unfair... but I just HATED this game. Besides, who said life was gonna be fair? (Disclaimer: I'm not a big fan of any of the crayon rails games)",
    "timestamp": 1061071200
  },
  {
    "username": "haihappen",
    "rating": 2.0,
    "comment": "Bad:\nDowntime is a big issue.\nThe event cards are catastrophe cards.\nThe board symbols and text are too small and bad to read.\nConstant cross-referencing between card, board legend, and map.\n\nGood:\nDrawing your rails is nice.\n\nGame design has moved a lot since '94.",
    "timestamp": 1600034400
  },
  {
    "username": "eimative",
    "rating": 2.0,
    "comment": "This game was made for (and likely by) folks who enjoyed the vintage map system of old D&D games. In today's game universe the game looks wholly outdated and is impractical on so many levels: squinting at miniature icons on the board, impossible to read crayon lines on a busy board, having to play a word search game every time you need to find a city or resource on the board, and the painfully slow way in which your train creeps over the board.\n\nThe heart of the game is a double layered route building mechanism (build a route. then move over it) which is perfectly fine, however; it becomes a serious slog to play as the win condition will take forever to reach.\n\nIt was one of the most painful games I have ever had to play.",
    "timestamp": 1509318000
  },
  {
    "username": "Genghis_Kob",
    "rating": 2.0,
    "comment": "Too much randomness for an economy builder. You win or lose entirely on what cards you draw. Negligible interaction between players; game is basically four hours if solitaire.",
    "timestamp": 1503007200
  },
  {
    "username": "dkearns",
    "rating": 2.0,
    "comment": "Eurorails this isn't. Board is way too big making starting hand too influential and exacerbates luck in future draws. All of the extra crap tacked on is lame and detracts from the crayon rails experience. Difficult and annoying to find cities. Geek factor is off the charts. \"See we play TRAINS shaped like DRAGONS and drive through DUNGEONS to pick up WANDS and sell them to GNOMES.\" Good grief, too geeky even for me.",
    "timestamp": 1453935600
  },
  {
    "username": "wkover",
    "rating": 3.0,
    "comment": "A yard sale score I can't wait to unload.\n\nUpdate:\n\nPart of the summer '25 \"owned and unplayed\" crusade. Rating based on the '94 original.\n\nI wasn't a fan of Empire Builder, and this is more.\n\nThe first thing I did was grab tokens to mark goods sources (zombies) and demands (shiny beads) on the polka-dotted map. I'm guessing most fans - especially solo gamers - do the same to minimize the organizational insanity.\n\nUnexpected surprises:\n\nYard sales rule. Load chips already stickered? Awesome. Sure, the board is peeling. But so are my orc-whipped flanks.\n\nJay Tummelson is listed first in the playtester list. Nice. In the early 2000s, JT was well known as the Rio Grande Games rep at east coast conventions. He loved to teach & play, and his con presence was always welcome.\n\nI like that Uloggh Orcs evolved from great danes. Sweet.\n\nRusty wheels and snapped coupling rods:\n\nThe design is so '90s it hurts: Barbed wire borders (?), an all-male foreman cast, paper gold pieces, overly similar goods symbols (e.g., fur/ale, fruit/hops), savagely unfair events, and a long and grating playtime.\n\nIn the crayon genre, goods locations are buried in player aid tables. You want sheep? Hit the books, pal.* The mental uptime and logistical downtime are unfriendly to new players, especially with imaginary city names.\n\nLastly and leastly, crayon rails are the precursor to the \"multiplayer-yet-solo\" efficiency Europuzzles that are inescapable in modern times. Not my thing.\n\n*Admittedly, small goods icons *are* printed on the board. So it's legal to use opera glasses instead of reference tables. Good luck with that.",
    "timestamp": 1752703200
  },
  {
    "username": "genresavvy",
    "rating": 3.0,
    "comment": "This game is far too long and boring. Slow train movement with no interesting mechanic for the basic pick up and deliver game this is.",
    "timestamp": 1677020400
  },
  {
    "username": "ExplodingSnail",
    "rating": 3.0,
    "comment": "A relic that should have been left in the past.",
    "timestamp": 1659996000
  },
  {
    "username": "OldPhartWargamer",
    "rating": 3.0,
    "comment": "Played this at a meetup once. Be prepared to have your eyeballs ache after staring at the tiny printing and tiny spaces on this board.",
    "timestamp": 1566424800
  },
  {
    "username": "Pandorzecza",
    "rating": 4.0,
    "comment": "Ok",
    "timestamp": 1636758000
  },
  {
    "username": "stayman",
    "rating": 4.0,
    "comment": "Alomst broken unless your have 4-6 hours to completely waste. It's very long, very convoluted. If your idea of fun is sitting around playing three back to back games of empire builder (A game I really like) then this game is for you.",
    "timestamp": 1625868000
  },
  {
    "username": "Matthew_Eklund",
    "rating": 4.0,
    "comment": "Empire Builder meets dragons... well not really dragons... more like trains that pick stuff up and carry it on tracks to various destinations for money...\n\nBut like dragons they breathe fire, fight each other, and have a tendency to eat people... oh wait... no they don't... they're just trains.",
    "timestamp": 1590789600
  },
  {
    "username": "Warren Bruhn",
    "rating": 4.0,
    "comment": "Takes a bit too long to play this one for the patience of modern kids and adults. Should have had more things to do in the underground. That was an interesting concept that should have been expanded.",
    "timestamp": 1567029600
  },
  {
    "username": "FrankRyan",
    "rating": 5.0,
    "comment": "Just like all the other crayon rail games but with a fantasy theme.",
    "timestamp": 1704754800
  },
  {
    "username": "fizzle",
    "rating": 5.0,
    "comment": "The additional features in Iron Dragon over Empire Builder look good on paper. They add a bit more richness and variation to the basic system, although the fantasy setting is as pasted on as they come. Those rich new playthings also add to the playtime, however, and for a mostly solitaire logistical puzzle it comes dangerously close to excessive. More old-school than I'm prepared to accept.",
    "timestamp": 1616886000
  },
  {
    "username": "bismarck1871",
    "rating": 5.0,
    "comment": "I love the Empire Builder series, but this variant just did nothing for me.",
    "timestamp": 1572303600
  },
  {
    "username": "Sigismundoh",
    "rating": 5.0,
    "comment": "1st impression (probably last). Only Crayon rails I've played, but if they are mostly similar I don't think I'm a fan or that they are one of the older games that have survived like 1830, Civ, El Grande etc. Overall it wasn't a total flop, but for the time it was not very engaging and just didn't have a good flow. Sometimes you have to wait a long time for a turn where you have no choice and move a few spaces (this can last for turns in a row) and then sometimes you need to math out a long route. Combined with the random card draws which can lead to either bad choices or forced hand changing plus the random events it just felt like it had lots of competitive problems for a game that takes as long as it does. Can't see why I would ever play this instead of 18xx or Age of Steam or Power Grid.",
    "timestamp": 1559512800
  },
  {
    "username": "discoking7",
    "rating": 5.0,
    "comment": "My favorite of the crayon rail games...but that's not saying much.",
    "timestamp": 1512514800
  },
  {
    "username": "jgoyes",
    "rating": 5.0,
    "comment": "2016-04-18\n\nInitial Rating: 7.0 (October 2010)\n\nIt’s been almost 6 years since I last played Iron Dragon, so I don’t remember much. I remember I thought the theme was excellent, but the playtime was VERY high, so my desire to play the game again is rather low.\n\nI also dislike games in which I have to physically write on the game boards, that’s a huge minus for me (The Crayon Rail System is NOT for me).\n\nIf I play the game again I will come back and make a proper comment.\n\nCurrent Rating: 5.0",
    "timestamp": 1461016800
  },
  {
    "username": "genbenkenob1",
    "rating": 5.0,
    "comment": "the theme is 'meh' for me; and most of the chrome only adds drag to your earning ability",
    "timestamp": 1460239200
  },
  {
    "username": "ALGO",
    "rating": 5.0,
    "comment": "Old edition with monochrome goods and very poor component quality. It seems odd with a game like this, but the full colour cards in my recent editions of Empire Builder and Eurorails make it feel more like a game and less like a chore. It certainly makes finding the bits a lot easier. It is very likely that I am really that shallow.\n\nAlso, more complexity is not really what I am looking for. I'm sure we'll dig this out some time, but for a game this long and repetitive I don't want to be squinting at symbols if I can avoid it.",
    "timestamp": 1417215600
  },
  {
    "username": "ericbinnyc",
    "rating": 6.0,
    "comment": "I simultaneously appreciate this lengthy shipping-and-logistics design while not being interested in playing another crayon rails game again.",
    "timestamp": 1757023200
  },
  {
    "username": "bitatmoonl",
    "rating": 5.5,
    "comment": "May 25 Dated design. the constant references to check where the city is and where the resources is very frustrating. the location on card should at least label the alphabet and number. very badly designed!",
    "timestamp": 1748642400
  },
  {
    "username": "Minorly",
    "rating": 6.0,
    "comment": "Long, slow, but unique and interesting to play at least once. Fun theming",
    "timestamp": 1743890400
  },
  {
    "username": "Eric Brosius",
    "rating": 6.0,
    "comment": "Not my favorite of the crayon rails series, but I'm willing to play it. It has a lot of glitz (glitz that takes extra time) so I wouldn't by preference teach it to new players, but if the setting draws them in and gives them the patience to want to play it, it can work.\n\nAlso, there's too much luck in the timing of the Rainbow Bridge event.",
    "timestamp": 1740178800
  },
  {
    "username": "Dmart",
    "rating": 6.0,
    "comment": "[MEAGHAN] One of the better crayon games, adding features such as ships (to aid with movement) and foremen (to aid with building). Still not enough interaction/confrontation for my liking, but enjoyable nonetheless.",
    "timestamp": 1735340400
  },
  {
    "username": "GuidoVanHorn",
    "rating": 6.0,
    "comment": "Before I was a proper hobby gamer my family got really into crayon rail games. I knew Iron Dragon existed but had never actually played it. Some people in my game group are big train gamers and played this occasionally, and one time I finally was able to play it. The map is a little confusing since you don't inherently know where any of the areas actually are, especially on an initial play, but the enhancements and twists are very cool. The randomness of events and unlucky contract draws makes it a little less of a game that I want to play these days but I think most people should give crayon rail games a try at least once in their life.",
    "timestamp": 1727215200
  },
  {
    "username": "ousgg",
    "rating": 6.3,
    "comment": "Some real advancements on the basic crayon rail mechanics, but also just a little too much whimsy to be really coherent.",
    "timestamp": 1714946400
  },
  {
    "username": "legolasegb",
    "rating": 6.0,
    "comment": "Fun, sprawling game with a ton of different ways to go, but be prepared for a SUPER long experience. A great game if you have the whole evening and are in the mood for a nice slow build-up over time.",
    "timestamp": 1714428000
  },
  {
    "username": "KatydidWonders",
    "rating": 7.0,
    "comment": "2-6",
    "timestamp": 1746136800
  },
  {
    "username": "laytox",
    "rating": 7.0,
    "comment": "EFORP10 - Much like Martian Rails, just a different setting. Game definitely shows its age. It's long for the sake of being long, could probably house rule it to shorten it up a bit. Still fun but actually finishing a game is a chore, most of the interesting decisions are made early on and then once everyone is connected to the requisite number of cities, it just drags on forever until someone finally wins. Didn't actually finish the game, we just decided it was over",
    "timestamp": 1742425200
  },
  {
    "username": "Gwydion19",
    "rating": 7.0,
    "comment": "Played many times a regular in the Mayfair rail building rotation.",
    "timestamp": 1737068400
  },
  {
    "username": "100pcBlade",
    "rating": 7.0,
    "comment": "I love ‘pick up and deliver’ type games and Crayon Rails do this as well as any other game. However, the big problem for me with the genre is the length. I don’t mind the length per se. Most 18xx games are longer than this after all but in 18xx you have a strategy and the game progress through different phases and your approach in each phase has to adapt. In Iron Dragon you also need a strategy but the mechanics of achieving that are more or less the same throughout and it can get a bit tedious (particularly if you end up having to redraw cards a few times until you find a delivery that suits your routes). If the game lasted just a couple of hours (perhaps with a smaller map) then I might really take to it",
    "timestamp": 1676934000
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Train Game\n\nI finally got to play a crayon rail game, something which I've been interested in trying for a while. I was taught by my friend Mark, since Iron Dragon is one of his favorite games. It's a fairly smooth pick-up-and-deliver game with almost too much freedom of expansion, given that you just drawn tracks on the board. I love the fantasy theme and how it's implemented, especially since none of it feels forced. I enjoyed this game a lot.",
    "timestamp": 1759356000
  },
  {
    "username": "GeminiWeb",
    "rating": 7.6,
    "comment": "Received via Math Trade!",
    "timestamp": 1754863200
  },
  {
    "username": "SylvaniaNights",
    "rating": 8.0,
    "comment": "The added complexity of foremen, ships, the underground, and more terrain types really brings the whole \"crayon rails\" concept to new heights here.",
    "timestamp": 1741388400
  },
  {
    "username": "Rygel",
    "rating": 8.0,
    "comment": "The best and biggest of the crayon rails. What is not to love. I also think this game is a little easier than some of the others because the pay outs are higher so money is easier to come by. Boats are great at saving money too.\n\nGot in 2008",
    "timestamp": 1731279600
  },
  {
    "username": "errorwick",
    "rating": 9.0,
    "comment": "My favorite rail game. Fun to build track and figure out how to solve the puzzle of connecting the main cities quickly and efficiently. Great casual game that is enjoyable and easy to learn.",
    "timestamp": 1729288800
  },
  {
    "username": "Marcus the Red",
    "rating": 9.2,
    "comment": "The best crayon train game out there.",
    "timestamp": 1707692400
  },
  {
    "username": "Spooncat",
    "rating": 9.0,
    "comment": "The best of the crayon games.",
    "timestamp": 1655071200
  },
  {
    "username": "mrtgr00",
    "rating": 9.0,
    "comment": "Fun game - crayon rails game in a fantasy realm.",
    "timestamp": 1644706800
  },
  {
    "username": "cenealon",
    "rating": 10.0,
    "comment": "2023 Top Games\n2024 Top Games\n2025 Top Games",
    "timestamp": 1757023200
  },
  {
    "username": "LoversQuarrel",
    "rating": 10.0,
    "comment": "If you can get your hands on a copy - BUY IT!\n\nA more complex but 100% NEXT LEVEL version of Ticket to Ride.",
    "timestamp": 1703372400
  },
  {
    "username": "NvidiaJunkie",
    "rating": 10.0,
    "comment": "Favorite of the entire series. The large amount of train upgrades and the seafaring makes for very varied gameplay.",
    "timestamp": 1675551600
  },
  {
    "username": "bobt4fun",
    "rating": 10.0,
    "comment": "Great beer & pretzels game, love to get it out and play",
    "timestamp": 1632434400
  }
]