[
  {
    "username": "magnoguido",
    "rating": 1.4,
    "comment": "I guess it would get a higher rating if I were 7 years old.",
    "timestamp": 1327100400
  },
  {
    "username": "bazik123",
    "rating": 2.0,
    "comment": "a very very very long game about generally bashing the leader, with your decisions mattering almost not at all compared to the collective vote who do we allow to win...",
    "timestamp": 1252188000
  },
  {
    "username": "PfrBraun",
    "rating": 3.0,
    "comment": "Igel Ärgern (Doris Matthäus / Frank Nestel) – oder: Was eigentlich gepriesen wird. Ein Spiel, dass für sich selbst 40 Varianten mitbringt, wird nicht zu Unrecht von den Kritikern gepriesen. Das ging schon Reinhold Wittig mit „Das Spiel“ so. Und natürlich macht es einen Unterschied, ob bei einem Rennen der erste Igel der erste Igel ist, oder er wegen Dopings disqualifiziert wird. Das ändert die Taktik ganz erheblich. Doch letztlich ist Igel Ärgern ein lupenreines Würfelspiel aus dem Genpool von „Fang den Hut“. So würfelt man sich durch die Runden, von Feld zu Feld. Ein paar Sonderfelder blockieren einen. Was die Konkurrenz zwar freut, aber das Spiel schmerzlich bremst. Was noch schlimmer ist, weil es nie so richtig Fahrt aufnimmt. Eigentlich gepriesen werden deshalb das unverbrauchte Thema mit den Igeln, die lustige Graphik und eben das Variantenbuch. Angeblich sorgt das für langanhaltenden Spielspaß?! Wohl eher für lang anhaltenden Spielspaß. Und ohne es zu wollen, kommt man auf eine Generalkritik: Igel ärgern kommt nicht recht auf den Punkt. Es ist zwar konzentriert auf die Würfelei, aber es wird nicht richtig spannend. Im Internet findet man immer wieder den Satz: Bereichert jede Sammlung. Mit leichter Differenzierungsleistung schlagen wir vor: Reichert jede Sammlung an. Aber ob sich das lohnt, wagen wir zu bezweifeln. Auch nicht mit 40 Varianten.",
    "timestamp": 1636844400
  },
  {
    "username": "robdizzledeets",
    "rating": 4.0,
    "comment": "This game is so deceivingly awesome. With endless variation combinations this game is chock full of replayability.",
    "timestamp": 1639522800
  },
  {
    "username": "casualcasual",
    "rating": 5.0,
    "comment": "Cute, with lots of ways to play, but didn't capture the imagination of the kids, who prefer some other roll and move race games of this nature.",
    "timestamp": 1637362800
  },
  {
    "username": "Toonix",
    "rating": 5.0,
    "comment": "nothing to sleeve",
    "timestamp": 1490223600
  },
  {
    "username": "Indy500sr",
    "rating": 6.0,
    "comment": ".compleet\nEAN 794764088113\nL6",
    "timestamp": 1757282400
  },
  {
    "username": "RoGo",
    "rating": 6.0,
    "comment": "nive variations to pachisi but to slow with not enough interesting decisions. derserves an upgrade like dog has been for pachisi",
    "timestamp": 1755554400
  },
  {
    "username": "robmderrick",
    "rating": 7.0,
    "comment": "Given to Rowan",
    "timestamp": 1708383600
  },
  {
    "username": "glsonn",
    "rating": 8.0,
    "comment": "Purchased 2/17/09 via BGG. Received 2/20/09.\n\nDidn't realize there were so many (40) variations included. We don't use them.\n\nH - 45",
    "timestamp": 1761078960
  },
  {
    "username": "HerbertML",
    "rating": 9.2,
    "comment": "As Billabong is our \"opener\" for a game session, so is \"Igel ärgern\" the \"closer\" of the session. Great game.\n/*#N1*//*stay*/",
    "timestamp": 1734994800
  },
  {
    "username": "Neophyteg52y",
    "rating": 10.0,
    "comment": "The best game with extremely simple rules and components that I know! Lots of variants included!! Cute thematic race game",
    "timestamp": 1457218800
  }
]