[
  {
    "username": "CGJ33",
    "rating": 1.0,
    "comment": "Poor Quality box, components, and cards especially for the price.",
    "timestamp": 1578524400
  },
  {
    "username": "Kaelistus",
    "rating": 1.0,
    "comment": "This was fun for the first 2-3 plays, but then you realize that the game takes way too long for the excitement to last. I wouldn't play this ever again.",
    "timestamp": 1361401200
  },
  {
    "username": "jcrim13",
    "rating": 1.0,
    "comment": "ugh, are we done yet?",
    "timestamp": 1311804000
  },
  {
    "username": "Insane Foxx",
    "rating": 1.0,
    "comment": "i've played this 3 times, and all 3 times, while i could have let the game go on, i could end it in 2 or 3 moves.. which makes it over way to fast. I'd have to want to let the opposition build up for it to last longer........ might change if i play more then 2 opponents",
    "timestamp": 1251064800
  },
  {
    "username": "OlavRokne",
    "rating": 1.0,
    "comment": "This isn't a game. It's a joke that happens to have rules. It's worth reading the cards for the jokes, but not worth reading the \"rule book\".",
    "timestamp": 1221429600
  },
  {
    "username": "vorondesan",
    "rating": 2.0,
    "comment": "This game is ugly, long, boring and overloaded.",
    "timestamp": 1657836000
  },
  {
    "username": "Pandorzecza",
    "rating": 1.5,
    "comment": "Not for me",
    "timestamp": 1628373600
  },
  {
    "username": "tankbard",
    "rating": 2.0,
    "comment": "I liked Illuminati back when I first encountered it, but in retrospect I think the main appeal of the game is the ridiculousness of the control structures you can make. The engine isn't that bad either and I really like the divergent victory conditions and the provisions for binding agreements and shared victory.\n\nI think Illuminati's main weakness is that it can get very tediously political, and you end up playing the sort of trade/bluff game I hate where you try to convince people that whatever deal you want to make isn't skewed absurdly in your favor (there are no other kinds of deals). The game ends up becoming very long as a result. One way to tone it down would be to prohibit or nerf interference from outside groups -- say, make them spend at a 2:1 rate. The fact of having to ask for permission to do anything really slows the game to a crawl.\n\nBetween permission checks and recomputing victory potentials I've never seen a game of this go for less than 3 hours, and in my opinion 6 is a more reasonable estimate. I almost wonder if I learned the game incorrectly, but that's probably comparable to, say, Twilight Imperium, minus all the mechanics that game has, and plus a tendency to play with very analytical but not altogether experienced players.",
    "timestamp": 1576018800
  },
  {
    "username": "jshufelt",
    "rating": 2.0,
    "comment": "I was not a fan of the mechanics. It's essentially building up gobs of money and throwing them at each other.\n\nCards are cute, the idea is nice. I love the idea but hated the game.",
    "timestamp": 1538949600
  },
  {
    "username": "pfctsqr",
    "rating": 2.0,
    "comment": "I would rate it higher if it was over in 30 minutes. But 2 to 3 hours for a 4 player game? The humor on the cards, which seems to be the main focus, wears awfully thin by then. And that has to be the absolute worst money tokens I have ever seen.",
    "timestamp": 1521068400
  },
  {
    "username": "alfonzo54",
    "rating": 3.0,
    "comment": "The theme/humor is just about my favorite for any game ever but the endgame is interminable and it has massive balance issues, mostly due to the trickle of groups that come out. There are too many cards to assume you'll ever even see a certain one and stuff like Orbital Mind Control Lasers is just so good it either gets destroyed out of spite or everyone fights over it.\n\nI've had a lot of fun experiences with this game in the past but I don't see playing it much anymore. I would love to see a reworking of this with modern design sensibilities (which will never happen).\n\nThis is one of those games where whoever tries to win first will lose and it's just a grinding slog of leader bashing.",
    "timestamp": 1733785200
  },
  {
    "username": "xWilcoXx",
    "rating": 3.0,
    "comment": "Convoluted, hard to teach, and a headache to play. Not a fan...\n\nps...why are Steven Jackson's games so bad?",
    "timestamp": 1712181600
  },
  {
    "username": "tomatosoupcan",
    "rating": 3.0,
    "comment": "deluxe edition, box wear, received in a previous trade",
    "timestamp": 1686002400
  },
  {
    "username": "jnharr",
    "rating": 3.0,
    "comment": "Illuminati is simply not my kind of game. I didn't find this much fun at all and can't imagine ever playing again.",
    "timestamp": 1586815200
  },
  {
    "username": "SirPork",
    "rating": 3.0,
    "comment": "NEVER BUY THIS FOR ME EVER AGAIN!!!",
    "timestamp": 1582930800
  },
  {
    "username": "bdcroom",
    "rating": 4.0,
    "comment": "Was introduced to this by the CCG, and found it great, and hilarious in theme and flavor text. ( Ha-Ha! My Hollywood controls the Media, and Media controls the Democrats! ( snicker ) ) Bought this, and ended up dissappointed. Family didn't enjoy it like my college friends had. Single sided tiny cardboard money was always a chore to sort, so we labeled the blank sides, though that maybe over-rode a deliberate design choice to keep player amounts secret? Sold my copy, wish it had been more fun.",
    "timestamp": 1716933600
  },
  {
    "username": "kimmo_juhani_makinen",
    "rating": 4.0,
    "comment": "It hasn't aged well (it's now 2024) although the core mechanisms of the game provide a fun, albeit luck-dependent, ride. I could see this game pumped up into the new millennium by SJG.",
    "timestamp": 1708038000
  },
  {
    "username": "ygram",
    "rating": 4.0,
    "comment": "Multiple plays: This is one of those games where gameplay is lacking but design and lore is supposed to make it fun. It simply doesn't work. It's not tactical or strategic enough.",
    "timestamp": 1696888800
  },
  {
    "username": "Amatulien",
    "rating": 4.0,
    "comment": "Kinda dissapointed",
    "timestamp": 1675206000
  },
  {
    "username": "Entropology",
    "rating": 4.0,
    "comment": "Not actually a great game, just an amazing idea. I love the idea of the Post Office controlling the Boy Scouts that controls the FBI. DEEP STATE!\n\n[Edit:] Tried this again for the first time in ten plus years. It's still a great theme but the actual game is bordering on just bad. Dropped several points. Love the idea but don't want to play again.",
    "timestamp": 1669503600
  },
  {
    "username": "Nodens",
    "rating": 5.0,
    "comment": "Typical SJ game: great fun, but way too long and flawed beyond redemption. Might be better if after about an hour a single die roll decided the winner.",
    "timestamp": 1756936800
  },
  {
    "username": "Chrizzzl",
    "rating": 5.0,
    "comment": "I really like the theme and the basic concept of the game (building up a weird network), but I never had much fun playing it.\n\nFor my taste, it's a bit too long for the relatively shallow depth of the game and the downtime is rather high, too.\nThere's also quite a problem with kingmaking and leader bashing (especially with larger numbers of players): as soon as someone is close to winning the game, they inevitably have to be attacked by the other players, who often spend a lot of money doing so. This can give the next player in line the opportunity to win without anyone else being able to stop them. This reminded me a bit of the problem I've always had with Munchkin (while Illuminati is significantly longer).\nIt can also happen that you are practically shot out of the game in midgame by a concerted attack by other players and still have to play along pointlessly for another hour.\nThe game offers some potential for negotiations and threats at the table, which is nice, but in the end it doesn't make up for it.\n\nAbout the material: Considering the theme, the cards are great. Unfortunately the traits and abilities printed on the cards are so small that you can't even read exactly what the person next to you has going on.\n\nConclusion: Surprisingly interesting for a game from the 80s, but today you are used to better game design. I would describe the feel of the game as aggressive and confusing. Illuminati is a whitty portray of our business world, but in my opinion it is not a particularly entertaining game.",
    "timestamp": 1745272800
  },
  {
    "username": "RikHavok",
    "rating": 5.0,
    "comment": "2/25\n\nSleeved Black Ultra Pro 66x91\n\nI like the concept of this game. But never really was any good at it. I would love to play it more, but most of my friends don't like it.\n\nI think, just reading the cards is fun.",
    "timestamp": 1740265200
  },
  {
    "username": "Rygel",
    "rating": 5.0,
    "comment": "Decent game that tends to go rather long.\n\nGot in 2008",
    "timestamp": 1731366000
  },
  {
    "username": "Bibi4",
    "rating": 5.0,
    "comment": "No sure I want to play this one again. We couldn't quite finish the game the last time I played. The theme is great fun, but I am not sure I enjoyed the mechanics of it that much.\nOnce the novelty has passed, it is too long an repetitive.",
    "timestamp": 1705878000
  },
  {
    "username": "RandaPrince",
    "rating": 5.0,
    "comment": "Overly complicated.",
    "timestamp": 1687125600
  },
  {
    "username": "Sack",
    "rating": 5.0,
    "comment": "//in Amulett",
    "timestamp": 1683410400
  },
  {
    "username": "Citadel",
    "rating": 5.0,
    "comment": "The network connections are interesting but otherwise an overly long and random take that game.",
    "timestamp": 1679007600
  },
  {
    "username": "Yriel",
    "rating": 5.0,
    "comment": "It's a funny game for the thematic but it's not interesting to play and it's very time consuming.",
    "timestamp": 1675897200
  },
  {
    "username": "Chouzar",
    "rating": 5.0,
    "comment": "The need of verbal interaction and cutthroat nature of it makes it a very open strategy game.\n\nWhen the game gets big it may be hard to read, fortunately the old cards feature a simple design.",
    "timestamp": 1672354800
  },
  {
    "username": "hed0ne",
    "rating": 6.0,
    "comment": "Enfundado",
    "timestamp": 1757887200
  },
  {
    "username": "dreamraven",
    "rating": 6.0,
    "comment": "Great as a light party game for 12&up, it helps if the players are familiar w/ the theme.",
    "timestamp": 1735945200
  },
  {
    "username": "Marcoloco21",
    "rating": 6.0,
    "comment": "Played it once and have the game.\nI want to play it more",
    "timestamp": 1719871200
  },
  {
    "username": "gmarius",
    "rating": 6.0,
    "comment": "Could be a lot of fun with the right people. Must be able to enjoy and accept the abuse you get in this game.",
    "timestamp": 1717452000
  },
  {
    "username": "genghisdhan",
    "rating": 6.0,
    "comment": "Consider Sell",
    "timestamp": 1712872800
  },
  {
    "username": "odinsgrandson",
    "rating": 6.0,
    "comment": "This was a cool proto-CCG card game.",
    "timestamp": 1711148400
  },
  {
    "username": "Acon17",
    "rating": 6.0,
    "comment": "X",
    "timestamp": 1709506800
  },
  {
    "username": "Kalifriki",
    "rating": 6.0,
    "comment": "More direct, no dice, take on a Monopoly-style game. Can be acquired in a single box as opposed to booster pack origin.",
    "timestamp": 1706828400
  },
  {
    "username": "Tophknight",
    "rating": 5.5,
    "comment": "If you take out the Negotiation (which basically says you can trade anything but cannot throw the game...a contraction in itself) it is not a bad little game. Some of the \"advance rules\" seem bogus though. I don't feel like all of the illuminati's are equal. Some feel much better than others. Also while the game suggests 4-6, I don't think I would ever want to play with more or less than 3-4. While I said it's not a bad little game, I think play is too long for what it is...and there are much better offerings out there. OH...the money in the game is a BEAST to organize.",
    "timestamp": 1678316400
  },
  {
    "username": "quill18",
    "rating": 6.0,
    "comment": "Fantastically entertaining theme.\nExtremely satisfying to build up your power structure.\nAnnoyingly convoluted rule book.\nOccasionally very frustrating combat, especially since ganging-up typically happens.",
    "timestamp": 1674342000
  },
  {
    "username": "Xcorps",
    "rating": 7.0,
    "comment": "Collected all cards except 1 :-(.\nGreat humorous set!",
    "timestamp": 1748210400
  },
  {
    "username": "Jocab",
    "rating": 7.0,
    "comment": "Got my version from a friend. Never been played! Sold to Stephan.",
    "timestamp": 1739660400
  },
  {
    "username": "Patmac20",
    "rating": 7.0,
    "comment": "I like the game and the theme. I just wish the money was printed on both sides.",
    "timestamp": 1737586800
  },
  {
    "username": "pezboy",
    "rating": 7.0,
    "comment": "KEEP",
    "timestamp": 1732230000
  },
  {
    "username": "kevster",
    "rating": 7.0,
    "comment": "What if the post office has been secretly infiltrated by aliens. Guess what...it has! Take over the most powerful organizations to win! Funner than I just made it sound...",
    "timestamp": 1726092000
  },
  {
    "username": "daveosuave",
    "rating": 8.0,
    "comment": "Fun game for moments but cheating version is more an experience than a game",
    "timestamp": 1744149600
  },
  {
    "username": "Blix",
    "rating": 8.0,
    "comment": "Story-Worthy\nReplayable Chaos\nGroup Dependent",
    "timestamp": 1743890400
  },
  {
    "username": "ncc1701jv",
    "rating": 8.0,
    "comment": "An oldie, but a classic. I love that the rulebook actually encourages you to lie, but not *too* much.",
    "timestamp": 1738537200
  },
  {
    "username": "HiveGod",
    "rating": 8.0,
    "comment": "Comments are for the 2007 Deluxe Edition. Be aware that the 2018 2nd Edition with the goofy cartoon artwork softens the geopolitical commentary into unfuckable flaccidity.\n\n\n\nWicked old-skool fun—\n\nSEVEN YEARS LATER\n\n—when played with the right people with the right mindset in the right timeframe (read: weirdos, party-time, briefly). Much like SG's other, uh, infamous design, this is more about the wacky card combinations and emergent narrative than the mechanical stuff. And like that other one it's just plain godawful with the wrong people even as it tries to stretch 30 minutes of fun across three grueling hours, an exercise much like trying to fit a dead congressman into a pair of pantyhose—the dildo goes in easily enough, but who was the moron who brought the petite taupe? The instructions clearly said sparkly black.\n\nProtip: Imminentizing the Eschaton works pretty well for a shorter, but still satisfying, game.\n\nAdditional house rules:\n\n• Deal 3 Specials to each player as part of setup.\nThe Illuminated should have tricks preloaded up their sleeves—and this way everyone can declare and cancel Privilege out of the gate.\n\n• Groups have total Power + Transferable Power.\nSo an Illuminati with 8/8 would have a total Power of 16, 8 of which is Transferable (instead of just 8 Power, 8 of which is Transferable). Yeah, this distorts the game by upping the baseline Power being wielded, and makes Groups with Transferable Power much more... powerful—but the distortion speeds up the game, which is absolutely necessary here.\n\nA COUPLE WEEKS LATER\n\nAlso, this thing has ludicrously... opaque rules for what it's trying to achieve. I almost wrote complex, but they're not really all that complicated—just needlessly detailed, with massive numbers of teeny modifiers, counterintuitive rules exceptions, and pointless minutiae. While this is par for the course for pretty much all Steve Jackson games, I'm left wondering if the purpose here was intentionally meta, or just a happy accident. I mean, it makes perfect sense that a game about world-dominating conspiracy would be utterly labyrinthine. Still, it can be a pain in the ass in actual practice.\n\nWhen in doubt, ditch the accounting and just make yarn maps.\n\nIncludes:\n\nY2K\nBavarian Fire Drill\n\n(Up-rezzed with MOAR MONEYS: Two sets glued together to make them double-sided and thicker to aid the piling of fat stacks and the tossing into the bank-hole during interference storms.)\n\nPS. The cards from the various sets are three different sizes, and since I'm allergic to sleeves (ptui!) that means that the deck has the appearance of a deckle-edged book. But this is obviously all part of The Plan.*\n\n*If we take the three card sizes and assign them numerical values based on when they were released (1, 2, 3), then any given shuffle produces a finite string of numbers\n\n13122212322132333123112212...\n\nwhich, when separated into double digits\n\n13 12 22 12 32 21 32 33 31 23 11 22 12...\n\ncan be compared against the alphabet to spell out revealing— yet troubling—messages. (Of course, I'm using the actual alphabet, with all 37 letters (not counting diacriticals); otherwise it's just gibberish.)",
    "timestamp": 1728165600
  },
  {
    "username": "jwilhm",
    "rating": 8.0,
    "comment": "Save",
    "timestamp": 1725832800
  },
  {
    "username": "Elden7",
    "rating": 9.0,
    "comment": "Excellent, intelligent, un jeu incompris et sous-cotté.",
    "timestamp": 1741042800
  },
  {
    "username": "EddyKansas",
    "rating": 8.5,
    "comment": "A wonderful marriage of theme and mechanism. So many little rules are well considered and grounded in the concept of conspiracies. For instance just consider how the \"fanatic\" group alignment is designed, where most cards of the same alignment tend to reinforce each other, the fanatic alignment is an exception and is always hostile to its own ilk. It's full of great little design moments like that.\n\nUnsurprisingly the game is well sourced in the Robert Anton Wilson tradition of counter-cultural fascination with conspiracy and it really shows, the rule-book even has a bibliography! It is a real treat for anyone even vaguely interested in the subject. I also appreciate any game that has a provision for cheating in the rules!\n\nThe game expects you to be quite cunning and you really feel like a mastermind manipulator spinning a web of influence and pitting your grand network of wacky organizations against the other players for covert world domination. One of my favorite things to do in this game is to narrate each action I take, because even a very literal description of what you are doing in this game is amazingly funny.\n\nHowever much I love this game, I found that new players find it rather daunting, especially as it is rather hard to make a comeback when you start falling behind. I also regret some of the more infamous pieces of art from the CCG didn't make it in.",
    "timestamp": 1739401200
  },
  {
    "username": "flintlocklaser",
    "rating": 9.0,
    "comment": "Imagine having the gall to dictate to people how they should or should not rate games here, while rating a game you've never played a '3' because it got rained on or something? Anyway probably more like a 7 but this is explicitly a counter-rating.",
    "timestamp": 1704841200
  },
  {
    "username": "Staban Tuek",
    "rating": 9.0,
    "comment": "Played this a LOT in my early gaming days. I tend to enjoy SJ's humor, and really like the variety of regular groups, as well as the goals and powers of the different Illuminati groups. There is a lot of player interaction in this one and a lot of tension as the end game draws near. Sometimes the game forces one player to be the spoiler which can limit the fun, but overall this isn't a huge problem. I have seen several people complain that some of the illuminati are just too powerful (e.g., Bavaria). This may be slightly true in 3-player games, but overall I don't see any imbalance issues and I have played this game MANY times. Plays best with about 4-5 players.\n\nTHRIFT",
    "timestamp": 1666476000
  },
  {
    "username": "Imperial_Archmage",
    "rating": 9.0,
    "comment": "Highly entertaining card based game with a satirical twist. It's the absurdity of the combinations of power/control create the fun.\n\nThe rules can be a little hard to understand for younger players, especially given the need to do a bit of on-the-fly math, but once mastered its a great game to play with friends.",
    "timestamp": 1661983200
  },
  {
    "username": "Kyllebylle",
    "rating": 10.0,
    "comment": "Absolutely amazing, this game is insanely cool IF played to win. The problem is that people can easily say \"fk dis\" and give the victory to anyone. Overall one of my best experience ever in any game, the political dynamic is so intense.\n\nIt's such a unique game and it can offer an insane simulation of world domination but it's DEFINITELY not for everyone.",
    "timestamp": 1746136800
  },
  {
    "username": "Fangism",
    "rating": 10.0,
    "comment": "",
    "timestamp": 1742857200
  },
  {
    "username": "Odd24_7",
    "rating": 10.0,
    "comment": "Classic from the 90s! This is just silly good fun, and a stab-your-friends-in-the-back game play. Cheating is encouraged. Tongue-in-cheek humor and cool artwork, if you have the earlier editions. The later editions watered down the cool 90s aesthetic. The expansions add lots of new content and variety to the cards, making for insane combos.",
    "timestamp": 1687816800
  },
  {
    "username": "DanDanMagic",
    "rating": 10.0,
    "comment": "I love this game.",
    "timestamp": 1677625200
  },
  {
    "username": "captaincomic",
    "rating": 10.0,
    "comment": "An epic game of power struggle and direct player interaction. As such, it takes the right group to be fun.\n\nI love how you can take sides in any conflict and contribute in tiny amounts to influence the outcome.\n\nIn the beginning of the game, everybody tries to gain control of powerful groups to be in a good position during the mid/endgame. As soon as somebody starts to be close to fulfill their private or the standard victory condition, everybody pulls together to stop him. It's not entirely unlike Munchkin, but less dependent on drawing the right cards.\n\nIt sometimes feels like luck is the dominating factor in determining the winner, but it's much more than that: knowing when to attack and when to hold back, spotting weak targets and dangerous opponents and, most importantly, table talk to rally the players against a leader and to distract from yourself and your plan. It can take quite a few rounds until somebody manages to outbid all others on their final attack, or to make a surprise attack that nobody is prepared to stop, but the struggle towards this moment is what makes this game great for me.\n\n\n\n# of players: 2 3 4 5 6 7 8",
    "timestamp": 1672873200
  }
]