[
  {
    "username": "hoobert",
    "rating": 1.0,
    "comment": "Just a bad game. Bonus points if your familiy tells you how oh so strategic it is, and that it was your own fault. Grow up and play real games, people!",
    "timestamp": 1752876000
  },
  {
    "username": "Scifi66",
    "rating": 1.0,
    "comment": "Roll to move luck fest with very few non-obvious decisions. Hard pass.",
    "timestamp": 1663365600
  },
  {
    "username": "lemonalien",
    "rating": 1.0,
    "comment": "又臭又长",
    "timestamp": 1652392800
  },
  {
    "username": "unic",
    "rating": 1.0,
    "comment": "Excessively random - apart from the initial placement, one was totally at the mercy of the die, and having to do choices was rare.",
    "timestamp": 1154383200
  },
  {
    "username": "darkfinale",
    "rating": 2.0,
    "comment": "Played many times on BGA. Not something of my forte, but game is simple to understand and to teach. Plays fast, good with speeding up Hugo.",
    "timestamp": 1744495200
  },
  {
    "username": "danielawillspielen",
    "rating": 2.0,
    "comment": "5+ Jahre, 5 Spieler empfohlen (2-8)\n= Mitternachtsparty, Hugo das Schlossgespenst\nBoardgamearena gespielt und kurz in real besessen und verkauft, macht keinen Spaß, auch von Tochter nach 2 Spielen verweigert",
    "timestamp": 1706655600
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1635372000
  },
  {
    "username": "ReptilianSamurai",
    "rating": 2.0,
    "comment": "Just a roll and move, way too luck based for my taste. Takes too long to play for so much luck.",
    "timestamp": 1630360800
  },
  {
    "username": "hiimjosh",
    "rating": 3.0,
    "comment": "Maybe the dice go your way. Or maybe they don't. Rather play another filler. Outside of the context with kids, I find the comment on this puzzling. I played with 3p which was absolutely terrible - more-so in a \"why bother?\" sense. Perhaps it works better if you have fewer pawns on the board as the game goes longer?",
    "timestamp": 1732489200
  },
  {
    "username": "PizzaChip",
    "rating": 3.1,
    "comment": "Śmieszna ta gra była, ale też bardzo losowa i w niektórych momentach monotonna. Jest okropnie prosta, przypominająca niekiedy chińczyka z twistem. Raczej w nią już nie zagram.\n\nOcena po 4 partiach w 3, 4 i 5 osób. Średni czas gry = 9 minut.\n\nbga",
    "timestamp": 1716156000
  },
  {
    "username": "GeorgW",
    "rating": 2.5,
    "comment": "Roll-and-move with a nice setting.\n\nPros:\nThe setting leads to some fun table talk and the production is good!\n\nCons:\nIt's a roll-and-move but you have 3 characters so there's still some amount of choice. Unless you roll the ghost side of the dice. Which I did all but 4 turns, meaning I got to make a total of 4 decisions. It's not an ideal first play experience and at least I could have fun at the incredulity of rolling another ghost, but it's still an issue how easy it is to lose almost all your agency.\n\nThese decisions that I did get to make were also very obvious. You want to go into a room so you can't get taken by the ghost. If possible you'd also like to move whoever's closest to the ghost and it's always fun to bump others out of their rooms and not get bumped yourself.",
    "timestamp": 1711494000
  },
  {
    "username": "unoq",
    "rating": 3.0,
    "comment": "basic children's game: roll a die, run from the ghost, try to get into the rooms. it also has quite a bit of downtimes.",
    "timestamp": 1677452400
  },
  {
    "username": "Legomancer",
    "rating": 4.0,
    "comment": "I did not understand anything that was going on here.",
    "timestamp": 1758578400
  },
  {
    "username": "VioletSquirrel",
    "rating": 4.0,
    "comment": "[only played on BGA]\n\n[checked out - tried]\nonly play: not for me",
    "timestamp": 1751148000
  },
  {
    "username": "silenceisgolder",
    "rating": 4.0,
    "comment": "Kids game, played for silly fun on BGA. Not really anything to it.",
    "timestamp": 1742770800
  },
  {
    "username": "capnwaffer",
    "rating": 4.0,
    "comment": "Roll and move, maybe.",
    "timestamp": 1729029600
  },
  {
    "username": "Lecaro",
    "rating": 5.0,
    "comment": "Kurzrezension:\nWer sich nach Mitternacht noch in den Gängen des Schlosses aufhält, ist selbst schuld, denn \"Hugo: Das Schloßgespenst\" treibt um diese Zeit sein Unwesen!\n\nSpielablauf:\nDie Spieler starten mit jeweils zwei Spielfiguren im zentralen Gang des Spielfeldes, welcher in Felder aufgeteilt ist und alle paar Schritte in einen Raum mündet.\nWer an der Reihe ist, wirft den Würfel und darf jetzt eine seiner Figuren um die angegebene Anzahl Schritte bewegen. Endet die Bewegung in einem Raum, ist die Figur erst einmal sicher, denn \"Hugo: Das Schloßgespenst\" bewegt sich immer nur auf den Gangfeldern, und zwar immer dann, wenn ein Spieler sein Portrait würfelt, welches auf einer Würfelseite abgebildet ist.\nErwischt Hugo eine Spielfigur, wird diese auf die Treppe des Kellers gestellt und erhält entsprechend viele Minuspunkte, kann, bzw. muss im Anschluss aber wieder aus dem Keller herausgezogen werden. Manche Räume geben Minuspunkte, wenn sie betreten werden, allerdings sind es im Vergleich zur Kellertreppe recht wenige und wenn ein Raum voll ist, wirft ein Neuankömmling eine andere Figur wieder raus auf den Gang!\nDas Spiel endet, sobald ein Spieler 47 Minuspunkte gesammelt hat. Dieser Spieler verliert das Spiel.\n\nMeinung:\n\"Hugo: Das Schloßgespenst\" ist ganz klar für Kinder entwickelt worden. Es enthält an jeder Ecke einen großen Zufallsfaktor. Allein schon der Würfelwurf entscheidet, ob ich meine Figur sichern kann, oder am Raum vorbeilaufen muss, was mir thematisch vermutlich keiner wirklich erklären kann. Warum ich hinter mir die Türe nicht einfach schließen kann, kann ich mir auch nicht erschließen, dafür sieht das Schloßgespenst Hugo aber wirklich niedlich aus. Ich glaube sogar, dass seine Figur nachts leuchten würde, wenn sie tagsüber mit Sonnenlicht aufgeladen wird.\nEs war mal ganz lustig, einen solchen Klassiker aus dem Kinderzimmer anderer erleben zu dürfen. Ich kenne es aus meiner eigenen Kindheit nicht, hätte mir damals aber vermutlich viel Spaß bereitet.",
    "timestamp": 1758060000
  },
  {
    "username": "Joka61",
    "rating": 5.0,
    "comment": "BR 1989 Mitternachtsparty",
    "timestamp": 1752876000
  },
  {
    "username": "chaniatreides",
    "rating": 5.0,
    "comment": "199?",
    "timestamp": 1749420000
  },
  {
    "username": "EniDawn",
    "rating": 5.0,
    "comment": "Kindheitserinnerung",
    "timestamp": 1731193200
  },
  {
    "username": "StormKnight",
    "rating": 5.0,
    "comment": "Original: Essentially mindless die rolling, but there are one or two choices to be made, and it moves fast and causes some amusement. Its fun to root for the ghost to get the other players.\nNewer version: Minor rules changes, but a lot more fun! That little bit of additional tactic and interaction adds a lot.",
    "timestamp": 1730329200
  },
  {
    "username": "millsyboy",
    "rating": 5.0,
    "comment": "A fun, silly game for adults and children alike... but that is a niche filled with other, more innovative games excel at (many of which are in the Zoch catalog). There is something charming about its old-school simplicity though.",
    "timestamp": 1729980000
  },
  {
    "username": "trodat123",
    "rating": 5.0,
    "comment": "nice kids game",
    "timestamp": 1712700000
  },
  {
    "username": "Ricsikeeee",
    "rating": 5.0,
    "comment": "Mitternachtsparty",
    "timestamp": 1712527200
  },
  {
    "username": "bnordeng",
    "rating": 6.0,
    "comment": "(KIDS) Good family game. Our youngest plays the ghost and just moves the ghost whenever it's rolled on the die. The rest of us attempt to race our people to safety. It's push your luck and it's pretty good.",
    "timestamp": 1760220000
  },
  {
    "username": "TheDeckie",
    "rating": 6.0,
    "comment": "Played digital version only",
    "timestamp": 1756332000
  },
  {
    "username": "pagius",
    "rating": 6.0,
    "comment": "hugo",
    "timestamp": 1754604000
  },
  {
    "username": "rharn",
    "rating": 6.0,
    "comment": "Good natured fun with a group that trash talks!",
    "timestamp": 1753308000
  },
  {
    "username": "ousgg",
    "rating": 6.0,
    "comment": "Part of the inestimable family of 'fun for young kids and drunk adults'",
    "timestamp": 1745186400
  },
  {
    "username": "CaroKann",
    "rating": 6.0,
    "comment": "Good and easy game for kids",
    "timestamp": 1744149600
  },
  {
    "username": "Kytty",
    "rating": 6.0,
    "comment": "HCPL\n\nKind of random with the dice, but plays a lot of players and keeps them involved throughout the game.",
    "timestamp": 1729980000
  },
  {
    "username": "Yondragon1981",
    "rating": 6.0,
    "comment": "good with kids (5+ is ok)",
    "timestamp": 1726783200
  },
  {
    "username": "jatang",
    "rating": 7.0,
    "comment": "Cute and quick.",
    "timestamp": 1757800800
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 4005556261277\nGL2",
    "timestamp": 1757368800
  },
  {
    "username": "zedeemia",
    "rating": 7.0,
    "comment": "Roll and move game with a touch of Kramer magic with plenty of schaudenfrede and fun mixed in. Playing the version with Hugo the ghost is a must.",
    "timestamp": 1755295200
  },
  {
    "username": "adamolanna",
    "rating": 7.0,
    "comment": "giocato infinite volte da ragazzo, è adatto anche ai più piccoli",
    "timestamp": 1755122400
  },
  {
    "username": "labyfan1313",
    "rating": 8.0,
    "comment": "Received Sept 23, 2022",
    "timestamp": 1760306400
  },
  {
    "username": "Pandante",
    "rating": 8.0,
    "comment": "A classic and a better game than is often made out to be. Its a Kramer game after all. Great theme, and i've always liked the illustrations on the board, the little details in the rooms of the old German editions. The strategy in placing the guests in the beginning is not immediately obvious. Kids love this game too!",
    "timestamp": 1754258400
  },
  {
    "username": "guimel",
    "rating": 7.5,
    "comment": "Not for trade. Fun warm up or filler, good with kids. Has cuteness.",
    "timestamp": 1753740000
  },
  {
    "username": "aronske417",
    "rating": 8.0,
    "comment": "Against all my instincts, I always enjoy playing this game.",
    "timestamp": 1753394400
  },
  {
    "username": "jarev",
    "rating": 9.0,
    "comment": "Eiga",
    "timestamp": 1742684400
  },
  {
    "username": "Ryan Keane",
    "rating": 9.0,
    "comment": "Played on BGA - Hugo version where I think Hugo is only 1 in 6 chance. It's random, but it's stupid fun. It's kind of like musical chairs meets tag. Roll a die and pick your pawn to move - that's it. There's some strategy positioning your pawns so that different numbers will allow you to kick someone out of a room (e.g. one 1 space from a room, another 2 spaces from a room, etc). Great end-of-night mindless game for a laugh.",
    "timestamp": 1707260400
  },
  {
    "username": "tea93",
    "rating": 9.0,
    "comment": "A6",
    "timestamp": 1701817200
  },
  {
    "username": "BagpipeDan",
    "rating": 9.0,
    "comment": "I like this game because ghosts are always fun!",
    "timestamp": 1673564400
  },
  {
    "username": "thanospap",
    "rating": 10.0,
    "comment": "",
    "timestamp": 1673046000
  },
  {
    "username": "paintime",
    "rating": 10.0,
    "comment": "used ravensburger",
    "timestamp": 1658527200
  },
  {
    "username": "Indy418",
    "rating": 10.0,
    "comment": "One of my favorite games from childhood. Very easy to learn and although it relies on dice rolling, there is strategy involved in the game. My four year old and I have been playing this a lot.",
    "timestamp": 1639954800
  },
  {
    "username": "Charlio44",
    "rating": 10.0,
    "comment": "This is a fun party game no matter the player count. Games can last anywhere from 5 minutes to half an hour depending on your luck.",
    "timestamp": 1626213600
  }
]