[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I had a lot more fun than I was expecting, but still not sure if it's all that good. Sure it's mean (as all the comments will agree on), but also very procedural to keep turn phases in order. Which means dealmaking isn't as freeform as it could've been, and I'm thinking of other negotiation games that are possibly meaner and more flexible.\n\nI'm most reminded of Chinatown, but enjoyed this more because of more amusing backstabbing. You can math out the revenue streams, but at least in this game the majority of the game are the negotiations, as opposed to only 1/3 of Chinatown being lively. But then it falls apart in the endgame the same way, it's too predictable how things will go (aaah, eurogame negotiations).\n\nSo it has the same flaw where only money is up for grabs, but makes up for it because hiring another player is possible, so at least there's a few dimensions. This means betrayal is pretty much mandatory. This is why I didn't find it overly mean myself, it was the game forcing me to pick one candidate, but I imagine for a lot of eurogamers this is super-aggressive.\n\nSeems to me like a response to Knizia's Quo Vadis, just not as good because it's obsessed with accounting. Also not as good as I'm The Boss, where the payout split is directly negotiated (and lots of wackiness can happen). And Cosmic Encounter is nonstop chaos in every direction. For more casual audiences, Bohnanza is generally nicer, simpler to learn, and its looser structure actually allows more creativity to blossom. So this one has mean negotiation, but.... not that hilarious, it's actually overly serious because the end result is counting money. It's just hard to keep track of who has the money because of all the bribes being thrown about (even if some of them aren't acted on). Still, I liked it more than a lot of other eurogame negotiation titles, which have no life at all.",
    "timestamp": 1744927200
  },
  {
    "username": "digiclam",
    "rating": 1.0,
    "comment": "My least favorite game. The gameplay makes me feel bad & sick.",
    "timestamp": 1708556400
  },
  {
    "username": "CastoroBoy",
    "rating": 1.0,
    "comment": "I've lost because my ex-friends bashed me",
    "timestamp": 1647990000
  },
  {
    "username": "zwyagel",
    "rating": 1.0,
    "comment": "проявляет самые низменные стороны в человеке, а иначе не выиграешь\nотстой и осадок остается отстойный",
    "timestamp": 1278280800
  },
  {
    "username": "TangentZ",
    "rating": 1.0,
    "comment": "I don't really understand the point of this \"game\". Is it really a game?",
    "timestamp": 1217541600
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 1.0,
    "comment": "I like this less than Diplomacy, which is a status few games can achieve.",
    "timestamp": 1137538800
  },
  {
    "username": "landrobot",
    "rating": 1.0,
    "comment": "Simple game with barely any structure. Players' moods dictates the entire strategy. Not fun, but an interesting concept. I'll never play this again, absolutely one of the worst eurogames I've played to date.",
    "timestamp": 1103497200
  },
  {
    "username": "janglemangle",
    "rating": 2.0,
    "comment": "i find the meanness tolerable but my friends can't, so i can't either\n\nironically, while the interaction shouldn't be taken seriously, the fact that i can't take this game seriously saps the fun out of it",
    "timestamp": 1709074800
  },
  {
    "username": "zedeemia",
    "rating": 2.0,
    "comment": "A pure negotiation game, which I generally dislike, and this one is no different. As the negotiation amounts to doing whatever you want the game has a tendency to painfully drag on and on.",
    "timestamp": 1705878000
  },
  {
    "username": "Pandorzecza",
    "rating": 1.5,
    "comment": "Słabe",
    "timestamp": 1630360800
  },
  {
    "username": "lushchords",
    "rating": 2.0,
    "comment": "Boring after one play. Why play this instead of Chinatown? Maybe one could argue because there is absolutely no luck, but that's what makes Intrigue a really dry game.",
    "timestamp": 1620684000
  },
  {
    "username": "Jeffrey F",
    "rating": 2.0,
    "comment": "La négociation est la seule mécanique du jeu.",
    "timestamp": 1542582000
  },
  {
    "username": "enzo622",
    "rating": 2.0,
    "comment": "Definitely too intentionally nasty for my tastes. Have no idea why I traded for this one; this was before I realized I don't like negotiation games. Games like this mean the stronger personalities in the group tend to dominate and/or personal rivalries can flare up (as they did in my one play). I just don't need any \"take that! no, seriously, take friggin' THAT!\" games.",
    "timestamp": 1452985200
  },
  {
    "username": "willgreg",
    "rating": 2.0,
    "comment": "Well, I've only played this once - and I did very well - but it left me cold. Playing the game was not fun, and I don't ever want to play it again.",
    "timestamp": 1450220400
  },
  {
    "username": "Huor79",
    "rating": 3.0,
    "comment": "Giocato una volta...orrendamente orrendo.i giochi così non li voglio più vedere",
    "timestamp": 1753912800
  },
  {
    "username": "adamscott",
    "rating": 3.0,
    "comment": "Played at 3p, which is not recommended by bgg. Might be better at 4p or 5p, but there is almost no game here.",
    "timestamp": 1733266800
  },
  {
    "username": "texasjdl",
    "rating": 3.0,
    "comment": "Do not play again.",
    "timestamp": 1724277600
  },
  {
    "username": "dukane",
    "rating": 3.0,
    "comment": "Negotiation game where you try to get your family members who are either a knight, lawyer, banker, a book, or bishop into other players estates to earn money. Each estate can have one of each and has different slots which pay off at different amounts.\n\nYou negotiate and bribe to put your family in other estates, to keep them there, and can leverage positions in your own estate to position yourself well.\n\nDo this for 6 rounds, have a final payout and that's the game.\n\nSeems like a game I'd like, yet my first play left me extremely sour on the experience. Lots of uncertainty in what delas are binding vs non binding (which may even be a rule error), and simply misreading a play can be so painfully brutal that a few bad deals can send you completely out of the game.",
    "timestamp": 1679266800
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "My initial reaction to Intrigue's sales pitch was a mix of \"The spirit of Diplomacy in 45 minutes? Where do I sign?\" and, upon a further read of the rules, confusion regarding the symmetry of both the initial game state and the actions available to players. I hoped that turn order - and the resulting asynchronous timing of payouts - would be enough to carve interesting situations, but it turns out that my worries were founded: 3 players agreeing to give away every non-minimal position to each other for the minimal bribe until a couple rounds of wages have paid out will basically roflstomp the first half of the game and (barring any bribe attempt from other players) that team will enjoy a risk-free joint first place with maximal income and only two opponents left to worry about. While from that point on, the game has yet to be decided and there is actual gameplay, it's ultimately the consequence of a fairly boring \"setup\" which has arbitrarily put another 1-2 players out of contention.\n\nOne may argue \"What if one member of the triad backstabs their companions by accepting another offer?\", but early betrayal is generally suboptimal in negotiation games for two reasons: you're building yourself a reputation for future games of being untrustworthy from the get-go, and for that game you're the leading player with a bull's-eye on your forehead and too many turns left to hope you won't get dethroned in response. Speaking of the latter, although the nature of non-binding agreements prevents arithmetics from completely taking over, it's unsurprising that the official game rules attempt to hide the relative rank of players and the calculation of endgame values behind (drumroll) hidden money.",
    "timestamp": 1670367600
  },
  {
    "username": "Hollyhock",
    "rating": 3.0,
    "comment": "In order to win, you have to lie and treason, but as you have so many freedom to make decisions, you cannot hide behind the excuse of \"I backstabbed you because it was the optimal move\".\n\nAs a result, this game literally enrages people.",
    "timestamp": 1645830000
  },
  {
    "username": "MMatias",
    "rating": 3.0,
    "comment": "Too mathy for a fun romp, too chaotic for a more serious affair.",
    "timestamp": 1645311600
  },
  {
    "username": "krit1789",
    "rating": 4.4,
    "comment": "Pure negotiation. A game of constant backstabbing and king making. Highly group-dependent.",
    "timestamp": 1754863200
  },
  {
    "username": "mi_de",
    "rating": 4.0,
    "comment": "Got the card game version at Essen'03 to replace the copy I traded away, and traded the card game away, too. Played 3 players and was underwhelmed. I think it would be better with 4 or 5, but it fell a little flat. I have better 'screw the other player' games. Willing to try again.",
    "timestamp": 1690581600
  },
  {
    "username": "Ranior",
    "rating": 4.0,
    "comment": "I love negotiation games, and I ought to like this one....\n\nBut the issue is this game seems to think backstabbing and betrayal somehow win negotiation games...but they really don't. Yes, at some point you generally need to to get the upper hand, but prior to that, ruthless cooperation by some parties will propel them to a much stronger spot over their other opponents.\n\nIt's not different here. Players that work together can easily get and protect strong income spots, and defecting too early is not rewarded as they'll just get cut out and beat down. So the game is fun for those players who have to figure out and time the right spot to make their break and try to get in the lead, but it just kind of sucks for those that have wound up on the outside.",
    "timestamp": 1679266800
  },
  {
    "username": "rauschpotato",
    "rating": 4.0,
    "comment": "1 play, 5p:\nI like negotiation/trading games, but this felt restricting and overly long. You have to negotiate in a certain order, closing off potential deals or double-crosses. In many cases, you can't persuade other players to change alliances and the game gets into a rut. Some players can get screwed with no hope of coming back, which I wouldn't mind except the game has more rounds than I like. The second half of this game felt repetitive instead of raising the stakes.\n\nI much prefer Chinatown or Bohnanza over this.",
    "timestamp": 1679266800
  },
  {
    "username": "smilingra",
    "rating": 4.0,
    "comment": "My initial play of this was very frustrating, your opponents can basically dump your people at any time and you're just effectively trying to play off of some sense of goodwill. I get that maybe you can be clever about what to play and what to hold back in order to get decent income, but this game seemed awfully cutthroat. I'd like to play it one more time just to see if it might actually be more fun the next time.",
    "timestamp": 1668553200
  },
  {
    "username": "AnttiT",
    "rating": 3.5,
    "comment": "I understand some people like free-form negotiation games, but not for me.",
    "timestamp": 1639004400
  },
  {
    "username": "_The_Inquiry_",
    "rating": 4.0,
    "comment": "Prior to 2020: 0 plays",
    "timestamp": 1619733600
  },
  {
    "username": "Plargyplop",
    "rating": 5.0,
    "comment": "Re-assessed: good bones, but a little too basic.",
    "timestamp": 1760565600
  },
  {
    "username": "Oezz",
    "rating": 5.0,
    "comment": "Brutal negotiation game. It's fairly quick, so bad blood doesn't linger, as you need to move on to the next deal to be made. I think it could be great with the right crowd. Theme wasn't quite right, but also not the worst either.",
    "timestamp": 1719180000
  },
  {
    "username": "KotQ",
    "rating": 5.0,
    "comment": "Malheureusement difficile à ressortir...",
    "timestamp": 1709766000
  },
  {
    "username": "Luds",
    "rating": 5.0,
    "comment": "(Math Trade: Got it with Mexica for The Lord of the Rings, Lord of the Rings: Friends & Foes and Lord of the Rings: Sauron in Échange mathématique pour les JAB 2012 - 31 mars - Échange en direct, 2012-03-31)\n\nThis game is not for everyone! Lie, break promises, back stab, it's very cruel. It's all about doing anything you can to get rich, and screw any potential rivals. It's quick enough to be a secondary game on game nights, and meaty enough not to just be a filler.\n\n(Traded for Intrigue (Mayfair Edition) and Statut Social in the Échange mathématique - En direct JAB 2013 - , 2013-04-06)",
    "timestamp": 1696024800
  },
  {
    "username": "DoktorDisco",
    "rating": 5.0,
    "comment": "Simple bribing and deception game. You try to cheat as much money from each other as possible by exchanging flavors and breaking promises.",
    "timestamp": 1632002400
  },
  {
    "username": "Tiamat",
    "rating": 5.3,
    "comment": "Not quite sure what I think (besides Mayfair components being lame: four cards instead of a board for each palace, and scholar iconography that doesn't seem to have a common style to me). I did like it once you reach the point that you can't send a scholar anywhere without annoying someone or forcing someone to make a choice. Interaction with every other player seems likely.\n\nI couldn't really understand why the winner won. I got why the biggest losers lost: there is definitely a popularity contest element in here. In addition to that, this game is extra nasty because all bidders lose what they bid and there is no way to guarantee that your bid will get chosen. It doesn't have to be so mean, surely? Why not just say that you keep your bid if you don't get picked.\n\nI also wonder whether it is too easy to calculate the value of a position. Towards the end of the game it seems to be. Maybe by game end the popularity contest turns into leader bashing. My \"keep your bid if you lose\" idea probably makes this worse by lessening the ability to make extra money by misleading people.",
    "timestamp": 1598392800
  },
  {
    "username": "hotc",
    "rating": 5.0,
    "comment": "We had the original edition.",
    "timestamp": 1596492000
  },
  {
    "username": "ChunmaV3",
    "rating": 5.0,
    "comment": "3-5, 5",
    "timestamp": 1585436400
  },
  {
    "username": "lamaros",
    "rating": 5.0,
    "comment": "Ok, perhaps too structure for social play and too light for serious play.\n\nDifferent settings of play needed to settle on a view.",
    "timestamp": 1577660400
  },
  {
    "username": "vetinari7878",
    "rating": 5.0,
    "comment": "A game that is all about deceit. Much shorter than Diplomacy, at least.",
    "timestamp": 1557784800
  },
  {
    "username": "SirHandsome",
    "rating": 5.0,
    "comment": "I don't know, there are better negotiation games\n\n(3 Design + 2 Enjoyment)",
    "timestamp": 1548457200
  },
  {
    "username": "congchua13",
    "rating": 5.0,
    "comment": "area control",
    "timestamp": 1511564400
  },
  {
    "username": "Maggibot",
    "rating": 5.0,
    "comment": "negotiation and blackmail, very few rules.",
    "timestamp": 1510441200
  },
  {
    "username": "Doomalinator",
    "rating": 5.0,
    "comment": "With the right group it has its moments. I wish it was longer though... Insane meta-game.\n\nRunied after the King Making Fiasco of '09.\n\nRefici is an a$$hole.",
    "timestamp": 1503871200
  },
  {
    "username": "Lemem",
    "rating": 6.0,
    "comment": "I have no recollection of what Intrigue is about. I will trust that my rating at the time was correct and state that the game was fine.",
    "timestamp": 1754344800
  },
  {
    "username": "TrevorJr26",
    "rating": 6.0,
    "comment": "As I said while playing, this is the part of monopoly where someone has the last property in your set and you're negotiating to get it from them. But that's the whole game. With the right players and maybe even a bit of light RP (as mean people or nice people, not as vampires or whatever. Although that's probably funny too), this is a good funny game. There is enough game that there are sometimes interesting choices, but mostly it's pure negotiation. I think possibly I'd rather play Bohnanza every time, but it's maybe offering something different enough to justify owning.",
    "timestamp": 1752184800
  },
  {
    "username": "toadles",
    "rating": 6.0,
    "comment": "Entertaining way to lose some friends! I'd give it a higher score if I still had friends to play it with.",
    "timestamp": 1742338800
  },
  {
    "username": "mongooseroar",
    "rating": 6.0,
    "comment": "I was expecting this to be meaner, I guess, based on reputation?",
    "timestamp": 1742252400
  },
  {
    "username": "Tomasaki19",
    "rating": 6.0,
    "comment": "Missing:\n- 2x red priest scholar tokens\n- 1x blue clerk scholar token",
    "timestamp": 1714428000
  },
  {
    "username": "Eskizer",
    "rating": 6.0,
    "comment": "P&P",
    "timestamp": 1710716400
  },
  {
    "username": "Japara",
    "rating": 5.9,
    "comment": "Just one word : Nasty.\nThe game is very simple to explain and a blast to play with a big caveat:\nIt is a pure negotiation game, with bribes, menace and betrayals as its core elements.\nWhatever happens just remember that it's just a game.",
    "timestamp": 1708470000
  },
  {
    "username": "Drakonio",
    "rating": 6.0,
    "comment": "10",
    "timestamp": 1679353200
  },
  {
    "username": "JasonSaastad",
    "rating": 6.0,
    "comment": "aesthetically awful\n\nNASTY",
    "timestamp": 1675119600
  },
  {
    "username": "Neutrinos",
    "rating": 6.0,
    "comment": "s",
    "timestamp": 1671318000
  },
  {
    "username": "MorelliBuendia",
    "rating": 6.0,
    "comment": "Too evil for its own good. If people try to math it out they kind of ruin it and it is also prone to kingmaking. If you want to break friendships, this is the game for you.",
    "timestamp": 1657749600
  },
  {
    "username": "OGNOG",
    "rating": 5.8,
    "comment": "Probably OG. (Rating non-indicative of game quality.)",
    "timestamp": 1649109600
  },
  {
    "username": "TomVasel",
    "rating": 6.0,
    "comment": "An evil game, but one that I never have too much trouble, since I explain about this ahead of time.",
    "timestamp": 1644102000
  },
  {
    "username": "plysbjorn",
    "rating": 6.0,
    "comment": "I love this game. I don't know how much control I really have when playing this, but I don't care. Any game where backstabbing, badmouthing, shrewd dealmaking and making offers-that-you-can't-refuse are integral parts of the experience is pure bliss (but then I'm a sucker for negotiation games). With the right crowd this is a hit. When playing in teams you add an extra layer of conflict as the team managing one house sure will have a lot of internal discussions (that perceptive players can profit from).",
    "timestamp": 1641250800
  },
  {
    "username": "Krevillen",
    "rating": 7.0,
    "comment": "Antiludoteca (3 plays).",
    "timestamp": 1747087200
  },
  {
    "username": "Gumstep",
    "rating": 7.0,
    "comment": "NASTY!",
    "timestamp": 1743372000
  },
  {
    "username": "TheMitchMaster",
    "rating": 7.0,
    "comment": "This is a good game, but boy can you make a lot of enemies in this game. It's easy for people to accept bribes based on the cash value alone, but I find paying/accepting bribes based on the board state more interesting. With this, you have to be flexible with your strategies depending on your fellow players.",
    "timestamp": 1742252400
  },
  {
    "username": "Argantonio",
    "rating": 7.0,
    "comment": "Gran juego que saca lo peor de uno. Traiciones y negociaciones todo con promesas que seguro que se incumplirán. Muy grupo dependiente y para determinado tipo de personas. Todos deberían ser jugones porque alguna amistad se puede perder. Me gusta pero no me lo paso bien del todo…",
    "timestamp": 1735340400
  },
  {
    "username": "abhiroo",
    "rating": 7.0,
    "comment": "Fascinating hidden gem of trivially simple rules and chaotic negotiation. You're attempting to secure high-paying positions in your opponents' mansions, but so are other players, so you're attempting to one-up them with bribes and quid pro quo promises that are almost impossible to hold up.\n\nI'm a big fan of negotiation games in general, and this is just pure negotiation through and through, but the deals and promises in this just seem to get so tangled and convoluted as the game progresses (which is probably by design!), and with people trying to optimize their deal-making on every turn, this game stretches far beyond the listed time of 45 mins.\n\nI was ultimately happy to play this, but would probably prefer to play Chinatown/Waterfall Park or Zoo Vadis in this genre, just because of how much more group-dependent this game is and how deals are much more tangible in those games, which also makes those games run a lot smoother.",
    "timestamp": 1732748400
  },
  {
    "username": "grammatoncleric",
    "rating": 7.0,
    "comment": "This game lives and breathes based on several things:\n\n(1) Negotiating strength and ability;\n(2) Evolving game theory;\n(3) The ability to persuade other players to act based on fiat promises (since the only currency in the game are promises and commitments).\n\nIt is a meta-game and it is a very very good one.",
    "timestamp": 1731711600
  },
  {
    "username": "spencyrrh",
    "rating": 7.0,
    "comment": "2024-06-13 (1 play at 5): I had fun. I need to play more. There's a bit of strategy in when to play each different type of flunky.",
    "timestamp": 1720044000
  },
  {
    "username": "NormandyWept",
    "rating": 8.0,
    "comment": "This is a delicious game of negotiations, bribes, and basically built-in betrayals and double-crossing manoeuvres.\n\nThe fact that payments to retain your crucial income-gathering workers in another player's home are not an auction but must be paid in full in order around the table creates some fantastically tense moments where you try to balance whether to pay even though you feel it's likely your offer will not win, vs. the potential of the receiving player choosing to go against you because you haven't engaged in the bribing game in good faith.",
    "timestamp": 1759356000
  },
  {
    "username": "HerbertML",
    "rating": 7.8,
    "comment": "You have to play this with people with a solid character. Some times the game is very HARD. With the right people, it is great.\n/*#W3*//*stay*/",
    "timestamp": 1759356000
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "It's a negotiation game, so that tracks that it was supposed to be mean, as I've rarely seen a game that focuses on that mechanic that isn't mean. The game centers around trying to acquire income generating positions from other players. That way you get these positions is by offering bribes to that player. The mean part comes from the fact that the player receiving the bribes must take all bribes offered, but is not obliged to keep any promises that were exchanged with that bribe. It's very easy to lose a pile of money based on mixed motivations between different parties, and even securing such an income position is not even secure, as it can be given away later. This was very lean and very clean, almost too much so for my taste. I did like it, but it quickly became a game that I would play but never seek out on my own.",
    "timestamp": 1759356000
  },
  {
    "username": "Fernegul",
    "rating": 8.0,
    "comment": "It's a miracle that it even works and I think it falls apart completely if players aren't willing engage at least a little with its spirit. It really wants to be this sly, cutthroat game: the cover art, the dramatic examples of betrayal the rulebook and so on. But contrary to what others say, I felt that you really have to bring your own meanness. If you bring too little or too much I don't see it being very enjoyable at all.\n\nAnyway, the game is great fun when it works. Drags on a little too long towards the end; though that, as every other aspect of it, will be very group dependent.",
    "timestamp": 1748296800
  },
  {
    "username": "Tbirdmg",
    "rating": 7.5,
    "comment": "Great negotiation game that always causes pleasant disappointment. Screwage squared. Simple theme, light rule set, plays in under an hour.\nA new, cherished part of the collection.",
    "timestamp": 1747000800
  },
  {
    "username": "Kotro",
    "rating": 8.0,
    "comment": "Personal rating: 4/5",
    "timestamp": 1739487600
  },
  {
    "username": "wooloo1",
    "rating": 8.0,
    "comment": "Hardly any rules. Zero luck. My Geekbuddy mawilson4 describes it well: \"The whole thing is just players bargaining and swearing revenge.\" It's either for you or it's not. I think it's an absolute riot. Not much fun with players uncomfortable with being a little (a lot?) evil in a game.",
    "timestamp": 1737154800
  },
  {
    "username": "couchlife",
    "rating": 9.0,
    "comment": "09/05/2025 - Paypig simulation game. Genius",
    "timestamp": 1758492000
  },
  {
    "username": "r3r00t3d",
    "rating": 9.0,
    "comment": "One of the best negotiation games in the right setting.",
    "timestamp": 1754431200
  },
  {
    "username": "Grimsalt",
    "rating": 9.0,
    "comment": "The sleekest negotiation game ever conceived, far less protracted than it's heavier counterparts, excellent barometer to read the chemistry of a group ; precursor to Genoa by Rüdiger Dorn. Unsleeved SWN-013 (145 ppk) x 150 bills #√45 #flr #inv #log",
    "timestamp": 1754258400
  },
  {
    "username": "iMisut",
    "rating": 8.5,
    "comment": "Reseña de Intrigue en Misut Meeple",
    "timestamp": 1747000800
  },
  {
    "username": "Samuel Vriezen",
    "rating": 9.0,
    "comment": "Astonishing. This is not a game at all! Just lovely\n\nBut then it does turn out to be a game, of course, well okay, nobody's perfect",
    "timestamp": 1744927200
  },
  {
    "username": "Sunnyfield",
    "rating": 9.0,
    "comment": "★★★★★\nUncomfortably deceitful, yet excruciatingly funny.\n\nIt still happens every now and then that I discover an under the radar game that gets the full five stars. 30 year old Intrigue is such a hidden gem. I have not laughed so hard during a game in a while.\n\nIntrigue is truly simple. In your turn you collect your wages, allocate job applicants at your castle and send your own workers to other player's castles. The winner is the player with the most money after 6 rounds.\n\nThe heart of the game is accepting or rejecting job applicants at your castle. Since any worker in your castle will earn income for the player owning the worker, you will want some favours back from the other player. Time to start negotiating!\n\nThe natural thing is to demand monetary compensation for hiring a worker. If you both agree the other player has to pay you the money and then it is up to you: do you stick to your promise, or do you give the worker a lower paying job or do you simply dispel the worker to Elba or some other undefined prison island colony?\n\nNot keeping your promise will cost you your reputation of course. And it most likely will affect your chances elsewhere where your workers will need to be negotiated to work and earn income. But being deceitful at one point becomes a necessity. And the other players may be untrustworthy, but not dealing with them may cost you more! This is where the discomfort starts to kick in.\n\nThe player you trusted so much is starting to earn too much income, and now there is a new job applicant from another (untrustworthy) player that could kick the trusted player out of the job at your castle. Will you reward deceitfulness and punish trustworthiness? Was the relationship really mutually beneficial and truly built on trust, or just exploitative leeching? Or will you keep up the pretense, only to extort some more money out of your \"ally\", before dumping them?\n\nIt is hard to keep a straight face, and you must be able to remember it is just a game where betrayal and deceit are the core of the game. Laugh it all off! And if you cannot, then this game is not for you.\n\nIntrigue is about inevitable deceit and it requires activating an uncomfortable dark side of yourself. It probably works best in a group of people that you know and trust. Only play this with people who understand that the rules of the game require you to be a schemer and that your decisions are not a reflection of your character.",
    "timestamp": 1715983200
  },
  {
    "username": "glanfam",
    "rating": 8.5,
    "comment": "Screwage at its all time best.\nI have the nicer original edition.\n\nLooking to reacquire original edition",
    "timestamp": 1705878000
  },
  {
    "username": "Boardgameswithb7",
    "rating": 10.0,
    "comment": "Super mean and amazing!",
    "timestamp": 1759615200
  },
  {
    "username": "elqueaprende",
    "rating": 9.6,
    "comment": "-----------------------------\nEvil game... I love it.",
    "timestamp": 1759356000
  },
  {
    "username": "genoan",
    "rating": 10.0,
    "comment": "The purest form of cut throat negotiation game I know. It can be fragile, but many of the great games are. I think 5 is the best number of players.",
    "timestamp": 1752271200
  },
  {
    "username": "trodat123",
    "rating": 10.0,
    "comment": "exactly my type of game. Negotiation, Menacing, Backstabbing... nothing more to wish for",
    "timestamp": 1742857200
  },
  {
    "username": "ultimoratio",
    "rating": 10.0,
    "comment": "Negotiation, alliances, and backstabbing condensed into a small box game. No-luck game. Cutthroat, mean, and rough. A triumph!",
    "timestamp": 1736377200
  },
  {
    "username": "realityfoible",
    "rating": 10.0,
    "comment": "Intrigue is a deviously delightful game of pure negotiation.\nThe core mechanics are so simple that players will already be cutting deals before you finish explaining the rules, though I should say that it is much better with some house rules eliminating minimum bribes and making negotiation more freeform.\n\nThe beginning of the game feels very open; the world is your oyster and you could happily make friends and spend almost any sum for a short-term gains...\n...But as each round passes the stakes get higher, the board becomes claustrophobic, and negotiations become increasingly stressful.\nBy the end you'll be yelling, bargaining, and breaking deals while swearing your loyalties up and down just to eek out an extra buck.\n\nTight design, no random chance, constant player interaction, and short enough that no matter how heated it gets it'll soon be over and everyone can decompress and laugh together. I love the story the players tell together through their dickering.",
    "timestamp": 1717538400
  },
  {
    "username": "Xyt4n",
    "rating": 9.5,
    "comment": "Collection\nThis is in a nutshell why I play board games\n+ + + + highly intelligent demanding game\n+ + + you can be highly creative through diplomacy and strategic and tactical deals\n+ + + every decision is meaningful and not easy to make\n+ + + extremely interactive\n+ + + extremely dynamic\n+ + + extremely story-telling or roleplaying friendly. Extremely thematic\n+ + + nothing will be for free or random. You have to earn your points with clever social play\n+ + extremely rules light which helps flowing the game\no extremely group dependent. Can be a hit or miss. Its very inaccesible for people who take things personally and very fun for people who have fun in the process\no personally I do not get it why people think this is mean. Its just business. You need a good reputation, making good deals and be clear why you harm someone. Its not personal. Its math. And if you take its personal, then you are not a trustworthy business partner and this will cost you making a deal with me because of the risk. This game is hilarious.\nAlternative: Diplomacy and financial 18xx",
    "timestamp": 1704063600
  }
]