[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "Kind of like Ticket to Ride, but backwards in everything. I find it much less fun to play, though it was fascinating to see the evolution from this. It's more realistic, but way less fun.",
    "timestamp": 1726264800
  },
  {
    "username": "amon1223",
    "rating": 1.0,
    "comment": "Mechanics\nIR or IPO",
    "timestamp": 1717624800
  },
  {
    "username": "hacksword",
    "rating": 1.0,
    "comment": "(1 play) At least it's better than Ticket to Ride...but not by much.",
    "timestamp": 1157580000
  },
  {
    "username": "ratbulogg",
    "rating": 2.0,
    "comment": "Difficulty in blocking makes the small railroads too good.",
    "timestamp": 1525039200
  },
  {
    "username": "afcgamer3",
    "rating": 2.0,
    "comment": "I think this would be a good game to play, but not to buy and the theme is something that just doesn't attract me",
    "timestamp": 1254175200
  },
  {
    "username": "oldcrow",
    "rating": 2.0,
    "comment": "i havent played this game in about 7 years, and its rare for me to have a memory of hating a game.. this is one of them.",
    "timestamp": 1183932000
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not my theme",
    "timestamp": 1624312800
  },
  {
    "username": "cymric",
    "rating": 3.0,
    "comment": "Union Pacific had been sitting on the shelf for nearly two years ere I got a chance to really play it. The game is not bad, but it is certainly not good either, and most certainly vastly overrated here on the Geek. Much later I realised that Union Pacific is Alan Moon's take on Acquire, just as Stephenson's Rocket is Reiner Knizia's. However, as per usual with Moon designs, luck is far more prominent. There is a bit of thought involved when it is your turn, but if you put hoarding UP stock above all else (since the payoff is the biggest and not hampered by silly track restrictions), and then based on your gut feeling and a swift look around the table decide whether to invest or expand, you cannot go wrong, really.\n\nUpdate The above is both right and wrong: UP stock is important, but it just means that people will hoard it in such a way that relative differences remain small. No, what really destroys the game is the completely unpredictable dividend payout which can cement good and bad positions in such a way that players lose the game there and then because of it. It's easy to fix... probably, because all suggested fixes I've looked at to date still use some form of randomness in when the cards come out. Thus odd clumping may still appear. Stephenson's Rocket is probably the better game here.",
    "timestamp": 1445986800
  },
  {
    "username": "wkover",
    "rating": 3.0,
    "comment": "Original comment:\n\nA \"6\" rating assumes the unlimited UP stock variant is in effect. A \"4\" with the original rules.\n\nThe availability of particular stock on your turn is critical, and therefore frustrating. It can also be unfun to draw useless track cards turn after turn.\n\nUpdate:\n\nI'm don't know what I was thinking. I don't care for this game period, with or without the unlimited stock variant. There's nothing more frustrating than watching a competitor make a dramatic comeback due to the fact that they luck into just the right stock at just the right time.",
    "timestamp": 1304287200
  },
  {
    "username": "sutrebuh",
    "rating": 4.0,
    "comment": "Acquire bogged down! The game principle is well known: Which stocks do you think are around? Where will the price rise? The game board doesn't really contribute anything except confusion, and when people are diligently drawing from the pile, everyone is flying blind. And why shouldn't you do that, so that the others don't know what you have? The elegance of Acquire was lost without anything else being gained. At least Alan Moon then found an elegant, thematic implementation with Ticket to Ride.",
    "timestamp": 1665439200
  },
  {
    "username": "marcodegoede",
    "rating": 4.0,
    "comment": "Airlines, but a little different",
    "timestamp": 1663538400
  },
  {
    "username": "WineScar",
    "rating": 4.0,
    "comment": "We have played this so much, that we know all the best strategies, and it plays itself...",
    "timestamp": 1612825200
  },
  {
    "username": "bigfranco",
    "rating": 5.2,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "verandi",
    "rating": 5.0,
    "comment": "Outdone by so many other similar games that have come out since, Union Pacific is just dated. The different track types feel like a completely superfluous mechanic, the luck of the share card flop/draw is annoying, pushing your luck re: when the next scoring card will come out is a big part of the game and adds some drama but ultimately the game is just too long to be this random.",
    "timestamp": 1654034400
  },
  {
    "username": "FranklinTV",
    "rating": 5.2,
    "comment": "For me, with Airlines Europe, this game is now redundant. UPDATE 4.862 Jan 17. UPDATE: Pub Meeple Ranking Engine Dec 2020 (Rating: 5.160).",
    "timestamp": 1615676400
  },
  {
    "username": "awarb",
    "rating": 5.0,
    "comment": "Would prefer some house rules to speed up the game and make later turns matter more. Currently, the first few turns matter significantly more than the rest of the game.",
    "timestamp": 1573599600
  },
  {
    "username": "junesen",
    "rating": 5.0,
    "comment": "downgraded to a 5 from a 7 because of turn order issues\nThis used to be one of my go to games for 6 players, but the first player advantage/last player disadvantage is becoming a big issue for me. There are two big factors in going later: you tend to have less turns for each of the dividend rounds, and you are behind in the race for UP shares.\n\nFor example, I never laid down stocks and always traded in for UP stock. I ended up with 3 UP stocks. Jacob, who was seated right in front of me did the same thing and he ended up with 4 stocks. 4 stocks was enough to be 2 way tied for 1st. 3 stocks was enough to be 3 way tied for 3rd. This meant that from UP stock, Jacob earned $40 vs. my $18 for a $22 difference. This is a huge difference just because he was one ahead of me in turn order.\n\nThe number of turns before the first dividend also bit me. The first dividend card was drawn after Jacob's turn which meant I scored practically nothing for the first dividend round. I was about to lay down some stocks which should have earned me $5+. So roughly, the initial turn order costs me 33% of my score in this game. That is way too much.\n\nI think if I ever play this game again, I would institute two rules: infinite UP shares, and a \"skip\" after each dividend. The latter would work as follows: you would play a full round with everyone having a turn; if a dividend happens during the round, then after you finish the round you'll have a \"new\" first player who used to be the 3rd player (or something like that).",
    "timestamp": 1522274400
  },
  {
    "username": "Teamjimby",
    "rating": 5.0,
    "comment": "Union Pacific is a cross between Ticket to Ride and Acquire. It has the set collection and train placement aspect of Ticket to Ride with the stock investment and majority/minority aspect of Acquire.\n\nUnfortunately, I think Union Pacific loses the best aspects of both games. It doesn't have the route building of Ticket to Ride or other train games, and it doesn't have the mergers and acquisitions that Acquire does so well.\n\nStock market games generally aren't my cup of tea. Union Pacific doesn't come close to Acquire or even Stock Pile as a stock market game. While it does have trains, it doesn't come close to Ticket to Ride or Railways of the World as a train game. It's a hybrid that doesn't capture the best parts of the genres it is trying to combine.\n\nOne other gripe was that the graphic design is pretty poor. Twice in the game I thought a card was for a different stock than it actually was (red vs orange vs brown were similar, white vs gray were similar), and those mistakes cost me a ridiculous number of points and took me out of the game.",
    "timestamp": 1513638000
  },
  {
    "username": "tommynomad",
    "rating": 6.0,
    "comment": "I'd rather play Gloria Picktoria.",
    "timestamp": 1760306400
  },
  {
    "username": "Bagherra",
    "rating": 6.0,
    "comment": "Fair game.\nThe comparisons to Acquire are appropriate. This game does have a very similar feel to that game.\n\nI felt something missing as I was playing and I couldn't quite put my finger on what it was.\n\nThe downtime during the game was very evident.\n\nA good game but not great.",
    "timestamp": 1742857200
  },
  {
    "username": "Wario1962",
    "rating": 6.0,
    "comment": "200",
    "timestamp": 1731106800
  },
  {
    "username": "Tavenier",
    "rating": 6.0,
    "comment": "Was probably a good game in its time, but by now surpassed by other train themed games.",
    "timestamp": 1711321200
  },
  {
    "username": "Stas",
    "rating": 6.0,
    "comment": "Rating based on two plays.\n\nLast played: July 2008",
    "timestamp": 1710630000
  },
  {
    "username": "gsiegele",
    "rating": 6.0,
    "comment": "Update:gave this one away, pulled it out in 2023 and it hasn’t aged so well, a little too long for what it is, Ticket to Ride much better, or if uou want something deeper age of steam.\n\n—- Excellent rail / stock investment game, apparently plays very well with 6p.",
    "timestamp": 1702681200
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 4007396093001\nIJL4",
    "timestamp": 1757196000
  },
  {
    "username": "ConnerCP",
    "rating": 7.0,
    "comment": "sell",
    "timestamp": 1754431200
  },
  {
    "username": "Beastly_Venturer",
    "rating": 7.0,
    "comment": "2 plays",
    "timestamp": 1742079600
  },
  {
    "username": "vtopa",
    "rating": 7.5,
    "comment": "Extremely good game. One of the games I would like to play again and again even with the same competitors. It is interesting mechanics combined on single board. Top idea that there are no \"own\" colors or units on the game table and each player may use all infrastructure. Becomes boring for two persons at the end, while the searching through card ongoing much slower compared with train building.",
    "timestamp": 1759615200
  },
  {
    "username": "Robert Osvalds",
    "rating": 8.0,
    "comment": "Excellent game! I really enjoy when designers install a sytem into the game that requires sacrifice. On your turn you have a CHOICE of playing stock or getting stock (which increases the value of one line). There is a further agonizing decision to trade away stock for U.P. stock. Game play is fast, and down time is minimal. I think it plays best with 4 players. I like the unpredictable way that the pay-outs happen. Great components too! Better than TICKET TO RIDE, this is ALAN MOONs masterpiece",
    "timestamp": 1758837600
  },
  {
    "username": "lisapc",
    "rating": 8.2,
    "comment": "Keep",
    "timestamp": 1745100000
  },
  {
    "username": "p00q",
    "rating": 9.0,
    "comment": "The better of the Alan R. Moon train games. The push and pull between expanding infrastructure and taking the time to invest before dividends pay out is extremely smart.",
    "timestamp": 1744754400
  },
  {
    "username": "giorgiopaco",
    "rating": 9.0,
    "comment": "A great example of simple and profound rules. Very nice.",
    "timestamp": 1744322400
  },
  {
    "username": "JustHavinFun",
    "rating": 9.0,
    "comment": "I love games of this type, that have really only a very few things you can actually do on your turn, but the choice between which action you'll take is REALLY crunchy. High player interaction because your choices are directly influenced by your opponents' choices, which really prompts you to read the ever-changing board state.",
    "timestamp": 1709766000
  },
  {
    "username": "SeanC",
    "rating": 10.0,
    "comment": "Irresistible. There is so much tension via calculated risk taking (OK - outright gambling) that the game is always fun to play. You have a tough decision to make every turn. Contrary to what you may have heard, a majority stake in U.P.* shares does not equal victory. It IS important to figure out early on who is committed to the UP share strategy, and who is likely to press their luck. Highly re-playable game - different every time.\n\n*Apparently, there are different versions of how this works depending on which printing you have, I'm most familiar with having to discard a non-UP share at the end of my turn to get a UP share. I think the other version is picking a UP share as your entire action for the turn.",
    "timestamp": 1727215200
  },
  {
    "username": "Euroman",
    "rating": 10.0,
    "comment": "My favorite board game of all time!!! Though it deals with trains, this is not a \"train\" gain like Empire Builder and the rest. Very simple rules, with the stress of never knowing when that score card will show up. This game has often been compared to Aquire. I see a slight similarity, but I don't like Aquire and I love Union Pacific. (Suggest not using the tracks in a 6-player game.)",
    "timestamp": 1707260400
  },
  {
    "username": "patox",
    "rating": 10.0,
    "comment": "Age of Steam Deluxe Plastic Chips",
    "timestamp": 1634853600
  }
]