[
  {
    "username": "johncraven",
    "rating": 1.0,
    "comment": "Terrible game which is a total luckfest: at the same level of intelligence as Poo or Nuts. Maybe if you like the comic book...",
    "timestamp": 1320620400
  },
  {
    "username": "quietcorn",
    "rating": 2.0,
    "comment": "the game tends to go until someone can jump from few points to tons of points in the same move rather than have a satisfying build.",
    "timestamp": 1718920800
  },
  {
    "username": "Rolan Snyder",
    "rating": 3.0,
    "comment": "Deciding when and how to play your cards offers few interesting decisions, which the roll of the dice makes negligible.",
    "timestamp": 1435701600
  },
  {
    "username": "Tsaar",
    "rating": 4.0,
    "comment": "Lame game, cool cards.",
    "timestamp": 1499119200
  },
  {
    "username": "robmderrick",
    "rating": 5.0,
    "comment": "... plus expansion",
    "timestamp": 1755122400
  },
  {
    "username": "GameCat3",
    "rating": 5.0,
    "comment": "nice art, silly party game. What I do highly recommend is the comic book series this is based on, with more of that unique art style, tons of humor, poetic writing, solid storytelling... Sergio is a genius!",
    "timestamp": 1630620000
  },
  {
    "username": "tiagoVIP",
    "rating": 6.0,
    "comment": "Designer: Sergio Aragonés, Ken Whitman\nPlaying time: 45 Min\nWeight: 1.50 / 5\nPublisher: Archangel Studios\n\nCOMPLEXITY: Low. While there are room for some thought about what to play, what to discard, when to attack and such, normally, you will simply do all that you can with the given resources, and take some care (if possible) to protect yourself and not giving space for someone else to grow too much.\n\nCOMPONENTS: Low. The cards are OK and the Aragonés art is, as expected, great. But the dice are cheap - is have to place stickers and with not many uses, wear is already visible.\n\nDOWNTIME: Medium. The more players you have, more downtime, but with the possibility of play some cards in other players turns, as well as being able to use resources from the dice the others couldn't, give a bigger sense or participating while isn't your turn proper.\n\nFUN: Medium. This is a game heavy on luck and take that. Yes, is this type of game, very 90ties. If you don't enjoy this sort of thing, you won't have fun here.\n\nINTERACTION: High. Resources you don't use go to next person; armies can attack your city and destroy buildings (which are the source of points in the game). Also, there are cards that move Groo around, and can activate him in the city he is, often to great destruction.\n\nPLAYING TIME: Low. Maybe is luck, maybe is how our grup play, but we are yet to have a game that lasts over 25 minutes. We even had a game that lasted just five! If the game did took us the projected 45 minutes, it would be (medium). But as it is, low is the place.\n\nLUCK: High. Is boarder line very high, since the draw of cards is blind, the use of resources comes from a die roll that you can even re-roll. Yet, the game does provide the chance to discard before actually playing yor turn, which helps a lot. And there is some choice in where to use what is given. Nonetheless, this is far from a strategy game - is akin to Munchkin.\n\nREPLAY VALUE: High. Due to the several random factors, the different abilities of buildings and troops, and the good amount of them, plays will go by different routes often.\n\nSOLITAIRE: Very low. This game isn't meant for solo play, nor have rules for it.\n\nTHEMATIC: High. Many of the debatable elements of the game (the chaos, the destruction) do indeed remember me of what happens in a Groo comics. One simply can't predict his actions - mayhem, often, but not always. Several of the cards also have thematic consistency and flavor.\n\nFinal comments: Groo: The Game is a product of its time - an older design that shows its age. The amount of luck, the bash of the leader, the take that - it is almost surprising that there is no player elimination, but I guess having your city in ruins after Groo is activated there, almost counts as that (but not really, as can be easy to reconstruct with some luck in the dice).\n\nStill, is plays rather fast, and does provide several decision points for the players - you can take risks or play more conservative. We had more fun than expected, and played several games in a row. It will definitely appear more times at our tables, being just a quick and interactive romp, with little pressure or deep strategy.",
    "timestamp": 1676934000
  },
  {
    "username": "ChazM",
    "rating": 6.0,
    "comment": "Max",
    "timestamp": 1632434400
  },
  {
    "username": "rmiczek",
    "rating": 6.8,
    "comment": "A chaotic, two player, take that, kind of game. This one should not be taken too seriously. There is a lot of battling and destroying opponents armies and buildings. Heavy luck with dice and card draw but there is some mitigation with special abilities. Groo's effects are probably the most annoying as he can basically destroy your whole tableau. I don't know the comic from this one but I would assume if you like the theme you'll be into this game. I actually didn't think it was too bad and would play if asked again.",
    "timestamp": 1749333600
  },
  {
    "username": "killgard",
    "rating": 8.0,
    "comment": "Got this game when it came out back in the late 90s, and have since played it regularly with family. A year or so ago, one of my kids spilled a can of soda and ruined the cards (the deck was in its box and I found it the next morning, completely swollen and glued together by the spilled beverage). I found a replacement for the game on the Geek Market and we're very excited to own it again!",
    "timestamp": 1591308000
  },
  {
    "username": "toomanyminis",
    "rating": 9.0,
    "comment": "Purge 05/2023",
    "timestamp": 1684274400
  },
  {
    "username": "Guthwine3",
    "rating": 9.6,
    "comment": "Spare copy purchased on or around the time I got our playing copy. This copy is new and unused but has been opened and placed in protective card pages so that others may view them. Bought this so that I'd have spare copies of all the cards when or if my playing copy is ever damaged or lost.\n\nUPDATE: gifted to my daughter in winter of 2023!",
    "timestamp": 1704582000
  }
]