[
  {
    "username": "sunibd",
    "rating": 1.0,
    "comment": "We couldn't work out how to play this!",
    "timestamp": 1557007200
  },
  {
    "username": "Lanternaut",
    "rating": 2.0,
    "comment": "Some kind of UNO-variant made worse trying to force a theme to it. You follow suite and hope it doesn’t drag too long.\n\nArtwork aside, I have barely anything good to say. Having more villains appear through the deck is something, at least, so even if you get that first one you have a real reason to accuse someone else. But it's an awful game in nearly every sense.\n\nUnfortunately, this is one of our regulars and I just bite down and bear through. It is only some kind of filler, after all...",
    "timestamp": 1507327200
  },
  {
    "username": "Captain Quirk",
    "rating": 3.0,
    "comment": "Could have been so much better. The game play is confusing and doesn't make much sense. Too bad as we normally like Sherlock Holmes themed games.",
    "timestamp": 1673305200
  },
  {
    "username": "Ironmann",
    "rating": 4.0,
    "comment": "The game went on too long and we lost interest after the second round of six.",
    "timestamp": 1741215600
  },
  {
    "username": "littlepurplerocks",
    "rating": 5.0,
    "comment": "A few glaring problems - feels like there wasn't enough play testing.\nBut enjoyable if the company is good.",
    "timestamp": 1727820000
  },
  {
    "username": "Quitch",
    "rating": 5.0,
    "comment": "A really small decision space, with mostly you praying someone plays a card you can play off. I dreaded having to do reshuffles, which just murdered the pacing.\n\nThe core of a decent idea is in there, but the implementation leaves much to be desired.",
    "timestamp": 1711494000
  },
  {
    "username": "vampirschi",
    "rating": 6.0,
    "comment": "Sleeved.",
    "timestamp": 1737932400
  },
  {
    "username": "RalfMalf",
    "rating": 6.0,
    "comment": "I'm a sucker for the theme but this game meanders a little and can easily outstay it's welcome. Ok once a year.",
    "timestamp": 1677798000
  },
  {
    "username": "DazBro",
    "rating": 7.0,
    "comment": "Nostalgia",
    "timestamp": 1758146400
  },
  {
    "username": "NotMyHeart",
    "rating": 8.0,
    "comment": "Really enjoy playing this game, with the randomness and the constraints of what can follow each card. It really understands Sherlock Holmes as well, it isn't just a game where they've slapped SH over the top and called it a day. It's good fun with 4 in my opinion.",
    "timestamp": 1744236000
  },
  {
    "username": "stopfi666",
    "rating": 8.5,
    "comment": "I have no idea how often we played this game. Often...very often. We played it, until the cards went blind...",
    "timestamp": 1539554400
  },
  {
    "username": "fake",
    "rating": 10.0,
    "comment": "y",
    "timestamp": 1663192800
  }
]