[
  {
    "username": "Big Bad Lex",
    "rating": 1.0,
    "comment": "Tile laying Games Workshop production which requires some time spent with the rule book before you kick off. Worth the effort\n\nUnfortunately on 26-11-2009, BGG were instructed to remove all uploaded files all all GW games. Even those files with no copyrite material.\n\nThe games might be OK but the company attitude to it's customers is definitely broken. All my GW game ratings are reduced to '1's until GW mend their piss poor attitude to their client base and files are allowed to be reinstated..",
    "timestamp": 1259190000
  },
  {
    "username": "Cynical",
    "rating": 1.0,
    "comment": "Pull random chit. Roll die to see what the chit fights. Roll to see what your chit does. Repeat.",
    "timestamp": 1248991200
  },
  {
    "username": "Itxi",
    "rating": 2.0,
    "comment": "A confusing mess of mechanics which do not blend together to make an appealing game. Poor graphical design makes the board difficult to read and there are no prompts for special rules (eg, extra movement costs of some tiles) to speed up gameplay. Would not recommend.",
    "timestamp": 1698444000
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1636585200
  },
  {
    "username": "Khan3",
    "rating": 3.0,
    "comment": "V",
    "timestamp": 1668380400
  },
  {
    "username": "ewokracoonbreder",
    "rating": 3.0,
    "comment": "Titan-lite...haven't played this one in a few years.\n\nFun game if you can get three people to play with you.",
    "timestamp": 1489618800
  },
  {
    "username": "Legomancer",
    "rating": 4.0,
    "comment": "Session report here.\nhttp://www.boardgamegeek.com/thread/84894\n\nHard to rate this. It's not a bad game for what it is, but it just doesn't know what it is. Way too long, too random, too silly, too fiddly for anyone, I think, to get much repeated entertainment from it.",
    "timestamp": 1520290800
  },
  {
    "username": "vanmetal",
    "rating": 4.0,
    "comment": "Silly, light 4X game. Very random.",
    "timestamp": 1466028000
  },
  {
    "username": "B_Moores",
    "rating": 5.0,
    "comment": "It seemed great at the time.",
    "timestamp": 1706482800
  },
  {
    "username": "haraggan",
    "rating": 5.0,
    "comment": "I'll be willing to try this game again, preferably with more players, to see if it improves. Some of it is fun and clever but, as with most Tom Wham designs, there are scads of special abilities and exceptions to the rules that need to be remembered - or looked up repeatedly - and a few lucky events and dice rolls can have a vastly disproporionate effect on the game.",
    "timestamp": 1636498800
  },
  {
    "username": "HansDavion",
    "rating": 5.0,
    "comment": "I enjoyed this as a kid and so bought it again off eBay. The bits are really fiddly and the rules uninspiringly written (like so many games back then I suppose) so I gifted it away.",
    "timestamp": 1609196400
  },
  {
    "username": "Boerni72",
    "rating": 5.0,
    "comment": "Impulse Buy",
    "timestamp": 1591308000
  },
  {
    "username": "Zenfire",
    "rating": 6.0,
    "comment": "Played once. Too much dice roll and silly roleplaying for my taste. This game is silly, but quite fun and enjoyable. For a really old game it actually quite impressive even. Definitely the best game so far from the year 1986.\n\nPlayed: 1 time.",
    "timestamp": 1749592800
  },
  {
    "username": "BigM23",
    "rating": 6.0,
    "comment": "Falk",
    "timestamp": 1737327600
  },
  {
    "username": "King_Custard",
    "rating": 6.0,
    "comment": "Box 4",
    "timestamp": 1713650400
  },
  {
    "username": "elflum",
    "rating": 6.0,
    "comment": "We appreciate the surreal humor but it's too old for us",
    "timestamp": 1637449200
  },
  {
    "username": "mau133",
    "rating": 7.0,
    "comment": "Brett 2023 (flea market)",
    "timestamp": 1742598000
  },
  {
    "username": "tphon",
    "rating": 7.0,
    "comment": "No cards",
    "timestamp": 1728856800
  },
  {
    "username": "Nodens",
    "rating": 8.0,
    "comment": "A wild game that holds a special place in my heart. Few games are as funny while as serious",
    "timestamp": 1759010400
  },
  {
    "username": "Rodimzew",
    "rating": 8.0,
    "comment": "game is fun, with family and friends.",
    "timestamp": 1735426800
  },
  {
    "username": "Nortelephan",
    "rating": 9.0,
    "comment": "It is quite a serious strategy game.\nThe illustrations and the tongue-in-cheek tone used in the rulebook make it sound like a casual Munchkin style game, which it is not.\nYou also have to deal with the luck of dice rolling and drawing things from the bag.\nAnd if a game is not over in one hour, it is likely to take three hours of attrition warfare.\nStill, I like the game.\n\nR-3",
    "timestamp": 1751752800
  },
  {
    "username": "mothertruckin",
    "rating": 9.0,
    "comment": "with replacement forest tile.",
    "timestamp": 1718575200
  },
  {
    "username": "mjlwood",
    "rating": 10.0,
    "comment": "got me into board gaming, never lower than a 10",
    "timestamp": 1738882800
  },
  {
    "username": "Rod_66",
    "rating": 10.0,
    "comment": "Great game. Prefer Tom Wham's artwork although I have the Z man edition and the West End edition. Have used double sided tape and very thick card to make the West End counters really thick. Then use them with the Z Man terrain tiles.",
    "timestamp": 1608678000
  }
]