[
  {
    "username": "huffa2",
    "rating": 1.0,
    "comment": "My attempts at playing this can't be described as \"plays\" as I couldn't get the thing to work at all. Fiddly, confusing, annoying. Not a game for me but a collection of magnets in a box.",
    "timestamp": 1395529200
  },
  {
    "username": "rseater",
    "rating": 1.0,
    "comment": "the rules are not well formalized, so this is not really qualify as a game. It is fun to play with, but you have to take a huge amount on good faith on what acceptable play and what \"isn't cricket\".",
    "timestamp": 1355958000
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1635544800
  },
  {
    "username": "kevan",
    "rating": 2.0,
    "comment": "Great gimmick component of placing pieces so that they float at an angle against nothing, but the game is essentially just a matter of trying to balance these things and your opponent getting one point each time you slip up.",
    "timestamp": 1526594400
  },
  {
    "username": "bagio99",
    "rating": 3.0,
    "comment": "Neat and unique dexterity game, but unfortunately it demands very fine motor-skills in a vibration-free environment.",
    "timestamp": 1672441200
  },
  {
    "username": "Cinful",
    "rating": 3.0,
    "comment": "Keep - Collection",
    "timestamp": 1641164400
  },
  {
    "username": "logopolys",
    "rating": 4.0,
    "comment": "Dexterity game that relies on magnets. Cool gimmick, more fun to play around with than to play.",
    "timestamp": 1759356000
  },
  {
    "username": "tempar",
    "rating": 4.0,
    "comment": "A gimmick, not fun to play.",
    "timestamp": 1646607600
  },
  {
    "username": "Goblin_Magnus",
    "rating": 5.0,
    "comment": "2 A",
    "timestamp": 1700866800
  },
  {
    "username": "b0ardgamer",
    "rating": 5.0,
    "comment": "A curiosity more than a game.",
    "timestamp": 1679266800
  },
  {
    "username": "Overexposed",
    "rating": 5.0,
    "comment": "A clever idea, but mainly a parlour game/trick that is fun for a game or two when there are new players to show it to. I can't see wanting to play it multiple times. You're basically doing the same placement every turn. Maybe once both players have mastered the the basic motions, the game gets more interesting? Or less interesting?\n\nThe components are good quality and it's nice that the game rolls up into a tight tube, although it's a bit long for travel (could be folded).",
    "timestamp": 1648418400
  },
  {
    "username": "scordo13",
    "rating": 5.0,
    "comment": "This game is just okay. We'll bring it out from time to time, but not a clear favorite.",
    "timestamp": 1604876400
  },
  {
    "username": "lisapc",
    "rating": 6.0,
    "comment": "Keep",
    "timestamp": 1745100000
  },
  {
    "username": "Bagherra",
    "rating": 6.0,
    "comment": "A bit weird with difficult instructions. It makes for an AWESOME toy",
    "timestamp": 1742857200
  },
  {
    "username": "kastel",
    "rating": 6.0,
    "comment": "Rd2",
    "timestamp": 1733439600
  },
  {
    "username": "Rygel",
    "rating": 6.0,
    "comment": "Two Player value = Poor\n\nThree Player Value = Poor. This is a two player game that requires teams to play with more. That really brings the game play down.\n\n\nPolarity is an odd game. In fact, I am not sure much of a game actually exists. Even the designer stated that Polarity is less of a game and more like a sculpture. So it is a sculpture where you score points.\n\nPolarity is a dexterity game where players try to balance magnets off the opposite poles of other magnets in an attempt to get their magnet to float in the air.\n\nThe dexterity part of the game is a bit rough. Learning the trick of balancing a single magnet off another single magnet in the clear is easy enough. The same goes for balancing a single magnet off two magnets that form a tower. However, once a tower contains three or more magnets it is near impossible.\n\nAdd to that a confined play area where you will need to judge the magnetic forces of several opposing magnets and the game gets very difficult.\n\nIt certainly is a novel concept for a game and it is good fun to see magnets floating in the air for the first time.\n\nThe few components the game has are all very nice. The magnets are built well and are strong. the canvas board and bag are a good touch.\n\nThe scoring is where the game falters. Learning the scoring rules is very simple. No complex rules here. Scoring points is not difficult either. Actually, scoring is too easy. With the difficulty is placing magnets, scoring points is extremely easy.\n\nOverall, the game is fun for first-timers and for the occasional play of a silly dexterity game.\n\n\nPros -\n- Silly fun\n- New and interesting design\n\n\nCons -\n- Rough to learn proper magnet placing\n- Which makes scoring too easy\n\n\nOverall Playability = 6.1\n\nDesign = 6\nStrategy = 5\nLuck = 6\nArtwork & Components = 5\nUse of Mechanics = 9\nTime of Play = 8\nFun = 5\nInnovation = 9\nAnalysis Paralysis = 6\nTheme = 2\n\n\n------------------------------------------------------\n\n\nUnique Component - Magnets\n\n\nUnique Mechanic - Making magnets float as they push against the opposite polarity of other magnets.\n\n\nQuick Thoughts - This is an odd game. It is fun to make the magnets lean and float. I am just not sure there is much of a game here though.\n\n\n------------------------------------------------------\n\n\nGot in 2014\n\n\nTwo Player Game List -\nhttp://boardgamegeek.com/geeklist/171376/item/3429049#item34...\n\nThree Player Game List -\nhttp://boardgamegeek.com/geeklist/171378/item/3765916#item37...",
    "timestamp": 1731452400
  },
  {
    "username": "beerwah2000",
    "rating": 7.0,
    "comment": "1,68\n8+\n2\n20min\nMagnets\n4005",
    "timestamp": 1745445600
  },
  {
    "username": "anton",
    "rating": 7.0,
    "comment": "Frustrating, Fist-Shaking and ultimately Fascinating game where the opposing forces are magnetic fields.\nIf you want to sharpen your hands' fine dexterity movements, this is the tool for you.\nI've used Polarity with my STEM class students, and it never fails to achieve maximum interest and understanding from them.",
    "timestamp": 1740351600
  },
  {
    "username": "faidutti_ludotheque",
    "rating": 8.0,
    "comment": "Polarity est l’un de ces jeux qui, dans une convention ou une rencontre de joueurs, attire immanquablement une foule de spectateurs intrigués par l’objet jeu et curieux de comprendre comment ça marche. Il est vrai que, vu de l’extérieur, une partie de Polarity semble un défi aux règles de la physique newtonienne, du moins jusqu’à ce que l’on réalise que les pions sont très fortement aimantés.\n\nPolarity est un jeu de stratégie et d’adresse pour deux joueurs dans lequel chacun à son tour doit placer sur le plateau de jeu – un tapis de toile – un pion reposant en équilibre sur le champ magnétique généré par un autre de ses pions. Cela semble d’abord impossible, mais après quelques tâtonnements, on finit par attraper le coup de main, puis par réaliser des coups de plus en plus improbables dans le chaos magnétique que devient peu à peu la surface de jeu. C’est à peu près tout, le plus gros des règles étant consacré à ce qui se passe en cas de rupture des fragiles équilibres magnétiques, de pions qui tombent à plat ou qui s’attirent trop violemment et finissent par s’empiler.\n---\nPolarity is one these games which, in a gaming gathering or convention, always attracts many spectators, intrigued by a strange gaming object and eager to understand how it works. From the spectator’s point of view, a game of polarity looks like a successful challenge to Newtonian physics, until you realise that all pawns are very strong magnets.\n\nPolarity is a strategy and dexterity game for two players in which each player on turn must place a pawn on the gaming surface, a circle drawn on a white cloth. The trick is that each pawn must be balanced on the magnetic field generated by another of the player’s pawn. It seems impossible at first, but after a few turns you get the hang of it, and start to make more and more unlikely moves in the growing magnetic chaos. That’s the heart of it, and the detailed rules mostly deal with what happens when the fragile magnetic balance is broken, when a pawn falls flat on the cloth or when two or more pawns are so strongly attracted that they spontaneously form a pile.",
    "timestamp": 1694815200
  },
  {
    "username": "OdysseusX",
    "rating": 8.0,
    "comment": "Weight: 1.69 / 5",
    "timestamp": 1580338800
  },
  {
    "username": "millsyboy",
    "rating": 9.0,
    "comment": "Hearing about it, it didn’t seem like it should work, but it really is a great, tactical dexterity game. I’m not good at it, but I find it enormously fun to play",
    "timestamp": 1739919600
  },
  {
    "username": "plysbjorn",
    "rating": 9.0,
    "comment": "This is a very different experience. Applied physics, dexterity and strategy rolled into one pretty zen package. Lovely.\n\nWarning: English rules are horribly written. Feels like they where written in shorthand. Translated into french and back to english again through Babelfish. What's really strange though is that the german rules (in the same booklet) are so much more clearly and consistently written. It's not the same basic text that has been translated. It's more like the publishers asked two different people write the rules separately. Weird.\n\nAnyway, this is a game I want to play again and again.",
    "timestamp": 1547938800
  },
  {
    "username": "darkgaze",
    "rating": 10.0,
    "comment": "Terribly difficult and fun. The cloth gets a little wrinkled but that adds to the fun",
    "timestamp": 1613343600
  },
  {
    "username": "Cayden101",
    "rating": 10.0,
    "comment": "Simple game of floating magnets. If you don't like it you're wrong.",
    "timestamp": 1543100400
  }
]