[
  {
    "username": "Kelgogi",
    "rating": 1.0,
    "comment": "As an avid chess player, my experience with Knightmare Chess was fairly offensive. Clearly, this is a biased opinion, so take my rating as you will. It's the only 1 rating I've ever given a game (both versions of Knightmare Chess that I tried).",
    "timestamp": 1444687200
  },
  {
    "username": "CortexBomb",
    "rating": 1.0,
    "comment": "Let me preface this review by saying that I'm far from a Chess purist. I've dabbled with the game for years, and I've never been anything more than an adequate player.\n\nThus, when my friend Justin asked me to play this variant, I was interested, anything which can add a new wrinkle is worthy of a try right?\n\nWell, not really. I'm not a big fan of Steve Jackson games in general, and Knightmare Chess is their biggest strike out to date.\n\nChess, as most people are aware, is one of the great pure strategy games of perfect information, perfect information meaning that you know exactly as much as your opponent does about the game state, and thus, it's entirely up to skill to see who can take advantage.\n\nKnightmare Chess destroys this basis of the game, and it takes the one hallmark of chess, pure strategy and planning, and throws it out the window.\n\nWithout knowing how your opponent's pieces can legally move you can't form any viable strategy, and you're best off moving with almost utter whimsy, as trying to set up a combination, or a winning mate is nigh impossible while there are still cards in their hand.\n\nIf you want to play an entirely new game with your old chess board, and you like playing games almost entirely for fun, with no concerns about strategy carrying the day, then pick this up and give it a try. Others are advised to stay away.",
    "timestamp": 1288216800
  },
  {
    "username": "Pandorzecza",
    "rating": 1.5,
    "comment": "Bez sensu",
    "timestamp": 1642114800
  },
  {
    "username": "BradJacobs",
    "rating": 2.0,
    "comment": "This is a cool idea, but in reality it's just meh. I don't like Chess much, but I'd rather play Chess than this",
    "timestamp": 1611183600
  },
  {
    "username": "ironvulture",
    "rating": 3.0,
    "comment": "Interesting idea to spice up boring old chess. Would rather play this version over regular chess any day.",
    "timestamp": 1409090400
  },
  {
    "username": "cadavaca",
    "rating": 3.0,
    "comment": "Nifty idea, beautiful artwork, but the game is unnecessary. Individual fixed decks or open information could improve this, but I'm not enamored enough to try.",
    "timestamp": 1271973600
  },
  {
    "username": "BillNC",
    "rating": 4.0,
    "comment": "Too much chaos for a serious game.",
    "timestamp": 1643324400
  },
  {
    "username": "visard",
    "rating": 4.0,
    "comment": "Chess with a deck of cards that break the rules in various ways. Highly random.",
    "timestamp": 1428703200
  },
  {
    "username": "Erhoads",
    "rating": 5.0,
    "comment": "Game takes 30-60 minutes to set up as you have to read a lot of cards which have very long descriptions. Then the game takes 5 min. Would rather just play normal chess.",
    "timestamp": 1734303600
  },
  {
    "username": "AlternativeOwl3433",
    "rating": 5.0,
    "comment": "Knightmare Chess deserved better, but it doesn't work for chessplayers because the superpowered cards nullify chess ability, while non-chessplayers think chess skill is required.",
    "timestamp": 1705014000
  },
  {
    "username": "Druivenclub",
    "rating": 5.0,
    "comment": "Hans",
    "timestamp": 1693778400
  },
  {
    "username": "okami31",
    "rating": 5.0,
    "comment": "It throws the all-too-serious chess game into total chaos, or the closest thing to it. Just try to find a chess player willing to accept the crazy changes to the traditional gameplay. That was sarcasm by the way.",
    "timestamp": 1664920800
  },
  {
    "username": "Mizerak",
    "rating": 6.0,
    "comment": "Together with KC 2, sold at a local used game auction.",
    "timestamp": 1758146400
  },
  {
    "username": "KoolerAidMan",
    "rating": 6.0,
    "comment": "2 players. Duo.\n\nDo not sleeve.",
    "timestamp": 1756072800
  },
  {
    "username": "SultanSevy",
    "rating": 6.0,
    "comment": "USED - Card deck",
    "timestamp": 1747692000
  },
  {
    "username": "Hellionus",
    "rating": 6.0,
    "comment": "with Knightmare Chess 2 (1998)",
    "timestamp": 1725746400
  },
  {
    "username": "casparvansliedregt",
    "rating": 7.0,
    "comment": "Tweede deel in bezit, 1e nog niet",
    "timestamp": 1748469600
  },
  {
    "username": "Smokalotapotamus",
    "rating": 7.0,
    "comment": "Review: One of the better Steve Jackson games most likely because Steve Jackson had nothing to do with it.\n\nDesigners: Pierre Cléquin, Bruno Faidutti\nArtists: Jeff Koke, Gérard Mathieu, Anthony Rezendes, Rogério Vilela\n\nCategories: Abstract Strategy, Card Game, Expansion for Base-game\nMechanism: Grid Movement\n\nTags: Best Two, Two Only, Fantasy, Small",
    "timestamp": 1717797600
  },
  {
    "username": "albcann",
    "rating": 8.0,
    "comment": "Fun chess variant that mixes chess with card play. However, there really is very little resemblance to chess once the cards are added. Kings leave the board, pieces shoot each other, meld into combo pieces, explode and wipe out areas of the board. Take it for what it is and it is a lot of fun. But if you expect a chess game, you won't find it here.\n\nEDIT: I, personally, have always used comments here to help learn about games, so I always try to say something useful ... while carefully avoiding untrue or misleading comments. Someone stated below that it takes 30-60 minutes to set the game up (due to extensive card reading), yet 5 minutes to play the game. Whatever game this person was playing, was not Knightmare Chess. That is a preposterous take on the game that is absolutely false. If you choose the variant where you use 150 points to create a deck, yes, it will take probably 15+ minutes to prep for your game. But playing the game cannot possibly take only 5 minutes unless the variant also includes only 10 moves per side, or someone rage quits. In fact, the gameplay is quite the opposite ... the games can run much longer than a normal chess game because no player is ever out of the game due to the strength of the cards. In fact, I just played a game where my opponent played a card that captured my queen on about the 5th turn of the game, yet the game lasted an hour before I finally was defeated.\n\nMy long winded point ... 30-60 minutes to set up to play a 5 minute game is 100% false and that is not up for debate.",
    "timestamp": 1741906800
  },
  {
    "username": "Daemonsson",
    "rating": 7.5,
    "comment": "9/2/2017 - Most recently played Jack Fry and James Hopkins. Memorable last card miracle win against Jack. Huge loss to Jim.\n\n31/12/23 - never leaving under any circumstance",
    "timestamp": 1703977200
  },
  {
    "username": "Syno",
    "rating": 9.0,
    "comment": "Underrated.",
    "timestamp": 1727042400
  },
  {
    "username": "elwayfan2k",
    "rating": 8.9,
    "comment": "Reviewed",
    "timestamp": 1558994400
  },
  {
    "username": "Palmberg",
    "rating": 10.0,
    "comment": "2 player. super great game based on chess. chaotic and very open in different strategies, counter-strategies and tactics.",
    "timestamp": 1691359200
  },
  {
    "username": "Loganator",
    "rating": 10.0,
    "comment": "Awesome chess variant. Highly recommend.",
    "timestamp": 1589752800
  }
]