[
  {
    "username": "Prinzessin",
    "rating": 2.0,
    "comment": "Handeln und langweilen",
    "timestamp": 1510786800
  },
  {
    "username": "eisenphx",
    "rating": 2.0,
    "comment": "Way to much luck of the dice in a 4-player game. I consider this game close to being broken.",
    "timestamp": 1164582000
  },
  {
    "username": "MisterEnigma",
    "rating": 3.0,
    "comment": "Pretty much just straight, awkward negotiations. Not enough going on to give anyone a hidden agenda or add anything interesting to those negotiations. Whoever goes up early seems to have a huge advantage for the rest of the game.",
    "timestamp": 1651788000
  },
  {
    "username": "Pandorzecza",
    "rating": 3.0,
    "comment": "Not for me",
    "timestamp": 1636498800
  },
  {
    "username": "bandit_boy7",
    "rating": 4.0,
    "comment": "3 rounds x 30 minutes per round—this just overstays its welcome.\nMaybe in the 90's I would have sat for the whole game, but today it just feels like something I want to finish in 1 round & move on to a more fun game. There IS a long game strategy here (and I have played it), but I was happier to concede after 1 round and move on to something else, rather than try to see if I could win after another hour of play.\nAt 3 players, it's frustrating to not get to do your action. At 4 players you almost never get to take your action. Even if you're a smooth trader, it's just too frustrating turn-after-turn. I wanted more possible actions to choose from—there's no skill required to predict what other players will want to do: there are only 3 options.",
    "timestamp": 1748296800
  },
  {
    "username": "tphon",
    "rating": 4.0,
    "comment": "No cards",
    "timestamp": 1728856800
  },
  {
    "username": "DavidNiecikowskiPhD",
    "rating": 5.0,
    "comment": "Decent game with simple rules that must be followed in order to fully appreciate; for example, we did not realize that the first piece to make a lap gets 10 points which made a certain card more important (we had an immediate paradigm shift when we realized what we did wrong). BTW: We are going to implement players placing gained gems behind screens so as to make the game more competitive for players who cannot make quick calculations when bartering; otherwise, seeing each other's gems can lead to analysis paralysis.",
    "timestamp": 1727215200
  },
  {
    "username": "westbrookgamer",
    "rating": 5.0,
    "comment": "Not really sure if I like it. It moves fast, but there isn't any direct player trading, which is what I hoped for.",
    "timestamp": 1716588000
  },
  {
    "username": "shmonkey",
    "rating": 5.0,
    "comment": "You roll to move to a new spot. That spot has a number, and gem icons. You choose to either take the number (points), the gems, or roll to move to a new space. If you lap your starting spot, you get a handful of points, so thats why you would move. If you pick the same option as another player (simultaneous selection), you have to bid gems for the action. Winner pays the loser. If 3 or more pick the same thing, nobody gets to do it.\n\nInoffensive but also not too exhilarating. The gem bidding is supposed to be the meat of the game but ends up being tedious. While its less frustrating than something like Revolution!, theres also far less game to be had here.",
    "timestamp": 1714082400
  },
  {
    "username": "rynelf",
    "rating": 5.0,
    "comment": "--Sept2007-- As a family game: pleasant and relatively innocuous; my young children can't read out the ramifications of the offers they make to the end-of-round bonuses. I'd imagine that this could be quite a delightful light diversion with a set of older participants.",
    "timestamp": 1680559200
  },
  {
    "username": "ShiannLin",
    "rating": 6.0,
    "comment": "2004 Mensa Select Winner\n1998 Spiel des Jahres Recommended",
    "timestamp": 1733353200
  },
  {
    "username": "serjordah",
    "rating": 6.0,
    "comment": "First impression was great! Played twice with three and the double-guessing what other players will choose mixed in with the bartering for actions is just perfection.\n\nI’m slightly concerned that, at four, the bartering each round will slow the game down significantly…but I’m willing to give it a go in order to find out!",
    "timestamp": 1694556000
  },
  {
    "username": "SeanC",
    "rating": 5.5,
    "comment": "I've played this game, but I remember absolutely nothing about it.",
    "timestamp": 1652911200
  },
  {
    "username": "OGNOG",
    "rating": 6.1,
    "comment": "OG. (Rating non-indicative of game quality.)",
    "timestamp": 1649109600
  },
  {
    "username": "dakotamassie",
    "rating": 7.0,
    "comment": "Better then I thought\nNot a lot of replayability\nOnly a 3 player game\n4 would annoy me",
    "timestamp": 1757455200
  },
  {
    "username": "shammois",
    "rating": 7.0,
    "comment": "Would it stand up to multiple plays? Maybe the sense of repetition would emerge - I've only played once - but I really enjoyed the initial experience. A combo of roll-and-move (where rolling high isn't necessarily bad), set-collection, trade and table-reading that rattles along at a great pace. Good fast-moving fun.",
    "timestamp": 1757282400
  },
  {
    "username": "Lusorculus",
    "rating": 8.0,
    "comment": "I really, really enjoyed my first play. I think it's a top 10 for me.\n\nI guess it's a little long if you play the full game. Somehow that didn't bother me.",
    "timestamp": 1755468000
  },
  {
    "username": "happyjosiah",
    "rating": 8.0,
    "comment": "One of the best negotiation games I own. It plays quickly with more bluffing than chance going into the randomness. You really have to manage and calculate, and it is deliciously satisfying to force a weakened opponent into giving you points. Despite this, it really doesn't come across as nasty to other players. This game is a lot of fun.",
    "timestamp": 1716242400
  },
  {
    "username": "Terry Egan",
    "rating": 9.0,
    "comment": "An outstanding game that I enjoy greatly, This has moved from a 10 to a 9 in my ratings in recent years owing to the quality of new releases in the decades since I first rated Basari, but it has stood the test of time and remains a favorite. It only rates this highly if the alternate rule of rolling one die and moving all player tokens the same number of spaces is used. Find a copy of the beautiful original FX Schmid edition if you can!",
    "timestamp": 1746482400
  },
  {
    "username": "Gabrielbacon",
    "rating": 9.0,
    "comment": "Hidden gem. One of my favorite negotiation games. 3 players is the sweet spot, but 4 works too.\n\nYou're trying to gain some kind of advantage every turn - points, gems or movement. The main mechanic is that you all choose which 1 of those 3 you're going for at the same time via a card. You all flip at once, and if anyone chooses the same thing as someone else, you have to negotiate with gems as to who gets to take the action. This opens up a lot of strategy, bluffing & negotiation as you can talk beforehand about what you're gonna do and try to read what the other players are up to and affect what they're gonna do. There's a LOT of table talk in this game. Resolving who gets to take the action is an interesting balance of paying them some valuable gems, or forcing their hand via gems they don't want. These mechanics, sprinkled with a bit of luck, makes for an exciting experience every time. This will never leave my collection.",
    "timestamp": 1744236000
  },
  {
    "username": "Golyadkin",
    "rating": 10.0,
    "comment": "Only one play but it was a blast. It doesn't really deserve a 10, but I gave it one anyway because of how much this game made me laugh. I also think it's pretty clever. It's a roll and move with simultaneous action reveal. There are only 3 actions: take gems, take points, and roll the dice to move again. HOWEVER, this is a majorities game, and if you and your opponent choose the same action, you must barter with gems to decide who gets to take the action. With 3 players this makes some juicy short term alliances as you barter in order to cut off opponent #3's majorities. I love the bartering considerations and how they feed into the double think over the simultaneous action reveal. Maybe you don't care about the gems you are sitting on, but your opponent definitely wants the gems he is sitting on -- so you choose the gems action because you want him to give you the gems that he doesn't care about. IF all 3 or 4 players choose the same action, it is cancelled, and nobody gets to do it. Just so silly, fast, and fun.",
    "timestamp": 1726956000
  },
  {
    "username": "RonCarlson01",
    "rating": 10.0,
    "comment": "TWS",
    "timestamp": 1608332400
  }
]