[
  {
    "username": "cesartustro",
    "rating": 1.0,
    "comment": "Un juego bastanter tontorrón y aleatorio.",
    "timestamp": 1248904800
  },
  {
    "username": "stormseeker75",
    "rating": 2.0,
    "comment": "Awful. Moving the cards continuously is a pain. I could look past that if there was ANY game here at all. No. Just no.",
    "timestamp": 1475359200
  },
  {
    "username": "PfrBraun",
    "rating": 3.0,
    "comment": "Das Riff – oder: Abfluss verstopft. Korallenriffe sind wunderschön und müssen geschützt werden! Dieses Spiel spielt in einem Korallenriff, es ist auch sehr schön, muss jedoch nicht geschützt werden. Noch selten haben wir ein Spiel auf dem Tisch gehabt, das sich so handwerklich angefühlt hat. Ständig muss was umgedreht und verschoben werden. Immerzu muss man was mischen. Und der Glücksanteil beim Angeln der richtigen Fische ist immens. Ja: Das Riff funktioniert! Aber es kommt reichlich adynamisch daher. Es kann rundenlang vorkommen, dass über die Riffkante nichts abfließt und dann ist man in stehendem Gewässer gefangen und hat überhaupt keine Handlungsoptionen. Am Ende ist auch der Sieg irgendwie so schal wie das Stehgewässer im Kosmosriff. Ja, man hat gewonnen. Aber nicht, weil man etwas gekonnt hätte, sondern weil die Kärtchen glücklich in der Auslage platziert waren. Klar: Beim Würfeln hat man es auch nicht in der Hand, aber selbst Kniffeln lässt mir Optionen, die ich aktiv auswählen kann. Hier aber ist man wirklich aufs Riff gelaufen und Leck geschlagen. Ein bisschen rechnen, ein bisschen würfeln, vier bisschen Verwaltung der Auslage: Das ist die mathematische Gleichung hier. Wahrscheinlich ist das Riff spielen immer noch besser als auf ein Riff aufgelaufen zu sein. Aber, wenn ich die Wahl hätte, würde ich beides vermeiden wollen.",
    "timestamp": 1661032800
  },
  {
    "username": "Reverend Pete",
    "rating": 4.0,
    "comment": "The cards look cool. Pretty colors. Those are about the only positive things I can say.",
    "timestamp": 1646953200
  },
  {
    "username": "Erik_Wudtke",
    "rating": 5.0,
    "comment": "keine Karten",
    "timestamp": 1711580400
  },
  {
    "username": "HardCore",
    "rating": 5.0,
    "comment": "Not too bad. Good wife game. I like the \"flow\" of the water.",
    "timestamp": 1665871200
  },
  {
    "username": "stevepwalker",
    "rating": 6.0,
    "comment": "Keep",
    "timestamp": 1735945200
  },
  {
    "username": "Rygel",
    "rating": 6.0,
    "comment": "My wife and I have a lot of fun with this little game. It plays quick, but has some depth to it. It is one of my favorites from the Kosmos small box twp player series.\n\nGot in 2006",
    "timestamp": 1731452400
  },
  {
    "username": "JoeSteadman",
    "rating": 7.0,
    "comment": "reminds me of double solitare. Hey, my wife likes it!",
    "timestamp": 1752616800
  },
  {
    "username": "HuckmanT",
    "rating": 7.5,
    "comment": "2025",
    "timestamp": 1738969200
  },
  {
    "username": "Rimmer2",
    "rating": 9.0,
    "comment": "My husband and I love this game. I usually beat him... heh.",
    "timestamp": 1181944800
  },
  {
    "username": "Perdurab00",
    "rating": 10.0,
    "comment": "Many play with incorrect rules (Rio Grande rules aren't thorough). However, once you've sorted that out, this is so easy to learn, but has several layers of complexity. There is more happening here than you might think. One of the best 2player games I have played.",
    "timestamp": 1056751200
  }
]