[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "A super generic title, more generic than Guild of Merchant Explorers. But the game looked interesting, a more hands-on John Company with negotiations over where the wagons move. The problem is there's like 5 phases of fluff, and the one exciting moment was negotiating to get your goods on someone else's cart. But so many rules just to make sure the owner doesn't load their own mixture of goods..... huh? I thought you trusted the players, why leash them??\n\nThe power cards are strong.... maybe too strong. Insanely strong, I haven't seen any this powerful in any other game. Sure there's bidding for them, but since they determine half the game it feels like they're more important than the core design. And there's so little room to maneuver that they're super important. I was intrigued by bidding on them at first, but by the end I was tired of how much control they gave. I was sick of that messenger minigame, and looking through an entire deck of cards for the power you want. So much could've been cut from the game. Just center it around that loading phase... maybe Container is better at this.\n\nSo there's more possibilities for negotiations, but it felt like we were negotiating to MIN-MAX numbers. With tons of auctions per turn, plus a blind auction. Maybe the goods prices could be better handled by a larger stock market (harder to manipulate with powers), or something to allow double think or negotiations to shine, or anything really. In a short bidding game, focus more on the auctions; in a long bidding game, give us something to interact with each other besides fiddling for pennies.\n\nI can see how the upkeep for VPs influenced John Company, but since there's no theme here it doesn't do much. Not that they do much in John Company either, even with the theme it's too stiff to negotiate anything (only money exists). I guess both games stink, just in different flavors.\n\nThis comment is a rambling mess, but in my defense, so is the game.",
    "timestamp": 1741129200
  },
  {
    "username": "ZorajitZorajit",
    "rating": 2.0,
    "comment": "I don't know why anyone would seek this out, but if you're offered this game or a punch to the jaw, take the latter. This game looks like a parody of board games. There's essentially no \"play fantasy\" here, the player is a nebulous proto-capitalist that operates without challenge across half a dozen continental cities. The players' respective play zones aren't even color coded -- the green player's warehouse is yellow, the yellow player's blue, the blue player's also yellow. Neither picking up, nor delivering is an accomplishment.",
    "timestamp": 1724796000
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "This was a really rough pickup and deliver game. The core idea is good, and similar to Panamax. You have these three nice wooden carts that players place their goods into, and then players get to move whichever of the carts they want during their opportunity to move. This means you are moving goods of both yours and your opponents. The part that makes this game nasty is that each turn, each cart in a city gets auctioned off to a player who then gets to load more, and force other players to pay them money to put their goods onto the cart. What happens next is that the goods are worth different amounts in different cities, sometimes significantly more. Carts once moved can't turn around, so players are angling their movements to get a cart with their goods to the city that will give them the most, while other player's goods might fetch a very small price. These two things make knowing how much money you'll have on a turn very unpredictable. The final nail in the coffin is that after all this happens, there are incredibly overpowered ability cards up for auction. These cards are extremely game warping and give the whole experience a feeling of extreme futility.",
    "timestamp": 1721685600
  },
  {
    "username": "Eisenkreuz",
    "rating": 4.0,
    "comment": "Overly long and there are many better trading games out there. This game is one of the missing from boring, procedural boardgames of the 1970s and 1980s to more modern Euros. Kudos to Kramer, but he's designed much better games since. There are better",
    "timestamp": 1706828400
  },
  {
    "username": "Samuel Vriezen",
    "rating": 5.0,
    "comment": "A few great ideas for a game that in the end, is as good as its title is inspired\n\nBest map of Europe ever, though",
    "timestamp": 1754258400
  },
  {
    "username": "Tridens92",
    "rating": 5.0,
    "comment": "Far too long for what it is. Too much chaos introduced by goods dials. Would not play again.",
    "timestamp": 1748642400
  },
  {
    "username": "Fernegul",
    "rating": 6.0,
    "comment": "I really want it to be good, but it just isn't. It has several very good ideas, wagon loading auction being everybody's clear favorite, but there's so many things that weigh it down... It probably deserves a well developed remake.",
    "timestamp": 1748296800
  },
  {
    "username": "ousgg",
    "rating": 6.0,
    "comment": "Not quite the great negotiation and economy game that I'd hoped. It's all a bit busy with 4P and too uncompetitive with 3P. The ideas hold up well but need some fine-tuning to make sense when held up to similar, more recent designs.\n\nCheap  Quality\nAbstract  Themed\nLight  Heavy\nShallow Curve  Steep Curve\nElementary  Complex\nTactics  Strategy\nIntegrated  Artificial\nLuck  Skill\nActive  Passive\nShort  Long\nBest with 3",
    "timestamp": 1745186400
  },
  {
    "username": "Qhorin",
    "rating": 7.0,
    "comment": "[4p] 2 plays. Great components. Similar to Traders of Genoa, but works much better with 2.",
    "timestamp": 1733612400
  },
  {
    "username": "pnpbackup",
    "rating": 8.0,
    "comment": "I really like overcharging people to get on the wagon",
    "timestamp": 1738018800
  },
  {
    "username": "HuckmanT",
    "rating": 9.0,
    "comment": "2025 I would only play this with \"gamers\", but it's one of my favorites among that type of game, and I liked it more the second time. Kind of a grail game for me, and I'm super happy to own it. Be prepared for some \"mean\" gameplay, but this is such a rewarding game to play.",
    "timestamp": 1738969200
  },
  {
    "username": "h0mbre",
    "rating": 10.0,
    "comment": "Absolutely no dices at all!! You'll have to rely on your own cunning and wit to survive and become the Master Händler!! One of the best money making games ever!",
    "timestamp": 1606258800
  }
]