[
  {
    "username": "meepleraptor",
    "rating": 1.0,
    "comment": "haven't played, just to seed the recommend AI",
    "timestamp": 1675983600
  },
  {
    "username": "Sir Pent",
    "rating": 1.0,
    "comment": "A rulebook for a game should not be the size of the unabridged dictionary. This game goes so much into the details of the simulation that it loses the ability to stay fun.",
    "timestamp": 1671058800
  },
  {
    "username": "Russell King",
    "rating": 1.0,
    "comment": "Ridiculously extravagant systems and rules: and not a patch on the original Squad Leader. A design which truly went out of control.\n\nHere, more is definitely less.",
    "timestamp": 1628287200
  },
  {
    "username": "quoth the raven",
    "rating": 1.0,
    "comment": "Key problems (Squad Leader - vehicle rules) remain.",
    "timestamp": 1555970400
  },
  {
    "username": "Beery",
    "rating": 1.0,
    "comment": "The height of the 1980s monster game craze, this one has the same problems that all games of that era had - a distinct lack of realism caused by poor or nonexistent morale and command/control rules combined with rules that make weapons way too effective. Add to that a rulebook that makes the Holy Bible seem like an afternoon's light read, and you have a game that is both unplayable and unrealistic.\n\nIf I ever want to spend six months of my life getting a squad of cardboard soldiers to cross a road, I'll run out and buy this game. Needlessly complicated rules and the game achieves no greater realism than any other game. Completely hopeless and boring. Any other game - ANY other game - is more fun and more historically accurate.",
    "timestamp": 1398808800
  },
  {
    "username": "NoNamium",
    "rating": 1.0,
    "comment": "A friend of mine bought this, but never, in the now 16 years he's had it, did we play it... too complex for my taste and unless your doing a masters degree on the game then its too little gain for too much effort. Pricey too.",
    "timestamp": 1323903600
  },
  {
    "username": "Bob.Gibson",
    "rating": 1.0,
    "comment": "Just don't like micro-managing each squad and having to deal with SO much complexity. Just not my preference.",
    "timestamp": 1321484400
  },
  {
    "username": "XAos",
    "rating": 1.0,
    "comment": "This is supposed to be a super-realistic tactical game.\nI've test played 5*Shermans V's 5*King Tigers. On maps deliberatly chosen for open country (To maximise the Tigers advantage) The Shermins win easily by exploiting the turret rotation/rolling fire rules.",
    "timestamp": 1288738800
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "Screwed owners of the SL system, rendering it all obsolete, by increasing complexity to greater than \"Tobruk\" without any of \"Tobruk's\" exquisite detail.",
    "timestamp": 1286661600
  },
  {
    "username": "BradyLS",
    "rating": 1.0,
    "comment": "ADD one point for each expansion you buy AND play.",
    "timestamp": 1247004000
  },
  {
    "username": "The ATS Guy",
    "rating": 1.0,
    "comment": "A friend of mine showed me this years ago, and it looked interesting, but we didn't get a chance to play it.\n\nThen around 1999 or so, I was looking into getting a tactical level WW2 boardgame, and I remembered ASL. I looked it up, and found out that a) you needed several games in order to have all the necessary rules to play; and b) those games weren't in print, but could be found on eBay for astronomical prices; and c) the rules were so complex as to bog down game play; and d) it was not solitaire friendly. So I said no way to that and looked elsewhere.\n\nThen I found ATS (Advanced Tobruk System) and bought Advanced Tobruk, which was based on an old favorite, Avalon Hill's 'Tobruk', which I played over and over again (and still have!).\n\nI am now hooked on ATS, which answers all my problems above, and is much more easily playable, and in a shorter amount of time.",
    "timestamp": 1238022000
  },
  {
    "username": "Mad Archeologist",
    "rating": 1.0,
    "comment": "Ok, maybe someone will kill me, buut I have found that ASL is one of the worst wargames ever published... Advanced tobruk system is far better and even Panzer Grenadier is nicer and better. TCS is really much more realistic. Why?\n\nASL in all is tons of rules has forgot to cover some of the basic tenet of warfare... Command. It's a simple Igo-youg game. While that approach work on bigger scale games at squad level it don't work. Too much reliance in a load of technical data and fiddly rules when that basic aspect is almost ocmpletely forgotten. And many of the scenarios seem too \"balanced\" for my tastes. They aren't historical they are conceived game wise instead that hostorical wise. War isn't a balanced affair.",
    "timestamp": 1227654000
  },
  {
    "username": "Patroclus",
    "rating": 1.0,
    "comment": "The rules are too dense to learn (like me! lol) without a serious investment in time for this game system.",
    "timestamp": 1219269600
  },
  {
    "username": "Sheylon",
    "rating": 1.0,
    "comment": "Life's too short for ASL.",
    "timestamp": 1199228400
  },
  {
    "username": "The Doctor",
    "rating": 1.0,
    "comment": "WAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAY TOO LONG. Use as a firestarter to create a cosy atmosphere for playing some REAL games that are actually FUN, like Dark Tower or Loopin' Louie.",
    "timestamp": 1192140000
  },
  {
    "username": "petershergalis",
    "rating": 1.0,
    "comment": "Wish I hadn't bought this turkey. It has many cumbersome rules that only a geek would want to memorize anyway. A&A miniatures although lite by these standards is alot more playable, learnable and a more positive enjoyable experience. Save your money as you'll have to invest enormous sums to get to a point where this system becomes realistic and fun.",
    "timestamp": 1166742000
  },
  {
    "username": "rickbill",
    "rating": 2.0,
    "comment": "I sometimes buy starter components or mainstream ASL components and then simply play using SqL and CoI rules when I can find a like-minded gameer, other-wise I tend toward LnL or OST.\n\nSad, John Hill's work with SqL and CoI were brilliant!!!",
    "timestamp": 1713650400
  },
  {
    "username": "decius",
    "rating": 2.0,
    "comment": "Too detailed for my taste (I play more usuallay Conflict of heroes or Old school tactical). More importantly, I realize that the historical accuracy of ASL is quite weak (far lower than I expected). The rating is quite severe but reflects the fact I will never play again ASL. I might try the histical modules that solve perhaps the problem.",
    "timestamp": 1711753200
  },
  {
    "username": "MajerBlundor6",
    "rating": 2.0,
    "comment": "An aging design that, despite its immense complexity, still results in absurdly comical outcomes. Truly a waste of time when so many other modern games are available which provide far more plausible results with a small fraction of the rules overhead.",
    "timestamp": 1681077600
  },
  {
    "username": "alchemyocelot",
    "rating": 2.0,
    "comment": "This seems more a lifestyle than a game.",
    "timestamp": 1678834800
  },
  {
    "username": "dafrca",
    "rating": 2.0,
    "comment": "Why did I sell this game off? Because it was just too much work to play. I play games for fun not so I can work. This game became more of a second job rather than something I looked forward too.",
    "timestamp": 1549062000
  },
  {
    "username": "mtgchamp",
    "rating": 2.0,
    "comment": "Way to many rules for me - plays too slow. Always looking things up. Not really into that.",
    "timestamp": 1511046000
  },
  {
    "username": "robertino",
    "rating": 2.0,
    "comment": "It was a great game that I enjoyed, 20 years ago.\n\nBut nowdays there is no chance of this game coming to the gaming table.",
    "timestamp": 1482706800
  },
  {
    "username": "heikman",
    "rating": 2.0,
    "comment": "It is the most complex tactical wargame there is & there probably ever will be. And if you don't mind (or actually happily looking forward to) reading 100 pages of rules, then this might be something you should look into.. but imho it has been surpassed by .. well by what actually?\nLet's say there are much easier titles, and each has it's own shortfalls.. like CoH Conflict of Heroes, Band of Brothers & others.\nASL is using 6 different Phases to create the feel of simultaneousness.. but does only create complexity for complexity sake..\n\nso for example in ASL you can move your units let's say around the enemy, while the enemy has no opportunity to move (they can shoot, but cannot move..). At least in CoH you could simply retreat your unit.\n\nAlso ASL knows no real hidden units, yeah you put questionmarks on counters but you still know where the counter is.. while in some other Tactical & block wargames you have no idea where the unit is..! These two things get me way more into the war-theme than to roll 6 dice to find out that the weather is not changing..",
    "timestamp": 1452294000
  },
  {
    "username": "hanguoren",
    "rating": 2.0,
    "comment": "Overly complex for me, although better than a lot of the other wargames I have been subjected to.",
    "timestamp": 1352502000
  },
  {
    "username": "out4blood",
    "rating": 2.0,
    "comment": "Rated a 2 only because I will \"never play this again.\" It's a good game, but an example of a \"lifestyle game.\" You commit to playing this, or you don't play it at all. It's also clearly better in conjunction with a computer. It drags due to all of the calculations players need to make in order to resolve engagements.\n\nThe beautiful Company of Heroes PC game satisfies my squad- and platoon-level tactical game itch in a tiny fraction of the time.",
    "timestamp": 1271196000
  },
  {
    "username": "Azog",
    "rating": 2.0,
    "comment": "Over-hyped. I want to like it, I really do, but I found ATS to be so much more accessible.",
    "timestamp": 1219615200
  },
  {
    "username": "alcazar",
    "rating": 2.0,
    "comment": "The original Squad Leader was a classic. Each subsequent expansion added more and more complexity, and revised the rules revisions introduced by earlier expansions. So in theory ASL was the answer to a maiden's prayer, but I soon decided to call it a day as I preferred the more hardware-oriented tactical games like Jim Day's Panzer/88/Armor and Hal Hock's Tobruk. More recently, I prefer the simplicity and elegance of Mark Walker's Lock'n'Load where each expansion adds more maps, counters and scenarios but precious few rules. But of course there's plenty of folk who think otherwise...",
    "timestamp": 1218924000
  },
  {
    "username": "thirtybrowns",
    "rating": 2.0,
    "comment": "I maybe unfair giving it a 2 but I won't ever play this again (hence the 2). It's way too complex, I feel you either dedicate your gaming life to this or you don't play it. I tried it, slogged through the rules, played it a few times and thought no, this is too much. I would also question how realistic it is? For all it's complexities does it actually simulate WWII fire fights? I really really doubt it. However I feel it's a land mark game and hence I'll not part with my copy",
    "timestamp": 1196809200
  },
  {
    "username": "Gutrender",
    "rating": 2.0,
    "comment": "How people play this thing is beyond me. Thank goodness I had received it as a gift so didnt waste my own money on it.",
    "timestamp": 1178661600
  },
  {
    "username": "kienzle",
    "rating": 2.0,
    "comment": "Wasted far too much of my gaming life on this monstrosity. With a new wargame, you expect to fumble through the rulebook for the first couple of plays. But with ASL it never ends -- no matter how long you've played, every game is an exercise in rule-flipping drudgery. And for what? It isn't any more \"realistic\" than the original Squad Leader. Went cold turkey, sold my complete AH set 10+ years ago, and haven't looked back.",
    "timestamp": 1153864800
  },
  {
    "username": "chiswi",
    "rating": 2.0,
    "comment": "Too complicated",
    "timestamp": 1070665200
  },
  {
    "username": "Riccardo Rinaldi",
    "rating": 3.0,
    "comment": "Not my piece of cake. VERY steep learning curve, very unfriendly manual regardless of the format, graphics that might (perhaps) have looked decent in the 1980s but now are totally obsolete. Icing on the cake, no 'module' is a compkete game except for the first.\nBesides, what other wargame requires the separate purchase of its rulebook?\nDespite a wonderful, helpful community of players, thanks but no thanks.",
    "timestamp": 1727474400
  },
  {
    "username": "saccenti",
    "rating": 3.0,
    "comment": "My feelings toward this game are complicated, as is the game itself. At certain times of my life, this has been a \"10.\" It has also gone a decade-plus unplayed. At this present moment--where I am enjoying shorter, simpler games--I have to give this a \"3\" on my very-tough scale.\n\nThe rules to ASL should be \"living,\" free, and readily available online. At this point, I would think a user-based wiki model would make the most sense. It is at once both amusing and sad that this is not the case.\n\nI peek in about once a year to see if we've gotten there yet. Nope. They've managed to make a PDF version of the rules now. That's kind of funny. Very apropos. Sigh.\n\nEverything about the game seems frozen in time, around like, I don't know, I guess the 90s? To play this online you are using software. Software. That's not even a word that is used anymore. Java. You've got to be kidding. Straight out of 1998.\n\nCompare this to what is happening right now in 18xx, a game from around the same time. A complete renaissance is happening in that area, tons and tons of new, young players (probably irritating us old-timers!), because of things like Discord and 18xx.games.\n\nIt's just kind of sad. The game deserves better. I guess. Maybe it doesn't. Fewer and fewer will ever know.\n\nThe caretakers of this game just keep getting older and still, against all the evidence and models around them, seem merely intent on squeezing the last few dollars out of the stone.",
    "timestamp": 1723672800
  },
  {
    "username": "Henrix",
    "rating": 3.0,
    "comment": "Far too old fashioned and fiddly.",
    "timestamp": 1681855200
  },
  {
    "username": "halbower",
    "rating": 3.0,
    "comment": "There are 22 chapters worth of rules. The fanboys will argue that you only need 16 of those chapters to play most scenarios. Fine. I concede. That's completely reasonble.",
    "timestamp": 1644793200
  },
  {
    "username": "Kenfeldman",
    "rating": 3.0,
    "comment": "2018 Update. While ASL does offer the most complete WWII era tactical experience with so many different nationalities and terrain types, the system just feels too dated and it takes too much time to maintain a proficiency with the rules. I'm switching to other, easier to play games.\n\nRating based on recent play of infantry-only scenario with an experienced player who did the rule look up.\n\nEasing back into this under the guidance of an experienced player. There are a lot of brain-burning decisions to be made each turn, and the game really moves along.\n\nIt's a game that requires a heavy investment of time and is expensive to get into. However, by easing into it, you can have a lot of fun while learning the game.\n\nI'm not sure if I'll take the full plunge into vehicles and artillery any time soon. Just the infantry and terrain rules require a lot of time to learn.",
    "timestamp": 1642978800
  },
  {
    "username": "Andytheman119",
    "rating": 3.0,
    "comment": "Excessive complexity makes the barrier to entry nigh impossible and the game is fundamentally based on chucking dice.",
    "timestamp": 1591999200
  },
  {
    "username": "Bulwyf",
    "rating": 3.0,
    "comment": "*edit*. After many plays, years and a few \"tournaments\" my opinion of ASL has soured. More and more while playing, I would ask, \"Where's the fun?\" I always felt like I was fighting the extremely chrome heavy rules rather than playing. Eventually I found ASL to be very frustrating and unsatisfying. It was a good run but I'm done.\n\nI sold my entire collection 11/2014 and have no regrets.",
    "timestamp": 1587074400
  },
  {
    "username": "mmychal",
    "rating": 3.0,
    "comment": "Just too many rules. The card-driven wargames supercede the need for ASL",
    "timestamp": 1577919600
  },
  {
    "username": "Si Fei",
    "rating": 3.0,
    "comment": "Very hard to rank. It is way too complicated for my taste, but that is as it is intended to be. I have decided that I think that this decision is not a good one. Can do nearly everyting with it - but then, just having a separate game that is very good at doing something might be a better choice.",
    "timestamp": 1527458400
  },
  {
    "username": "Bangla",
    "rating": 3.0,
    "comment": "Not a game but a way of life. Loved the original Squad Leader, but this was 20 steps too far.",
    "timestamp": 1522706400
  },
  {
    "username": "Silverman",
    "rating": 3.0,
    "comment": "Sencillamente el juego más complejo que ha creado el homo sapiens. Muy exigente, muy absorvente, muchísimos detalles. Indicado sólo para los muy viciados en la época/temática que dispongan de mucho tiempo libre y paciencia.\n\nSimply the most complex game that created the homo sapiens. Very demanding, very absorbent, very many details. Only suitable for very fans at the time / theme that have a lot of spare time and patience.",
    "timestamp": 1451516400
  },
  {
    "username": "Tom Lehmann",
    "rating": 2.5,
    "comment": "A \"life-style\" version for the Squad Leader fanatic who wants the game to be even slower, more mired down in minutia, and abstruse.\n\nIt's still not a simulation and the wonderful \"cinematic\" feel that the original Squad Leader evoked has been completely lost.\n\nAn example of a re-development that managed to completely miss what made the original game interesting and innovative.",
    "timestamp": 1432677600
  },
  {
    "username": "seanmac",
    "rating": 3.0,
    "comment": "Pretty much the poster child for what can go wrong with a wargame. It took a much simpler base game in Squad Leader and drowned it in extra detail that did nothing to improve the quality of the game or the quality of the simulation. The details are all in the wrong places, undone by the complete absence of anything recognizable as a command and control system. The historical modules are wonderful looking, only the scale is completely wrong, so you get a woefully distorted result that looks superficially like it is really simulating something. It's telling that both John Hill and Don Greenwood, the two men most directly responsible for ASL, have essentially disowned the system. I know it's immensely popular and more power to the people who get enjoyment from it, but I'm not buying what it's selling.",
    "timestamp": 1369778400
  },
  {
    "username": "Grumbling Grognard",
    "rating": 3.0,
    "comment": "Played the holy crap out of this game in college (years ago...) Long since came to the conclusion that 'this' is what happens when a very good game system is brought to its knees by (quite simply) too many rules. I am a mini gamer and I used to play ASL for twenty years. I not only can deal with detail, I like detail 'when it is needed' and when it adds to the game. ASL crossed the line over and over again... Stick with the original \"Squad Leader\" and its couple of first expansions (\"Cross of Iron\" required for veh rules) or go for ATS.",
    "timestamp": 1348264800
  },
  {
    "username": "SommeGrandads",
    "rating": 3.0,
    "comment": "Amazing Rule Set. I thoroughly enjoyed colouring in all the illustrations of the terrain. Never played it - never will, unless stranded on desert island with nothing but a dry copy of ASL, some dice and a decent table.",
    "timestamp": 1340402400
  },
  {
    "username": "thomasprowell",
    "rating": 3.0,
    "comment": "I stuck with this system all the way from John Hill's original SL through Code of Bushido. Eventually I realized the rules weight-to-fun ratio wasn't paying off for me. And after playing the Gamers TCS system, I decided ASL was pretty bad as a tactical simulation as well. So I sold the whole lot off.\n\nA few years later, I thought I kinda missed it, so I started buying it all up again, this time paying crazy eBay prices. And after three modules or so, I realized no, I really was over this game. So I sold 'em all again. And I know, this time, I won't go back.",
    "timestamp": 1317247200
  },
  {
    "username": "chrisbrandt",
    "rating": 4.0,
    "comment": "23% play. 77% referencing the rule book.",
    "timestamp": 1746309600
  },
  {
    "username": "revshafer",
    "rating": 4.0,
    "comment": "10 for the new eASLRB! An amazing piece of work. Imagine a 700+ page rulebook, fully hyperlinked, searchable, printable, with all of the errata fully incorporated. Imagine it not being a scan, but a document that you can shrink or zoom at will. It is much easier to find things, and so much easier on the eye. No more going out of print! Now MMP can release everything for ASL print and play, and they’ll only have to worry about keeping their counter sheets in stock! This was so good and well organized that I put the ASLSK away and dove into full ASL! The rulebook can now be read in the bathroom!",
    "timestamp": 1725141600
  },
  {
    "username": "HavocIsHere",
    "rating": 4.0,
    "comment": "Lots of small rules, a focus on simulation yet this game does not amount to more realism than, say, memoir 44.\nBack then it was a good game because there were not so many alternatives.",
    "timestamp": 1684360800
  },
  {
    "username": "zaubererer",
    "rating": 4.0,
    "comment": "Slightly improved Squad Leader, terribly outdated, very complicated and random on the same time.",
    "timestamp": 1639609200
  },
  {
    "username": "mvdwege",
    "rating": 4.0,
    "comment": "I used to be an enthusiast, but dealing with other tactical games has soured me on MMP's \"Chrome for chrome's sake\" approach, and the toxic community has led me to downgrade the score.",
    "timestamp": 1615417200
  },
  {
    "username": "Fulminata",
    "rating": 4.0,
    "comment": "The grand master of fiddly rules systems, with a rulebook the size of many phone books. I can still be talked into this game if I'm in the right mood, but those moods are few and far between.\n\nTo be honest, the game plays more smoothly than you'd think it would given the sheer amount of rules.\n\nUpdate: There are just too many easier, better games out there now that cover the same ground. I think the only reason to play this now is if you are already deeply invested.",
    "timestamp": 1615417200
  },
  {
    "username": "wildog",
    "rating": 4.0,
    "comment": "1st Edition to the best of my knowledge",
    "timestamp": 1610060400
  },
  {
    "username": "Gryfon",
    "rating": 4.0,
    "comment": "replaced by combat mission - all the detail and you only need to understand the fundamentals, not the nuts and bolts.\n\nplays include Combat Mission.\n\nhow to not enjoy an evening",
    "timestamp": 1584831600
  },
  {
    "username": "Andy Pain",
    "rating": 4.0,
    "comment": "Decided I just didn't need to go down the slippery slope of owning ASL and all it's bits",
    "timestamp": 1574895600
  },
  {
    "username": "papercut",
    "rating": 4.0,
    "comment": "Too much overhead. Complexity for complexity's sake in a baroque display of excess and lack of soul. Gave it up after slogging it out for several years -- replaced by the joyful, effervescent, and evergreen Up Front. Never missed the bloated, rotting putrescence of ASL.",
    "timestamp": 1563919200
  },
  {
    "username": "emperormark",
    "rating": 4.0,
    "comment": "Even more pointlessly complex...even by 70s/80s standards. Near impossible to play following all the rules. Honestly, I like Memoir 44 more. Sacrilege, I know.",
    "timestamp": 1560031200
  },
  {
    "username": "finril56",
    "rating": 4.0,
    "comment": "I try it....and dump it very quickly. Too much rules, too much extension for very little fun. Also I never find the balance of the army to be fair. Heer is too powerful, US Army also (too much firepower in fact), Finland was superheroic to a point of crazyness, USRR was stuck with the Barbarossa version of the troops all along the war despise being a very different army at the end of the war.",
    "timestamp": 1549321200
  },
  {
    "username": "TheMP",
    "rating": 4.0,
    "comment": "Just too much to be bothered to learn. I guess I'll never get over my disappointment at how it changed the old Squad Leader system that I knew inside out.",
    "timestamp": 1503352800
  },
  {
    "username": "dandechino",
    "rating": 4.0,
    "comment": "Like chess, or a master's degree, you must dedicate yourself to mastering it. Rated a notch below the ASLSKs since they are more approachable and may be a sweet spot in complexity for me. I do like some of the added rules in full ASL however. This system feels like the holy grail of retro tactical squad based combat. Charts, dice, and indexed rulebook nirvana.",
    "timestamp": 1463522400
  },
  {
    "username": "Rick Mathews",
    "rating": 4.0,
    "comment": "I played this alot between 1985 and 1992, and then gave it up in disgust. I don't mind luck in games, but this has a far too high luck factor given the amount of time you have to spend with the rules. Fortunately I kept the components, because the Retro variant rules set from Minden Games makes it possible for me to use the components in games I actually enjoy playing.",
    "timestamp": 1445119200
  },
  {
    "username": "Philip Jelley",
    "rating": 4.0,
    "comment": "I bought myself ASL after graduating from university, but never got into its complex universe. I think you must be either fully committed to the cause or want to have a life which included other games and pastimes. I sold it off at a B&B to a father and son team.",
    "timestamp": 1383260400
  },
  {
    "username": "JBWG",
    "rating": 5.0,
    "comment": "Grew disillusioned: too much game too, too little simulation. Too much chrome and complexity for the payoff.",
    "timestamp": 1756677600
  },
  {
    "username": "Pinetree",
    "rating": 5.0,
    "comment": "Loved it at first, but found it too hard to retain the rules if I didn't play it for a while. Way too many gamey loopholes for my tastes and in the end, not a very realistic depiction of tactical combat. Sold off my entire ASL collection with no regrets.",
    "timestamp": 1748901600
  },
  {
    "username": "Two Crows",
    "rating": 5.0,
    "comment": "There was a time when I thought very highly of this game. I misconstrued complexity with accuracy.\n\nAs the decades have passed, this is (somewhat sadly) no longer true.\n\nIf I am honest, it's a horrible game, but once (in the 20th century) was a shining beacon of light to me and my peers. I can't rate it lower due to our history, but I probably should.\n\nP.S. If you don't know the game already, be prepared to be enlightened by a whole new level of \"Complexity\" you never imagined could actually exist.",
    "timestamp": 1743116400
  },
  {
    "username": "Dgotrek",
    "rating": 5.0,
    "comment": "I once mastered it if such a thing is possible back in the 80s to 90s. I found it increasingly hard to find opponents and it required constant refreshing to stay on top of the rules. It is a lifestyle rather than a game. I also did not like the constant buy this and that to keep up aspect. I got sick of that with TSR long before AH turned to this cash cow. Nevertheless, I respect the commitment of fans of ASL and acknowledge some flaws in the basic SL system.\n\nWhen I returned to cardboard gaming in 2019, I opted for basic SL and its gamettes. My decision was clinched by ASL not surviving the Great Storage Purge of 2015. The price of ASL is staggering today when compared to basic SL and expansions. I found them to offer a vast amount of play for far less money.\n\nIt is true that G.I. Anvil of Victory rule book is a mess, but a great PDF of consolidated and rationalized rules exists for the entire system. Yes, I love the basic system despite all of its warts. Once you use optional semi-simultaneous movement and defensive defensive fire and the COI revamp of the armor, you remove the major flaws of the system.",
    "timestamp": 1741129200
  },
  {
    "username": "AEFGIRT",
    "rating": 5.0,
    "comment": "Won't touch it",
    "timestamp": 1738537200
  },
  {
    "username": "retrosoldier",
    "rating": 5.0,
    "comment": "A caveat: If ASL came packaged with the Retro ruleset option enclosed, then this game would get a 10 because regular guys would at least have a low-complexity option to access and play this game of grand-design.\nThe shear amount of work and audacity has to be respected--but it has been a vexing demon to thousands of baffled players, young and old, for decades.\n(I've always felt that a lab-coated scientist with a clipboard was watching me thru a two-way mirror as I hopelessly flipped pages for an hour before having the courage to move a unit!\nMy low rating is really just based on being frustrated and inability to play it. So that's my fault.\nIncluding options for \"levels\" of complexity would be a game-changer.",
    "timestamp": 1738364400
  },
  {
    "username": "chaochou",
    "rating": 5.0,
    "comment": "A genuine classic of wargaming although one which trades on competition rather than a worthwhile representation of combat. Detail here masquerades as accuracy, generating only faux historicity and rules lawyering.\n\nActual tenets of squad level infantry combat are almost completely ignored by the ruleset, happening only by accident in edge cases rather than as a doctrinal centrepiece. Command and control is entirely absent. As a result, the game offers almost no insight into WW2 tactical combat.\n\nThe modular board/countermix/overlays means that it isn't something you can dip into, except in the Starter Kits. At least they allow you to discover the flaws for yourself at a fraction of the cost.",
    "timestamp": 1728338400
  },
  {
    "username": "JAkz",
    "rating": 5.0,
    "comment": "With all due respect to old ASL, but my God, she's so stuffy by the book.\nI haven't played for half a year and forgot all the rules in a flash.",
    "timestamp": 1708729200
  },
  {
    "username": "Trebor1415",
    "rating": 5.0,
    "comment": "I have never successfully played. My best friend and I tried when he got it as a gift when he was 12 but we never got past some sample examples.",
    "timestamp": 1691964000
  },
  {
    "username": "luckylucky",
    "rating": 5.0,
    "comment": "Boring",
    "timestamp": 1687212000
  },
  {
    "username": "badinov",
    "rating": 5.0,
    "comment": "This is Squad Leader with just more grit added to the game mechanics. Perfect example of an attempt to add more realism at the expense of playability. Got it just for the counters and mapboards, which you can use with the original game (which is better).",
    "timestamp": 1686866400
  },
  {
    "username": "BBCD",
    "rating": 5.0,
    "comment": "One of my first wargame (i started with the SL 1977 version) and really appreciate it 30 years ago when i had time and willingness to invest in complex game. But now it is too much overhead and i am more oriented towards simpler games.",
    "timestamp": 1682028000
  },
  {
    "username": "OsideP",
    "rating": 5.0,
    "comment": "Played it back in the 80’s and 90’s but sold it all and have never regretted it. There are more recent designs that do 99% of what ASL does with 10% of the rules overhead or effort. It was a great system and that cannot be denied but I have moved on and I have never looked back.",
    "timestamp": 1673305200
  },
  {
    "username": "gallants2",
    "rating": 5.0,
    "comment": "The original Squad Leader had a certain elegance about it. ASL is an overly complex mess of a game system. Newer games such as Conflict of Heroes, and Last Hundred Yards are far less complex and give you a better feel for tactical combat.",
    "timestamp": 1658095200
  },
  {
    "username": "Fuzzel",
    "rating": 5.0,
    "comment": "Deutlich komplexer als Combat Commander. Selbst die Starter Kits. Das vollständige Spiel hat eine PDF Anleitung von > 700 Seiten! Kein Gelegenheitsspiel. Riesige Community und Fan Erweiterungen. Zig Module, Szenarien und Kriege. Nur auf Englisch. \"Combat Commander is mostly fun while ASL is mostly work.\" < CCP.",
    "timestamp": 1651096800
  },
  {
    "username": "ShKO",
    "rating": 5.0,
    "comment": "The rules are too complicated. The interrelationships between the rules are difficult to understand. The abstraction is too game-like and lacks a sense of reality. Players need to memorize the rules and use game techniques rather than tactical doctrine.\n\nI think it would be better if the game were made into a computer game with fully automatic processing so that players can concentrate on their military duties.",
    "timestamp": 1632175200
  },
  {
    "username": "Pandorzecza",
    "rating": 5.0,
    "comment": "Not for me",
    "timestamp": 1621548000
  },
  {
    "username": "Meadbeard",
    "rating": 4.9,
    "comment": "Dated simulation. With the proliferation of microcomputers, there's no need to endure this spreadsheet-fest over the table ever again.\n\nFor its time it made sense, but there's no actual fun to be had here. Nonetheless admirable.",
    "timestamp": 1596405600
  },
  {
    "username": "civil",
    "rating": 4.8,
    "comment": "such a bad rule book! i didn't even manage to play one game",
    "timestamp": 1592344800
  },
  {
    "username": "TheRealTroll",
    "rating": 5.0,
    "comment": "The most complex game I've ever played.",
    "timestamp": 1577401200
  },
  {
    "username": "Largo68",
    "rating": 5.0,
    "comment": "Archived",
    "timestamp": 1554760800
  },
  {
    "username": "rajungamer",
    "rating": 5.0,
    "comment": "A classic 80s take on wargaming.\nIt took the old Squad Leader system that had gotten larded up with chrome and tried to rationalize the IGO-UGO mechanics with an absurdly complex set of phases..\nThe system also goes into incredible detail at the technical level - rules for almost every type of weapon etc. Yet with all the rules there is little to cover the effects of command or morale.\n\nIt is a \"lifestyle\" game, you have to play it a lot to get past the rule curve. However this has way too much overhead for me to want to invest my time. Ultimately it is a game I don't want to deal with.",
    "timestamp": 1554415200
  },
  {
    "username": "pipwoodie",
    "rating": 5.0,
    "comment": "Sam",
    "timestamp": 1545951600
  },
  {
    "username": "b4ry",
    "rating": 5.0,
    "comment": "The system is GREAT but the rule book is terrible.",
    "timestamp": 1527804000
  },
  {
    "username": "Rimush",
    "rating": 5.0,
    "comment": "Like the scale and scope. Not over keen on 'some' of the detail. Do we really need an explanation for one hex(the small hut in the forest) on one board! I guess we do  Historical scenarios seem to be the apex of the system.",
    "timestamp": 1515279600
  },
  {
    "username": "Hms_indefatigable",
    "rating": 5.0,
    "comment": "I really don't know what I was thinking when I agreed to purchase this title. Actually my wife said she wanted it, the title was recommended by Joe Steadman from the Dice Tower. This is crazy complex.",
    "timestamp": 1504562400
  },
  {
    "username": "falagar",
    "rating": 5.0,
    "comment": "A very old game with an old game system that can not compete with late WW2 Squad Level Games.\nAn heavy and absurdly detailed rules set that could be also interesting for enthusiast reader but are often with no-sense in Game Turn term. (Turret pivoting speed for example: a Tiger turret was able to pivot 180° in 30 secs. , so it's a real no-sense to \"penalize\" its ToHit value in a 2 minutes game turn!!)\n\nI read many enthusiatic comments about realism of ASL but i would really understand how can be realistic a squad tactical simulation where (and for example) there is no \"Command/Control Chain\" and you can move all your units at same time (even hundreds meters apart!) and without any possible enemy reaction in movement terms (and this is not the only example can be pointed out).\n\nThat's the limit of ASL no-impulse turn based game mecahnics... and any other consideration about its so much lauded realism and historical detail is made useless by its unrealistic base mecahnics.\n\nOf course, as any other similar Squad level games, ASL is an abstraction of reality and ASL offers its own way to model the reality, it is not the best nor the worst: it's only one way among the other games ones.\nI gave \"5\" for disillusion about a game that, despite its celebrity, i simply consider just a good (but not the best) game.\n\nI see it just a WW2 Squad Level game precursor (and i can understand romantic devotion to it by many BGG users) but nowadays it is fully outdated by more valid and amusing tactical games.",
    "timestamp": 1503007200
  },
  {
    "username": "jeanba",
    "rating": 5.0,
    "comment": "Could not really pass from the \"old\" SL to ASL",
    "timestamp": 1477000800
  },
  {
    "username": "Homemade war",
    "rating": 5.0,
    "comment": "Many intelligent people have embarked on learning this game and decided against the pursuit. This, coupled with needing bifocals and tweezers to play it, begs a peak at the emporer's new clothes. Retro rules are fully attired, however.\nThat said, the game is beautiful to look at and ponder. I wish Multi-Man would create a Retro-like version for the 99% that would like to play the game.",
    "timestamp": 1473285600
  },
  {
    "username": "ilskengravling",
    "rating": 5.0,
    "comment": "Seems designed by a control freak lacking a stop-button. To be fair, as a simulation of war, it sure beats the hell out of Poker. Gameplay is best described as Trivial Pursuit with a wartheme.",
    "timestamp": 1464300000
  },
  {
    "username": "hsh1417",
    "rating": 5.0,
    "comment": "((노구매))정보없음\n난이도 4.7 접자접어ksp",
    "timestamp": 1447542000
  },
  {
    "username": "cheque6",
    "rating": 5.0,
    "comment": "Has its flaws:\n\n1. You have perfect command and control over your troops\n2. You have perfect knowledge of terrain\n3. You have perfect knowledge of opponent's objectives\n4. You have perfect knowledge of opponent's strengths and weaknesses\n5. Significant amount of gamey tactics, known as ASL \"sleaze\"\n6. Rules overhead--to play well, you virtually have to pass the bar exam testing your knowledge of the rulebook; AND keep playing to prevent knowledge loss. There are fan-created advanced sequences of play that remind me of the task cards/checklists used by the Apollo astronauts!\n\nBut, the best simulation of a WWII movie. As long as a scenario is limited to five or less game turns, infantry only, and limit the time you can use to think about moves (chess clock?), then you can play it for theme, narrative, detail and even fun. Add in armor, and it bogs down tremendously.\n\nEdit: Rereading my comments, rating really should be downgraded. Now rates a \"5.\" Sadly, like a sports superstar that stayed too long, this system should be retired.\n\nI've played Band of Brothers, and it's eye-opening just how elegant that system is, and far more realistic in terms of WWII infantry tactics, using a rulebook a mere 16 pages long!",
    "timestamp": 1440280800
  },
  {
    "username": "whitecatplays",
    "rating": 6.0,
    "comment": "SK mostly. Fun once the rule reading ends and the squad leading starts.",
    "timestamp": 1760738400
  },
  {
    "username": "alfonzo54",
    "rating": 6.0,
    "comment": "ASL is appealing to me on some visceral level. I may be the only person in the world that loves the presentation. The simple silhouette counters, the tiny folding boards, the bold colored text on white informational markers, even the layout of the rulebook: all this I find very compelling.\n\nI also love the amount of detail in the rules. Obviously people have preferences one way or another in terms of rules complexity, but regardless of how playable it makes the game, or how \"realistic\" or not it may be, I love the modeling of different locations within the same hex, or bypass movement, or any number of other little details. It's fun just to read the rules and see how things are modeled.\n\nI think it plays fine for the most part, although it gets bogged down in procedure quite often. I'm sure this would improve with play but I had to abandon a solo learning scenario because I completely lost track of whose turn it was after looking up something. Even just trying to keep track of sniper rolls for both sides while soloing was a bit much for me when I tried. I'd love to do Red Barricades/Factories but as it would be a solo endeavor it doesn't seem feasible.\n\nBecause of these factors, ASL is currently a game I occasionally gawk at, similar to how I swore off playing MtG and now treat it as a spectator sport. Were I to have a patient and motivated opponent I would happily play (and my rating would likely increase), but for now I will admire it from afar and remain a bit covetous of the physical product.",
    "timestamp": 1756677600
  },
  {
    "username": "cptal",
    "rating": 6.0,
    "comment": "Excellent WWII tactical game. A lot of infantry variety from nation to nation, unfortunately the variety is not based on historical fact. 2nd edition rules is a marked improvement. The font in the 2nd edition is larger, rules clarifications, updated artillery chart, and about 20 years of errata are incorporated.",
    "timestamp": 1746828000
  },
  {
    "username": "martybjsg",
    "rating": 6.0,
    "comment": "Brought it all together, but never replaced the thrills of the original squad leader for me.",
    "timestamp": 1733612400
  },
  {
    "username": "Desiderata",
    "rating": 6.0,
    "comment": "I think I prefer strategic-level wargames. I don't have the appreciation for the squad-level micromanagment. Impressive system, but too much for me. I am more of a light-wargame player, so naturally, I am not the target audience for this type of wargame.\n\nThe only way this game stays fresh is to churn out endless scenarios, as replaying a scenario just doesn't seem all that fun. And it's too expensive (and space consuming) to own multiple counters and maps.",
    "timestamp": 1731884400
  },
  {
    "username": "yangtze2000",
    "rating": 6.0,
    "comment": "Too overblown.",
    "timestamp": 1717624800
  },
  {
    "username": "jldiii",
    "rating": 6.0,
    "comment": "This is a great example of too much of a good thing. Squad leader was a great system that became bogged down with more stuff in subsequent expansions. ASL was supposed to rationalize all that, and it did, but did not really make for a more playable game.",
    "timestamp": 1708642800
  },
  {
    "username": "kahunasan",
    "rating": 6.0,
    "comment": "I can really see why people have this as a lite style game. To thick of a rulebook for me to get into in the moment but I am happy yo play with someone who knows the rules. The game is action packed with lots of interesting decisions.",
    "timestamp": 1693432800
  },
  {
    "username": "andymack",
    "rating": 6.0,
    "comment": "Anyone in Western NSW Forbes, Parkes etc wanting to play this game. Will travel up to two hours.\nOr use the Vassal on-line system.",
    "timestamp": 1677279600
  },
  {
    "username": "Lord Flashheart",
    "rating": 6.0,
    "comment": "I've played it and enjoyed it but it was ultimately just far too much rules-wise for me. I'd literally have to play this all the time to retain even a vague semblance of the rules but that's not going to happen as I play a number of other wargames.\n\nIt's a classic and rightly so but for me, Old School Tactical was what I was looking for in a tactical WWII squad level wargame and gave me the \"Yes! That's what I've been looking for!\" moment the first time I played it.",
    "timestamp": 1665698400
  },
  {
    "username": "BartholomewPots",
    "rating": 6.0,
    "comment": "Great detail but very heavy- lots of rules (in an A4 binder) so not something to take out lightly or play with the family. Seeks to be a tactical level battlefield recreation, with all the complexity that entails. This is a set of rules only, a module is required to be able to actually play.",
    "timestamp": 1664143200
  },
  {
    "username": "hoostus",
    "rating": 6.0,
    "comment": "Even when you strip out all the variants and expansions, even the base rules set is pretty complicated when compared to some of the competition WW2-squad-level games.\n\nAn unparalleled amount of expansions, scenarios, and support.\n\nBest if you're playing with someone who knows the reasonably well. I can't imagine two newbies trying to figure out how to play this.",
    "timestamp": 1632952800
  },
  {
    "username": "lacrauzorro",
    "rating": 6.0,
    "comment": "A must have to learn the game.\nTryed to play for various times, but it's really hard. This game would captivate more players and would be more fun if it was a bit simplyfied in regard of artillery and tanks. Too much modifiers, exceptions and anachronisms. You roll for an attack then you add -1 because ffnan, -2 because xyz, +3 because Saturn is aligned with the moon... You get the point.\nNot for me.",
    "timestamp": 1614294000
  },
  {
    "username": "210Khamen",
    "rating": 6.0,
    "comment": "holy hell those rules..",
    "timestamp": 1585519200
  },
  {
    "username": "Thrylos",
    "rating": 6.0,
    "comment": "The effort to make this game is monumental. I do not like these kind of game but I appreciate the effort.",
    "timestamp": 1577228400
  },
  {
    "username": "hwfung",
    "rating": 6.0,
    "comment": "Fine system, accessibility is the weak spot.",
    "timestamp": 1566770400
  },
  {
    "username": "Zilver",
    "rating": 6.0,
    "comment": "It is definitely better than Squad Leader and it's three gamettes brought together. But it is far too complicated in terms of kindling modifier stuff to be really enjoyable.",
    "timestamp": 1548111600
  },
  {
    "username": "LeZerp",
    "rating": 6.0,
    "comment": "Just the 3rd edition rule book - and it is a monster.\n\nOrganized in the classic AH manner of numbered clauses and subclauses, it is a stack of more than an inch of pages of rules, numerous appendixes - and an entire section of programmed learning (Highly recommended!)\n\nASL is less a game than a way of life, and right now, it is not for me. But wow, the effort is truly gargantuan",
    "timestamp": 1543273200
  },
  {
    "username": "Arven",
    "rating": 6.0,
    "comment": "Still like the type, but computers make counter-pushing so much easier.",
    "timestamp": 1527372000
  },
  {
    "username": "galen",
    "rating": 5.5,
    "comment": "5",
    "timestamp": 1524434400
  },
  {
    "username": "Lewster55",
    "rating": 6.0,
    "comment": "A very detailed simulation.",
    "timestamp": 1517958000
  },
  {
    "username": "Unclefeg",
    "rating": 6.0,
    "comment": "Better and more streamlined than Squad Leader, but a lot more complicated right out of the box.",
    "timestamp": 1516662000
  },
  {
    "username": "Bezmozgu",
    "rating": 6.0,
    "comment": "Not really my cup of tea -- way too many weeds. Too bad AH didn't stop evolving the SL system after Cross of Iron and just add new nationalities to that system rather than try to come up with a rule for every possible contingency. Much prefer LnL Band of Heroes series for playability and ASL Starter Kits and original SL and expansions.",
    "timestamp": 1501192800
  },
  {
    "username": "Dennis Murray",
    "rating": 6.0,
    "comment": "Hard to rate--I didn't dislike it but have no interest in playing it again. Simply way too complex to approach as anything but a lifestyle game. Even players who play it regularly need to look up obscure rules all the time in the gigantic rule book. That being said, I loved the original game when it came out (see my comments on that) and got into this initially as well before the complexity and expense got out of hand.",
    "timestamp": 1486940400
  },
  {
    "username": "ykjimr",
    "rating": 6.0,
    "comment": "I got in on this game when it came out, because a couple of my friends played it all the time. I have to admit that I never really got into having to look up rules all the time, for every single action or event-but maybe that was just the way they played, and not the fault of the game. I have not played this game for a long time.",
    "timestamp": 1482793200
  },
  {
    "username": "slatersteven",
    "rating": 5.5,
    "comment": "I like this rather less then Squad Leader. It is just a tad to fiddly.\n\nShame as it covers so much more, if it was a bit less involved would be an 8",
    "timestamp": 1480201200
  },
  {
    "username": "NewTroll",
    "rating": 6.0,
    "comment": "Donated to Children's Home",
    "timestamp": 1474495200
  },
  {
    "username": "Capeguy",
    "rating": 6.0,
    "comment": "Solid game, but more of a lifestyle than a game due to the huge amount of rules and time investment required.Game was extremely complicated and not that realistic actually IMHO as it was designed by armchair historians that didn't portray the chaotic nature of real firefights where you didn't have as much control over your soldiers as the game gives you. Everything in game happens in an orderly, efficient and clinical manner where you get to move and fire everything as you proceed thru the sequence of play. Gaming has evolved since then but at the time it satisfied that WW2 tactical itch admirably",
    "timestamp": 1468101600
  },
  {
    "username": "pilotofficerprune",
    "rating": 6.0,
    "comment": "A game that has given me much pleasure over the years, in spite of its 'everything including the kitchen sink' and 'detail for detail's sake' design. It feels as if the lunatics took over the asylum for this game, larding the original Squad Leader with too much detail. The game is scored relatively low because competition play has diminished the game in my eyes. Tournament players have leveraged the rules in order to win, and modelling of WW2 has been forgotten. The infighting and arguments over issues such as VBM sleaze are one reason why this gets no play any more.",
    "timestamp": 1463522400
  },
  {
    "username": "Maalech",
    "rating": 6.0,
    "comment": "Once a mainstay, it tends to focus on detailed rules for everything rather than flow and gameplay. I can respect it, but times have moved on and realism is not measured in whether you have rules for running past or through a house.",
    "timestamp": 1457823600
  },
  {
    "username": "fusionkast",
    "rating": 6.0,
    "comment": "The deepest tactical WWII board game I have ever played. Used to play with my father but too time consuming for me these days.",
    "timestamp": 1438380000
  },
  {
    "username": "mi_de",
    "rating": 6.0,
    "comment": "I appreciate it for what it is, but it is too much for me. I draw the line at Combat Commander.",
    "timestamp": 1423177200
  },
  {
    "username": "Scifi66",
    "rating": 7.0,
    "comment": "NO doubt an excellent game but:\n–The rules burden is Empire State Building high. Maybe I should retry the starter kits again?\n–Stacking was a pain",
    "timestamp": 1756677600
  },
  {
    "username": "jshtnt",
    "rating": 7.0,
    "comment": "Played Squad Leader in the 90s, loved it. ASL seems a more realistic (i.e. complex) simulation. Would require half-a-retirement to study.\n2009: 8.5\n2020: 8 (life-style game, is it my lifestyle?)",
    "timestamp": 1752789600
  },
  {
    "username": "mothertruckin",
    "rating": 7.0,
    "comment": "I have avoided ASL for a long time, but Hakkaa Päälle! really captured my interest so I've bought a few modules. Not sure yet if I'll ever play it (I have played SK1).\n2007 Edition Binder\nWith ASL Rule Book Divider Set from MMP",
    "timestamp": 1743458400
  },
  {
    "username": "perfectcaptain",
    "rating": 7.0,
    "comment": "Awesome, but too much detail in some places, other imprtant things ignored",
    "timestamp": 1742684400
  },
  {
    "username": "pyrosixer9",
    "rating": 7.0,
    "comment": "Returned to Father-in-Law.\n\n- Rules burden",
    "timestamp": 1741561200
  },
  {
    "username": "Tanky123",
    "rating": 7.0,
    "comment": "HAd all the system, sold it, did that twice, sold it all for the second time 5 years ago, just got back into it for the 3rd and last time roughly last year, managed to score a new Rule Book, 2 copies of Beyond Valour, 2 copies of Yanks, Red Barricades and Prokhorovka for under £200, bargain.",
    "timestamp": 1739314800
  },
  {
    "username": "Zerosum",
    "rating": 7.0,
    "comment": "Prefer classic SL I think.",
    "timestamp": 1738364400
  },
  {
    "username": "chazoom2",
    "rating": 7.0,
    "comment": "$35.00USD",
    "timestamp": 1728943200
  },
  {
    "username": "oldgoat3769967",
    "rating": 7.0,
    "comment": "Squad leader, you either love it or hate. I don't hate it, but the game's complexity of rules and the huge numbers of expansions creates a giant in wargaming. ASL is all too much to get into. Overall, ASL feel too much like work and is a hobby into itself.",
    "timestamp": 1674169200
  },
  {
    "username": "arcastbooster",
    "rating": 7.0,
    "comment": "Very detailed WW2 tactical simulation.",
    "timestamp": 1668812400
  },
  {
    "username": "Pierce",
    "rating": 7.0,
    "comment": "It's the best WWII tactical wargame available, and has enough content to keep one busy for life.",
    "timestamp": 1651960800
  },
  {
    "username": "Temprament",
    "rating": 7.0,
    "comment": "plus alot of expansions",
    "timestamp": 1644879600
  },
  {
    "username": "Javore",
    "rating": 7.0,
    "comment": "Lo tengo desde los noventa. Poco que añadir. Gran juego, mayores reglas, difícil encontrar a oponentes, al menos en mi ciudad.",
    "timestamp": 1630533600
  },
  {
    "username": "ABigOleBoat",
    "rating": 7.0,
    "comment": "This is a very good, very demanding game. By this point I think most everyone understands the weight/complexity of the game - and the popular opinion is pretty much right on the money in regards to that.\nThe game itself is fun to play, tense, and with all the modular system additions / decades of published + fan content, there's enough game out there that you could play just ASL and never run out of new things to try.\nFor me, this game is a seven and not an eight or a nine because of the investment - reward ratio for new players, the rather poor rulebooks, and the difficulty of introducing them to the system. The starterkit does a decent job - but I really do think that this game could see a resurgence of popularity with a better introductory set.\nASL has a lot of content, and the skill ceiling is very high. If you think there's a good chance that you can get a few players together to regularly play and keep the rules interanlized/fresh, I think that ASL is a great investment of time. However, if you're looking for a tactical scale game to break out once in a blue moon, or for a more mixed group of players - I think you'd be better served with Combat Commander, Lock n Loads, LYH, etc.",
    "timestamp": 1618610400
  },
  {
    "username": "kitchent",
    "rating": 7.0,
    "comment": "ASL is ASL, but I really prefer the smaller scenarios with fewer counters and urban terrain. The ASLSK scenario \"War of the Rats\" is one of my favorites in the entire series.",
    "timestamp": 1613775600
  },
  {
    "username": "Picton101",
    "rating": 6.5,
    "comment": "See my ASLSK#1 comments for details. Yes my comments are relevant to both starter and full as I delved into both.\n\nFor my tactical fix I'd rather play something simpler with character at ASL's lower squad level (HoN, LnL, CC:E/M/P/R) or something a bit meatier at a broader tactical level (PzG, Red Poppies, NaW)",
    "timestamp": 1602540000
  },
  {
    "username": "curtnic",
    "rating": 8.0,
    "comment": "My buddy's favorite game. Many many hours playing. I prefer the operational over the tactical, but lots of fun.",
    "timestamp": 1757196000
  },
  {
    "username": "SpareTire",
    "rating": 8.0,
    "comment": "A superb game [Edit] While I still love the game, facing the reality of not getting this to the table -- sold off my collection to fund other games.",
    "timestamp": 1756677600
  },
  {
    "username": "KerbalGandalf",
    "rating": 8.0,
    "comment": "I enjoyed my time playing ASL and in total that is quite a lot. I even have a map design credit for \"Festung Budapest\". It is a good game of small unit actions in WWII movies. It is not a really good simulation of small unit actions in the real world, especially not at the cost of the rules overhead this game has. It's armor model is only so-so. When one talks about this game, you are immediately shunned if you make a \"reality argument\" which annoys me to no end. I am more into wargames to simulate and learn. The sheer complexity of it and the enormity of supporting products prevents the rules from evolving. There are so many fiddly bits that any tweak and the thing falls apart. These rules were groundbreaking in 1985 but have not benefited anything since.\n\nI doubt I will play much again, except with my brother who loves this game.",
    "timestamp": 1755468000
  },
  {
    "username": "Ben_Bos",
    "rating": 8.0,
    "comment": "Get a life after playing this one. Buy it and show its ... 620 + pages of bible formatted (2 columns) text to every gamer who thinks he's a rules lawyer.\nProblem is that ASL takes so much time and effort to play...\n\nAfter 41 years of wargaming though I can say it is not the best wargame at all in a LOT of features.\n\n- The scale is too limited to see historical battles unfold in a reasonable amount of time. You really can not simulate key battles of Stalingrad on a squad level. Simple fact.\n\n- The scale is too small to show off WW2 hardware differences and effects of combined arms adequately. The ground scale limits tank ranges and effectiveness for example.\n\n- I have huge questions about its leadership interference. These 9-2 leaders remind me too much of John Wayne standing straight on Omaha Beach with a cigar in his mouth. I have never seen these guys at my own FIBUA training sessions either.\nOk, it is a game ... but at this level of rules writing, it is like putting lipstick on a pig.\n\n- Its sequence of play is convulted, too artificial and frankly ... wrong and here is why:\n\nASL is a direct result from traditional wargame mechanics from the 60’s : I move/fire all then you move/fire all troops. Of course these are crude operational methods. To make that work in a tactical game you need to INTERRUPT every few actions between players and so you create an abomination monster of a far too complicated sequence of play...\n\nThe end result is 620 pages of rules written in the smallest bible book tradition.\nThe game simply can NOT be played error free unless you want to limit it to its most basic infantry scenarios with the least troops/conditions possible.\nIts convulted sequence of play prevents ANY decent solo mechanics too btw both as a 2 handed solo method as in possible AI bot play.\n\nAs a tactical wargame better alternatives appeared over the years.\n\n- Panzer turns circles around the hardware shown in ASL and its scale better represents WW2 grand tactical operations. In Panzer you can SEE the fight around a certain key village in France 40 as it is fought over 3-4 square miles...\nin ASL you fight over a house while in Panzer you try to get control over a key objective as big as a village but with 10% of the rule overhead and 10 times more hardware detail on the mechanised units.\n\n- Conflict of Heroes introduces simultanious movement: you go ONE hex, I go ONE hex, you fire ONCE, I fire ONCE. Alternating units do not even have a movement factor on their counter, only an activation number to see if they continue the orders given or ... stop.\n\n- The Day at series or Enemy Action Ardennes turn circles around ASL in SOLO excitement. In no way ASL will ever have any decent challenging solo play. Its too complicated sequence of play and zillion rules interactions will prevent it.\n\n- Finally Up Front shows the real hectic of basic Infantry fighting ASL will never bring to the table. Stumbling over a creek, trying to get to a few trees to gain some cover. Pushing to get to a building with all unexpected events one can fear. Even the simplest AFV has a better emotional appearance in its smallest firefight format possible.\n\nNo, while I still have masses of ASL expansions, the game is no longer the ultimate wargame. Actually it never was.",
    "timestamp": 1738969200
  },
  {
    "username": "Tank3RTR",
    "rating": 8.0,
    "comment": "finally got back into ASL 3rd time around, have owned pretty much everything 2 times, sold it all on and now back into it for good 3rd time round. been a funny 37 years.",
    "timestamp": 1721858400
  },
  {
    "username": "murph0499",
    "rating": 8.0,
    "comment": "It is what it is. If you like tactical games, you have to play this game.",
    "timestamp": 1711062000
  },
  {
    "username": "werwerf",
    "rating": 8.0,
    "comment": "An all time classic.",
    "timestamp": 1710802800
  },
  {
    "username": "Kaiser116",
    "rating": 8.0,
    "comment": "ASL - AH",
    "timestamp": 1708556400
  },
  {
    "username": "TVDinner",
    "rating": 8.0,
    "comment": "Played wargames in teens, eventually bought this. Loved it, but it seemed that by the time I taught someone how to play it somebody'd move. Had to get rid of it. Look back at it fondly, but I don't regret dumping it. Had all the boards and scenarios, Deluxe ASL too.\n\nI really can't rate this. Fantastic game for those who like cardboard solders and have an opponent or two. Back before dat inturnat thing it was much harder to find and teach folk.\n\nOddly enough I got beat a good deal at wargames but loved playing them.",
    "timestamp": 1707692400
  },
  {
    "username": "PeteMan73",
    "rating": 8.0,
    "comment": "Have just about every official thing up to end of 2023. No longer adding to the collection - as too many unopened items... GREAT system, but imho it is being poorly nurtured - the constant board releases is on par with microtransaction hell.",
    "timestamp": 1704927600
  },
  {
    "username": "doubt72",
    "rating": 7.5,
    "comment": "Stand-in for ASL in general.",
    "timestamp": 1694815200
  },
  {
    "username": "kameronsnewphone",
    "rating": 7.5,
    "comment": "The ruleset is super exciting on paper, and the content and variety is excellent. But not totally convinced the game experience is worth its length yet.",
    "timestamp": 1687298400
  },
  {
    "username": "AnotherHorrorFan",
    "rating": 8.0,
    "comment": "Finally played ASL at Kubla Con. I am so glad I finally learned the rules. This is easily one of the best games I have ever played. It just feel like distilled squad level war gaming (probably because all modern squad level war gaming seems to come from this). I will gladly play this at any opportunity. My struggle now becomes getting someone I know to learn the system.\n\n2019-02 Update: I still like and respect the game but I would never play it over Band of Brothers (or some other squad level games) nor would I have the option to outside of Kubla Con. There is just WAY too much rules overhead.\n\n2020-04: Further lowering score due to my increasing engagement with the BoB system.\n\n2021-05: 6->8. On its way back up as I have growing appreciation for how classic it is along with the sheer volume of content.\n\n2022-05: Further increasing the score because of a recent play where I realized the game isn't as impossibly complicated as it seems. There is obviously a lot going on but it isn't as ludicrously beyond other tactical games as I initially thought.",
    "timestamp": 1671058800
  },
  {
    "username": "SeanC",
    "rating": 8.0,
    "comment": "Oy, the Rules!!! Best to get someone to teach you this game, or do a lot of solitaire experimentation. Some scenarios are playable within 2-4 hours, and you don't usually need much space (coffee table works). However, If you're adverse to games with lots of rules, rate ASL a 0 out of 10.",
    "timestamp": 1660514400
  },
  {
    "username": "johnwong882",
    "rating": 8.0,
    "comment": "+ Starter Kit #1\n+ Starter Kit #2\n+ Starter Kit #3\n+ 1. Beyond Valor\n+ 3a. Yanks\n+ 5a. For King and Country\n+ 9. Hatten in Flames\n+ 10a. Croix de Guerre\n//",
    "timestamp": 1660514400
  },
  {
    "username": "jgross68",
    "rating": 8.0,
    "comment": "Sold collection May 2022",
    "timestamp": 1652738400
  },
  {
    "username": "GomJabbar",
    "rating": 8.5,
    "comment": "My Rank: 30",
    "timestamp": 1758146400
  },
  {
    "username": "Istvanffy",
    "rating": 9.0,
    "comment": "Excellent but very complex. It is a very addictive and their are countless scenarios. Well worth the effort if you don't mind the tactical scale.",
    "timestamp": 1757282400
  },
  {
    "username": "Rhuned",
    "rating": 9.0,
    "comment": "If I was on a desert island with one game, this would be it. The Ultimate tactical WW2 game. The most comprehensive, realistic, and detailed you will find.",
    "timestamp": 1744840800
  },
  {
    "username": "jofomo",
    "rating": 9.0,
    "comment": "It has it all, and maybe a bit too much even.",
    "timestamp": 1742166000
  },
  {
    "username": "erico_rempel",
    "rating": 9.0,
    "comment": "There are newer, simpler and more beautiful tactical games, but I'm a Mathematics professor, so this is a delight.",
    "timestamp": 1721858400
  },
  {
    "username": "WBRP",
    "rating": 9.0,
    "comment": "All I have left is both editions of the ASLRB: sold of everything else (except my dice with BV) but still try to get to the CASLO when it is in Victoria or Ottawa.\n\nI've had most everything official except for the SK stuff (why bother - I was way past 'starting') and the Operations mags. I'd rate it a 10 if the regular rules had incorporated the Command & Control rules and Mission/Random Events mechanic of the SASL module from the get go.",
    "timestamp": 1715637600
  },
  {
    "username": "Wild Admiral",
    "rating": 9.0,
    "comment": "ASL\n\n\"Simulate nearly any battle in any theater up to the battalion level. Maneuver 10-man squads, five-man half squads, and individual leaders and vehicles across a combination of over 50 geomorphic map boards or fight a campaign game on one of several highly detailed campaign game map sheets.\"\n\n1997's \"Classic ASL\" is a collection of articles, variants, analysis and scenarios for Avalon Hills Advanced Squad Leader game. The first 10 scenarios are updated ASL versions of Squad Leader Scenarios and the other 6 are new tournament scenarios.\n\n2003's (pdf in 2020) \"A GI’s Dozen\": 13 converted scenarios from the original Squad Leader series (from GI: Anvil of Victory and Series 300) to Advanced Squad Leader).\n\n2008's \"Turning the Tide\": 20 scenarios that are updates to the Advanced Squad Leader system of Squad Leader scenarios from Cross of Iron, Crescendo of Doom, GI: Anvil of Victory, the 100 Series, the 200 Series, and the “Rogue 200” scenarios.\n\n2013's \"Rivers to the Reich\": 15 scenario adaptations ........ completing the official Squad Leader scenario conversions begun with Turning The Tide.",
    "timestamp": 1711753200
  },
  {
    "username": "BlitzkriegBeast",
    "rating": 9.0,
    "comment": "This, the king of WWII tactical war games, has left more fond - and often hilarious - memories than any other game I’ve played over my 4 decades of wargaming. It’s hard work though. I recommend playing it with a laid back attitude, and just moving past the situations you can’t seem to figure out. If you know the rule - great, quote it or find it quickly, and use it. If you don’t, come up with a house rule you both can live with, move on and leave it to the AAR to figure out.",
    "timestamp": 1709247600
  },
  {
    "username": "jtreu",
    "rating": 9.3,
    "comment": "2nd Edition rules of course. After slowly making my way through it, have played a lot of games and am an experienced player, but still never seem to get enough of it!\n\nIt needs better tutorials than just the Starter Kits, and it needs a bit better flowchart type decision matrices (but it now has an electronic searchable rules database). The reason it doesn't get a 10 is that there are some things that have ossified rules wise, and I'm disappointed that the community is largely okay with the poor recruiting and poor welcoming of newer, younger players, meaning sustainability is tsk tsk.",
    "timestamp": 1708124400
  },
  {
    "username": "spinettio",
    "rating": 9.0,
    "comment": "A big investment in time and money but very rewarding. Can be frustrating when the dice decide to go against you but then these moments happen they make for great stories of glory or woe when they occur.",
    "timestamp": 1707346800
  },
  {
    "username": "MTT191",
    "rating": 9.0,
    "comment": "Best tactical WW II game! Heavy rules simulating almost every possible situation but actually you use about 90% of game only basic rules and 10% scenario related rules.",
    "timestamp": 1704927600
  },
  {
    "username": "turpid",
    "rating": 9.0,
    "comment": "The Daddy of all Squad based games. The ultimate package especially now that MMP are reprinting the core modules with all those extra goodies included.",
    "timestamp": 1700348400
  },
  {
    "username": "williewhale",
    "rating": 9.0,
    "comment": "Many modules. I need more 4-6-7 counters.",
    "timestamp": 1693951200
  },
  {
    "username": "Many Mariuses",
    "rating": 9.0,
    "comment": "I've probably had more fun playing ASL than any other game. That being said, the rules are extremely dense and often poorly written. The best way to learn the game is at the feet of an experienced gamer. Still, its worth the investment of time and brainpower.",
    "timestamp": 1687730400
  },
  {
    "username": "PabloGS",
    "rating": 9.0,
    "comment": "Only game I keep playing continuosly.",
    "timestamp": 1677884400
  },
  {
    "username": "eerom",
    "rating": 9.0,
    "comment": "Perfect Hollywood stuff (except for the officers lurking behind the lines). Best played in slightly relaxed mode.",
    "timestamp": 1672959600
  },
  {
    "username": "doktor avalanche",
    "rating": 10.0,
    "comment": "& various scenarios and starter kits.",
    "timestamp": 1759010400
  },
  {
    "username": "kwhite1",
    "rating": 10.0,
    "comment": "P",
    "timestamp": 1757973600
  },
  {
    "username": "autumnweave",
    "rating": 10.0,
    "comment": "Plays\n2025/09/15 Rally Point 13 - RPT122 Let'er Buck. Larry (US armor), Dan (US inf.) Charles (German Armor), Diane (German inf) German Win.\n2025/04/28: Coastal Fortress BB 21.1 - Awaiting orders. Dan (American defenders) - L, Larry German attackers) - Win\n2025/02/22: U35 Semper Paratus Dan (German defenders) L, Diane Spangler (Canadian attacker ) w.\n2025/01/18: BFP-99: Ivanovskii. Dan (Russian) - W, Larry Spangler (German) - L. This was from Crucible of Steel\n2024/12/23: AP89: To the pain. Dan (British) - L, Diane Spanger (Japanese) - W.\n2024/11/23: MM78: A day at the Museum. Dan (German) - L, Lorenzo Knight (British) - W.\n2024/10/12: DB135: The Krinkelterwald (Dispatches From the Bunker #45) - Dan (US) Lorenzo Knight (German) W\n2024/03/02 +(24/02/29): S03 Simple Equation - Dan (US) Guy (German (W)\n2024/02/29 + (24/025): S03 Simple Equation - Dan (German) Guy (American) L\n2024/02/16: S02 War of the Rats (SK1): Dan (German) Guy (Russian) (L) - Guy wins on the last turn with the last dice roll. I roll a 10, needed a 9 to win.\n2024/01/25: S01 - Retaking Vierville (ASL SK1) Dan (US) Guy (German) (W)\n2018/10/21: T1/ ASL 181: Gavin Take (Yanks 3a) Dan (US) against Jacob B. (German). Wild West Fest. (W)\n2018/10/20: RPT129 American Banzai (Rally Point 13) Dan (German) against Diane S. (American) Draw\n2018/10/19: LM-01 Recruiting Tactics (The Long March) Dan (KMT) Adam E. (Russian). (W)\n2018/09/16: BFP 102 (Crucible of Steel) Finished Brian Y.'s (Russian) game against Larry (German) as the Russians. (W)\n2018/05/17: ASL 48 (Last Hurrah) Dan (Belgian) against Doug (German). (Incomplete)\n2018/04/14: ASL 14 (Paratrooper) Dan (German) Tycho (American) (W)\n2018/03/17: S02 (ASL SK1) 2 games against Bruce using full rules. 1st was a forward defense, 2nd was further back. (W/L)\n2016/05/03: S02 (ASL SK1) Dan (German) Against Tripp (Russian). (L)\n2016/03/28: S01 (ASL SK1) Dan (German) Against Tripp (American) (W)\n2014/02/15: S02 (ASL SK1) Dan (American) against Seth (German) (W)\n2013/08/19: S01 (ASL SK1) Dan (German) against Seth (American) (W)\n2005/08/14: S01 (ASL SK1) Solo game in Singapore.\n\n\n2021/06/03: Upcoming Releases: From Hong Kong Wargamer's site\nMMP, Hollow Legions reprint with desert & Sons of Negus (Preorder 2021)\nMMP, ASL Journal 13 with Board 77 (2021)\nMMP, Overlay bundle (Preorder 2021)\nMMP, Drop Zone Ste Mère Église HASL (2020-21)\nMMP, Ortona : Little Stalingrad\nMMP, Slaughter at Ponyri (2020-21)\nMMP, The Dawn of Eagles, Rotterdam Mini-HASL\nMMP, Sword and Fire: Manila 45 HASL (Preorder 2021)\nMMP, Chapter E Pack\nMMP, Pocket Size Chapter H (2021)\nMMP, Pocket Size Charts – spiral bound (2021)\nMMP, Rare Vehicles & Ordnance (mentioned ASL J9)\nMMP, Sevastopol HASL (mentioned ASL J9)\nMMP, The 10th Guards Rifle Division Action Pack (mentioned J11)\nMMP, Polish Eagles (tent.) HASL, Poles from 1939-1945 (+Mokra CG, 1 map, 2 geo, 20 scenarios)\nMMP, Marco Polo Bridge HASL\nMMP, Spanish Civil War\nMMP, The US First Cavalry Division Action Pack (2021 ASLOK)\nMMP, Supplemental Map Bundle 2 (2021)\nMMP, Sparrow Force, The Battle of Timor\nBounding Fire Production, The Devil’s Anvil: Peleliu\nBounding Fire Production, (Late War in Netherlands)\nBounding Fire Production, (North Africa)\nBounding Fire Production, Sangshak Operation U-Go (PTO, Brit/Japanese, HASL, CG & 20 scenarios) – Hathaway & Nogueira\nBounding Fire Production, (PTO, USMC)\nBounding Fire Production, (Scenario Pack Philippines Campaigns)\nBounding Fire Production, (mini HASL, Battle for the Manila Sports Complex, 7 scenarios + CG)\nBounding Fire Production, Operation Neptune\nBounding Fire Production, Mannerheim’s Cross (Finnish Pack)\nBounding Fire Production, East Front Pack\nBounding Fire Production, Recon by Fire 5\nBounding Fire Production, High Ground 3\nLone Canuck, TM Opening the Baltic Gap, 5-6 July 1944, the Soviet Summer Offensive\nLone Canuck, TM Battle of the Hedgerows Lurking Panthers, July 1944, Normandy\nLone Canuck, Grossdeutschland Pack 3 High Tide at Kursk July 1943\nLone Canuck, Red Surge Operation Kutuzov, July 1943, Orel\nLone Canuck, WinPak 3\nLone Canuck, Operation Bagration\nLone Canuck, TM Sacrifice & Courage, Cassino, Jan 1944 ( US 133d Infantry Regiment, 34th Infantry Division “Red Bull” vs. 44.Infanteriedivision “Hoch und Deutschmeister”)\nLone Canuck, Storming Hitler’s Festung Europa – Juno Beach\nLone Canuck, Wacht Am Rhein 2nd Ed, Vol 2 – Hitler’s Last Gamble in the West\nLone Canuck, Operation Martlet Objective Barracuda – Battle for Fontenay le Pesnel, 49th (West Riding) Infantry Division vs Panzer Lehr & 12th SS Hitlerjugend Divisions\nLone Canuck, Hell at Dom Bütgenbach, Hitlerjugend 12th SS-Panzer Div vs the Big Red One.\nLone Canuck, Battle of Lake Khasan, 1938 Russians vs Japanese\nLone Canuck, Brandenburgers Hitler’s Special Forces\nLone Canuck, Elst, XXX Corps’ Highwater Mark\nLone Canuck, Battle for France, from the Somme to the Seine\nLe Franc Tireur, Amiens & Abbeville 1940 HASL (PT @ ASLOK 2017)\nLe Franc Tireur, Deluxe Pack 2\nLe Franc Tireur, Case Green (Czechoslovakia)\nLe Franc Tireur, Prokhorovka CG\nLe Franc Tireur, Armored Trains\nLe Franc Tireur, Tarakan (Borneo)\nLe Franc Tireur, Gothic Line\nLe Franc Tireur, Le Corps Franc Pommiès (French Resistance)\nLe Franc Tireur, Madrid 1937/1938\nLe Franc Tireur, Eben Emael + Kanne (German paras in Belgium)\nLe Franc Tireur, Stavelot (Bulge)\nLe Franc Tireur, Stalnie Prostori II\nLe Franc Tireur, Indochine 1946-1954\nLe Franc Tireur, Bir Hakeim (Gazala)\nLe Franc Tireur, Kohima\nLe Franc Tireur, St Nazaire 2, plus the Battle of Bengtskär\nLe Franc Tireur, FTC10 Fox Hill\nHazmo: Scenario Pack 1 A World at War\nKansas City ASL, WWI ASL The Great War\nNew England Volunteers & Yankee ASL, Nor’easter Pack II\nAdvancing Fire Group, Orsogna (Italy, Gustav Line, December 1943)\nAdvancing Fire Group, Prokhorovka (Kursk, July 1943)\nAdvancing Fire Group, Alytus (Barbarossa, June 1941)\nAdvancing Fire Group, Roma (Italy, September 1943)\nAdvancing Fire Group, Termoli (Italy, October 1943)\nAdvancing Fire Group, Counterattacking the Thumb (Campleone-Aprilia, Italy, February 1944)\nAdvancing Fire Group, Targu Frumos (Romania, April-May 1944)\nAdvancing Fire Group, Caen, Buron-Franqueville sector (June-July 1944)\nAdvancing Fire Group, Rauray (July 1944)\nDeath to Fascism 2 “Not one step back!” (ASLOK 2021)\nSherry Enterprises, Schwerpunkt #24\nSherry Enterprises, Rally Point #19 PTO SK\nSherry Enterprises, Rally Point #20 The Italian Army in WW2\n\n\n2018/4/15: Plays are recorded on the individual modules. So far I've only started using guns.\n\n2007/2/12: Okay I've got a fetish here, and I'm not certain that it's totally healthy. Do I play this game a lot? no. Do I think about it a lot? Yes. Do I like what I see? Most definitely. Should I be saying these things about Melissa Theuriau rather than some dumb board game? absolutely, sign me up for therapy.\n\nHave both 1st and 2nd edition rulebooks.\n\nNote: remember possibly using plano 3601s as a storage solution.",
    "timestamp": 1757973600
  },
  {
    "username": "kwhite1",
    "rating": 10.0,
    "comment": "P",
    "timestamp": 1757887200
  },
  {
    "username": "MagisterLudo",
    "rating": 10.0,
    "comment": "Pocket edition of rules. Very useful size and a lot easier to carry around (3PP vs 5PP). Incorporates both Desert and PTO whereas these pages were normally only available with purchase of modules.",
    "timestamp": 1757714400
  },
  {
    "username": "DesignXception",
    "rating": 10.0,
    "comment": "Includes everything official",
    "timestamp": 1757541600
  },
  {
    "username": "Pocruiser",
    "rating": 10.0,
    "comment": "Greatest tactical game of all time!",
    "timestamp": 1755640800
  },
  {
    "username": "iplaybgnaked",
    "rating": 10.0,
    "comment": "The game to end all games, nothing else manages to pack such a strategically rich and thematically dense experience into ~2 hours as this masterpiece does. Sure it's riddled with gamey exploits that have been discovered by now, but there's a reason it has held up for over 40 years primarily as a competitive experience first and a thematic simulation second because ASL's gameplay is just that damn good.",
    "timestamp": 1747260000
  },
  {
    "username": "MoriQuessir",
    "rating": 10.0,
    "comment": "Bloody historical gambling simulator.",
    "timestamp": 1747000800
  },
  {
    "username": "PaulusBorgia",
    "rating": 10.0,
    "comment": "Hell yes",
    "timestamp": 1745359200
  },
  {
    "username": "x6ftundx",
    "rating": 10.0,
    "comment": "Greatest game ever made",
    "timestamp": 1745013600
  },
  {
    "username": "George Arthur",
    "rating": 10.0,
    "comment": "Incredible system - the king of tactical WWII gaming.",
    "timestamp": 1743202800
  },
  {
    "username": "DogNamedGus",
    "rating": 10.0,
    "comment": "*This game is in my personal Top 4 (AKA a \"Mount Rushmore\" Game)*\n\nI actually consider this game as a flag planted atop my \"Mount Rushmore\", so it outranks my Top 4\n\nThis one is the true big boy, the ultimate in complexity and chrome. Tackling the rulebook is akin to learning a college course, but the payoff is entry to a grand combat simulation experience like no other.",
    "timestamp": 1742857200
  },
  {
    "username": "SwordsandRifles",
    "rating": 10.0,
    "comment": "The gold standard for WWII tactical games.",
    "timestamp": 1738537200
  },
  {
    "username": "JaggedTech",
    "rating": 10.0,
    "comment": "I've been playing this game for over 30 years. I have a very large ASL collection which I do not track in this BGG profile.\n\nASL is a challenging, but very rewarding game to play. The game has an outstanding ebb and flow feeling, and it is very frequently difficult to know whether you will win or lose until the end of the scenario. Consequently, the game is always intense. The phase structure of the turns mean that both players are always doing something, which means NO downtime between turns.\n\nYou can try this game system very inexpensively with the ASL Starter Kits available through Multiman Publishing. Some people are happy to play just the starter kits, and others go on to explore the entire system. No other game has the same replayability. If you own the complete system, you can play every major and minor participant in the war, and fight on any front. If a vehicle, weapon, or troop existed in WWII, you can probably find it somewhere in a module or expansion.\n\nEach nationality has a different feel when played (is any of this realistic, probably not, but I don't care.... it is just a great game). The game is also very flexible. There are a large number of geomorphic boards (more than 60) that can be placed together to make custom maps. In addition, there are a very large number of historical maps based on research of the actual terrain on which the battles were fought. Play time can range from an hour for small scenarios up to 100 or more hours for large campaign games. There are many hundreds of published scenarios available, and some are free for downloading from the web. In addition there are rules for solitaire play, email and postal play, online game play through Virtual Advanced Squad Leader (VASL), and design your own games called DYO that allow you to quickly pick out opponents purchase your forces and set up maps and objectives. There is a thriving community of dedicated players who produce scenarios and historical modules for this game. In addition there are expansions for the system covering the Spanish civil war, the Italian invasion of Ethiopia and other non-WWII battles. There is a large body of information about the game including FAQ’s and mailing lists to assist players with game play and rules interpretations. Other players are fairly easy to find via the Internet, and most major metropolitan areas will have an active group of ASL players. The game requires a high level of skill to play well, but there is enough luck that, like real life, surprising things happen and you must adapt. I play a lot of different games and I rate a few quite highly, but if I had to pick only one game to play, this is the one I would choose.\n\nGo here for a really great review of ASL by Cleitus the Black: http://www.boardgamegeek.com/thread/386060/an-attempt-to-des...-\n\nAnd here is another really good review by Eoin Corrigan: http://www.boardgamegeek.com/article/12814113#12814113",
    "timestamp": 1736722800
  },
  {
    "username": "Kingkerosin",
    "rating": 10.0,
    "comment": "A S L - complex but great!",
    "timestamp": 1735513200
  }
]