[
  {
    "username": "Yvan13",
    "rating": 1.0,
    "comment": "Jeu parfaitement inintéressant, à éviter",
    "timestamp": 1669935600
  },
  {
    "username": "ultimoratio",
    "rating": 1.0,
    "comment": "Awful, boring, tedious take-that game that drags on and on. Put me in the hit list because I'd rather die than to play this game again.",
    "timestamp": 1581289200
  },
  {
    "username": "jarmoaulu",
    "rating": 1.0,
    "comment": "Confusing and boring. (Dec 2016)",
    "timestamp": 1552604400
  },
  {
    "username": "HintofSarcasm",
    "rating": 1.0,
    "comment": "Junk. Complete randomness on what you draw and who decided to play their cards. No real strategy. I'd rather roll dice or play slots",
    "timestamp": 1536616800
  },
  {
    "username": "fearad",
    "rating": 1.0,
    "comment": "This game is just awful.",
    "timestamp": 1363993200
  },
  {
    "username": "darquil",
    "rating": 1.0,
    "comment": "Components: The cards are rather garish, with unattractive backgrounds behind the mobsters, and the same mobster featured on each card of a suit, despite each card having a different mobster's name (even with a female mobster name, there is still a picture of a male mobster).\n\nExperience: A tit-for-tat system, that didn't amount to much for me.\n\nFirst Played: 2002-01-01\nLast Played: 2002-01-01\nEagerness to Play Again: Never\n\nPlays (2):\n? players: 2",
    "timestamp": 1319320800
  },
  {
    "username": "Boltana",
    "rating": 1.0,
    "comment": "Boring card game that suffers from kingmaker situations for players with little hope of winning.",
    "timestamp": 1302732000
  },
  {
    "username": "AnalogGamer",
    "rating": 1.0,
    "comment": "NOT a simulation of Organized Crime: that's just the theme pasted onto the otherwise nice abstract card game.",
    "timestamp": 1286661600
  },
  {
    "username": "logicalgambit",
    "rating": 1.0,
    "comment": "You might as well just flip a coin to decide who wins this game, as opposed to actually playing it.",
    "timestamp": 1243288800
  },
  {
    "username": "m_r_tyler",
    "rating": 1.0,
    "comment": "Now here's a fun game. Not! This is \"Survivor\" with cards. If the other players want you gone, you are gone. Strategy can't help you. This boils down to a popularity contest.",
    "timestamp": 1120255200
  },
  {
    "username": "yttire",
    "rating": 1.0,
    "comment": "This game is terrible. It is so bad I can barely call it a game, it sat on a garage shelf for months not warranting being stored with the real games.. it probably has moved on to the trash can by this point. Pointless card playing",
    "timestamp": 1054332000
  },
  {
    "username": "babimanis1",
    "rating": 2.0,
    "comment": "sold 2022",
    "timestamp": 1673218800
  },
  {
    "username": "SeerMagic",
    "rating": 2.0,
    "comment": "Typical take that game\n\n Mob theme\n\n Luck based\n No balance\n Very little decision making",
    "timestamp": 1646089200
  },
  {
    "username": "Pandorzecza",
    "rating": 2.0,
    "comment": "Not my type",
    "timestamp": 1628719200
  },
  {
    "username": "RevolutionTech",
    "rating": 2.0,
    "comment": "Check out my review: http://boardgamegeek.com/video/30811/family-business/tableto...",
    "timestamp": 1612134000
  },
  {
    "username": "Arkeas",
    "rating": 2.0,
    "comment": "Quick and easy take that filler game but there's nothing remarkable about it. After playing it and hoping I'd never see it again, we somehow got this as a sweetener in a math trade. Managed to give it away with a couple of other games I sold.",
    "timestamp": 1566856800
  },
  {
    "username": "Kratzer",
    "rating": 2.0,
    "comment": "Old, old, old old old feeling.",
    "timestamp": 1554156000
  },
  {
    "username": "johnpnewman",
    "rating": 2.0,
    "comment": "It's a take that game, similar to guillotine but with less charm, more luck and takes more time.",
    "timestamp": 1544137200
  },
  {
    "username": "Miked1921",
    "rating": 2.0,
    "comment": "This game is ok. It runs the same issues as Mafia or Werewolf - killing people off just because, and favorites/ teamsies can happen quite often. Probably will never really want to play again.",
    "timestamp": 1515279600
  },
  {
    "username": "realityfoible",
    "rating": 2.0,
    "comment": "This game feels like playing Guillotine, if Guillotine was a quite a bit more bland. Fine for the family, but if presented with the choice, this is not the path to take.",
    "timestamp": 1513551600
  },
  {
    "username": "chaps357",
    "rating": 2.0,
    "comment": "Don't really like this kind of game, it's just chaos and stupid leader bashing.\nSame than \"Canardage\" for instance, that I hate with all my heart.\nCould be ok for young players, art is nice (I have the old fantasy version).\nI might try to play it with my daughter though...",
    "timestamp": 1502834400
  },
  {
    "username": "seeleste",
    "rating": 2.0,
    "comment": "Maybe it's the French remake, maybe is the game, but it's awful.",
    "timestamp": 1472335200
  },
  {
    "username": "CameronWLucas",
    "rating": 3.0,
    "comment": "Had a really bad time playing this. Maybe repeat plays would go differently, but I'm not eager to find out.",
    "timestamp": 1671318000
  },
  {
    "username": "Nicolas Weiss",
    "rating": 3.0,
    "comment": "Family Business may be criticised for being another mindless \"take that\" game where bashing the leader is the best course of action. But it isn't. The optimal strategy is instead to always target the player on your right, since if your attack gets countered and your target becomes the active player, you're next in turn order. Which manages to make the experience even worse than the previous assumption!\n\nAlso, whoever was responsible for the 2000s French version, thought that a mafia mob war was not a suitable setting and concluded that the fantasy of commiting a genocide against fairytale species by chewing them alive would be more marketable should maybe question their sanity.",
    "timestamp": 1665439200
  },
  {
    "username": "Pastelpainter",
    "rating": 3.0,
    "comment": "just a Take That game that usually ends up in bashing the leader. Theme is done quite well but that's about it.\nIt's extremely light, silly and has no strategy. It's very luck based.",
    "timestamp": 1635458400
  },
  {
    "username": "zackt",
    "rating": 3.0,
    "comment": "Not a fan. Sold after just a couple plays",
    "timestamp": 1622930400
  },
  {
    "username": "joebelanger",
    "rating": 3.0,
    "comment": "Great theme! I wish there was some card text on the cards. I'm not a big fan of \"language independence\".",
    "timestamp": 1610406000
  },
  {
    "username": "hiyou",
    "rating": 3.0,
    "comment": "キングメーカー問題について学べるゲーム。\n逆に他プレイヤーと共闘関係を結んでやったら面白いかもしれない。カウンターでターンが来る訳だし、カードもより有効に使いことが出来る。",
    "timestamp": 1587420000
  },
  {
    "username": "YRUHERE",
    "rating": 3.0,
    "comment": "suppose to be cut throat... seems to stall.",
    "timestamp": 1581375600
  },
  {
    "username": "Kamaitatchi",
    "rating": 3.0,
    "comment": "Pretty random hand management game. Theme's not my jam and art design + art also left a lot to be desired...",
    "timestamp": 1574550000
  },
  {
    "username": "nucleartrask",
    "rating": 3.0,
    "comment": "Pointless no strategy kingmaker nonsense.",
    "timestamp": 1567634400
  },
  {
    "username": "Theatremorgan",
    "rating": 3.0,
    "comment": "This is nothing more than Uno with a mob family theme. The only entertainment is joking about the characters and maybe adding some lines from mob movies yourself.",
    "timestamp": 1558994400
  },
  {
    "username": "calandale",
    "rating": 3.0,
    "comment": "2nd edition took a bad game that could be silly fun and made it unplayable.",
    "timestamp": 1551913200
  },
  {
    "username": "geofffs",
    "rating": 4.0,
    "comment": "Gangsters doing what they do best",
    "timestamp": 1760306400
  },
  {
    "username": "Kodeir",
    "rating": 4.0,
    "comment": "Way too fiddly for what it is. Was good back in the day, but years haven't been kind to it.\n\nRating: \nOptimal number of players:\n4~5\n2~3\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1709334000
  },
  {
    "username": "lewelen",
    "rating": 4.0,
    "comment": "Take-that made fun only through hard work",
    "timestamp": 1674946800
  },
  {
    "username": "bnordeng",
    "rating": 4.0,
    "comment": "One play and I was knocked out pretty quick... I think they were after me . I did see that I mis-managed what I was doing a bit, but it was fun for a relatively quick little card game of \"take that.\"\n\nPlayed again and it's just \"take that\" which I won the second time. Unfortunately, it seems to have the common bash-the-leader feel and be lucky enough to draw the right cards to win. The theme and game play does cause a feeling of dread, but I'm not sure this is exactly my style of game.",
    "timestamp": 1670367600
  },
  {
    "username": "smilingra",
    "rating": 4.0,
    "comment": "This is an old-school version of Guillotine, with the primary difference being that it takes an initial threshold before the gangsters start getting killed and all the gangsters are the same; instead, you play action cards. It's not bad for occasional silly fun, but that's about it.",
    "timestamp": 1668553200
  },
  {
    "username": "Emil1979",
    "rating": 4.0,
    "comment": "I liked it at first, but over time I'd rather play Mille Bornes for Take That and I'd rather play Guillotine for the \"line up\" feature, and I'd rather play \"The Boss\" for the mafia/crime theme. So after the first few plays, it just didn't scratch any of the itches better than the other games I mentioned above.",
    "timestamp": 1655157600
  },
  {
    "username": "Jimzik",
    "rating": 4.0,
    "comment": "A game probably better with 3 or more players.",
    "timestamp": 1652479200
  },
  {
    "username": "punkin312",
    "rating": 4.0,
    "comment": "Mob game to get rid of all the other players. Nothing fun about this, but nothing was actually broken either. Eh, not great.",
    "timestamp": 1638831600
  },
  {
    "username": "Ravensburg24",
    "rating": 4.0,
    "comment": "Outcompeted by Love Letter.",
    "timestamp": 1628460000
  },
  {
    "username": "youjon5",
    "rating": 4.0,
    "comment": "Not a fan.",
    "timestamp": 1621202400
  },
  {
    "username": "FranklinTV",
    "rating": 4.0,
    "comment": "Based on one 4 player session; an interesting themed card game with player elimination, just nothing which demands that it be on the immediate replay list (14/12/08). UPDATE It's ok (Rating 5.758 Jan 17). UPDATE: One for the Board Game Event Horizon (Dec 19). UPDATE: Pub Meeple Ranking Engine Dec 2020 (Rating: 4.033).",
    "timestamp": 1615330800
  },
  {
    "username": "purplecow55",
    "rating": 5.0,
    "comment": "A card based game where players are trying to be the last mobster standing (starting with 9). Players take a card, then play a card (usually adding player's mobsters into hit list). The hit list starts at the deck and expands. Once it hits 6 mobsters long (aka starts a mob war), each start of a turn, the first mobster in line is killed until all mobsters in the hit list is killed, ending mob war, until it mob war starts up again.",
    "timestamp": 1755468000
  },
  {
    "username": "Bagherra",
    "rating": 5.0,
    "comment": "A fast paced game about mob war. Great stuff and nice graphics to boot.",
    "timestamp": 1742857200
  },
  {
    "username": "mocherill",
    "rating": 5.0,
    "comment": "Multiple Plays - Average game",
    "timestamp": 1731884400
  },
  {
    "username": "opinicus",
    "rating": 5.0,
    "comment": "It was just okay for me. Famiglia was a little bit better in my mind.",
    "timestamp": 1723500000
  },
  {
    "username": "Flatirons",
    "rating": 5.0,
    "comment": "James P. owns it.\n\nSetup (0-Slow | 4-Quick): 3/4\nEasy to teach (0-Hard | 4-Easy): 3/4\nPlayer Interaction (0-Solitaire | 4-Plenty): 4/4\nDowntime (0-Long | 4-Short): 3/4\nLuck Influence (0-Swingy | 4-None/Counterable): 4/4\nReplayability (0-Barely any | 4-Almost infinite): 2/4\nFun (0-Boring | 4-Heck Yeah): 2/4",
    "timestamp": 1718229600
  },
  {
    "username": "krit1789",
    "rating": 4.7,
    "comment": "Simple, \"take that\" type card game. Player elimination is the core aspect of the game.",
    "timestamp": 1695160800
  },
  {
    "username": "AmassGames",
    "rating": 5.0,
    "comment": "I don't recall this\n\nGoogle AmassGames (2,300 board game reviews, podcast, 3000+ Instagram posts and more)",
    "timestamp": 1692396000
  },
  {
    "username": "dscford",
    "rating": 4.5,
    "comment": "Had fun because of the people I was playing with, but very much feels like a dated game and it went on excessively long for the type of game it is. Rules are about as simple as that of ‘love letter.’ Would highly recommend “Guillotine” over this one if you are looking for this type of game.",
    "timestamp": 1691100000
  },
  {
    "username": "edfrew",
    "rating": 5.0,
    "comment": "Not bad...not exceptional",
    "timestamp": 1688076000
  },
  {
    "username": "rynelf",
    "rating": 4.5,
    "comment": "--Dec2009-- Gift from Secret Santa. (Thanks, SS!) #1 Daughter was amused; she'd just recently learned about \"The Mob\" in school, and found it delightful to play a game with Bonnie, Clyde, and Al Capone. I suspect it'd be quite a good deal more entertaining with more than just the two of us, so I'll hold off giving it a rating until I've had a few more plays.\n--Jan2010-- So #1 Daughter convinces #2 Son that it's worth a play. And with the two of them, it's great fun. Not quite certain I want to pull it out with anyone else, though!",
    "timestamp": 1680559200
  },
  {
    "username": "TaijiJohn",
    "rating": 5.0,
    "comment": "I was introduced to this game through the original edition and wore out two copies of the '89 edition. However, I don't enjoy this type of take that! game as much anymore.",
    "timestamp": 1680386400
  },
  {
    "username": "Sprout100",
    "rating": 5.0,
    "comment": "Team 1",
    "timestamp": 1664834400
  },
  {
    "username": "Boomdagger",
    "rating": 4.5,
    "comment": "I really wish the cards explained what they did.",
    "timestamp": 1654984800
  },
  {
    "username": "rosewild",
    "rating": 5.0,
    "comment": "Played in 2020",
    "timestamp": 1650060000
  },
  {
    "username": "Michael Ward",
    "rating": 5.0,
    "comment": "03/13/22 Played a five-player game of Family Business (I \"think\" the 1982 version), in 43 minutes.",
    "timestamp": 1647126000
  },
  {
    "username": "elclarkey",
    "rating": 5.0,
    "comment": "Old Junk.",
    "timestamp": 1630274400
  },
  {
    "username": "mjhake",
    "rating": 5.0,
    "comment": "Hit list, mob wars, plays up to 6, card game",
    "timestamp": 1622066400
  },
  {
    "username": "ccmonter",
    "rating": 5.0,
    "comment": "[TRADED]\n\nStraight up high luck screw-your-neighbour. Player elimination is a bit of a problem, but the main target is usually the player in the lead, so all players tend to be eliminated pretty closely together. Huge meta-gaming revenge factor.",
    "timestamp": 1610492400
  },
  {
    "username": "retsnimel",
    "rating": 5.0,
    "comment": "service compris",
    "timestamp": 1589061600
  },
  {
    "username": "DarioAggioli",
    "rating": 5.0,
    "comment": "gioco un po' inutile",
    "timestamp": 1575327600
  },
  {
    "username": "GaryCollins68",
    "rating": 5.0,
    "comment": "An amusing party game.",
    "timestamp": 1563573600
  },
  {
    "username": "Cheelara1",
    "rating": 5.0,
    "comment": "Secret Santa Gift at a new/Popular white elephant with a 20-40 dollar price range. Bum Gift\nBrand New in Shrink",
    "timestamp": 1555192800
  },
  {
    "username": "ditterio",
    "rating": 6.0,
    "comment": "boring game",
    "timestamp": 1759960800
  },
  {
    "username": "madbeast8",
    "rating": 6.0,
    "comment": "You take control of a mob family, based on real life infamous criminals, and play cards with the goal of wiping out all of the other families in the game. Easy to learn and play, but has the potential to turn real life families against each other!",
    "timestamp": 1758664800
  },
  {
    "username": "fletch49er",
    "rating": 6.0,
    "comment": "Man the art work is horrendous!\nIf you can get over the look of the game there is a fun 'party' game there (If your not to sensitive about getting targeted. Poor old Demi.) . Part of the enjoyment was renaming the gang members to 'look-a-like' celebs. as they were put into the 'hit list'.",
    "timestamp": 1757368800
  },
  {
    "username": "panpan2",
    "rating": 6.0,
    "comment": "家族事業 (繁中版)",
    "timestamp": 1749074400
  },
  {
    "username": "fromeea",
    "rating": 6.0,
    "comment": "In Box #0142\nNot Sleeved because of Insert\n\nRosalie Phillips: 7\nAmy Peschong: 6",
    "timestamp": 1737068400
  },
  {
    "username": "matthewb360",
    "rating": 6.0,
    "comment": "Similar concept as the game \"Guillotine\", except that this is more cutthroat as you're taking out others' players instead of collecting points. Last man standing wins",
    "timestamp": 1723327200
  },
  {
    "username": "oldgoat3769967",
    "rating": 6.0,
    "comment": "A mafia themed game very much worth playing. The game action is very much \"take that\", so some sensitive game-players will get their feeling hurt in as their characters are killed off. This is a good party game, though be selective as to who you will play with.",
    "timestamp": 1723240800
  },
  {
    "username": "Parabellum76",
    "rating": 6.0,
    "comment": "A very mean card game",
    "timestamp": 1720303200
  },
  {
    "username": "Strategette",
    "rating": 6.0,
    "comment": "Worse version of guillotine",
    "timestamp": 1717279200
  },
  {
    "username": "sbsimp1",
    "rating": 6.0,
    "comment": "Column K - Cassette Box",
    "timestamp": 1716760800
  },
  {
    "username": "Eisenkreuz",
    "rating": 6.0,
    "comment": "OK, but probably replaced by other games and there is a bash-the-leader issue.",
    "timestamp": 1714946400
  },
  {
    "username": "dcomartin",
    "rating": 6.0,
    "comment": "Adam",
    "timestamp": 1705446000
  },
  {
    "username": "Daminor8",
    "rating": 6.0,
    "comment": "MY game group likes this one, but i find that you can sit out for a long time if eliminated early one. Definitely game swings by targeting/grouping up on a person.",
    "timestamp": 1704841200
  },
  {
    "username": "Ostiombe",
    "rating": 6.0,
    "comment": "Classic",
    "timestamp": 1701730800
  },
  {
    "username": "multi_killer",
    "rating": 6.0,
    "comment": "Sleeved. RIB",
    "timestamp": 1683324000
  },
  {
    "username": "codiakattack",
    "rating": 6.0,
    "comment": "Tia 6",
    "timestamp": 1670281200
  },
  {
    "username": "Schwenkstar",
    "rating": 6.0,
    "comment": "Though the majority of this card game is rather simplistic - due to its heavy reliance on basic \"luck of the draw\" mechanics - the game is elevated somewhat in status over its card game brethren due to its rather interesting \"Hit List\" mechanic - cards are played in a line (called \"the hit list\") and the actual order of them is vastly important as it means life and death for your gang members. The cards can be altered, swapped out, and re-arranged depending upon the cards you have in your hand. This thankfully does add a much needed strategic element to the proceedings, which would have been rather bland otherwise.\n\nPlease note that the 2006 edition has a rather annoying attribute - action cards have only the titles printed on them with no directions or instructions whatsoever. In order to know what the ability of each card is, you will have to look in the instruction manual. This is acceptable for those who know the game well and have played it often, but is very frustrating when people are new to the game. Thankfully, this is corrected in the newest edition (2009).",
    "timestamp": 1668207600
  },
  {
    "username": "Robert_A_Woodward",
    "rating": 6.0,
    "comment": "Back in the day, we generally played this if we had time after the main game was played. Usually the winner of the main game was ganged up on and wiped out first.",
    "timestamp": 1661637600
  },
  {
    "username": "mandrewsbex",
    "rating": 6.0,
    "comment": "(Traded with Alex 7-22)",
    "timestamp": 1657404000
  },
  {
    "username": "bneffer",
    "rating": 6.0,
    "comment": "I loved the theme of this back in the 90's - Good for player elimination.",
    "timestamp": 1648677600
  },
  {
    "username": "rkaski",
    "rating": 5.5,
    "comment": "Wanted to like this. Not great. Art is lame.",
    "timestamp": 1638313200
  },
  {
    "username": "Riever32",
    "rating": 6.0,
    "comment": "A Mafia themed card game that is decently entertaining but may lack the X-factor for me.\n\nBernard’s game",
    "timestamp": 1634853600
  },
  {
    "username": "DrunkDwarves",
    "rating": 7.0,
    "comment": "A fun confrontational card game that sadly I think is disappearing. This is one that I'll never part with, but for some reason never seem to remember when packing my bag up for gameday at the shop. One I need to play a lot more than I am. The game is very confrontational and because of that you have to negotiate and try to work with other families but in the end there can only be one winner so it is delicate work getting the timing right on when to turn on someone.",
    "timestamp": 1759010400
  },
  {
    "username": "Indy500sr",
    "rating": 7.0,
    "comment": ".compleet\nEAN 029877044016\nGL5",
    "timestamp": 1758146400
  },
  {
    "username": "Slimeyselim",
    "rating": 6.5,
    "comment": "Mayfair English fourth edition 2008\n\nLanguages: English\n\nVery Good Condition.\n\nUK Postage only",
    "timestamp": 1752271200
  },
  {
    "username": "tinofr",
    "rating": 7.0,
    "comment": "Service Compris",
    "timestamp": 1741215600
  },
  {
    "username": "jaluth",
    "rating": 7.0,
    "comment": "Not at all a fan of the new art (based on photoshopped mug-shots of employees from Lookout Games and their friends in the industry). Real shame, because the gameplay still holds up. Wound up selling this one, and keeping my Mayfair second edition copy.",
    "timestamp": 1739746800
  },
  {
    "username": "losmi81",
    "rating": 7.0,
    "comment": "nice and fast take that game that works fine in 2player as well as with more ppl ...",
    "timestamp": 1736290800
  },
  {
    "username": "Scottybonzo",
    "rating": 6.5,
    "comment": "Much better with 4+",
    "timestamp": 1735254000
  },
  {
    "username": "Jokeerus",
    "rating": 7.0,
    "comment": "Verify. Played once. Decent party game but almost too heavy for the groups you would want to play it with.",
    "timestamp": 1732575600
  },
  {
    "username": "WarBozz",
    "rating": 6.5,
    "comment": "it's a reprint",
    "timestamp": 1724450400
  },
  {
    "username": "oppenheimer84",
    "rating": 7.0,
    "comment": "Complete and excellent condition.",
    "timestamp": 1722117600
  },
  {
    "username": "Bankman",
    "rating": 7.0,
    "comment": "Fun, easy to learn game for light game night fare. Not a headliner, but a good filler.",
    "timestamp": 1715810400
  },
  {
    "username": "jaluth",
    "rating": 8.0,
    "comment": "One of those timeless free-for-all card games that people always want to play \"just one more round\" of. Amazing with 3+ players.",
    "timestamp": 1739746800
  },
  {
    "username": "bggmatje",
    "rating": 8.0,
    "comment": "[December 2017]\nA silly fun take that beer and pretzel card game. Creates a few laughs and creates funny moments.",
    "timestamp": 1689199200
  },
  {
    "username": "OKIEJOE",
    "rating": 8.0,
    "comment": "I own the Mayfair Edition",
    "timestamp": 1671490800
  },
  {
    "username": "sctreno",
    "rating": 7.5,
    "comment": "Forgot how good this was after 25+ years. Played today 4 player and had a blast. Best 4-6, great filler! 1-19-20",
    "timestamp": 1671145200
  },
  {
    "username": "Cuchulainn1795",
    "rating": 8.0,
    "comment": "No idea how this one came into my possession.\n\nNot too bad really, although players can get knocked out leaving them to twiddle their thumbs.\n\nGood little filler.",
    "timestamp": 1632607200
  },
  {
    "username": "Brodrick",
    "rating": 8.0,
    "comment": "Zack owns it.",
    "timestamp": 1624485600
  },
  {
    "username": "echelon",
    "rating": 8.0,
    "comment": "I played tons of this in the 1990's and still hits the table, occasionally. Its cutthroat quality has never been annoying at all, instead it generates quite a few laughs  An oldie, sure, but in my opinion, better than many contemporary card games.",
    "timestamp": 1624226400
  },
  {
    "username": "LaSJ",
    "rating": 7.5,
    "comment": "Not a bad game.\nPeople hate me though, so I always die first.",
    "timestamp": 1604962800
  },
  {
    "username": "Von Falkenheyn",
    "rating": 7.5,
    "comment": "Hilarious game!! All players assume the role of a 1920s mobster and try to wipe each other out. Only the most cunning and devious lowlife will stay alive and win the game. My friends and I have gotten quite a few laughs out of this one",
    "timestamp": 1597615200
  },
  {
    "username": "xistonxiston",
    "rating": 8.0,
    "comment": "Traduzido",
    "timestamp": 1595196000
  },
  {
    "username": "OwenFawr",
    "rating": 8.1,
    "comment": "Over the years this is the game that our group has the most plays of.\nThe perfect filler for us.",
    "timestamp": 1594072800
  },
  {
    "username": "FrancoLondo613",
    "rating": 9.0,
    "comment": "Found this game in college and it was and still is a blast! Not a ton of variation when playing, it’s just luck of the draw and be a gangster.",
    "timestamp": 1755208800
  },
  {
    "username": "au64",
    "rating": 9.0,
    "comment": "New in shrinkwrap; I also own and play the 1986 edition.",
    "timestamp": 1710111600
  },
  {
    "username": "simoncorne",
    "rating": 9.0,
    "comment": "Enjoyable, if nasty, take that card game with a gangster theme.",
    "timestamp": 1609714800
  },
  {
    "username": "Quartzgamer",
    "rating": 9.1,
    "comment": "Another popular Classic game which doesn't seem to get played enough nowadays.\n04/05/16: Finally made it to the table again, and is still an excellent game./\n14/01/17: An oldie but very goodie!\n01/04/18: Great to get this back to the table.\n20/10/18: Aut B&P: great 6 player game - really worked.\n02/03/19: Been a while but - great to get back to table.\n02/10/19: Gotta get this to the club:\n12/11/19: TLGC 2 x 5pl both won by Ma Baker.\n18/11/19: Finally getting the plays.\n17/09/20: TLGC / RAFA 2 x 2 - AS 1 SS\n22/10/22: TLGC / RAFA 1 x 6 - what a game!!!",
    "timestamp": 1603490400
  },
  {
    "username": "Mandaladam",
    "rating": 9.0,
    "comment": "En francais : SERVICE COMPRIS",
    "timestamp": 1581116400
  },
  {
    "username": "PravinLal",
    "rating": 9.0,
    "comment": "A classic game of dark humour!",
    "timestamp": 1578610800
  },
  {
    "username": "philby2",
    "rating": 9.0,
    "comment": "fantastic end-of-the-night game to end on. Too fast to feel victimised or picked on!",
    "timestamp": 1578438000
  },
  {
    "username": "Gareth00Simon",
    "rating": 9.0,
    "comment": "I haven't seen my copy for 10 years or more - hopefully it is still in storage in my sister's cellar.\n\nThis was one of those games you picked up to fill in any spare time when a game finished early, or at a social game evening (whatever happened to the Bun Shop in Surbiton?). I couldn't begin to estimate how many times I played this back in the 1980s; scores of times, at least.",
    "timestamp": 1574895600
  },
  {
    "username": "mectron",
    "rating": 9.0,
    "comment": "Fantastic fast pased \"take that\" gangster card game. Eleminate enemy gangs before they take you out.",
    "timestamp": 1559340000
  },
  {
    "username": "Samga Lemurien",
    "rating": 9.0,
    "comment": "Très très sympa !",
    "timestamp": 1540245600
  },
  {
    "username": "LjupchoMKD",
    "rating": 9.0,
    "comment": "This game is tonnes of fun, even though the blue card rule sometimes pisses me off.",
    "timestamp": 1539295200
  },
  {
    "username": "Volcaronaut",
    "rating": 10.0,
    "comment": "This is an unassuming great game that everyone should own. I bought this game on a whim because I needed something to bring to a mates place. It was a hit (pun intended) and everyone's always up for a game. The illustrations are fab and it is super fun to play with lots of people.",
    "timestamp": 1598824800
  },
  {
    "username": "Levydrogo",
    "rating": 10.0,
    "comment": "Played this loads. Favourite for holidays. You know who your friends are!",
    "timestamp": 1540159200
  },
  {
    "username": "bigbuck008",
    "rating": 10.0,
    "comment": "Ce jeu est bien balancé et facile à jouer ... Bon prix et bonne qualité ... excellent jeu.",
    "timestamp": 1342648800
  },
  {
    "username": "SEEDLESSbbv",
    "rating": 10.0,
    "comment": "So fun it's retarded!",
    "timestamp": 1278194400
  },
  {
    "username": "bamma",
    "rating": 10.0,
    "comment": "This is really fun but the repetitious artwork could have been substituted for some further characterization. The play is smooth and quick with plenty of room for surprises and negotiation.",
    "timestamp": 1268434800
  },
  {
    "username": "Jimcampanella",
    "rating": 10.0,
    "comment": "Great \"beat-up-on-your-friends\" game",
    "timestamp": 1261609200
  },
  {
    "username": "Astinex",
    "rating": 10.0,
    "comment": "Rated high due to how much fun I have playing with friends and family. Simple game, easy to teach, loads of fun.",
    "timestamp": 1227308400
  },
  {
    "username": "Ed123play",
    "rating": 10.0,
    "comment": "What can I say. A Brillent game.",
    "timestamp": 1212703200
  },
  {
    "username": "TherMight",
    "rating": 9.5,
    "comment": "I always play with 2 decks and 1 set of mobsters. Beloved for the way that 'saving' someone by countering contracts helps encourage alliances. Fun to role play and apply social engineering.",
    "timestamp": 1173740400
  },
  {
    "username": "Swordopolis",
    "rating": 10.0,
    "comment": "It's a simple game, yet terribly addictive. Bring your best mobster faux-accent!",
    "timestamp": 1157925600
  },
  {
    "username": "Justitra000",
    "rating": 10.0,
    "comment": "Yo this game is the shiznit",
    "timestamp": 1109113200
  }
]