[
  {
    "username": "Majiken",
    "rating": 1.0,
    "comment": "This game sucks more than a vacuum. Played once, and that's enough. Nothing more than another dice-fest with a slapped on dinosaur theme. Three players, 3 hours, and I finally gave up and quit, an event that the game's owner will never let me forget. Probably the most frustrating game I've ever played.",
    "timestamp": 1213567200
  },
  {
    "username": "crushgals",
    "rating": 2.0,
    "comment": "If players don't 'play nice' the death spiral here could result in a game that could take a very long time. I hear it's not a bad solo game, and I would play it again solo to find out, but with others I'll pass. This game is busted, all nostalgia.",
    "timestamp": 1362438000
  },
  {
    "username": "TheEldereye",
    "rating": 3.0,
    "comment": "Big let down. Thought the game would be fun to play with the kids but there wasn't much to it at all.",
    "timestamp": 1422486000
  },
  {
    "username": "bagio99",
    "rating": 3.5,
    "comment": "Good theme but... player interaction is low: however that's usually the case with games that have solo play. Once the major principles are understood, the pace accelerates, although downtime still peaks when another player goes through an Adventure. Experience will tell you which equipment is more likely to help when starting a game. The Adventure sheets are well-drawn in a clean comic-book style but they contrasts with the gameboard's fuzzy color graphics. A bit of humour sprinkled in the game's illustrations allows the game to not feel too dry as it tries to appeal to younger players, but the game fails at that in my opinion. Although the game features varied and interesting mechanics, there are just too many for one game, and it \"feels\" heavy. I just think this game could have been more streamlined.\n\n... Thinking of letting it go.",
    "timestamp": 1672268400
  },
  {
    "username": "brettellmd",
    "rating": 5.0,
    "comment": "I always liked the idea of the side paths on board games, ever since Careers. Apart from the escape track, nothing really new in the game, though.\n\nSold in Sydney Noship Auction 2022 for $15",
    "timestamp": 1656367200
  },
  {
    "username": "dinozaurplanet",
    "rating": 5.0,
    "comment": "Bought it for the 80s dinosaurs.",
    "timestamp": 1581375600
  },
  {
    "username": "jcarvin",
    "rating": 5.7,
    "comment": "A little confusing until you've played through it at least once, but worth it once you do. Fun for me mostly because I love exploration themed games. Can be a little slow paced but it is fun nonetheless.",
    "timestamp": 1731193200
  },
  {
    "username": "Biker1999",
    "rating": 6.0,
    "comment": "Great theme and I really like the storyboards. There is even a decent solitaire variant.\n\nUpdate: Sold.",
    "timestamp": 1709334000
  },
  {
    "username": "KatydidWonders",
    "rating": 7.0,
    "comment": "1-4",
    "timestamp": 1745877600
  },
  {
    "username": "rooninzen",
    "rating": 8.0,
    "comment": "Si te gusta ser perseguido por dinosaurios, que te roben tus cosas, ganarte el odio de las tribus y ver como tus esperanzas de escapar se desvancen bajo las fauces del carnívoro en turno es tu tipo de juego. Tiene rejugabilidad media. Se hubiera agradecido mejor calidad de componentes y que estuviera en español.",
    "timestamp": 1737414000
  },
  {
    "username": "Tulotoma",
    "rating": 9.0,
    "comment": "DOLW is a great game. Don't let the cartoonish kiddie level drawings and art work fool you; underneath is a game with a decent amount of meaningful decisions, strategy, and adventure board gaming.",
    "timestamp": 1682719200
  },
  {
    "username": "Ranger3d75",
    "rating": 10.0,
    "comment": "Sir Arthur Conan Doyle and Doug Mcclure would be proud of this dino themed gem! Dripping with nostalgia, strategy, and b-movie greatness, set in a prehistoric animal, occupied land.",
    "timestamp": 1529791200
  }
]