[
  {
    "username": "janus",
    "rating": 1.0,
    "comment": "Kickstarter backer of the 2024 edition. Paid $185 for TWO copies and S&H to Italy. Received only one copy.",
    "timestamp": 1758405600
  },
  {
    "username": "Snapcase",
    "rating": 2.0,
    "comment": "Immense amounts of unique chits and clunky rules. Neat for something from the 70s but wargames have become actually fun to play since.",
    "timestamp": 1552345200
  },
  {
    "username": "Schenke9497",
    "rating": 3.0,
    "comment": "Played in a group game, and the RNG factor of the game in theory is great, but there wasn't really any reward for strategy. It was honestly just whatever the dice rolled, and no way can there be any factors to influence combat, like action/instant/anytime/buff spell cards. Was quite frustrated with how combat was also just one single combat and then that basically ended your turn.",
    "timestamp": 1759269600
  },
  {
    "username": "tbrofromspace",
    "rating": 4.0,
    "comment": "In spite of how much I love the art, some stuff should probably remain in the nostalgia of the past. All of the fun stuff this game offers is lost within boring movement rules",
    "timestamp": 1743804000
  },
  {
    "username": "Grapeshot",
    "rating": 5.0,
    "comment": "VERY old fashioned. An exercise in nostalgia that got out of hand.",
    "timestamp": 1751061600
  },
  {
    "username": "Asmoridin",
    "rating": 5.0,
    "comment": "Not so good. Sieges are very tough, and combat can be either really deadly or extremely uninteresting. The game itself is really TOO much die-rolling, and not a lot you can do if the dice screw ya. Okay for a one-time play, but I'd prefer not to play again.",
    "timestamp": 1725573600
  },
  {
    "username": "WingnutUARK",
    "rating": 6.0,
    "comment": "Uncovering this game in the closet is like channel surfing to the movie \"Excalibur\". You love everything it represents but do you want to sit through the whole thing again? It is a fantastic game of cardboard chits, awkward modifiers, Machiavellian strategy, nearly impossible references to locations on a map you probably won't find, and everything Game of Thrones portrays 30 years before it was in mainstream pop culture. Brilliant game but not sure a modern audience has the dedication to play to its fullest. Not a Euro-Game.",
    "timestamp": 1731366000
  },
  {
    "username": "drtufte",
    "rating": 6.0,
    "comment": "Played this one once at a friend's house. An intriguing fantasy map and game.\n\nThis game was one of those \"Eureka!\" moments on the internet. Thirty to thirty-five years after playing it *once* I got on a forum and had random responders pin it down from my bare bones memories within just a few tries.",
    "timestamp": 1712613600
  },
  {
    "username": "JaggedTech",
    "rating": 7.0,
    "comment": "I have fond memories of playing it when I was in my late teens. But that was many decades ago. I don't know if it has stood the test of time. I suspect I might not like it if I played it now.",
    "timestamp": 1760392800
  },
  {
    "username": "cannoneer",
    "rating": 8.0,
    "comment": "After playing and enjoying this solo, I canceled the KS pledge. The base game is all I need. Enjoyable solo experience with obvious rough edges from the 1970s!\n\nPurchased the republished base game while awaiting the 2026 Kickstarter fulfillment. This is interesting - big and sprawling in all the right ways, with a plethora of optionals that don't really add much complexity (though I am soloing the base game first to get a feel for the standard experience).\n\nCombat is VERY swingy - going into a battle with a 5-2 advantage in units is definitely no guarantee of success. At first I was nonplussed by this, but in thinking it through, it makes sense: in this game the players definitely don't represent \"battlefield commanders\" with direct control over how a given fight progresses; instead they represent monarchs or councils of state who sort of set strategy and policy and hope the military folks can actually deliver! I think I like that angle, because it gives the players realistic (lack of) control commensurate with their role in the game itself.\n\nThis edition is very nice, except for a lack of a place-name location index is a criminal oversight.\n\nI'm certain I would love a 4-player session of this but realistically that will probably never happen.",
    "timestamp": 1759788000
  },
  {
    "username": "kareds",
    "rating": 9.0,
    "comment": "Playing Divine Right kind of just feels like you're making things up as you go along. I started this post by listing out some of the weird, niche rules we encountered in our game, but quickly realized that basically every rule is weird and niche. You'll be referencing the rulebook for the entire game to check and double check the rules for the plethora of unique units, artifacts, and special abilities, but it's all in service of the theme and narrative. It feels like every time the designer had to make a choice they opted for the coolest one, balance and elegance be damned.\n\nThe result is a game of uncompromised vision. Playing Divine Right gave me a genuine feeling of wonder that instantly took me back to all of those fantasy books I read as a kid. It's a game that you play to explore the world and see what happens. I look forward to visiting it again and again.",
    "timestamp": 1745272800
  },
  {
    "username": "BarryBeadman",
    "rating": 10.0,
    "comment": "want to trade for Original version 1979 or 1980. Map must be in good condition most importantly and would be nice if box were as well.",
    "timestamp": 1758319200
  }
]