[
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "I think I spent the entire time wishing I was playing Condottiere instead. Not a VP salad of this and that.",
    "timestamp": 1714600800
  },
  {
    "username": "dakotamassie",
    "rating": 1.0,
    "comment": "I'd prefer Jinder Mahal",
    "timestamp": 1713650400
  },
  {
    "username": "delgard",
    "rating": 1.0,
    "comment": "This game is horrible!!!! A big stinker for Knizia.",
    "timestamp": 1198710000
  },
  {
    "username": "leanderuk",
    "rating": 2.0,
    "comment": "Certainly the worst board game I have played.",
    "timestamp": 1485558000
  },
  {
    "username": "DaveD",
    "rating": 2.0,
    "comment": "V",
    "timestamp": 1345759200
  },
  {
    "username": "alexisW",
    "rating": 2.0,
    "comment": "A very confusing first play. Interesting art but somehow completely puts me off. Felt even plain train games are nicer than this.\n\nThe set collection and auction was not enjoyed by me. Felt the chore than excitement.\n\nDoubt I will try this again. Rating of 1 play.",
    "timestamp": 1331506800
  },
  {
    "username": "Mijjy",
    "rating": 3.0,
    "comment": "One of the most unthematic games I think I've ever played (until I played Attika) & oh look, it's another RK creation...",
    "timestamp": 1758492000
  },
  {
    "username": "Mark van Varik",
    "rating": 3.0,
    "comment": "Terrible game. Too Random and clunky. Outdated too. I generally like The Doctor's games, but this one is a hard pass for me.",
    "timestamp": 1756418400
  },
  {
    "username": "quietcorn",
    "rating": 3.0,
    "comment": "This is a game where you bid cards with different symbols, trying to get the majority of one or more symbols to win the ability to place your palaces on the board spots. Ideally you want to work so you make chains of your buildings to get the most points. There is a lot to like here, but the downtime between turns is very high with 5 players, and the game works out to be a little to chaotic. You can find yourself fighting hard for key spots and then missing your opportunities to connect to those spots making the previous effort meaningless. It's fine, but it could and should be a lot better.",
    "timestamp": 1721685600
  },
  {
    "username": "TedW",
    "rating": 4.0,
    "comment": "Gave away 4/17",
    "timestamp": 1755727200
  },
  {
    "username": "TrevorJr26",
    "rating": 4.0,
    "comment": "In the Amun Re zone of Knizias I'm afraid. Not necessarily a bad game, but not punchy enough for its length. This one doesn't have a super simple teach like Through the Desert or even something like El Grande. I'd like to see the concept revisited, visiting each place on the map once, but here it isn't good enough to recommend. Also (and this shouldn't be a factor but it is), no one ever wants to play this game. It looks boring and it sounds boring... and it kind of is. ?",
    "timestamp": 1752703200
  },
  {
    "username": "MatroidX",
    "rating": 4.0,
    "comment": "Didn't enjoy this much. Trying to analyze why:\n\n1) No sense of progression: what you do in round 12 is pretty much the same as round 1. There's of course a bit more palace inter-connection and resource values differ per person, but the math is similar, the feel is similar, and the game just feels repetitive. Each bidding round is also the same decision multiple times (i.e. What percent do I win now if I quit vs if I continue? Do I care that much about this round or I should focus on next?).\n\n2) Virtual elimination: The last 2 rounds were just me and one other person vying for first (we ended up tying), and 2 of the 5 players were out around round 8 or so. Having absolutely no chance of winning but still having to play another 30-45 minutes seems pretty bad... and their decisions became more and more arbitrary later on (which affected how the rest of us did).\n\n3) The special 4 cards seemed rather over-powered; for instance, getting 2 bonus points every turn. In fact, the person who tied me for first got nearly 20% of their points from the one special card (yellow). We all re-checked the rules since this seemed so bad halfway in...\n\n4) Runaway leaders: Similar to comment #2. Basically if you're ahead, every item is worth more to you (e.g. gold/tea/etc, special cards compound to make you win more, etc). Just keeps amplifying your lead.\n\n5) Somewhat arbitrary failure: One player's last card had him in the lead on 3 categories with 3 people left, and I had to back out immediately after; the other player played a card which tied him on all 3, so he got nothing (no more cards left). After that he was out of game (finished 2nd last), but I couldn't really fault his play... just very bad luck. Made the game seem more arbitrary to me.\n\n6) Very minor, but I feel the player colors need to differ more.\n\nOn the pros side, I like the idea of inter-connection with previous decisions (though in practice most I and others got was 3; people would block and you needed to win two of four or crown), and the crown sharing a space was good. I think scoring only if you get resource or elephant means most players don't score most rounds, which led to wide disparities in score (first place had ~60 points, last place didn't get to 20).",
    "timestamp": 1718402400
  },
  {
    "username": "lawmen",
    "rating": 5.0,
    "comment": "RK的老遊戲，集合了兩個我不是很喜歡的機制，競標+區控，尤其競標很吃牌運跟順位，特權卡感覺有點強，玩起來真的不愛",
    "timestamp": 1750284000
  },
  {
    "username": "Takhyon",
    "rating": 5.0,
    "comment": "This is another Knizia design that I can’t really fault mechanically, but ya boy was just struggling to extract any joy out of the experience, and my dislike of it is more about the vibe of the thing than anything else. The hand management and the card play is interesting, but feels frustratingly restrictive. The route-building or set collection parts work but are quite pedestrian, it felt like I’ve seen both mechanisms implemented in more interesting ways in other games since then. Also the entire game dynamic mostly revolves around stopping other people from doing anything, and is extremely fragile due to left-right binding nature of it. It is just not enjoyable for me.\n\nAlso as usual with Knizia, the abstract and obtuse nature of it also makes it surprisingly difficult to grok and explain to people. While I realize that sometimes the whole idea is about knowing when and where to pick your battles and sometimes strategically yield, not getting to do anything in a given round is just boring. Also losing auctions after you’ve committed like 4+ cards to one only to tie someone and get nothing in return feels bad, especially when someone manages to duck out of the round early and get benefits after committing just one card. I’m guessing people who praise this find the possibility of not being able to do anything tense and exciting, but to me that just leads to a tedious and unfulfilling game.",
    "timestamp": 1749333600
  },
  {
    "username": "tbrofromspace",
    "rating": 5.0,
    "comment": "It's just not Condotierre",
    "timestamp": 1743631200
  },
  {
    "username": "parpari",
    "rating": 4.6,
    "comment": "I imagine 25 years ago it was an amazing game but these days, it is an outdated game. It is somehow similar to Brian Boru but Brian Boru is cleaner design with way less luck. Also, there is some similarity to\nCondottiere which is shorter, faster and easier game to play.\nDr. Knizia brings core auction mechanism of this game to Heckmeck am Karteneck which becomes way superior game with faster and shaper play.",
    "timestamp": 1742425200
  },
  {
    "username": "DummeGans",
    "rating": 5.0,
    "comment": "Superb production. Pretty, stackable palaces, attractive and easily readable symbology and a board that is both visually appealing and functional. The game itself is slightly odd and feels like a mashup of several different mechanics - auctions/bidding with cards, route building and blocking, and set collection. I found it difficult to teach and it took a full playthrough for everyone to understand what we were doing. It's a solid euro that doesn't stay around too long and offers some great tense decisions.\nUltimately traded away. Nobody enjoyed our first play or asked to play again.",
    "timestamp": 1741820400
  },
  {
    "username": "Addiction2k",
    "rating": 5.0,
    "comment": "Its fine",
    "timestamp": 1740438000
  },
  {
    "username": "whitehouse3001",
    "rating": 6.0,
    "comment": "It's a clever and unique game, but someone in our group put it best: \"too long to be a casual/warmup game, but a little too random to be a long, deeply strategic 'main course' kind of game.\" The bidding/push your luck mechanic was fun and interactive, but with the card randomness and luck of the draw, sometimes you just can't get what you need in a particular round, and that can really mess up your strategy. It's unfortunate, because if your network gets busted at a key point in the game, you can't really fix it, and it can make the rest of the game a bit of an unproductive slog. I think if I played it again, I'd need to think harder about what exactly I want to do, and make sure I bank cards to do what I want in key regions. 12 rounds definitely felt too long given that each round was kind of the same. The later rounds got more interesting with the networking possibilities, and some people had more cards to work with. Overall a quality game, but I wish it was a little shorter. I think I enjoyed Brian Boru better for this style of area control/network building/set collection/card bidding/\"trick taking\" kind of game.",
    "timestamp": 1760565600
  },
  {
    "username": "shawnmackay1593",
    "rating": 6.0,
    "comment": "I remember not hating this but not much else.",
    "timestamp": 1759096800
  },
  {
    "username": "icheyne",
    "rating": 6.0,
    "comment": "2025-09-24\nMore confrontational than I remember. It is often called an auction game but they are are really small battles like in Ivanhoe/Condottiere.\nThe area control reminds me a lot of Iwari/Web of Power/Tyrants of the Underdark.\nThis is less intuitive than a regular Knizia. Not one of his best but memorable.\n---\nOnly played once. Not as similar to Ivanhoe as some say. Complex scoring, but there's the fun and skill.",
    "timestamp": 1758664800
  },
  {
    "username": "Hrontajkpa",
    "rating": 6.0,
    "comment": "With 2p it was fun, but a bit rote. I can see it being a lot better with more people though.",
    "timestamp": 1752876000
  },
  {
    "username": "apkendrick",
    "rating": 6.0,
    "comment": "Fun, engaging, simple but challenging. I just want to play it again, yet for some reason I never choose it off the shelf. Traded.",
    "timestamp": 1751061600
  },
  {
    "username": "thptr",
    "rating": 6.0,
    "comment": "zman version\ndry euro, but I adore the artwork.\nplay fast, less than 1.5 hours.\nquite easy to teach. Have layers of subtle strategy, mind game",
    "timestamp": 1748815200
  },
  {
    "username": "kylpo",
    "rating": 7.0,
    "comment": "A really clever design that would get a much higher rating from me if it were significantly shorter.\n\nMaybe 8 rounds would feel better? The decision space for choosing to fight on or cut your losses or potentially go out quickly to guarantee that crucial spot felt really satisfying. Even the choice of a turn one withdraw to gain 3 cards felt clever and good.\n\nOther than game length, my only real complaint was the cadence of special cards being passed around. It felt like there wasn't much planning you could do for offense or defense to keep a specfic one, and since they're each tailored for different strats (one for set collection, one for placing more palaces to grow a bigger route, one for card flexibility, and one for straight up points), this level of chaos didn't feel satisfying or rewarding.\n\nA friend said something like \"it is too long to be a light game, and too random to be a deep one\".",
    "timestamp": 1760565600
  },
  {
    "username": "vyntoo",
    "rating": 7.0,
    "comment": "1st play:\nI pushed my luck on the elephants ftw on my first play.\nI felt I was losing on the second half of the game.\nNot sure if I like it enough to have it in my collection yet.\nWe played for almost 2 hrs and there was lot of luck of the card draw.\nThere are also instances of \"you ll have to pass and wait for others to battle it out\". However, I was engaged throughout on who will win.\n\n2nd play:\nElephants strat didn't work this time. It has potential. It took 90mins to play though.",
    "timestamp": 1759615200
  },
  {
    "username": "KivasFajo",
    "rating": 7.0,
    "comment": "First edition including white palaces (alternative player colour)",
    "timestamp": 1758319200
  },
  {
    "username": "smurfodeth",
    "rating": 7.5,
    "comment": "Captures one of the best parts of Blue Moon: the multiple auctions with strategically-timed withdrawals, in a game for more than two; it then combines those auctions with board control to magnificent result. A woefully overlooked Knizia, and maybe my favorite of his designs.",
    "timestamp": 1761098280
  },
  {
    "username": "mexo",
    "rating": 7.5,
    "comment": "Jan",
    "timestamp": 1760824800
  },
  {
    "username": "darkk_",
    "rating": 8.0,
    "comment": "Building palaces... count me in! Although, I thought the Taj Mahal was a tomb?\n\nCaptivating ✅\nEngaging ✅\nReplayability ✅\nRules ❌\nQuality ✅",
    "timestamp": 1760306400
  },
  {
    "username": "btasam",
    "rating": 8.5,
    "comment": "Very unique; would love to play more.",
    "timestamp": 1759183200
  },
  {
    "username": "Table43",
    "rating": 9.0,
    "comment": "Great game with terrifically tense decisions on when to stay in on a hand and when to drop out for the possible benefits. It's poker where the rewards are richest for winning, but the cards and route building pieces could be just as valuable for folding. That mechanic has appeared in other Knizia games such as Gem Dealer and Attacke. Excellent art and components, too. Taj Mahal plays long and the sustained intensity can be draining. For me, its a classic.",
    "timestamp": 1758405600
  },
  {
    "username": "d3struct10n",
    "rating": 9.0,
    "comment": "Great game that offers an easy to understand mechanics that allows at the same time pretty sophisticated strategies, allows planning, and forces players to make choices.",
    "timestamp": 1754863200
  },
  {
    "username": "logopolys",
    "rating": 10.0,
    "comment": "Taj Mahal is a subtle game of choosing your battles, much more so than most auction games. Different players using the same bids to bid for completely different prizes pushes your ability to know when to quit or not. Great fun.",
    "timestamp": 1759356000
  },
  {
    "username": "silenceisgolder",
    "rating": 10.0,
    "comment": "Great game, packs so much into just an hour, and has interesting and unique mechanics which all generate fascinating little interactions. I really love everything about it. It feels so different going early in a round vs going late, but in sort of a novel way -- by going later, it's almost like you have an extra card for those wars of attrition, getting to go last. But when you play early, you have the opportunity to sneak away with one or two symbols that nobody else is playing into this round for only one card. Planning a few rounds ahead to maximize your scoring opportunities, getting pulled away to interfere with your opponents...there's so much to every little thing in Taj Mahal, and I appreciate it more and more after each play.",
    "timestamp": 1757887200
  },
  {
    "username": "Rob Doupe",
    "rating": 10.0,
    "comment": "Revised rating to 10. Has stood the test of time. In 30+ players, I’ve never had a bad game of Taj Mahal. Which isn’t to say I’ve never blown a game by playing five cards at a visit and come away empty-handed. But rather that playing five cards just to come away empty-handed is part of what makes this game so excruciatingly glorious.\n============================================\nA heavy, rough-and-tumble euro. Retains its flexibility of strategy even after many playings. Has a very brutal poker feel, which some may not enjoy.",
    "timestamp": 1756332000
  }
]