[
  {
    "username": "meepleraptor",
    "rating": 1.0,
    "comment": "haven't played, just to seed the recommend AI",
    "timestamp": 1675983600
  },
  {
    "username": "Cardboardjunkie",
    "rating": 1.0,
    "comment": "I've played 661 unique games, and this is the first one I've rated a 1. Since I don't like seeing unexplained 1s, I'll elaborate. There are a couple of things I liked, but there are 6 rules that turn it into a dumpster fire.\n\nPros:\n1. I like the spatial puzzle of the Operating phases. Trying to connect various cities is interesting and fun. However, the operating phase is not without faults. See Cons#1-4\n\n2. The Stock rounds are fairly standard, and can be an interesting aspect of the game. Again, not without faults. See Cons#5-6\n\nCONS:\n1. Your train pool gets smaller as your company grows bigger. I can't think of a single real-life company that works that way. Reach and Growth are usually parallel trajectories.\n\n2. Trains just poof at certain points. If I want to keep older, less efficient trains around, that's my prerogative. That's what I hire mechanics for!\n\n3. You can't sell/upgrade trains. Seems like a fairly ordinary business decision that you just can't do here.\n\n4. The rules have never heard of scheduling or switching stations. If I have a northbound train leaving at 11, I can't also have a westbound train leaving at 4, if they use the same tile.\n\n5. You're capped at 6 shares of a company. If I want to have 9-10 shares of a company, for value control, I should be able to. I'm sure real companies don't stop taking money once an investor hits 60%.\n\n6. Selling shares causes the price to drop, but buying shares does not increase the price. Makes it WAY too easy to tank a company, but nearly impossible to recover.",
    "timestamp": 1627596000
  },
  {
    "username": "WilcoxDave",
    "rating": 1.0,
    "comment": "I hate these type of games. I have never grasped the control by stock ownership games. In addition there is the hurting of other players in this game. I have been miserable every time I have played and am miserable just thinking of playing.",
    "timestamp": 1522274400
  },
  {
    "username": "AMI_SOLGER",
    "rating": 2.0,
    "comment": "Not for me",
    "timestamp": 1733698800
  },
  {
    "username": "emperormark",
    "rating": 2.0,
    "comment": "Terrible, long, boring and historically inaccurate.",
    "timestamp": 1561500000
  },
  {
    "username": "Dean_AKI_UK",
    "rating": 2.0,
    "comment": "Too much like going back to work for a few hours to be called a game. Must be thrilling for accountants....",
    "timestamp": 1461967200
  },
  {
    "username": "tehspookeh",
    "rating": 3.0,
    "comment": "Sold Jan 2021 as I just don't want to play this in future. I find it inferior to other 18XX games.",
    "timestamp": 1735426800
  },
  {
    "username": "Kubigaruma",
    "rating": 3.0,
    "comment": "Outdated. Very poor game pacing. Thankfully, others have improved on the ideas here.",
    "timestamp": 1728338400
  },
  {
    "username": "ZoRDoK",
    "rating": 3.0,
    "comment": "Too long (7 hours online with expirienced players). I've prefer another xx games.",
    "timestamp": 1629669600
  },
  {
    "username": "Malcolm C",
    "rating": 4.0,
    "comment": "I owned this since not long after its release in the mid-1980s until early 2025. There is a lot to like about the game: I like the mechanics of buying stock and floating the railroad corporations, and the mechanics of laying track, placing tokens, and the increasing level of complexity that that involves. So I enjoy a lot of the play of the game. The reason I rate it as a 4 (\"it doesn't get me but I could be talked into it on occasion\") is that I find the lack of transparency about who is winning, and how long is left in the game, to be things that take away the sort of tension I look for in a multi-player game. I want to know who is winning, and how much ground I need to make up in what time period. I also think that it can be the case that the shape of the game solidifies quite a long time before the end, so that a reasonable proportion of the end game feels like processing rather than competing.\n\nPlays well PBEM using a Java-based programme called (really) \"Rails\".",
    "timestamp": 1759269600
  },
  {
    "username": "Forgeforgeforge",
    "rating": 3.9,
    "comment": "paraphrasing someones description of this game from 18xx.games:\n\n\"The game is obtuse. The actual challenges, risks, opportunities, obligations etc are not obvious, or even intended, from the ruleset. They've only been discovered by playing it to death. Trying to play 1830 for the first time now is like trying to play billiards on an ancient broken down table with worn and saggy felt, spongy bumpers, and a few crooked cue sticks. All the old locals know the table by heart and will play circles around you on this broken table.\"\n\nThe game is ugly and somewhat arbitrary, and nothing that happens feels good. The waterfall auction is overall an unstable system that requires utter faith in your game group to execute it in a reasonable way to get a good game state. It's interesting as a chaotic randomizer but I wish it wasn't the default to be replicated across a hundred other games.",
    "timestamp": 1740351600
  },
  {
    "username": "tectactoe",
    "rating": 4.0,
    "comment": "A classic for a reason. Can be punishing for new players since some areas of the game are unbalanced, and you have to know and understand those imbalances to properly mitigate them (starting right with the opening private company auction, for example). Once you get over that hurdle, though, the game has seemingly endless possibilities to play out. Wish the map was a little more... \"eventful\" or interesting, but as with most 18xx games, the map is surprisingly low on the list of things you should be worried about.",
    "timestamp": 1733785200
  },
  {
    "username": "Awschmitkons",
    "rating": 5.0,
    "comment": "Print & play",
    "timestamp": 1750888800
  },
  {
    "username": "coolkid91",
    "rating": 5.0,
    "comment": "Too large of a map with too slow development doesn't make for a very exciting experience for me. The town placement are an early decision players must make that from what I know can make later parts of the game very different. But I am unlikely to ever reach a point where learning that is of any interest to me.",
    "timestamp": 1748210400
  },
  {
    "username": "wkover",
    "rating": 5.0,
    "comment": "Advice: Don't play this with an experienced player who tells you exactly what to do every turn.\n\nIn other news, don't hammer nails into your forehead. That's also not as fun as it sounds.",
    "timestamp": 1726783200
  },
  {
    "username": "gstevens31",
    "rating": 5.0,
    "comment": "Long game.",
    "timestamp": 1677538800
  },
  {
    "username": "Victoria_hermit",
    "rating": 5.0,
    "comment": "18xx",
    "timestamp": 1670972400
  },
  {
    "username": "adamscott",
    "rating": 5.0,
    "comment": "The game was good...until the last hour or so when it was all number crunching and no more decision-making. This would definitely be better to play online or in an app.\n\nAfter a second play of a different but similar 18xx game a few years later, I don't think this series is for me.",
    "timestamp": 1654984800
  },
  {
    "username": "iplaybgnaked",
    "rating": 6.0,
    "comment": "The quintessential 18xx game. Although I do find the game a bit too long for how punishing it is, 1830 is still a delight to play due to the incredible depth of its metagame leading to a different experience emerging with each play.\nAs great of a game as it is, after getting in some more plays with experienced players I just feel over with the game as I've hit my glass ceiling in terms of player skill and I've realized I just don't enjoy the game enough to want to play it more in order to breakthrough that barrier. I got many hours of fun plays out of it so I can't complain.",
    "timestamp": 1755640800
  },
  {
    "username": "El_Vis",
    "rating": 6.0,
    "comment": "Mimo że to klasyka 18xx, to nie zostawiła mnie z tak pozytywnymi odczuciami jak jej \"klony\". Moje doświadczenie było raczej w stylu: długa i nudna. Może herezja, ale...no tak miałem.\n\nZapewne nie odmówię rozgrywki jeśli ktoś zaproponuje gdzieś kiedyś w składzie osobowym 5+, ale ja swojego egzemplarza zdecydowanie mieć nie muszę.",
    "timestamp": 1755468000
  },
  {
    "username": "aresil",
    "rating": 6.0,
    "comment": "18xx blow train win",
    "timestamp": 1752789600
  },
  {
    "username": "cheshire_cat",
    "rating": 6.0,
    "comment": "I don't play this yet but rules are great.\nI don't play this game yet. Don't meet anyone who wants play 5 hour game about trains =(\n\nI have played this game. It take ten hours (with two brakes for lunch and dinner). It's intersting game.\nIt may be first play affect, but Endgame phase take too long (time where we just run trains and take dividends to empty bank, not construct roads or place stations).",
    "timestamp": 1750284000
  },
  {
    "username": "Citery",
    "rating": 6.0,
    "comment": "To bring something so fully formed, with such depth of play, originality, and nuance into the world forty years ago is nothing short of a lifetime achievement for Francis Tresham. 1830 is the definition of a seminal work, and has my utmost respect.\n\nBut!\n\nThe brilliance has faded somewhat after seeing how the genre has developed under the care of so many keen, talented designers that have distilled the best parts of Tresham's foundation into tighter, more focused packages, both within 18xx and in 18xx-adjacent spaces (cube-rails, Indonesia, Imperial, Age of Steam etc.).\n\n1830 just doesn't inspire me like it used to, and I find myself far less willing to tolerate many of its more painful idiosyncrasies: the arduous playtime combined with an overly front-loaded decision space; the frankly broken C&A private that can easily sink said arduously long game on turn 0 without an annoying amount of meta-knowledge required of the table to manage the threat; the relatively uninteresting and constricted B&O position that is usually compelled on a player rather than chosen by them; the lack of incentives in the northern half of the map that sees its otherwise fascinating spatial decision points rarely explored; and some weird, gamey edge-case rules that even the thorniest of its descendants had the good sense to do away with (I still couldn't tell you exactly how forced train purchases work in '30).\n\nIt's just too bogged down by its rough edges to be enjoyable to me anymore, and while I recognize that it is precisely those rough edges that make this such an intensely terse game for good 18xx players, for me (a bad 18xx player) it simply feels overbearing and trap-laden in ways its successors do not.\n\nI'm deeply thankful that it exists, and knowing who I choose to spend my game time with I'll probably play it again in the future, but I can't love it on its own terms.",
    "timestamp": 1744581600
  },
  {
    "username": "shmonkey",
    "rating": 6.0,
    "comment": "My intro to 18xx. future plays get long winded. the bank is too large and should be reduced for more streamlined play. Playing with an 8k bank makes the game feel about right.\n\nThis game is more meaty than 18Ches, but the added length means that this will not be played very frequently. Still, this one is a keeper.\n\nMy appetite for 6+ hour long games has dwindled over time. I think this might be on the chopping block once 1989 shows up.\n\nI sold all of my 18xx games since my playgroup for them dissolved. They are still fun occasionally",
    "timestamp": 1738191600
  },
  {
    "username": "CMagex",
    "rating": 7.0,
    "comment": "4, keep as the 18xx in the collection",
    "timestamp": 1760911200
  },
  {
    "username": "whitecatplays",
    "rating": 7.0,
    "comment": "Never fully unraveled the route knot around NYC.",
    "timestamp": 1760738400
  },
  {
    "username": "joebelanger",
    "rating": 7.0,
    "comment": "Interesting Choices/Mitigated Luck: 2\nDoesn't Overstay Its Welcome: 1\nInteresting/Novel Mechanisms: 1\nComponent Quality and Art: 1\nTheme Fit/Duly Abstract: 2",
    "timestamp": 1756332000
  },
  {
    "username": "Coconut_Mousse",
    "rating": 8.0,
    "comment": "Fantastic game, no player around",
    "timestamp": 1760911200
  },
  {
    "username": "logopolys",
    "rating": 8.0,
    "comment": "Train Game\n\nThis was my best experience with 18XX. I liked the 2D stock market far more than the linear stock market of 1846; the private companies auction was also an improvement over the privates draft. Despite not really feeling confident about what I was doing for the first act of the game, there were simple enough rules and options that I never felt completely lost. If you forced me to choose between something like 1830 and Dual Gauge, I'll probably choose Dual Gauge, but if it's a big convention-type environment, I could be tempted into 1830.",
    "timestamp": 1759356000
  },
  {
    "username": "zenmester",
    "rating": 8.0,
    "comment": "spiller det med Robert, Ole og Frederik, det er så svært at vinde eller ændre på en dårlig streak, at jeg nok dropper det.",
    "timestamp": 1759010400
  },
  {
    "username": "kendallgrubbs",
    "rating": 9.0,
    "comment": "30’s legacy is well deserved. The introduction of 1830 is one of the most important events in Board gaming. The game is exceptionally clever, but is best played with a group on Or near equal footing. It’s a great intro to the xx side of things & teaches you enough to play the lot of them. P.S. Get the AH edition.",
    "timestamp": 1760738400
  },
  {
    "username": "Kveld",
    "rating": 8.5,
    "comment": "El clásico 18xx, a día de hoy sigue siendo una alternativa fuerte para aquellos que quieren iniciarse en los 18xx o solo quieren tener un título de este tipo en la colección.\nFuerte manipulación de la bolsa y posibilidad de maniobras muy destructivas.",
    "timestamp": 1759269600
  },
  {
    "username": "Scifi66",
    "rating": 9.0,
    "comment": "Status:Shelf\nWow everything the grognards gush about and more. Astounding that it is still relevant today and has spawned many clones. Simple and deep. A staple of any 18xx collection, playing 3 to 6 and you could have a broad 18xx collection with just 1830 and 1846. The game isn't perfect though:\n->Fragile auction, if a new player pulls at the wrong moment one player could end up with a very significant advantage.\n->If no bankruptcy occurs, the last 2-3 closing OR sets are tedium due to the large bank of $12k. Cut bank down?\n->Game length is about 6 hours. Much prefer games that run 3-4 hours (1846/1862). Get faster with practice OR cut bank down.\n->Tileset can be jarring. Oldtimers will correctly argue that is part of the game but it can lead to some weird table situations, i.e. companies unable to operate as there isn't a basic yellow tile available for them to start? Again this goes away with some experience.\n->Minor quibble my Lookout games edition mapboard is not as clear as I would like. Once tiles are being laid, it becomes a little obscure around the preprinted hexes on the coast.\n\n++++++++++++++++\nInitial rating 9. Amazing game and it's a 1986 design! 1830's fantastic reputation is well deserved.\n\n24Feb 5p f2f with 3 new players to 1830 (one a total new player to 18xx). Game went a bit over 5 hours in total and we needed to run the sheets for one more OR set. Had a near bankruptcy mid-game.",
    "timestamp": 1758060000
  },
  {
    "username": "masterlelik",
    "rating": 10.0,
    "comment": "twice",
    "timestamp": 1760133600
  },
  {
    "username": "MorelliBuendia",
    "rating": 10.0,
    "comment": "Still the best. If you're only going to have one 18xx game, this should be the one. I would say playtime is about 4-5h if you play until the bank breaks. Like most 18xx games, there will be times where the winner can be called earlier.\n\nDespite the simple rules, it offers so many tools and strategic depth. While opaque and confusing to new players, the waterfall auction is fascinating and makes every game unique. There is fierce competition for the timing in looting privates, for buying the best trains, and for reaching the key spots on the map and blocking each other, not to mention the complex market with stock trashing, yellow strategies to stretch that share limit.\nSuch an elegant masterpiece.\n\nMogul scale: 5/E. It's at the lower end of the 5s, since it's one of the easiest 18xx games to learn, but it's still quite complex, like any other game in the series. Depth-wise, E+, only matched by stuff like 1817.",
    "timestamp": 1759442400
  },
  {
    "username": "mrbunkers",
    "rating": 10.0,
    "comment": "Online plays online. The apex of 18xx games.",
    "timestamp": 1758578400
  }
]