[
  {
    "username": "arthurcucumber",
    "rating": 1.0,
    "comment": "I changed my rating from an 7 to a 4 and now to a 1. This is to reflect how I now feel about Ra. In theory it's a very clean bidding/auction game but luck* can totally screw you over and if you play with the wrong people the game is dead.\n\nI like to describe Ra as an auction games for people who don't like auction games.\n\nI believe Medici, Strozzi, Modern Art, Amun-Re, Merchants of Amsterdam and even games like Palazzo are all superior Knizia auction games and I would always choose to play them over Ra.\n\n*I've had a player win a pot with a low number sun and two mediocre tiles currently with no Ra tiles out only for nothing but Ra tiles to come out and end the epoch. The tiles were well shuffled in the bag but the game rewarded bad play and this has happened multiple times to me over the years for it not to be an issue.",
    "timestamp": 1759701600
  },
  {
    "username": "hazered",
    "rating": 1.0,
    "comment": "It's really a press-your-luck game, since the bids are limited and predefined. Very rarely it blurs into auctioning, but most of the time it simply doesn't matter how others value a set. When 1 player is left, it becomes a game of how much they can grab up before the round ends, what does that hint at? When people pitch it as an auction game, I've noticed players become obsessed with drawing tiles and making the row more valuable, which they have no chance of winning. It makes more sense as a game where you sometimes need to call RA before it gets too rich.\n\nBut even as a press-your-luck game, I find it..... okay. All those ways to score, but really the only one anyone cares to look around on is if others irrigated the Nile. Also the monuments are too generous, scoring both wide and tall. I'll still play it, I just find it odd how popular this one gets. I guess it did VP salad way before it was a common thing, and that's why it's still huge.",
    "timestamp": 1731711600
  },
  {
    "username": "Oquundo1",
    "rating": 1.0,
    "comment": "Horrible game to play with a mix of new and experienced players.",
    "timestamp": 1680386400
  },
  {
    "username": "GhostInside",
    "rating": 1.0,
    "comment": "This game was a terrible experience IMO. I'm stunned it is popular. It felt like this game plays itself: just pull something from the big bag and throw it on the table and somebody who knows the rules will resolve everything. If you get behind with the bidding chits then you are hosed. You get punished if you hold back longer that everybody else. This smorgasbord of unfun design decisions, I never want to see this game again.",
    "timestamp": 1679180400
  },
  {
    "username": "Goodsound",
    "rating": 1.1,
    "comment": "85% of this game consists of random tile drawing: repetitive and boring. Weak on theme. Folks who like dry gaming experiences may enjoy this one, but I am going to pass in the future and play games that are more fun and exciting. It's kind of deceiting that such a cRAp game is published by Alea. 0.1 over 1 because it's not clearly broken, but it‘s definitely one of my most horrible gaming experiences.",
    "timestamp": 1541718000
  },
  {
    "username": "TisDandy",
    "rating": 1.0,
    "comment": "I try to do my homework before ever adding a game to my collection... While I may have scored a B+ for my research I found that I have to give this game a flying F. Every time I play, different people, same people... we always feel like this game is so bad we must be playing it wrong some how...\n\nits random, annoying chance where there is no strategy and there is no rhyme or reason.",
    "timestamp": 1362783600
  },
  {
    "username": "alaemortis",
    "rating": 1.0,
    "comment": "A game to burn in the egyptian riots . . .\n\nGreat EUROTRASH",
    "timestamp": 1355353200
  },
  {
    "username": "Mayasty",
    "rating": 1.0,
    "comment": "Probably my greatest disappointment ever ! Possible brilliant logic of this game is far beyond my perception :-(",
    "timestamp": 1311717600
  },
  {
    "username": "Der Ubermolch",
    "rating": 1.0,
    "comment": "Ugh, I hate this auction system.",
    "timestamp": 1178143200
  },
  {
    "username": "hacksword",
    "rating": 1.0,
    "comment": "(2 plays) A game that gives you one of two things to do on a turn, neither of which are fun.",
    "timestamp": 1156888800
  },
  {
    "username": "Sigerson",
    "rating": 1.0,
    "comment": "Well, I'm glad my instincts were right in saying during my first play of Ra, \"This reminds me of that auction game, the one with the gangsters...\" and somebody said, \"Razzia!\" and I said, \"Yeah! I didn't like that one either.\"\n\nAfter looking at players comments of Razzia!, I noticed that the first 5 comments, all high of course since they start in the 10's, all mentioned \"Ra\" in some way, shape or form and likened Razzia! to Ra. Hmmm...? Which came first? Ra or Razzia!? 'Cuz whoever designed the 2nd game definitely stole most of their ideas from the 1st one. I mean, for crying out loud, they played like EXACTLY THE SAME GAME!\n\nTo me the games are boring. Pull tiles(cards), call Ra(Razzia!), bid on tiles(cards), pull cards(tiles), call Razzia!(Ra), bid on cards(tiles). Which game are we playing anyway?\n\nI hate the random epoch ending contrivance of pulling the red tiles. How about this? Keep some red tiles set aside and when somebody calls Ra!, put one of the red tiles on the red tile track. That would at least speed up the process of getting to the end of this boring game.",
    "timestamp": 1132700400
  },
  {
    "username": "dakotamassie",
    "rating": 2.0,
    "comment": "This might be the most boring game I've ever played\nIts so lucky it's not interesting\nThere's no strategy at all\nAnother overrated knizia game\nIts only well liked because of the components",
    "timestamp": 1754690400
  },
  {
    "username": "TForever",
    "rating": 2.0,
    "comment": "Closed system auction game. It's a bunch of different types of auctions, but you can still get the least desirable piece. It's not very deep.",
    "timestamp": 1745359200
  },
  {
    "username": "Thatsnotme",
    "rating": 2.3,
    "comment": "Geekup bits",
    "timestamp": 1684965600
  },
  {
    "username": "BoredBeast",
    "rating": 2.0,
    "comment": "This game is terrible. We got sucked in from the hype of it being an \"older game\" and therefore it must be soooo good. Wow, no, just now. It's a random snooze-fest with zero inspiration. It needs to stay back in 1999 no matter how beautiful the new production is. We will never play this again.",
    "timestamp": 1682892000
  },
  {
    "username": "Damdael",
    "rating": 2.0,
    "comment": "The artwork is a bit outdated but acceptable. I hate everything else about this game. In my playgroup there are players of varying skills. Ra is a game where if you have a good understanding of the game you will win with a qazillion points while the less skilled players can end the game with close to zaro points. I find it a better game design philosophy where skill is rewarded, but not this heavily.",
    "timestamp": 1642287600
  },
  {
    "username": "Clwe",
    "rating": 2.0,
    "comment": "a pretty clever game for how simple it is, but I hate the complete lack of control you have. Your actions are frustratingly limited (basically either add to the current items for auctioning, or start a once round the table bid - that's it! Even poker gives you more options, FFS!). To top it off, the scoring system a) makes little to no thematic sense, and b) is pointlessly convoluted.\n\nOh, and c) the tiles look like they were drawn by a five year old. And I'm being generous...",
    "timestamp": 1543964400
  },
  {
    "username": "chromia",
    "rating": 2.0,
    "comment": "I've played this game only once. I'll never play it again. I have nothing more to say.",
    "timestamp": 1450738800
  },
  {
    "username": "bearn",
    "rating": 2.0,
    "comment": "Dry very dry and not all that much fun.",
    "timestamp": 1445119200
  },
  {
    "username": "Colls",
    "rating": 2.0,
    "comment": "Incredibly boring for me. Huge mismatch between game and me as player, obviously (oh, look, Ra has been invoked again? yay.).",
    "timestamp": 1422745200
  },
  {
    "username": "davedanger",
    "rating": 2.0,
    "comment": "Agree with other criticisms in 4 and below ratings. No theme - just set collection. Dull. Long. Bidding game without change and not wholly secret bids. Random choice generation.",
    "timestamp": 1374962400
  },
  {
    "username": "rfoth",
    "rating": 2.0,
    "comment": "Auction mechanism leaves me dry.",
    "timestamp": 1358636400
  },
  {
    "username": "tectactoe",
    "rating": 3.0,
    "comment": "Easy to see why this is considered a classic, and the bidding mechanic is unique enough to make it feel very different from a standard auction game. Knowing when to use your higher-valued bids (knowing that you will lose it and essentially have to \"trade\" for a potentially much lower bid in the future) creates lovely tension. My biggest complaint is that underneath this ingenious bidding system, you have a merely fine set collection game. Set collection games, unfortunately, have a much lower ceiling.",
    "timestamp": 1734649200
  },
  {
    "username": "Golyadkin",
    "rating": 3.0,
    "comment": "This game feels like auctioning off handfuls of candy. Unfulfilling -- too sweet --- and only enjoyable for the person who wins it. And even then, barely. The auction itself completely lacks tension. It's very obvious what is and isn't worthwhile, and there is barely anything you can do to interfere with your opponents, since the limited choices for fixed bids means that upping the price either means overpaying for something you don't want, or coming in under just for hollow showmanship. For a much better game that utilizes fixed bidding pieces, play Metropolys.",
    "timestamp": 1720216800
  },
  {
    "username": "English Teechur",
    "rating": 3.0,
    "comment": "Totally luck driven. Too much downtime. Not fun at all.",
    "timestamp": 1711580400
  },
  {
    "username": "baddice",
    "rating": 3.0,
    "comment": "Sufficiently different to my other games to keep, but not always the most enjoyable experience. The problem is the frequency of those Ra tiles which trigger the end of an epoch; often this happens with several players having unused bids, sometimes you'll even get a player who has not won a single bid. Whole epochs go by with some players adding little or nothing to their stock of tiles. Can be quite frustrating.\nUpdate: Way too much luck. In my last game (and I mean the last game of this I'm going to play) one round ended in a blink because four Ra tiles were drawn in a row. In another round there was one player left, who drew eight tiles and took them all because there was no Ra. Any sort of planning is impossible. Not a good way to spend half an hour. Edit: sold.",
    "timestamp": 1708038000
  },
  {
    "username": "Korwin",
    "rating": 3.0,
    "comment": "Queens from SUSD says this game is stupid in a good way.\nI agree with the first part",
    "timestamp": 1703977200
  },
  {
    "username": "capasso2300",
    "rating": 3.0,
    "comment": "Took me several playthroughs at different player counts to really cement my opinion. And that opinion is Ra just isn't fun.\n\nThe mechanics are clever. The components are nice, but it just isn't fun. At 3 players, all the way up to 5, the person with the lowest bidding token realizes it's just in their favor to call auctions every time it comes to them, so they can try and steal a tile or two, and trade their bidding token for a higher one to use later. This basically makes the game a low scoring affair. In fact our last game became about who lost the least amount of points, instead of who scored the most.\n\nThe fact that it doesn't fit in it's box is another big gripe.",
    "timestamp": 1701903600
  },
  {
    "username": "musicalanarchy",
    "rating": 3.0,
    "comment": "The act of drawing tiles to build up what is being bid on was slow and tedious. Drawing the red tiles was disappointing because it often forced a round of passing when the offer was mediocre, and then the person who drew it feels like they barely had a turn. The bidding system seemed similar to Nidavellir, but worse since you have to swap with the last token that won a bid. And the disaster tiles also just ruined so many offers that might have been good, but then no one wanted them, meaning we had to just keep drawing tiles to balance it out, which was boring.",
    "timestamp": 1693346400
  },
  {
    "username": "HowitzerBug",
    "rating": 3.0,
    "comment": "Not bad for a bidding game. Not really my kind of thing, but I like the aesthetic and the different value bidding tokens are interesting.",
    "timestamp": 1692309600
  },
  {
    "username": "drbenn",
    "rating": 3.0,
    "comment": "I'll never understand what makes this game popular. It does absolutely nothing for me. Well, odds are your mileage will differ",
    "timestamp": 1683583200
  },
  {
    "username": "FranzK",
    "rating": 3.0,
    "comment": "What a dull game. This is the definition of a pasted-on theme. I don't really care for games that emphasize set collection - it feels like a generic mechanic.",
    "timestamp": 1621720800
  },
  {
    "username": "lushchords",
    "rating": 3.0,
    "comment": "Not a fan of this one. Modern Art blew this one out of the water. Medici is slightly more interesting.",
    "timestamp": 1620684000
  },
  {
    "username": "rjones53",
    "rating": 4.0,
    "comment": "Not for me. If you like auction games it might be for you but it's tedious and slow.",
    "timestamp": 1754776800
  },
  {
    "username": "iplaybgnaked",
    "rating": 4.0,
    "comment": "Pretty clever auction game, the perfect information mixed with the push your luck aspect of the auction pool and the Euro-ish auction mechanic with the tiles makes for a pleasant family game that even the most hardcore players can still enjoy. Game may run a tad long for its simplicity but it's exciting and crunchy enough that I remain invested and engaged the entire time.",
    "timestamp": 1752530400
  },
  {
    "username": "Tenome",
    "rating": 4.0,
    "comment": "Meh, auction euro.",
    "timestamp": 1751666400
  },
  {
    "username": "NotThatSalem",
    "rating": 4.0,
    "comment": "So, so boring.",
    "timestamp": 1749592800
  },
  {
    "username": "Magneton",
    "rating": 4.0,
    "comment": "miało być super, a była nieemocjonująca i sucha licytacja\nmasz tyle, to Cię przebiję\nnie mam? No to nie mam, leć dalej. Nuda.",
    "timestamp": 1741734000
  },
  {
    "username": "Beastly_Venturer",
    "rating": 4.0,
    "comment": "This like most other Knizia fell flat for me. I know I'm in the minority.",
    "timestamp": 1740783600
  },
  {
    "username": "getareaction",
    "rating": 4.0,
    "comment": "I downloaded the iOS version at the same time as Medici, another auction game, and I much prefer Medici. The multitude of tiles in Ra feels too artificial, and the way luck impacts the game annoys me (not that there's too much luck, I just prefer how the luck works in Medici). I've since played the over-produced deluxe version a couple of times and feel very meh about it.",
    "timestamp": 1739833200
  },
  {
    "username": "Generalkhun",
    "rating": 4.0,
    "comment": "How this can be the greatest one of so much people? Too luck driven. Game state is basically 100% on a random drawing titles. Not worth to teach to anyone at all. Cannot strategized anything. Maybe can play with no brain in if someone wants",
    "timestamp": 1736377200
  },
  {
    "username": "rayzg",
    "rating": 4.0,
    "comment": "2024-06-09: Downgrade from 5 to 4. I really, really don't like auction games.\n\nOctober 2006: The scoring is just too convoluted, or rather, unintuitive. Quick and snappy auction game, though.\n\nUPDATE: Downgraded from 7 to 5. I personally don't like the (IMHO) inelegant blend of scoring mechanisms.\n\nUPDATE: Same rating. I just realized one of the key points in this game is that low value suns are not *that* bad!",
    "timestamp": 1717970400
  },
  {
    "username": "newrev",
    "rating": 4.0,
    "comment": "To much luck.",
    "timestamp": 1716242400
  },
  {
    "username": "eddieb",
    "rating": 4.0,
    "comment": "Do you enjoy auctions. Cause this entire game is about pushing your luck in auctions",
    "timestamp": 1713132000
  },
  {
    "username": "Musketeer84",
    "rating": 5.0,
    "comment": "Reasons for culling:\nNever really gelled with the game. Don't like it having so many penalties for having the least of certain tiles and bidding tokens, or the disaster tiles when the game is quite luck driven.\nPrefer modern art, for sale, or nidavellir as auction games or quacks or circus flochsti for push your luck",
    "timestamp": 1760911200
  },
  {
    "username": "BeansForTrade",
    "rating": 5.0,
    "comment": "Modern Art is better.",
    "timestamp": 1759615200
  },
  {
    "username": "dj_koen",
    "rating": 5.0,
    "comment": "Its not bad but im not a fan\n\nIts too tedious to play for the amount of fun it offers",
    "timestamp": 1759528800
  },
  {
    "username": "benni_jolink",
    "rating": 5.0,
    "comment": "Interesting bidding system but the dull theme doesn't spark much enthusiasm. Baffling production: in spite of the huge box with large wooden pieces, the actual icons for calculating scores are super tiny!",
    "timestamp": 1759010400
  },
  {
    "username": "chiangs",
    "rating": 5.0,
    "comment": "Played once, want to try again",
    "timestamp": 1756677600
  },
  {
    "username": "csi_ice",
    "rating": 5.0,
    "comment": "Press Your Luck The Board Game",
    "timestamp": 1753048800
  },
  {
    "username": "Unitoch",
    "rating": 5.0,
    "comment": "I've given this more than its share of chances, and I cannot see what all the fuss is about. It's fast, but ultimately I find it rather unsatisfying. It feels slippery --there should be good choices, but it's just too chaotic and random to make a really satisfying game. It's very, very, VERY difficult to judge how much an auction is worth when much of it is completely dependent on how the other tiles are going to come up for the rest of the epoch and the game and those tiles are incredibly variable. The scoring mechanisms are counterintuitive and uninteresting. Too long for filler, and not enough control for a meaty experience. Pass.",
    "timestamp": 1751580000
  },
  {
    "username": "rvtk",
    "rating": 5.0,
    "comment": "I can't make myself enjoy this game.",
    "timestamp": 1751234400
  },
  {
    "username": "Jabaaa",
    "rating": 4.5,
    "comment": "10.6.25",
    "timestamp": 1750111200
  },
  {
    "username": "oursino",
    "rating": 5.0,
    "comment": "Jeu sympa, mais trop de choix pour gagner des points, la visibilité est limitée à part pour Vince (de Muchos Gamus) qui avait déjà « lu » sa tactique et a gagné haut la main.",
    "timestamp": 1744927200
  },
  {
    "username": "opks22",
    "rating": 5.0,
    "comment": "iOS version\nThis version is buggy as fuck, constantly crashes or just stops working altogether -- very frustrating.",
    "timestamp": 1744063200
  },
  {
    "username": "Flatirons",
    "rating": 5.0,
    "comment": "Martin owns it.",
    "timestamp": 1743890400
  },
  {
    "username": "Be_Ka",
    "rating": 5.0,
    "comment": "vk 14-15",
    "timestamp": 1741474800
  },
  {
    "username": "meerkatmobgames",
    "rating": 5.0,
    "comment": "I think there are better auction games with more enjoyable themes. Great quality and pieces though.\n\nBought a reprint through Gamefound in 2022",
    "timestamp": 1738364400
  },
  {
    "username": "Kodeir",
    "rating": 5.0,
    "comment": "I don't mind abstracts, but I would have preferred to bid for something more plausible than a God, a pyramid and bunch of gold coins: the theme is so thin it gets in the way, as scoring is tied to the symbols, so it isn't straightforward at all. And, unsurprisingly, it's utterly impossible to follow anything resembling a plan without internalising said unintuitive scoring mechanism.\n\nDue to that, it can give a horrible first impression: someone will win, and few players, if any, will understand why. It's a solid game once players are familiar with it but, considering all the auction games out there, I'm not quite sure it's worth the effort. There are other multiple bidding games out there with intuitive themes that contribute positively to understanding the rules.\n\nRating: \nOptimal number of players:\n3\n5\n\nFor more information on how I rate games, go to my profile",
    "timestamp": 1737500400
  },
  {
    "username": "dtmoney75",
    "rating": 5.0,
    "comment": "1 Play\n\nPlayed at: 3",
    "timestamp": 1736722800
  },
  {
    "username": "KateEM",
    "rating": 5.0,
    "comment": "It's OK to play if a fourth person is needed but I don't enjoy the bidding much and it seems a bit pointless.",
    "timestamp": 1735081200
  },
  {
    "username": "ultimoratio",
    "rating": 5.0,
    "comment": "Great auction game from Knizia. The asymmetric incentives between players is really interesting on top of such a simple rule set.\n\nHowever, I don't find it as interesting as Modern Art or Medici or Strozzi. The area majority contest in Strozzi is much more interesting for me.",
    "timestamp": 1734735600
  },
  {
    "username": "jauggy",
    "rating": 5.0,
    "comment": "Had high expectations of this game due to all its praise. It's a decent game but I feel like I've experienced enough after one game that I don't have the desire to try again.",
    "timestamp": 1734562800
  },
  {
    "username": "tolhs",
    "rating": 5.3,
    "comment": "2024:+1",
    "timestamp": 1733958000
  },
  {
    "username": "bigfranco",
    "rating": 4.8,
    "comment": "Archived",
    "timestamp": 1732402800
  },
  {
    "username": "magicfreak39178",
    "rating": 5.0,
    "comment": "No interest in playing again. A weird auction game.",
    "timestamp": 1726956000
  },
  {
    "username": "KevKevKev",
    "rating": 6.0,
    "comment": "Update: culled.\nExcellent production and game mechanics. But sadly, the game isn’t fun at all and never landed well with my different playgroups. It’s just too hard to know the value of things and the rewards are neither frequent or high enough. Very sad to say as I enjoy Knizia games a lot, this one is not working.\n(And yes if we all played this 15 times we would know the value of things. But this is not going to happen",
    "timestamp": 1760911200
  },
  {
    "username": "destro",
    "rating": 6.0,
    "comment": "Ph",
    "timestamp": 1760306400
  },
  {
    "username": "Beru",
    "rating": 6.0,
    "comment": "#unplayedcopy",
    "timestamp": 1759615200
  },
  {
    "username": "Ephorus",
    "rating": 6.0,
    "comment": "What I like:\n- Shouting RAAA!\n- Timing is very important. Do I create an auction now? Do I wait? Do I participate in the auction? Which tiles are worthy for the other players?\n\nWhat I dislike:\n- Auctions itself are pretty one-sided and limited due to the set amount of suns.\n- Bit hard to teach due to the different set collection rules.\n\nWhy I culled it:\nSomehow the spark was never there for my fellow players. I kept Razzia in my collection though.",
    "timestamp": 1759183200
  },
  {
    "username": "ashkai",
    "rating": 6.0,
    "comment": "Includes:\n\n- Traders",
    "timestamp": 1759010400
  },
  {
    "username": "Mijjy",
    "rating": 6.0,
    "comment": "Another game of interesting abstract concepts from the master of throw away Euros.\n\nBut the mechanics save this one.",
    "timestamp": 1758492000
  },
  {
    "username": "Username2024",
    "rating": 6.0,
    "comment": "I can tell this is a good game but it made me realize I don't particularly like auction/biding games\nGive me something with more stakes than \"For sale\" or \"No thanks\" and I will suffer",
    "timestamp": 1758319200
  },
  {
    "username": "Mageknight12",
    "rating": 6.0,
    "comment": "Ra has classic appeal, but the auction pacing can feel repetitive and dry. The luck of the tile draws often outweighs strategic bidding, making planning feel pointless at times.",
    "timestamp": 1757023200
  },
  {
    "username": "Nonoku",
    "rating": 6.0,
    "comment": "3-5 B 3-4\nPros\n-Good auction mechanics\n-Well made pieces\n-Has a giant wooden block\n\nCons\n-Has a little bit of luck to it",
    "timestamp": 1756159200
  },
  {
    "username": "Herakleitos",
    "rating": 6.0,
    "comment": "It can be a little difficult at the start, because so much of the strategy relies on familiarity with the variety of scoring methods and the pace at which the Ra tiles come out. It certainly gets people groaning, which I like! I would like to play it again - especially at 3-4 players. I think that, having played it once myself, the second game will be stronger - as I don't think I did a great job of introducing it on the first go.\n\nEdit: in the end, I decided to pass Ra along. It is obviously a very well designed game but it is not something I see myself setting aside time to play. It is helping me see, however, how important thematic immersion is to me and that I'm drawn largely to 'event' games that tell stories. Still, I would gladly play someone else's copy!",
    "timestamp": 1755900000
  },
  {
    "username": "ueyinnafesh",
    "rating": 6.0,
    "comment": "크니치아 게임은 다 재밌게 하는 편인데, 이상하게 라는 안 맞다. 뽑는 타이밍이 즐거운 상황이 별로 없달까.",
    "timestamp": 1753308000
  },
  {
    "username": "blackpawl",
    "rating": 6.0,
    "comment": "2025 / 2024 / 2023 / 2022",
    "timestamp": 1750716000
  },
  {
    "username": "ReptilianSamurai",
    "rating": 6.0,
    "comment": "It's a decent push your luck and auction game, but too luck based for me",
    "timestamp": 1748210400
  },
  {
    "username": "Technarius",
    "rating": 6.0,
    "comment": "Initial review based on a couplfe of plays:\n\nPros:\n+ Easy to play & teach\n+ Very tight, a lot of tension\n+ Unique auction game\n\nCons:\n- Randomness of turn order and drawing tiles out of the bag. Small random draw can decide over winning and loosing a game.\n- Repetitive. The core puzzle stays the same. Some day you will just have the same Experience.\n- Almost no player agency. The space of players decisions consist of basically only one and only decision \"are the auction tiles cool enough to call \"Ra\" and bet your highest value \"sun\". Everything else is pretty random... And the game basically plays you all together.\n\nVerdict: Not my cup of tea. I already have some auction games (Taj Mahal, Cyclades, Rurik: Dawn of Kiev...) so i don't need this one.",
    "timestamp": 1747778400
  },
  {
    "username": "Profecia91",
    "rating": 6.0,
    "comment": "A classic auction game, the mechanics work well, some rounds can be boring, there's randomness, the theme and the art don't help and I will go for other and better auction games.",
    "timestamp": 1747346400
  },
  {
    "username": "erwinhabes",
    "rating": 6.0,
    "comment": "Te koop €20,-",
    "timestamp": 1747346400
  },
  {
    "username": "RangerFox",
    "rating": 6.0,
    "comment": "It is kinda boring and too long for what it is. Not my cup of tea.",
    "timestamp": 1746136800
  },
  {
    "username": "Thomson3020",
    "rating": 6.0,
    "comment": "2025-04-16: It wasn’t luv at first sight, and if anything it’s only going downhill from here.. it’s not the gimmicks of pulling tiles out of a bag that rubs me the wrong way as much as the point salad nature of it all. Here are some points for this, and that, and that too…\n\n2025-02-12: At last we meet!\nI thought it was pure auction but after tonight session I would disagree with that statement. It’s just as push your luck as it is an auction game.\nAlas I didn’t feel that knife edge tension you get on other auction game. Heck even Tikal I would argue has more tension to the bidding rounds.\nGlad I tried it, and not trying to bring Ra down, but I would rate Tramway, Power Grid, Modern Art, Ponzi Scheme… all a step above Ra from an auctioning perspective so a bit let down by the game given its reputation.\nAlso I wasn’t that bothered with the scoring system.\nOn the plus side though, the unique bidding values on each tile and how you get to swap your winning bid with the central piece for future round was appreciated.",
    "timestamp": 1744840800
  },
  {
    "username": "darkfinale",
    "rating": 6.0,
    "comment": "Auction and set collection game.\nGood dynamic between players and slight push your luck.\nGame plays relatively fast. Works. Theme not fully my type.",
    "timestamp": 1744495200
  },
  {
    "username": "pitonowie",
    "rating": 6.0,
    "comment": "Same fun as in Razzia, if you like auction games You must try it.",
    "timestamp": 1744495200
  },
  {
    "username": "saintetna",
    "rating": 6.0,
    "comment": "Indra 20\nNelvin 51\nGabby 12\nDar 16\nMatthew 19",
    "timestamp": 1743030000
  },
  {
    "username": "Sethenstien",
    "rating": 6.0,
    "comment": "Solid enough game that never gets fully going, works well but not amazing. The most recent release is beautiful though.\n\n6/10",
    "timestamp": 1742252400
  },
  {
    "username": "Holzmichel01",
    "rating": 7.0,
    "comment": "Very good game, and the 25th century edition has amazing components which make the game and it's tactile feel that much better.\n\nThe bidding mechanism is very smart.\n\nThe set collection itself felt a bit basic and underwhelming for us. But I understand that for some this streamlined experience might add to the charm.",
    "timestamp": 1760824800
  },
  {
    "username": "StupidRatCreature",
    "rating": 7.0,
    "comment": "",
    "timestamp": 1760565600
  },
  {
    "username": "magdalencox",
    "rating": 7.0,
    "comment": "Needs to be snappier - too light to be a long game, too involved to be a post-dinner game",
    "timestamp": 1760479200
  },
  {
    "username": "BarFightBill",
    "rating": 7.0,
    "comment": "Best: 3-5\nOwner: Martin",
    "timestamp": 1759960800
  },
  {
    "username": "KANDANG",
    "rating": 7.0,
    "comment": "O: 8.10.2025",
    "timestamp": 1759874400
  },
  {
    "username": "smurfodeth",
    "rating": 6.5,
    "comment": "Fantastic combination of auctions (one of the best) and push your luck (again, one of the best).",
    "timestamp": 1759096800
  },
  {
    "username": "Fruktstund",
    "rating": 7.0,
    "comment": "Kickstarter, new chunky big pieces of wood and also very nice colors, intense green and turqoise",
    "timestamp": 1757887200
  },
  {
    "username": "Kevin_Whitmore",
    "rating": 7.0,
    "comment": "BGG:HoF\n\nRa is a good game! The theme, or motif, is plausible. As a pure auction game, Ra is all about leveraging your resources, and seeing what a lot is worth both to yourself, but to the other bidders.\n\nNon-essential",
    "timestamp": 1757628000
  },
  {
    "username": "Kaliff09",
    "rating": 7.0,
    "comment": "#lighteuro",
    "timestamp": 1757541600
  },
  {
    "username": "paulclarke339",
    "rating": 7.0,
    "comment": "It's an Okay Knizia. The scoring is confusing the first couple of times, but once you are used to it the game is more understandable and (IMO) playable than other Knizias (T&E, Modern Art, Samurai etc.)",
    "timestamp": 1757368800
  },
  {
    "username": "Schierke",
    "rating": 7.0,
    "comment": "Markus",
    "timestamp": 1756850400
  },
  {
    "username": "chipsmith",
    "rating": 8.0,
    "comment": "Was introduced to this game at CCBGC 2025. I really like this game. Initial rating is an 8, at least.\nMy feeling is that there more depth than first appears. I would love to play this many more times.",
    "timestamp": 1760911200
  },
  {
    "username": "AndrewRK",
    "rating": 8.0,
    "comment": "Fun game! Pretty simple, volatile, but a good time overall. Quick to teach and play with pretty fun moment-to-moment gameplay.",
    "timestamp": 1760824800
  },
  {
    "username": "jtaets",
    "rating": 8.0,
    "comment": "Pharaoh Edition: wood",
    "timestamp": 1760738400
  },
  {
    "username": "Couch",
    "rating": 8.0,
    "comment": "Traders Expansion.",
    "timestamp": 1760652000
  },
  {
    "username": "realanthillkit",
    "rating": 8.0,
    "comment": "Streamline redesign\nhttps://boardgamegeek.com/geeklist/254413/collection-bg-rede...",
    "timestamp": 1760565600
  },
  {
    "username": "Anne_Claire",
    "rating": 8.0,
    "comment": "rules heaviness: medium\na nerve-racking set collection betting game, very good for 3-5 players",
    "timestamp": 1760392800
  },
  {
    "username": "Aition",
    "rating": 8.0,
    "comment": "Toegankelijk en elegant veilingspel met een gesloten economie en setcollectie.",
    "timestamp": 1760220000
  },
  {
    "username": "Jordan_Varbev",
    "rating": 8.0,
    "comment": "Knizia\n#3**, #4**, #5*\n10/25 - After another 3p game, I really don't think it is optimal player count, contrary to the bgg poll. It is better for strategy, but less fun.",
    "timestamp": 1759960800
  },
  {
    "username": "ditterio",
    "rating": 8.0,
    "comment": "Solo: https://boardgamegeek.com/thread/1593914/no-solo-variant\n\nor:\n\nhttps://boardgamegeek.com/thread/3173382/solo-variant-versio...",
    "timestamp": 1759960800
  },
  {
    "username": "GibberishTea",
    "rating": 8.0,
    "comment": "Explainations seemed a bit convoluted at first, but eventually players got it and it's not so bad. Fun at 3p, 2 of us were so focused on each other that the third took the win. I like how you sometimes have to make preposterous moves like buying 2 tiles with a 12 or 13.\n\nHowever, it should be noted that TILES NEVER GO BACK IN THE BAG. ALWAYS DISCARD TILES TO THE BOX. Why it that not written in the rules is beyond me...",
    "timestamp": 1759960800
  },
  {
    "username": "KingdmHeartsFan",
    "rating": 8.0,
    "comment": "Backed Deluxe Edition On Gamefound.",
    "timestamp": 1759874400
  },
  {
    "username": "Eivisso",
    "rating": 8.5,
    "comment": "Pharaon edition",
    "timestamp": 1761046320
  },
  {
    "username": "Drb89_",
    "rating": 9.0,
    "comment": "Push your luck\nSet collection\n++ Art\n++ Fun and tense",
    "timestamp": 1760911200
  },
  {
    "username": "sean_tsi",
    "rating": 8.5,
    "comment": "5 player",
    "timestamp": 1760824800
  },
  {
    "username": "janglemangle",
    "rating": 9.0,
    "comment": "RA! RA! RAAA!!!\n\nno other game makes me more INFURIATED!!",
    "timestamp": 1760652000
  },
  {
    "username": "Beanreaper",
    "rating": 9.0,
    "comment": "Just great simple game that feels surprisingly deep.",
    "timestamp": 1760565600
  },
  {
    "username": "strongbadia",
    "rating": 9.0,
    "comment": "X",
    "timestamp": 1760479200
  },
  {
    "username": "kilianbognar",
    "rating": 8.5,
    "comment": "There’s nothing left to say - this is probably the best push-your-luck auction game. If you play it and don’t really understand what the fuss is about the first time, give it another shot; it’s short enough for that.",
    "timestamp": 1760306400
  },
  {
    "username": "spcsamri",
    "rating": 8.5,
    "comment": "I frequently bounce off of \"Classic games you have to play.\" So, I'm not really sure why I backed the Ra Kickstarter. I'm very glad I did though. It plays very quickly, is very easy to explain/understand, has some great decision making, a little bit of luck, and this edition is gorgeous. A great game I was 26 years late to the table on.",
    "timestamp": 1760306400
  },
  {
    "username": "rbal12502",
    "rating": 9.0,
    "comment": "Best bidding game of all time. New production also is fantastic.",
    "timestamp": 1760306400
  },
  {
    "username": "KalElSkywalker",
    "rating": 8.5,
    "comment": "2023 Pharaoh Edition. Great auction bidding game. Also have the Trader expansion. All played recorded here.",
    "timestamp": 1760133600
  },
  {
    "username": "hiimjosh",
    "rating": 9.0,
    "comment": "Endlessly replayable and delightfully tactical. Ra is a masterclass example of the once around auction and has been pivotal in helping it become one of my favorite mechanics\n\n+ Plays great at higher player counts\n+ Very high variety due to draw variance\n+ Opportunities for big plays in almost every game\n+ High time-to-decision ratio\n\n- I don't like it as much at lower player counts\n- Took a while for me to appreciate\n- Passing the bag around is annoying\n\n(Played at 3p, 4p, and 5p; strong preference for 5 and soft avoid at 3)\n\nI've given Ra multiple chances, but it never clicked. It's a filler that runs long. Every game I've played of it has swung really hard due to the draw on a single lot. Maybe I need to play with people who are really good.\n\nEDIT: Okay, it turns out that I love 5p Ra.\n\nEDIT: After about 10 plays I finally feel convinced by Ra. I really enjoy it. Super streamlined, very quick moving, and nice and competitive.",
    "timestamp": 1760133600
  },
  {
    "username": "Sir_Mix_Alot",
    "rating": 10.0,
    "comment": "Very fun and not so easy as it seams to be. Perfect boardgame for families.",
    "timestamp": 1760652000
  },
  {
    "username": "frankqb",
    "rating": 9.5,
    "comment": "Fascinating. Can't wait to play more.",
    "timestamp": 1760565600
  },
  {
    "username": "btasam",
    "rating": 9.5,
    "comment": "Auction game with open information and set-bids. Works really well with two players and shows nuance through its player count.",
    "timestamp": 1760392800
  },
  {
    "username": "Tonybo",
    "rating": 10.0,
    "comment": "Best Auction game.",
    "timestamp": 1760392800
  },
  {
    "username": "Euroman",
    "rating": 10.0,
    "comment": "Fantastic closed auction/push your luck game.\nI never win this one, but still enjoy it.",
    "timestamp": 1760392800
  },
  {
    "username": "TheSlushySnake",
    "rating": 10.0,
    "comment": "Ancient Egyptian-Themed, Auction + Set-Collection Game.\n3-5 Players. (Best With 3-4 Players).",
    "timestamp": 1760392800
  },
  {
    "username": "Master Margarita",
    "rating": 10.0,
    "comment": "*",
    "timestamp": 1760306400
  },
  {
    "username": "Timstikkers",
    "rating": 10.0,
    "comment": "one of my favorites its more lean than Prince in his prime years.",
    "timestamp": 1760047200
  },
  {
    "username": "Thrylos",
    "rating": 10.0,
    "comment": "One of the Best Auction games of all times. Now with the deluxe version is a real 10.",
    "timestamp": 1760047200
  },
  {
    "username": "Aletsche",
    "rating": 10.0,
    "comment": "neu gekauft",
    "timestamp": 1759701600
  },
  {
    "username": "garykagan",
    "rating": 10.0,
    "comment": "5 player",
    "timestamp": 1759615200
  }
]