[
  {
    "username": "starspangledgirl",
    "rating": 1.0,
    "comment": "The gameplay is ok, with too much take that, but not completely horrible. What makes it a 1 for me, and guarantees I’ll never play again, is the making of domestic abuse a joke.",
    "timestamp": 1582326000
  },
  {
    "username": "The Gamester",
    "rating": 1.0,
    "comment": "We read the rules, started to play, & decided it SUCKS!",
    "timestamp": 1250200800
  },
  {
    "username": "millsyboy",
    "rating": 2.0,
    "comment": "It’s silly and not too long, but I would prefer to play most other games.",
    "timestamp": 1724277600
  },
  {
    "username": "fizzle",
    "rating": 2.0,
    "comment": "This is a typical take-that card game in which the player least beaten up by the others wins. It might be a bit cheekier than most with its theme but there's just as little substance to it as to most of the competition.",
    "timestamp": 1408312800
  },
  {
    "username": "ShiannLin",
    "rating": 3.0,
    "comment": "1993 Fairplay À la carte Runner-up",
    "timestamp": 1734562800
  },
  {
    "username": "skrutsch",
    "rating": 3.0,
    "comment": "Gave it to Dorcas.",
    "timestamp": 1531432800
  },
  {
    "username": "krit1789",
    "rating": 4.4,
    "comment": "Like Burn Rate, I like its sense of humor than its actual game play.",
    "timestamp": 1695765600
  },
  {
    "username": "TimMierz",
    "rating": 4.0,
    "comment": "There are a few weird quirks in the game: tenants whose value is not how much they pay (Mover, Celebrities), cards with abilities you always have to look up (Politics - what do Eviction and Demolition do again?), and the complete uselessness of the Jail. Still, despite its randomness, quirks, and poorly written rules (in my version at least), it's decently fun once in a while.",
    "timestamp": 1672268400
  },
  {
    "username": "Colls",
    "rating": 5.0,
    "comment": "The cards are hilarious, but the gameplay is neither particularly interesting nor particularly fun for me.\n\nGave to friend",
    "timestamp": 1664661600
  },
  {
    "username": "yegods",
    "rating": 5.0,
    "comment": "a fun card game. random, but nice and \"screw your neighbor\"ish",
    "timestamp": 1617832800
  },
  {
    "username": "Brian Collins",
    "rating": 5.0,
    "comment": "Marvelous! I only wish the cards were in color.",
    "timestamp": 1530655200
  },
  {
    "username": "Jimzik",
    "rating": 5.0,
    "comment": "Nice little card game with humor. Many ways to screw your neighbor as well as improve yourself.",
    "timestamp": 1449702000
  },
  {
    "username": "Geekpunkt",
    "rating": 5.8,
    "comment": "Artwork: 5\nMechanic: 5\nTheme: 7\nFun: 7\nQuality: 5\n———————————-\nSCORE: 5.8\n———————————-",
    "timestamp": 1716156000
  },
  {
    "username": "wicuwe",
    "rating": 5.8,
    "comment": "ABACUSSPIELE\nGER",
    "timestamp": 1667170800
  },
  {
    "username": "moooples",
    "rating": 5.5,
    "comment": "Interesting game and I like the art. Suffers extremely from a rich get richer at lower player counts.",
    "timestamp": 1601330400
  },
  {
    "username": "Boggnogg",
    "rating": 6.0,
    "comment": "Wucherer",
    "timestamp": 1581462000
  },
  {
    "username": "tasieio",
    "rating": 7.1,
    "comment": "ok",
    "timestamp": 1740351600
  },
  {
    "username": "NOOCX",
    "rating": 7.0,
    "comment": "Underrated Friese, old enough that it has no FF-title. Basically a stack of lovably nasty take-that. Players use cards for building houses, settle tenants or teasing others with bombs, murder, squatters and musicians. Sic the police on your friends who'll aresst them unless they have a xxx orgy alibi. I dig the crude humor and the political incorrect original artwork. The game is not super balanced though and suffers from a serious runaway leader issue. The creative usage of cards makes it worth to explore nevertheless and despite its flaws Wucherer is a frequently requested game in our groups.",
    "timestamp": 1695506400
  },
  {
    "username": "silentSID",
    "rating": 8.0,
    "comment": "Vorschlagliste (dt. Wucherer)",
    "timestamp": 1674946800
  },
  {
    "username": "Spielmadchen",
    "rating": 8.0,
    "comment": "This is a fairly simple game, but I really enjoy it! My husband and I would get so into the games that I wouldn't speak to him a couple of times afterward. Lol\n\nThis would be a great game to play with tweens and teens too.",
    "timestamp": 1672959600
  },
  {
    "username": "fake",
    "rating": 9.0,
    "comment": "n",
    "timestamp": 1662933600
  },
  {
    "username": "PrivateMeggido",
    "rating": 9.0,
    "comment": "Fun, light and easy to play game.",
    "timestamp": 1629669600
  },
  {
    "username": "DoodleMac",
    "rating": 10.0,
    "comment": "I just love the game Landlord! Because you can build different stuff .\n\n\n1st doodlemac 71\n2st dad 41\n3st xmacklerz 29\n4st mom 27",
    "timestamp": 1546038000
  },
  {
    "username": "LittleMisfit",
    "rating": 10.0,
    "comment": "This game is perfect! The idea is unique, it's easy to learn, it's loads of fun, and there is a lot of screwage, Mwahaha! It's definitely one of my favorites. The only thing that could make it better is to make the cards color instead of black and white.",
    "timestamp": 1159221600
  }
]