[
  {
    "username": "Spielfreak",
    "rating": 1.0,
    "comment": "I've held onto this one only for the bits. I should dig it out some day and see if it's as bad as I remember -- it's probably been 20 years since I last played it. UPDATE: Yes, it is indeed bad. Roll high and you'll build a lot, roll low and you'll build squat.",
    "timestamp": 1217455200
  },
  {
    "username": "amodman",
    "rating": 2.0,
    "comment": "Boring.",
    "timestamp": 1455318000
  },
  {
    "username": "Eispirat",
    "rating": 3.0,
    "comment": "geerbt",
    "timestamp": 1749592800
  },
  {
    "username": "PBandJellyfish",
    "rating": 4.0,
    "comment": "@SC",
    "timestamp": 1760824800
  },
  {
    "username": "Indy500sr",
    "rating": 5.0,
    "comment": ".compleet\nEAN 3010005700444\nIJK2",
    "timestamp": 1758319200
  },
  {
    "username": "oldgoat3769967",
    "rating": 5.0,
    "comment": "advance to boardwalk has too much luck play and doesn't involve the player much. I wish to have played more Monopoly instead.",
    "timestamp": 1737586800
  },
  {
    "username": "j333walk",
    "rating": 6.0,
    "comment": "Has nothing to do with the original monopoly, but does have a unique gameplay.",
    "timestamp": 1727560800
  },
  {
    "username": "GuidoVanHorn",
    "rating": 5.5,
    "comment": "Better than monopoly, not terrible for the the time it was designed.",
    "timestamp": 1698444000
  },
  {
    "username": "grognard72",
    "rating": 7.0,
    "comment": "This is one of two copies currently owned.\nI have now played this a few times with the grandsons.",
    "timestamp": 1760738400
  },
  {
    "username": "PawnsandDice",
    "rating": 8.0,
    "comment": "Parker Brothers game of \"High Rises\" and \"Fast Falls\"",
    "timestamp": 1749506400
  },
  {
    "username": "DarrylFerster",
    "rating": 8.5,
    "comment": "I own 2 copies. Garage sale games, likely paid $2. I had given away a third copy to a friend. Excellent game. I wasn't expecting much from a Monopoly spin-off game, but it's fantastic.",
    "timestamp": 1423868400
  },
  {
    "username": "PhiladelphiaHipHop",
    "rating": 9.5,
    "comment": "The only simular thing with monopoly is the character Rich Uncle Pennybags! Also that you can screw over your opponent by stealing thier hotels, sort of simular how you can buy a house on a color that they were about to own all 3 on so they cant build on monopoly. I actually LOVE this game I just started playing it not too long ago and at first Its a little imtimidating, big long board a bunch of peices of hotels the whole nine. I suggest reading the directions slowly because once u get the hang of it its awesome! I cant wait to play again, I give it a 9.5, definitly 10 worthy (maybe).",
    "timestamp": 1310853600
  }
]