[
  {
    "username": "HiTracey",
    "rating": 1.0,
    "comment": "A nicely produced game, but much down time with the involvement of analytical players. Slight rules revision re catapults.\n\nComplexity - 2/10",
    "timestamp": 1695420000
  },
  {
    "username": "Gryfon",
    "rating": 1.0,
    "comment": "get catapults, win game",
    "timestamp": 1325458800
  },
  {
    "username": "Ron Smith",
    "rating": 1.0,
    "comment": "Horrible, Horrible! Ridiculous, Stupid! And those are it's good points.",
    "timestamp": 1099350000
  },
  {
    "username": "Phuntom",
    "rating": 2.0,
    "comment": "Have old 80's version of this. Catapults break too easy. Combat system was weak, but apparently fixed in the 2005 version of the game.",
    "timestamp": 1604358000
  },
  {
    "username": "SFRR",
    "rating": 1.6,
    "comment": "Great game once the combat system is modified. The original combat system is a ridiculous gambit of which player can amass more catapults more quickly and plow through the entire fractured empire unopposed.....stupid. A more Shogun-like combat system makes the game really enjoyable, and is a truly unique, enjoyable, innovative game experience. The Italia player must always go FIRST, never LAST (or they never have a chance in heck).",
    "timestamp": 1442440800
  },
  {
    "username": "A3RKev",
    "rating": 2.0,
    "comment": "Gets an 8 for components. But a miserable failing grade for the catapult rules. What's worse, the conception or how it goes unnoticed through playtesting?\nMaybe it wasn't playtested at all. Even the most obtuse gamer should see it.\nThankfully, there are alternate rules I believe.",
    "timestamp": 1397340000
  },
  {
    "username": "theagricolan",
    "rating": 3.0,
    "comment": "Some interesting ideas here, but it seems like a case of being less than the sum of it’s parts.",
    "timestamp": 1695506400
  },
  {
    "username": "catandave",
    "rating": 3.0,
    "comment": "It was alright for the first few plays. Soon, everyone realized that it was a race to purchase the most catapults and then pound each other into the ground.",
    "timestamp": 1598220000
  },
  {
    "username": "DegenerateElite",
    "rating": 3.0,
    "comment": "Terrible game.\n\nNevermind the catapults that people complain about.\n\nThe real problem is road travel being insane and the economic inflation really screws players that start to fall behind.\n\nNo incentive to build cav troops either.",
    "timestamp": 1506031200
  },
  {
    "username": "Spinoza1667",
    "rating": 4.0,
    "comment": "This was the weakest of the Gamemaster series that I played. It had a lot of good things about it, but a broken combat system. You had to have more catapults than the other guy, so there was often a cold war catapult race. Not at all thematic. This problem was fixed in the reboot.",
    "timestamp": 1482361200
  },
  {
    "username": "robf",
    "rating": 4.0,
    "comment": "Broken game. Breaking parts. Broken box.",
    "timestamp": 1473631200
  },
  {
    "username": "blockhead",
    "rating": 4.0,
    "comment": "One of the weaker of the GameMaster Series (best was Fortress America). Catapults ridiculously overpowered and limited to 20 shared between all players, so often strategy came down to picking fights just to generate casualties that you could rebuy on your own turn.\nComponents were of a brittle plastic that ended to snap off.\nRerelease edition by Eagle Games is much better",
    "timestamp": 1462140000
  },
  {
    "username": "Kalifriki",
    "rating": 5.0,
    "comment": "Nice alternative to Risk.",
    "timestamp": 1706828400
  },
  {
    "username": "Vorpa",
    "rating": 5.0,
    "comment": "Probably one of the best of the GameMaster's series as long as you fixed the catapult. For me it doesn't have the nostalgia that Axis and Allies has as I have only played it once (In the Netherlands it was hardly sold). By todays standards, apart from the obvious catapult bug, it is a bad game.",
    "timestamp": 1706310000
  },
  {
    "username": "chris_walker",
    "rating": 5.0,
    "comment": "Mibu",
    "timestamp": 1704150000
  },
  {
    "username": "mr_quadratic",
    "rating": 5.0,
    "comment": "Been a while since I played, but the catapults didn't work right",
    "timestamp": 1685224800
  },
  {
    "username": "fambans",
    "rating": 5.0,
    "comment": "Catapult arms race",
    "timestamp": 1661551200
  },
  {
    "username": "RogerDHyman",
    "rating": 5.0,
    "comment": "Rightly called \"Battle of the Catapults\", etc. The most fun part was negotiating about the fate of captured Generals . . . !\nHowever, the 2nd ed. fixed the issues, and made it a much better game.",
    "timestamp": 1609801200
  },
  {
    "username": "BreaultGamesLLC",
    "rating": 6.0,
    "comment": "Fun game but unbalanced as written. Suggest nerfing the bonus for catapults to remove a serious exploit.",
    "timestamp": 1760738400
  },
  {
    "username": "wread",
    "rating": 6.0,
    "comment": "Nostalgia",
    "timestamp": 1748210400
  },
  {
    "username": "dcpepp",
    "rating": 6.0,
    "comment": "I remember enjoying this as a pre-teen. Loaned it to a friend in 8th grade and never saw it again.",
    "timestamp": 1740351600
  },
  {
    "username": "DonJunk",
    "rating": 6.0,
    "comment": "Last Verified\nFebruary 8, 2025\n\n~$50 - $75 (several $100+)\n\n2 copies",
    "timestamp": 1739055600
  },
  {
    "username": "bishop026",
    "rating": 6.0,
    "comment": "Fun for what it was back in the day but dated compared to the competition these days.",
    "timestamp": 1720044000
  },
  {
    "username": "ppsacco",
    "rating": 6.0,
    "comment": "an UPGRADE to a stand by...Risk. Risk with money...I love this game. The roads also add a nice kick to the combat.",
    "timestamp": 1661810400
  },
  {
    "username": "Erstwhileranger",
    "rating": 6.5,
    "comment": "Usually play with one catapult per legion and Mike Montesa's 1:1 screening suggestion (catapults that aren't screened by friendly infantry or cavalry can be destroyed on a 4+).",
    "timestamp": 1732575600
  },
  {
    "username": "gizmobj",
    "rating": 7.0,
    "comment": "wish I still had a copy for posterity.",
    "timestamp": 1684188000
  },
  {
    "username": "rlowke",
    "rating": 7.0,
    "comment": "One of the MB large format (\"Gamemaster\") series from the 80s. It was much liked until it was discovered that the catapult rules were broken. The player with the most catapults wins. Since then, the catapult rule has been fixed in a new edition, and I understand that it's still a good game.",
    "timestamp": 1679526000
  },
  {
    "username": "4ndroid",
    "rating": 8.0,
    "comment": "$99",
    "timestamp": 1651096800
  },
  {
    "username": "Harlowe Thrombey",
    "rating": 8.0,
    "comment": "Need to get another copy, loved this game back in the day.",
    "timestamp": 1533160800
  },
  {
    "username": "Rebbon_71",
    "rating": 8.0,
    "comment": "Great design for its time, and still fun.",
    "timestamp": 1517439600
  },
  {
    "username": "B2UGArt",
    "rating": 9.0,
    "comment": "Just a fantastic strategy game. Takes awhile to play, but if you love history, or have ever taken Latin in school, this is highly enjoyable experience.",
    "timestamp": 1620165600
  },
  {
    "username": "Woofalot",
    "rating": 8.6,
    "comment": "$55",
    "timestamp": 1588284000
  },
  {
    "username": "teamxavier",
    "rating": 9.0,
    "comment": "Catapults unbalance the game and require a house rule to limit their effectiveness but other than that simple and very fun play",
    "timestamp": 1515020400
  },
  {
    "username": "dragon76n",
    "rating": 10.0,
    "comment": "This is really my favorite game. I understand why people have a problem with this game and I usually played using modified rules when I've played in recent years. Nostalgia helps push this to the top for me because I learned to play this with my uncle when I was young.",
    "timestamp": 1747260000
  },
  {
    "username": "xlegion",
    "rating": 10.0,
    "comment": "I've played a lot of the grand strategy ancients games, including all the versions of 'Imperium Romanum' and many others. This game is just plain 'fun' and that's all there is to it.\n\nIt is simple and less cumbersome than all of the other games that I have played. Sure, these other games are more 'historical' but I'm finding that the path to victory is usually the same in ALL of these games.\n\nBy that I mean, what happens is usually two parties make a gigantic army, have one big battle where one side is annihilated and then 'that's that'. The game is virtually over.\n\nIs that historical? Yes, often it is. The Ancient world was often like that. One big battle decided it all. \"Charonea\", \"Guagamela\", \"Actium\", \"Pharsalus\" and so on.\n\nSo, I can spend hours setting up a large scenario from \"Imperium Romanum\" and taking at least that long to play it and the 'decisive' point of the game is always the same. One big battle where one side is destroyed.\n\nI find, that I can achieve almost the same results playing this game in a multi-player environment where everyone has fun.",
    "timestamp": 1745359200
  },
  {
    "username": "Timothee",
    "rating": 10.0,
    "comment": "Simply beautiful and fun",
    "timestamp": 1504130400
  }
]