{
    "id": 462,
    "name": "Esels-Rennen",
    "yearpublished": "1989",
    "minplayers": "2",
    "maxplayers": "6",
    "minplaytime": "15",
    "maxplaytime": "15",
    "age": "8",
    "description": "First issued in 1989 for fewer players, the second edition (released in 1996) is for 2-6 players. The board has two sides, for racing either 3 or 4 colored donkeys. Players are given a card secretly, each showing the donkey's finishing order, a different result for each card. The board shows a patchwork of steps across a field from start to finish, each space with a colored arrow matching the donkeys. When you move a donkey onto a space marked with a green arrow pointing left, you then move the green donkey one space that way. If that space then has a blue arrow pointing right, you next move the blue donkey on one space that way. This goes on until you cannot move the final donkey because it is blocked. Eventually, the donkeys cross the finish line, and the player with the best matching result on their card wins. More of a competitive puzzle than a game, it is a nice diversion, but awkward because the donkeys constantly fall on their sides. Possibly Doris &amp; Frank&#039;s first game and related to their Bunny Zick-Zack.<br/><br/>3rd Place 1989 Hippodice Spieleautorenwettbewerb (as Donky [sic]).<br/><br/>",
    "image": "https://cf.geekdo-images.com/n2vcMAzm9B5zOU1iQcXZIA__original/img/CoZEwR3JhGmMbVevP-nulxAZiHs=/0x0/filters:format(jpeg)/pic293868.jpg",
    "thumbnail": "https://cf.geekdo-images.com/n2vcMAzm9B5zOU1iQcXZIA__small/img/arFnpbNJbR9Ss3-rsnT0I0oaP3U=/fit-in/200x150/filters:strip_icc()/pic293868.jpg",
    "publishers": [
        "Doris & Frank"
    ],
    "designers": [
        "Doris Matthäus",
        "Frank Nestel"
    ],
    "artists": [
        "Doris Matthäus"
    ],
    "classifications": {
        "mechanics": [
            "Betting and Bluffing"
        ],
        "categories": [
            "Animals",
            "Racing"
        ],
        "families": [
            "Animals: Donkeys"
        ]
    }
}