{
    "id": 420,
    "name": "Rail Baron",
    "yearpublished": "1977",
    "minplayers": "3",
    "maxplayers": "6",
    "minplaytime": "180",
    "maxplaytime": "240",
    "age": "10",
    "description": "Rail Baron is one of the earlier train games - boardgames with a railroad theme.<br/><br/>Players move trains along historical USA railroad lines and collect delivery payoffs. They compete to purchase the railroads in order to assemble a network that gives access to important map destinations while simultaneously trying to prevent their opponents from doing so.<br/><br/>From the Box (Avalon Hill Bookshelf Game)<br/>Only in America!<br/><br/>You are living in the heyday of the locomotive. You are Jay Gould. And you have just added another railroad to your vast railroad empire. Flushed with success, you now retire to the sartorial splendor of your very own Pullman Palace Car. The dream ends. You awaken to reality with the thought... &quot;just another fantasy.&quot; Ahh, but for the grace of Avalon Hill, you dream continues.<br/><br/>Here, in Rail Baron, you become a latter day Gould, or a Cornelius Vanderbilt, or any of those menacingly infamous moguls whose wizardry and acumen established the criteria for which business success was to be judged in decades to come.<br/><br/>Rail Baron is played on a large board of the United States RR network. in fact, it comes in three separate boards. Laid end to end, it spell out America and portrays the 28 major rail lines and major cities they connected during the halcyon days of railroading.<br/><br/>You start with $20,000 - and a train. You make money on trips from city to city. Pretty soon you've got enough money to build up your empire (you can buy the B&amp;O and C&amp;O for just $44,000). More holdings bring more money your way (track rental) from your opponents.<br/><br/>With many new nuances of strategy, it becomes a game where fortunes see-saw until the last rail baron is bankrupt - or has accumulated the $200,000 needed to win.<br/><br/>All of this may take 3 to 4 hours. But it's great fun for 3 to 6 people, ages 10 &amp; up.<br/><br/>",
    "image": "https://cf.geekdo-images.com/cKhELVLlWPp7FU4mOQx2SA__original/img/hEtqk-JyDHjSTs3hUY_XBzzBaAQ=/0x0/filters:format(jpeg)/pic292230.jpg",
    "thumbnail": "https://cf.geekdo-images.com/cKhELVLlWPp7FU4mOQx2SA__small/img/cQNPUgn6TM5RGdCKEdE4c0hDPp0=/fit-in/200x150/filters:strip_icc()/pic292230.jpg",
    "publishers": [
        "The Avalon Hill Game Co"
    ],
    "designers": [
        "R. S. Erickson",
        "Thomas F. Erickson, Jr."
    ],
    "artists": [],
    "classifications": {
        "mechanics": [
            "Roll / Spin and Move"
        ],
        "categories": [
            "Economic",
            "Trains",
            "Transportation"
        ],
        "families": []
    }
}