{
    "id": 185,
    "name": "Devil Bunny Needs a Ham",
    "yearpublished": "1998",
    "minplayers": "2",
    "maxplayers": "5",
    "minplaytime": "30",
    "maxplaytime": "30",
    "age": "8",
    "description": "In this wacky Cheapass title, players are Sous Chefs trying to get to the top floor of a skyscraper by scaling the outside.  However the maniacal Devil Bunny is hopping about in a mad lust for blood thinking he'll get a ham by knocking you off.  Yeah, right, whatever.<br/><br/>The game board is a rectangular grid representing the side of a building, with the starting space at the bottom, and the goal at the top. There is a dotted line near the top that represents a critical height (see below). Furthermore, there are special spaces on the sides of the buildings that represent &quot;fear&quot; that cannot be moved into (As a show of Cheapass Games' signature humor, these fears included &quot;spiders&quot; and &quot;Wesley Snipes.&quot;)<br/><br/>In the basic game, each player controls two sous-chefs; on each turn, the player rolls two six-sided dice. Any roll other than a 6 can be used to move one or both sous-chefs up the side of the building, either horizontally or on upwards diagonals (a player cannot voluntarily move down the building). If a 6 is rolled, the Devil Bunny token is moved to the highest sous-chef on the board and knocks him off; if there is a sous-chef vertically below the one that was knocked off, the player controlling that one may opt to catch the falling sous-chef, placing the token in the spaces immediately below him. If no player that is able to catch the sous chef offers to help, the chef will crash to the ground. If the chef fell from a height below the marked line on the board, the chef is safe but must restart him climb back from the start. However, if the chef was above this line, the chef is dead, leaving the player with one fewer token to win. The players earn points for the order in which their chefs arrive at the top, and the weighting is such that a player with second and third-place chefs can beat a player with a first-place and a dead (non-scoring) chef.<br/><br/>Variants include ignoring the effects of the fear spaces (which normally cluster the players into the center columns), and using 3 sous-chef tokens for each player.<br/><br/>",
    "image": "https://cf.geekdo-images.com/w56psT-g5Dh5d3HUmtAVeA__original/img/HATThhs_EoZQp6KCC9QWYPzHamQ=/0x0/filters:format(jpeg)/pic6511187.jpg",
    "thumbnail": "https://cf.geekdo-images.com/w56psT-g5Dh5d3HUmtAVeA__small/img/0Uv-QJU8tdZBEWn9U6hnGSrhLvs=/fit-in/200x150/filters:strip_icc()/pic6511187.jpg",
    "publishers": [
        "Cheapass Games",
        "Greater Than Games, LLC"
    ],
    "designers": [
        "James Ernest"
    ],
    "artists": [
        "Scott M. Brown"
    ],
    "classifications": {
        "mechanics": [
            "Grid Movement",
            "Race",
            "Roll / Spin and Move",
            "Take That"
        ],
        "categories": [
            "Abstract Strategy",
            "Dice",
            "Print & Play"
        ],
        "families": [
            "Animals: Rabbits / Hares",
            "Components: Dice with Icons",
            "Components: Miniatures",
            "Crowdfunding: Kickstarter"
        ]
    }
}