{
    "id": 63,
    "name": "Samurai: Game of Politics and Warfare in Feudal Japan",
    "yearpublished": "1979",
    "minplayers": "2",
    "maxplayers": "8",
    "minplaytime": "180",
    "maxplaytime": "180",
    "age": "12",
    "description": "(from the back of the box:)<br/><br/>You are now back in time-12th through 17th century Japan, to be exact. Your objective: the exalted title of &quot;Shogun&quot;. As &quot;Shogun&quot;, you will have the right to enforce the emperor's will, and become the real ruler of Japan.<br/><br/>Samurai allows you to take control of Japan. In medieval Japan, the central government of the emperor was dissolved. He become a powerless figurehead while various clans competed to take control of the country. <br/>These clans were similar to the noble houses of Europe; and their leaders the equivalent of medieval Dukes, Barons, Counts, and the like. <br/>Using formldable samurai warriors, the clans waged endless wars across the major islands of the Japanese archipelago.<br/><br/>Concept of Play <br/>Each player controls a clan, with one or more lords. Each lord has a province representing his personal &quot;fief&quot; or home, and often has additional holdings of troops, titles, ships, castles, and more provinces.<br/><br/>The game is played in 20 turns, each representing a pace of historical events running between a few months to a few years. In each turn, moves are conducted on a mapboard that portrays the three major islands of Japan.<br/><br/>The playing pieces-360 in all-include Samurai Lords, clan control markers, holdings and title counters, troops, garrisons, and more; all explained in the easy&shy; to-follow prose of the 18-page rules folder.<br/><br/>Many Games in One <br/>An excellent game for 2 to 8 players. Samurai is suitable for beginning and intermedlate play, with plenty of optional rules and strategic options for even the expert. And for the really hard-core power-politics fanatics, special rules create a nearly &quot;perpetual&quot; game representing tho true ebb and flow of Japanese feudal confilct. <br/>Samurai includes a variety of playing aids to make learning and playing the game truly an effortless task. The rules manual contains historical background and designer's notes that offer the player the full flavor and authenticity of what medieval conflict was all about in the age of the &quot;Shogun&quot; struggles.<br/><br/><br/>(BGG description:)<br/><br/>Samurai is a game about warfare and politics in feudal Japan. The aim of the game is to gain the title &quot;Shogun&quot; by game end. To become Shogun, the player has to gain control of two out of four Imperial Articles scattered across the mapboard. These are: the Emperor, The Heir, The Imperial Regalia and Kyoto Castle.<br/><br/>Playing pieces are the samurai lords of various houses. Each lord has a home province which provides him with troops. Additional troops may be added through offices, other provinces, castles, etc.<br/><br/>",
    "image": "https://cf.geekdo-images.com/cwU7yMp2ISonhEzJ5ZNmqw__original/img/_7X04AHX3fIpgzg1C-AVtz_OIFs=/0x0/filters:format(jpeg)/pic245105.jpg",
    "thumbnail": "https://cf.geekdo-images.com/cwU7yMp2ISonhEzJ5ZNmqw__small/img/z1jj4FFfucQtIQQ-4ftcQWJkKnQ=/fit-in/200x150/filters:strip_icc()/pic245105.jpg",
    "publishers": [
        "The Avalon Hill Game Co",
        "Battleline"
    ],
    "designers": [
        "Dan Campagna"
    ],
    "artists": [
        "Steve Burnett",
        "Arnold Hendrick"
    ],
    "classifications": {
        "mechanics": [
            "Area Movement",
            "Dice Rolling",
            "Movement Points",
            "Ratio / Combat Results Table",
            "Simulation",
            "Turn Order: Progressive"
        ],
        "categories": [
            "Medieval",
            "Political",
            "Wargame"
        ],
        "families": [
            "Components: Map (Continental / National scale)",
            "Country: Japan",
            "History: Kamakura Period to Muromachi Period",
            "History: Sengoku Period"
        ]
    }
}