{
    "id": 254,
    "name": "Empires in Arms",
    "yearpublished": "1983",
    "minplayers": "2",
    "maxplayers": "7",
    "minplaytime": "120",
    "maxplaytime": "12000",
    "age": "14",
    "description": "(from the back of the box - Avalon Hill edition:)<br/><br/>&quot;Empires in Arms&quot; is a board-wargame covering the major elements of diplomacy and warfare during the Napoleonic Wars of 1805-1815. <br/>YOU, as a player, are the absolute monarch of a major European power (Austria, France. Great Britain. Prussia. Russia, Spain or Turkey) and guide that nation through the maze of conflicting interests and ambitions that characterized Napoleonic Europe. <br/>Each major power has its own individual economic; military and geographic advantages and disadvantages. <br/>Players negotiate alliances. dictate peace treaties. administer conquests and conduct warfare on land and sea by maneuvering corps and fleets in the constant struggle for survival and prestige.<br/><br/>&bull; Numerous Scenarios : These vary in size and length from the four-Turn. two-player 1805 Scenario to the 132 Turn, seven-player Grand Campaign Game (1805-1815).<br/><br/>&bull; Great Military Leaders : Napoleon of France. Nelson of Great Britain. Blucher of Prussia. Prince Charles of Austria and many, many more<br/><br/>&bull; Uncontrolled Major Powers : Rules that allow the realistic use of extra major powers in campaign games when less than seven players are available<br/><br/>&bull; Unique Combat Systems : Land combat takes into account the effects of leadership, grand-tactics and the numbers, morale and types of troops present. Sieges include stormings and sorties. Sea commanders try to hold the &quot;wind-gauge&quot;. Massed shore batteries protect harbors from blockading enemy fleets.<br/><br/>&bull; Economic System : Money and manpower availability from home provinces and conquests determine recruiting and national strength.<br/><br/>CONTENTS:<br/>1008 Die-Cut Counters<br/>Two 25&quot; by 35&quot; mapboard<br/>1 Rulebook<br/>2 Dice<br/>1 Double sided Display Charts/Forms<br/>2 Identical Double sided Charts/tables reference page<br/>7 National Cards<br/><br/><br/>(BGG description :)<br/><br/>A board-game covering the major elements of diplomacy and warfare during the Napoleonic Wars of 1805-1815. Each player is absolute monarch of one of the major powers(England, France, Austria, Russia, Prussia, Spain and Turkey).  The full game lasts 132 turns 1 for each month approx playing time is 100-150 hours. Each month is split into 4 phases:<br/><br/><br/>     The Diplomatic phase where players negotiate deals, forge alliances etc. <br/>     The Reinforcement phase where each player in sequence adds reinforcements due. <br/>     The Naval phase each player conducts naval moves in sequence.<br/>     The Land phase where each player moves and fights with his armies in sequence. <br/><br/><br/>And then every third month an additional phase is added:<br/><br/><br/>     The Economic phase, which is where players collect resources and purchase future reinforcements. <br/><br/><br/>To win the game each nation needs to amass victory points these are scored in the economic phase and are based on your nations political status. As status always gravitates to a central position players must continually &quot;politik&quot; to reach their goal.<br/><br/>",
    "image": "https://cf.geekdo-images.com/jaeUmGmOuicA5q3Il4Mb2w__original/img/ERxKg9p0v1zlZPcZSJFkBWafbW4=/0x0/filters:format(jpeg)/pic3651485.jpg",
    "thumbnail": "https://cf.geekdo-images.com/jaeUmGmOuicA5q3Il4Mb2w__small/img/2nc_sI5TSGwPWke1RwpZfqh6sT4=/fit-in/200x150/filters:strip_icc()/pic3651485.jpg",
    "publishers": [
        "Australian Design Group",
        "The Avalon Hill Game Co"
    ],
    "designers": [
        "Greg Pinder",
        "Harry Rowland"
    ],
    "artists": [
        "Michael Fisher",
        "Charles Kibler",
        "George I. Parrish, Jr."
    ],
    "classifications": {
        "mechanics": [
            "Area Movement",
            "Dice Rolling",
            "Movement Points",
            "Scenario / Mission / Campaign Game",
            "Secret Unit Deployment",
            "Simulation",
            "Variable Player Powers",
            "Variable Set-up"
        ],
        "categories": [
            "Economic",
            "Napoleonic",
            "Negotiation",
            "Political",
            "Wargame"
        ],
        "families": [
            "Components: Map (Continental / National scale)",
            "Continents: Europe",
            "Country: Austria",
            "Country: France",
            "Country: Ottoman Empire",
            "Country: Prussia",
            "Country: Russia",
            "Country: Spain",
            "Country: United Kingdom",
            "History: Napoleonic Wars"
        ]
    }
}