{
    "id": 289,
    "name": "Chariot Lords",
    "yearpublished": "1999",
    "minplayers": "3",
    "maxplayers": "4",
    "minplaytime": "360",
    "maxplaytime": "360",
    "age": "12",
    "description": "Between 1500 and 600 BC, Asia Minor and the Mediterranean witnessed the rise and fall of several mighty empires. Often the birth of one empire precipitated the death of another. How could a small people like the Judeans establish an empire when located between such giants as Egypt and Assyria? Why did some Empires endure for centuries while others lasted only a few generations? Chariot Lords shows you the how and why.<br/><br/>Each Lord controls between 5 and 6 nations, some strong, others weak, each with varying goals and objectives - indeed some of these countries may not even exist at the same time. Players compete against one another to achieve the victory criteria for their empires. Nations quickly become rivals, involving them in death struggles over expansion. Each turn (90 years) will see new countries come to the fore, while established empires struggle to levy reinforcements and arrange alliances. A fine line must be walked between conserving one's forces and expanding one's empire. Too much expansion will see your resources spread thin and possibly swept away by a new emerging empire, but not enough aggression will see your empire fail to garner sufficient victory points to win.<br/><br/>Armies are of a mix of foot and mounted units, along with the occasional leader of note. It is not enough to conquer -- you must be able to keep what you have taken. The winner will be the one who has the most victory points after all the armies have had their moment on the stage. It is up to you to determine whether your empire will be relegated to the dustbin of history, or whether others will hail you as...The Chariot Lord.<br/><br/>Contents: <br/><br/>    8 pages of Rules, 4 of notes and commentary <br/>    1 hard-backed map <br/>    140 3/4 inch square counters/markers <br/>    170 5/8 inch square counters <br/>    4 victory point charts with combat charts on reverse <br/>    4 nation force arrival charts <br/>    1 master nation force arrival chart<br/><br/><br/>",
    "image": "https://cf.geekdo-images.com/lNaJapx0qSHzHHVB6Ee3MQ__original/img/LhxNowLaXNZQNs0IZzKh9VfzgtM=/0x0/filters:format(jpeg)/pic64656.jpg",
    "thumbnail": "https://cf.geekdo-images.com/lNaJapx0qSHzHHVB6Ee3MQ__small/img/3QB9yRKu_WlC3RwE6Ckcv9qTpIc=/fit-in/200x150/filters:strip_icc()/pic64656.jpg",
    "publishers": [
        "Clash of Arms Games",
        "Tilsit"
    ],
    "designers": [
        "Charles Vasey"
    ],
    "artists": [
        "Greg Cervall"
    ],
    "classifications": {
        "mechanics": [
            "Area Movement",
            "Dice Rolling",
            "Simulation",
            "Variable Player Powers"
        ],
        "categories": [
            "Ancient",
            "Territory Building",
            "Wargame"
        ],
        "families": [
            "Ancient: Egypt",
            "Ancient: Mesopotamia",
            "Components: Map (Continental / National scale)",
            "History: Wars in the Ancient Near East",
            "Region: Middle East",
            "Series: Britannia Game System"
        ]
    }
}