{
    "id": 478,
    "name": "Citadels",
    "yearpublished": "2000",
    "minplayers": "2",
    "maxplayers": "8",
    "minplaytime": "20",
    "maxplaytime": "60",
    "age": "10",
    "description": "In Citadels, players take on new roles each round to represent characters they hire in order to help them acquire gold and erect buildings. The game ends at the close of a round in which a player erects his/her eighth building. Players then tally their points, and the player with the highest score wins.<br/><br/>Players start with a number of building cards in their hand; buildings come in five colors, with the purple buildings typically having a special ability and the other colored buildings providing a benefit when you play particular characters. At the start of each round, the player who was king the previous round discards one of the eight character cards at random, chooses one, then passes the cards to the next player, etc. until each player has secretly chosen a character. Each character has a special ability, and the usefulness of any character depends upon your situation, and that of your opponents. The characters then carry out their actions in numerical order: the assassin eliminating another character for the round, the thief stealing all gold from another character, the wizard swapping building cards with another player, the warlord optionally destroys a building in play, and so on.<br/><br/>On a turn, a player earns two or more gold (or draws two building cards then discards one), then optionally constructs one building (or up to three if playing the architect this round). Buildings cost gold equal to the number of symbols on them, and each building is worth a certain number of points. In addition to points from buildings, at the end of the game a player scores bonus points for having eight buildings or buildings of all five colors.<br/><br/>The expansion Citadels: The Dark City was initially released as a separate item, but the second edition of the game from Hans im Gl&uuml;ck (packaged in a tin box) and the third edition from Fantasy Flight Games included this expansion and can be recognized by its rectangular box (not square). With Dark City, Citadels supports a maximum of eight players.<br/><br/>",
    "image": "https://cf.geekdo-images.com/42iW4E-vOumFXRQAiSf-GA__original/img/ochY5pK4sq4vtzkka0OPRwsGLOE=/0x0/filters:format(jpeg)/pic3239104.jpg",
    "thumbnail": "https://cf.geekdo-images.com/42iW4E-vOumFXRQAiSf-GA__small/img/lxwVwqIO1RkDyyykSDFnpmwbgyI=/fit-in/200x150/filters:strip_icc()/pic3239104.jpg",
    "publishers": [
        "Hans im Glück",
        "999 Games",
        "Arclight Games",
        "Brain Games",
        "cutia.ro",
        "Delta Vision Publishing",
        "E L & M Productions",
        "Edge Entertainment",
        "Enigma (Bergsala Enigma)",
        "Fantasiapelit",
        "Fantasy Flight Games",
        "Fantasy Shop",
        "Galakta",
        "Galápagos Jogos",
        "Giochi Uniti",
        "Hobby World",
        "Houpaa",
        "KADABRA",
        "Kaissa Chess & Games",
        "Korea Boardgames",
        "Laser plus",
        "Midgaard Games",
        "Millenium",
        "MINDOK",
        "MultiSim",
        "Nexus Editrice",
        "Schmidt Spiele",
        "Siam Board Games",
        "Silver Stars Publishing",
        "Smart Ltd",
        "Swan Panasia Co., Ltd.",
        "Windrider Games",
        "Z-Man Games",
        "Ігромаг"
    ],
    "designers": [
        "Bruno Faidutti"
    ],
    "artists": [
        "Cyrille Daujean",
        "Julien Delval",
        "Jesper Ejsing",
        "Bruno Faidutti",
        "Didier Graffet",
        "Bjarne Hansen",
        "Darrell Hardy",
        "Florence Magnin",
        "Jean-Louis Mourier",
        "Scott Nicely",
        "Hassan Nozadian",
        "Christian T. Petersen",
        "Brian Schomburg",
        "Richard Spicer"
    ],
    "classifications": {
        "mechanics": [
            "Action Drafting",
            "Closed Drafting",
            "Income",
            "Lose a Turn",
            "Set Collection",
            "Take That",
            "Turn Order: Role Order",
            "Variable Player Powers"
        ],
        "categories": [
            "Bluffing",
            "Card Game",
            "City Building",
            "Deduction",
            "Fantasy",
            "Medieval"
        ],
        "families": [
            "Digital Implementations: Board Game Arena",
            "Digital Implementations: BrettspielWelt",
            "Digital Implementations: VASSAL",
            "Game: Citadels",
            "Mechanism: Tableau Building",
            "Misc: Dice Tower Hall of Fame",
            "Misc: Watch It Played How To Videos",
            "Players: Games with expansions that change player count",
            "Series: Fantasy Flight Silver Line"
        ]
    }
}