{
    "id": 91,
    "name": "Paths of Glory",
    "yearpublished": "1999",
    "minplayers": "2",
    "maxplayers": "2",
    "minplaytime": "480",
    "maxplaytime": "480",
    "age": "14",
    "description": "(from GMT Games' website:)<br/><br/>They called it the Great War. In over four years of titanic struggle, the ancient Europe of Kings and Emperors tore itself to pieces, giving birth to our own violent modern age. The bloody battles fought in the trenches of the Western Front, the icy plains of Poland, the mountains of the Balkans, and the deserts of Arabia, shaped the world we know today. We are all orphans of the Great War.<br/><br/>Paths of Glory: The First World War, designed by six-time Charles S. Roberts awards winner, Ted Raicer, allows players to step into the shoes of the monarchs and marshals who triumphed and bungled from 1914 to 1918. As the Central Powers you must use the advantage of interior lines and the fighting skill of the Imperial German Army to win your rightful 'place in the sun.' As the Entente Powers (Allies) you must bring your greater numbers to bear to put an end to German militarism and ensure this is the war 'to end all wars.' Both players will find their generalship and strategic abilities put to the test as Paths of Glory's innovative game systems let you recreate all the dramatic events of World War I.<br/><br/>Components:<br/><br/>     316 full-color die-cut counters:<br/>         176 5/8&rdquo; die cut counters<br/>         140 1/2&rdquo; die cut counters<br/>    <br/>     One 22x34&quot; full-color mapsheet showing most of Europe and the Near East<br/>     110 Strategy Cards<br/>     32-page Rule Book including sample game replay (21 pages of actual rules)<br/>     Two Player Reference Cards <br/><br/><br/>DESIGNER: Ted Raicer<br/>DEVELOPER: Andy Lewis<br/>ART DIRECTOR: Rodger B. MacGowan<br/>MAP ART: Mark Simonitch<br/>CARDS &amp; COUNTER ART: Mark Simonitch<br/><br/><br/>(BGG description:)<br/><br/>Following in the footsteps of We the People, Hannibal: Rome vs. Carthage, Successors: The Battles for Alexander's Empire (First/Second Edition), and For the People, Paths of Glory utilizes a similar card-driven system.  The game covers WWI from its outbreak to American intervention and spans all of Europe and the Middle East.  Not only is the game innovative, but it also plays fast, usually within just an evening.<br/><br/>While the game itself has all of the normal expectations of a wargame, with various units, CRT charts and period chrome, at heart the game rests within the card play.  Players are given a hand of cards to play out six sub-phases of a turn.  Each sub-phase allows for the use of a card or a pass with a minimal movement of units.  Each card has four possible uses: operational movement, strategic movement, special events, and replacement points.  The cardplay forces players to constantly make tough decsions as they feel that they need to do a little bit of everything but they can only do one thing at a time.  How you play your cards will decide to a large degree the outcome of the war.<br/><br/>",
    "image": "https://cf.geekdo-images.com/Ip4TygnwFxuR57Vky9ZeZA__original/img/MP1e5GdDAT-4QO734-n8_rUkMv8=/0x0/filters:format(jpeg)/pic4490515.jpg",
    "thumbnail": "https://cf.geekdo-images.com/Ip4TygnwFxuR57Vky9ZeZA__small/img/6yGJ8gs7e_WwYJc5Y7pXgTBFxF8=/fit-in/200x150/filters:strip_icc()/pic4490515.jpg",
    "publishers": [
        "GMT Games",
        "Devir",
        "DiceTree Games",
        "GaGa Games",
        "Udo Grebe Gamedesign",
        "Wargames Club Publishing",
        "Wydawnictwo Gołębiewski"
    ],
    "designers": [
        "Ted Raicer"
    ],
    "artists": [
        "Charles Kibler",
        "Terry Leeds",
        "Rodger B. MacGowan",
        "Mark Simonitch"
    ],
    "classifications": {
        "mechanics": [
            "Campaign / Battle Card Driven",
            "Dice Rolling",
            "Point to Point Movement"
        ],
        "categories": [
            "Wargame",
            "World War I"
        ],
        "families": [
            "Continents: Europe",
            "Country: France",
            "Digital Implementations: Rally the Troops",
            "Digital Implementations: Tabletopia",
            "Misc: Dice Tower Hall of Fame",
            "Misc: LongPack Games",
            "Players: Games with expansions that add solo play",
            "Players: Two-Player Only Games",
            "Region: Middle East",
            "War Level of Command: Strategic"
        ]
    }
}