{
    "id": 1,
    "name": "Die Macher",
    "yearpublished": "1986",
    "minplayers": "3",
    "maxplayers": "5",
    "minplaytime": "240",
    "maxplaytime": "240",
    "age": "14",
    "description": "Die Macher is a game about seven sequential political races in different regions of Germany. Players are in charge of national political parties, and must manage limited resources to help their party to victory. The winning party will have the most victory points after all the regional elections. There are four different ways of scoring victory points. First, each regional election can supply one to eighty victory points, depending on the size of the region and how well your party does in it. Second, if a party wins a regional election and has some media influence in the region, then the party will receive some media-control victory points. Third, each party has a national party membership which will grow as the game progresses and this will supply a fair number of victory points. Lastly, parties score some victory points if their party platform matches the national opinions at the end of the game.<br/><br/>The 1986 edition featured four parties from the old West Germany and supported 3-4 players. The 1997 edition supports up to five players in the re-united Germany and updated several features of the rules as well.  The 2006 edition also supports up to five players and adds a shorter five-round variant and additional rules updates by the original designer.<br/><br/>",
    "image": "https://cf.geekdo-images.com/rpwCZAjYLD940NWwP3SRoA__original/img/yR0aoBVKNrAmmCuBeSzQnMflLYg=/0x0/filters:format(jpeg)/pic4718279.jpg",
    "thumbnail": "https://cf.geekdo-images.com/rpwCZAjYLD940NWwP3SRoA__small/img/YT6svCVsWqLrDitcMEtyazVktbQ=/fit-in/200x150/filters:strip_icc()/pic4718279.jpg",
    "publishers": [
        "Hans im Glück",
        "Moskito Spiele",
        "Ediciones MasQueOca",
        "Portal Games",
        "Spielworxx",
        "sternenschimmermeer",
        "Stronghold Games",
        "Valley Games, Inc.",
        "YOKA Games"
    ],
    "designers": [
        "Karl-Heinz Schmiel"
    ],
    "artists": [
        "Bernd Brunnhofer",
        "Marcus Gschwendtner",
        "Harald Lieske"
    ],
    "classifications": {
        "mechanics": [
            "Alliances",
            "Area Majority / Influence",
            "Auction / Bidding",
            "Dice Rolling",
            "Hand Management",
            "Simultaneous Action Selection"
        ],
        "categories": [
            "Economic",
            "Negotiation",
            "Political"
        ],
        "families": [
            "Country: Germany",
            "Digital Implementations: VASSAL",
            "Political: Elections",
            "Series: Classic Line (Valley Games)"
        ]
    }
}