{
    "id": 280,
    "name": "Neue Spiele im alten Rom",
    "yearpublished": "1994",
    "minplayers": "2",
    "maxplayers": "7",
    "minplaytime": "20",
    "maxplaytime": "60",
    "age": "10",
    "description": "Neue Spiele im Alten Rom (or New Games in Old Rome (NGIOR)) is a compendium of games from Reiner Knizia. In the box are fourteen games themed on ancient Rome. The games are themed to cover, albeit in a highly abstract fashion, the rise of Rome, the Roman Republic and finally, the Empire.<br/><br/>(7 of the games are described below)<br/><br/>The Wheel of History : 2-5 players<br/><br/>This is an early version of what was to become Bunte Runde. 25 cards are laid out in a large circle, representing the tribes to be united under early Rome. Players may advance a pawn one, two or three spaces forwards and collect a card. Cards are scored on face value, but there are some quirks that vary this.<br/><br/>The Seven Hills of Rome : 2 players<br/><br/>This is one of the easier games in the compendium. The theme here is you are battling your opponent for control of the seven hills of Rome. The hills are represented by seven cards, numbered 1 to 7, laid out between the players. Cards are played from a hand against the 'hills' in an attempt to influence them to your side. You sum the hills you control at the end of the game, and the highest total wins.<br/><br/>Mercator : 3-7 players<br/><br/>This game is Medici&#039;s ancestor. It is a simplified version of Medici, with the chief differences being you can hold six cards on your ship, and you are competing for highest value totals only. The number of each suit taken is meaningless, except in a variant where you get paid a bonus if you get one of each. The game lasts only one round. Medici is worth purchasing on its own, but this is still worth a look.<br/><br/>Imperium : 3-5 players<br/><br/>The aim is to earn points for control of each of the 9 areas on the board. The game lasts 9 turns, and at the end of each turn, the area matching the turn number is evaluated for control and points are awarded. On your turn, 3 cards are revealed simultaneously. These cards are numbered 1 to 9, with 2 additional banner cards. The numbers correspond to the areas you want to place control markers into. The banner cards indicate you want one or two extra chips placed in the indicated area. After control markers are placed, the current turn's area is evaluated - points being awarded to the winner and perhaps the second and third places as well. After 9 turns, the player with the most points wins. As you progress, the points awarded for each area increases, giving a nice feeling of acceleration.<br/><br/>Senator : 2-3 players<br/><br/>You play a Roman faction trying to position your people (a hand of cards) into the senate. They can only get their via the senate steps. The board is a grid of 5x5 spaces, The 9 spaces in the center are the senate, while 12 of the remaining 16 are the steps spaces that run around the perimeter of the senate. Cards are placed initially on the steps, and then pushed into the senate by placing more cards on the steps.<br/><br/>Circus Maximus : 3-5 players<br/><br/>A simple chariot racing game where players are competing to be the first to get their team of three chariots around the hex map circuit and onto the podium. Each player has a set of cards face up in front of them, numbered 1 to 5. To move a chariot they select up to three cards per chariot which that is the movement allowance for that piece. The movement off each card must be in a straight line, so some rather clumsy cornering ability is built into the game. Cards used by a chariot are turned face down, becoming unavailable for the other chariots still to move. Each chariot must be moved at least once per turn, if possible. Therefore, the trick is to maximize your movement with your 15 points each turn.<br/><br/>Consul : 2-4 players<br/><br/>This is an intriguing memory game, that, like most of the games in this compendium, have a hard time being fitted into a theme! Twenty-five cards are turned face down in a grid. Players start the game each holding three cards in their hand. On their turn, players make a bid to take a turn. The highest bid gets to turn up cards until they choose to finish, or make a mistake. Cards in a set can be of the same value, or same color, or both. The value of the set must equal of exceed the bid made, simply by summing the face values of the cards. If a mistake is made, the cards are turned face down, and the player must discard a card from their hand into the grid. If the bid is made, the cards are taken into the players hand. At the end of the game, the highest total held wins.<br/><br/>--<br/><br/>Translated rulebook to the contrary, this game has never been published by an English publisher.<br/><br/>Note: 3 of these have been printed/repackaged in English by GMT in Rome: Imperium, Circus Maximus, Hannibal vs Rome.<br/><br/>",
    "image": "https://cf.geekdo-images.com/kmz-TihAsXAjDrvH9zu8ew__original/img/1OZw4amwy5NlZkaaCf5euhW6HSo=/0x0/filters:format(jpeg)/pic756525.jpg",
    "thumbnail": "https://cf.geekdo-images.com/kmz-TihAsXAjDrvH9zu8ew__small/img/-jgR4u0u54GGuvUAc01tn0EkncA=/fit-in/200x150/filters:strip_icc()/pic756525.jpg",
    "publishers": [
        "New Games Order, LLC",
        "Piatnik"
    ],
    "designers": [
        "Reiner Knizia"
    ],
    "artists": [
        "Franz Vohwinkel"
    ],
    "classifications": {
        "mechanics": [],
        "categories": [
            "Abstract Strategy",
            "Game System"
        ],
        "families": [
            "Ancient: Rome",
            "Components: 5 x 5 Grids"
        ]
    }
}